[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:49:49
-   export function openDeleteAccountModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openDeleteAccountModal({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:49:49
-   export function openDeleteAccountModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openDeleteAccountModal({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/deleteAccountModal.js:49:49
-   export function openDeleteAccountModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openDeleteAccountModal({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[NoCoverage] BooleanLiteral
src/components/deleteAccountModal.js:50:7
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (doc) return Promise.resolve({ confirmed: false });

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:50:7
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (true) return Promise.resolve({ confirmed: false });

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:50:7
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (false) return Promise.resolve({ confirmed: false });

[NoCoverage] ObjectLiteral
src/components/deleteAccountModal.js:50:36
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (!doc) return Promise.resolve({});

[NoCoverage] BooleanLiteral
src/components/deleteAccountModal.js:50:49
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (!doc) return Promise.resolve({ confirmed: true });

[NoCoverage] BooleanLiteral
src/components/deleteAccountModal.js:69:27
-       btnConfirm.disabled = true;
+       btnConfirm.disabled = false;

[NoCoverage] BlockStatement
src/components/deleteAccountModal.js:75:43
-       input.addEventListener('input', () => {
-         btnConfirm.disabled = !isValidConfirmation(input.value);
-       });
+       input.addEventListener('input', () => {});

[NoCoverage] BooleanLiteral
src/components/deleteAccountModal.js:76:29
-         btnConfirm.disabled = !isValidConfirmation(input.value);
+         btnConfirm.disabled = isValidConfirmation(input.value);

[NoCoverage] BlockStatement
src/components/deleteAccountModal.js:79:48
-       btnConfirm.addEventListener('click', () => {
-         if (isValidConfirmation(input.value)) {
-           try { overlay.remove(); } catch { /* swallow */ }
-           resolve({ confirmed: true });
-         }
-       });
+       btnConfirm.addEventListener('click', () => {});

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:80:11
-         if (isValidConfirmation(input.value)) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:80:11
-         if (isValidConfirmation(input.value)) {
+         if (false) {

[NoCoverage] BlockStatement
src/components/deleteAccountModal.js:80:45
-         if (isValidConfirmation(input.value)) {
-           try { overlay.remove(); } catch { /* swallow */ }
-           resolve({ confirmed: true });
-         }
+         if (isValidConfirmation(input.value)) {}

[NoCoverage] BlockStatement
src/components/deleteAccountModal.js:81:13
-           try { overlay.remove(); } catch { /* swallow */ }
+           try {} catch { /* swallow */ }

[NoCoverage] ObjectLiteral
src/components/deleteAccountModal.js:82:17
-           resolve({ confirmed: true });
+           resolve({});

[NoCoverage] BooleanLiteral
src/components/deleteAccountModal.js:82:30
-           resolve({ confirmed: true });
+           resolve({ confirmed: false });

[NoCoverage] BlockStatement
src/components/deleteAccountModal.js:85:47
-       btnCancel.addEventListener('click', () => {
-         try { overlay.remove(); } catch { /* swallow */ }
-         resolve({ confirmed: false });
-       });
+       btnCancel.addEventListener('click', () => {});

[NoCoverage] BlockStatement
src/components/deleteAccountModal.js:86:11
-         try { overlay.remove(); } catch { /* swallow */ }
+         try {} catch { /* swallow */ }

[NoCoverage] ObjectLiteral
src/components/deleteAccountModal.js:87:15
-         resolve({ confirmed: false });
+         resolve({});

[NoCoverage] BooleanLiteral
src/components/deleteAccountModal.js:87:28
-         resolve({ confirmed: false });
+         resolve({ confirmed: true });

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:105:49
-   export function renderDeletePostSplash({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function renderDeletePostSplash({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/deleteAccountModal.js:105:49
-   export function renderDeletePostSplash({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function renderDeletePostSplash({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/deleteAccountModal.js:105:49
-   export function renderDeletePostSplash({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function renderDeletePostSplash({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[Survived] ConditionalExpression
src/components/deleteAccountModal.js:106:7
-     if (!doc) return null;
+     if (true) return null;
Tests ran:
    renderDeletePostSplash null doc → null

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:45:46
-   export function openEmailChangeForm({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openEmailChangeForm({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:45:46
-   export function openEmailChangeForm({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openEmailChangeForm({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/emailChangeForm.js:45:46
-   export function openEmailChangeForm({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openEmailChangeForm({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[NoCoverage] BooleanLiteral
src/components/emailChangeForm.js:46:7
-     if (!doc) return Promise.resolve({ submitted: false });
+     if (doc) return Promise.resolve({ submitted: false });

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:46:7
-     if (!doc) return Promise.resolve({ submitted: false });
+     if (true) return Promise.resolve({ submitted: false });

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:46:7
-     if (!doc) return Promise.resolve({ submitted: false });
+     if (false) return Promise.resolve({ submitted: false });

[NoCoverage] ObjectLiteral
src/components/emailChangeForm.js:46:36
-     if (!doc) return Promise.resolve({ submitted: false });
+     if (!doc) return Promise.resolve({});

[NoCoverage] BooleanLiteral
src/components/emailChangeForm.js:46:49
-     if (!doc) return Promise.resolve({ submitted: false });
+     if (!doc) return Promise.resolve({ submitted: true });

[NoCoverage] BlockStatement
src/components/emailChangeForm.js:78:47
-       btnSubmit.addEventListener('click', () => {
-         const verdict = validateEmailChangeInputs(inputPrimary.value, inputConfirm.value);
-         if (!verdict.valid) {
-           errLine.style.display = 'block';
-           errLine.textContent = verdict.reason === 'mismatch'
-             ? 'Adresele introduse nu corespund.'
-             : 'Adresă invalidă.';
-           return;
-         }
-         try { overlay.remove(); } catch { /* swallow */ }
-         resolve({ submitted: true, email: String(inputPrimary.value).trim() });
-       });
+       btnSubmit.addEventListener('click', () => {});

[NoCoverage] BooleanLiteral
src/components/emailChangeForm.js:80:11
-         if (!verdict.valid) {
+         if (verdict.valid) {

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:80:11
-         if (!verdict.valid) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:80:11
-         if (!verdict.valid) {
+         if (false) {

[NoCoverage] BlockStatement
src/components/emailChangeForm.js:80:27
-         if (!verdict.valid) {
-           errLine.style.display = 'block';
-           errLine.textContent = verdict.reason === 'mismatch'
-             ? 'Adresele introduse nu corespund.'
-             : 'Adresă invalidă.';
-           return;
-         }
+         if (!verdict.valid) {}

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:82:31
-           errLine.textContent = verdict.reason === 'mismatch'
+           errLine.textContent = true

[NoCoverage] ConditionalExpression
src/components/emailChangeForm.js:82:31
-           errLine.textContent = verdict.reason === 'mismatch'
+           errLine.textContent = false

[NoCoverage] EqualityOperator
src/components/emailChangeForm.js:82:31
-           errLine.textContent = verdict.reason === 'mismatch'
+           errLine.textContent = verdict.reason !== 'mismatch'

[NoCoverage] BlockStatement
src/components/emailChangeForm.js:87:11
-         try { overlay.remove(); } catch { /* swallow */ }
+         try {} catch { /* swallow */ }

[NoCoverage] ObjectLiteral
src/components/emailChangeForm.js:88:15
-         resolve({ submitted: true, email: String(inputPrimary.value).trim() });
+         resolve({});

[NoCoverage] BooleanLiteral
src/components/emailChangeForm.js:88:28
-         resolve({ submitted: true, email: String(inputPrimary.value).trim() });
+         resolve({ submitted: false, email: String(inputPrimary.value).trim() });

[NoCoverage] MethodExpression
src/components/emailChangeForm.js:88:41
-         resolve({ submitted: true, email: String(inputPrimary.value).trim() });
+         resolve({ submitted: true, email: String(inputPrimary.value) });

[NoCoverage] BlockStatement
src/components/emailChangeForm.js:90:47
-       btnCancel.addEventListener('click', () => {
-         try { overlay.remove(); } catch { /* swallow */ }
-         resolve({ submitted: false });
-       });
+       btnCancel.addEventListener('click', () => {});

[NoCoverage] BlockStatement
src/components/emailChangeForm.js:91:11
-         try { overlay.remove(); } catch { /* swallow */ }
+         try {} catch { /* swallow */ }

[NoCoverage] ObjectLiteral
src/components/emailChangeForm.js:92:15
-         resolve({ submitted: false });
+         resolve({});

[NoCoverage] BooleanLiteral
src/components/emailChangeForm.js:92:28
-         resolve({ submitted: false });
+         resolve({ submitted: true });

[Survived] Regex
src/components/emailChangeForm.js:20:10
-     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email.trim());
+     return /[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email.trim());
Tests ran:
    isValidEmail valid emails accepted
    isValidEmail invalid emails rejected
    validateEmailChangeInputs — typo guard double-input both equal valid → valid
  and 4 more tests!

[Survived] Regex
src/components/emailChangeForm.js:20:10
-     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email.trim());
+     return /^[^\s@]+@[^\s@]+\.[^\s@]+/.test(email.trim());
Tests ran:
    isValidEmail valid emails accepted
    isValidEmail invalid emails rejected
    validateEmailChangeInputs — typo guard double-input both equal valid → valid
  and 4 more tests!

[Survived] MethodExpression
src/components/emailChangeForm.js:20:44
-     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email.trim());
+     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email);
Tests ran:
    isValidEmail valid emails accepted
    isValidEmail invalid emails rejected
    validateEmailChangeInputs — typo guard double-input both equal valid → valid
  and 4 more tests!

[Survived] MethodExpression
src/components/emailChangeForm.js:31:13
-     const c = String(confirm ?? '').trim();
+     const c = String(confirm ?? '');
Tests ran:
    validateEmailChangeInputs — typo guard double-input both equal valid → valid
    validateEmailChangeInputs — typo guard double-input mismatch → mismatch reason
    validateEmailChangeInputs — typo guard double-input invalid format primary → invalid_format
  and 2 more tests!

[NoCoverage] ConditionalExpression
src/components/forkDecisionModal.js:27:48
-   export function openForkDecisionModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openForkDecisionModal({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/forkDecisionModal.js:27:48
-   export function openForkDecisionModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openForkDecisionModal({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/forkDecisionModal.js:27:48
-   export function openForkDecisionModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openForkDecisionModal({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[NoCoverage] BlockStatement
src/components/forkDecisionModal.js:56:46
-       btnCloud.addEventListener('click', () => {
-         try { overlay.remove(); } catch { /* swallow */ }
-         resolve('cloud');
-       });
+       btnCloud.addEventListener('click', () => {});

[NoCoverage] BlockStatement
src/components/forkDecisionModal.js:57:11
-         try { overlay.remove(); } catch { /* swallow */ }
+         try {} catch { /* swallow */ }

[Survived] ConditionalExpression
src/components/forkDecisionModal.js:28:7
-     if (!doc) return Promise.resolve('cloud');
+     if (false) return Promise.resolve('cloud');
Tests ran:
    Fork Decision UI rendering — ZERO default highlight enforced both buttons have IDENTICAL class (no default highlight)

[Survived] BlockStatement
src/components/forkDecisionModal.js:53:11
-         try { overlay.remove(); } catch { /* swallow */ }
+         try {} catch { /* swallow */ }
Tests ran:
    Fork Decision UI rendering — ZERO default highlight enforced both buttons have IDENTICAL class (no default highlight)

[Survived] ArrayDeclaration
src/components/hipThrustSetup.js:73:20
-     const cleanups = [];
+     const cleanups = ["Stryker was here"];
Tests ran:
    Hip Thrust Setup — render renders root element with data-component
    Hip Thrust Setup — render renders title
    Hip Thrust Setup — render renders ROM + foot placeholder slots
  and 9 more tests!

[Survived] ConditionalExpression
src/components/hipThrustSetup.js:74:7
-     if (typeof opts.onChange === 'function') {
+     if (true) {
Tests ran:
    Hip Thrust Setup — render renders root element with data-component
    Hip Thrust Setup — render renders title
    Hip Thrust Setup — render renders ROM + foot placeholder slots
  and 9 more tests!

[Survived] EqualityOperator
src/components/hipThrustSetup.js:98:32
-     return Number.isFinite(n) && n >= 0 && n < 1000;
+     return Number.isFinite(n) && n > 0 && n < 1000;
Tests ran:
    Hip Thrust Setup — weight input defaults to 0 when no initialKg
    Hip Thrust Setup — weight input respects initialKg
    Hip Thrust Setup — weight input rejects negative initialKg
  and 5 more tests!

[Survived] EqualityOperator
src/components/hipThrustSetup.js:98:42
-     return Number.isFinite(n) && n >= 0 && n < 1000;
+     return Number.isFinite(n) && n >= 0 && n <= 1000;
Tests ran:
    Hip Thrust Setup — weight input defaults to 0 when no initialKg
    Hip Thrust Setup — weight input respects initialKg
    Hip Thrust Setup — weight input rejects negative initialKg
  and 5 more tests!

[NoCoverage] ConditionalExpression
src/components/logoutModal.js:24:42
-   export function openLogoutStep1({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openLogoutStep1({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/logoutModal.js:24:42
-   export function openLogoutStep1({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openLogoutStep1({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/logoutModal.js:24:42
-   export function openLogoutStep1({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openLogoutStep1({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/logoutModal.js:80:42
-   export function openLogoutStep2({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openLogoutStep2({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/logoutModal.js:80:42
-   export function openLogoutStep2({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openLogoutStep2({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/logoutModal.js:80:42
-   export function openLogoutStep2({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openLogoutStep2({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[NoCoverage] ObjectLiteral
src/components/logoutModal.js:81:36
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (!doc) return Promise.resolve({});

[NoCoverage] BooleanLiteral
src/components/logoutModal.js:81:49
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (!doc) return Promise.resolve({ confirmed: true });

[NoCoverage] ConditionalExpression
src/components/logoutModal.js:127:45
-   export function renderLogoutSplash({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function renderLogoutSplash({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/logoutModal.js:127:45
-   export function renderLogoutSplash({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function renderLogoutSplash({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/logoutModal.js:127:45
-   export function renderLogoutSplash({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function renderLogoutSplash({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[Survived] BlockStatement
src/components/logoutModal.js:57:11
-         try { overlay.remove(); } catch {}
+         try {} catch {}
Tests ran:
    openLogoutStep1 — checkbox default OFF + branch coverage Continue without checkbox → wipeLocal false
    openLogoutStep1 — checkbox default OFF + branch coverage Continue with checkbox bifat → wipeLocal true

[Survived] BlockStatement
src/components/logoutModal.js:61:11
-         try { overlay.remove(); } catch {}
+         try {} catch {}
Tests ran:
    openLogoutStep1 — checkbox default OFF + branch coverage renders checkbox default OFF (per §56.12 LOCKED V1)
    openLogoutStep1 — checkbox default OFF + branch coverage Cancel → continue false

[Survived] BooleanLiteral
src/components/logoutModal.js:62:45
-         resolve({ continue: false, wipeLocal: false });
+         resolve({ continue: false, wipeLocal: true });
Tests ran:
    openLogoutStep1 — checkbox default OFF + branch coverage renders checkbox default OFF (per §56.12 LOCKED V1)
    openLogoutStep1 — checkbox default OFF + branch coverage Cancel → continue false

[Survived] ConditionalExpression
src/components/logoutModal.js:81:7
-     if (!doc) return Promise.resolve({ confirmed: false });
+     if (false) return Promise.resolve({ confirmed: false });
Tests ran:
    openLogoutStep2 — anti-tap-accidental confirm renders prompt + detail wording
    openLogoutStep2 — anti-tap-accidental confirm Confirm → confirmed true
    openLogoutStep2 — anti-tap-accidental confirm Cancel → confirmed false

[Survived] BlockStatement
src/components/logoutModal.js:105:11
-         try { overlay.remove(); } catch {}
+         try {} catch {}
Tests ran:
    openLogoutStep2 — anti-tap-accidental confirm Confirm → confirmed true

[Survived] BlockStatement
src/components/logoutModal.js:109:11
-         try { overlay.remove(); } catch {}
+         try {} catch {}
Tests ran:
    openLogoutStep2 — anti-tap-accidental confirm renders prompt + detail wording
    openLogoutStep2 — anti-tap-accidental confirm Cancel → confirmed false

[Survived] ConditionalExpression
src/components/logoutModal.js:128:7
-     if (!doc) return null;
+     if (true) return null;
Tests ran:
    renderLogoutSplash null doc → null

[NoCoverage] BlockStatement
src/components/modalManager.js:25:31
-   function _logDismiss(modalId) {
-     try {
-       const today = new Date().toLocaleDateString('sv');
-       const entries = DB.get('coach-decisions') ?? [];
-       const entry = entries
-         .filter(e => e.date === today && !e.superseded)
-         .sort((a, b) => b.ts - a.ts)[0];
-       if (!entry) return;
-       entry.ext = entry.ext ?? {};
-       entry.ext.modalDismisses = entry.ext.modalDismisses ?? [];
-       entry.ext.modalDismisses.push({ modalId, ts: Date.now(), dismissed: true });
-       DB.set('coach-decisions', entries);
-     } catch { /* non-blocking — dismiss log is best-effort */ }
-   }
+   function _logDismiss(modalId) {}

[NoCoverage] BlockStatement
src/components/modalManager.js:26:7
-     try {
-       const today = new Date().toLocaleDateString('sv');
-       const entries = DB.get('coach-decisions') ?? [];
-       const entry = entries
-         .filter(e => e.date === today && !e.superseded)
-         .sort((a, b) => b.ts - a.ts)[0];
-       if (!entry) return;
-       entry.ext = entry.ext ?? {};
-       entry.ext.modalDismisses = entry.ext.modalDismisses ?? [];
-       entry.ext.modalDismisses.push({ modalId, ts: Date.now(), dismissed: true });
-       DB.set('coach-decisions', entries);
-     } catch { /* non-blocking — dismiss log is best-effort */ }
+     try {} catch { /* non-blocking — dismiss log is best-effort */ }

[NoCoverage] LogicalOperator
src/components/modalManager.js:28:21
-       const entries = DB.get('coach-decisions') ?? [];
+       const entries = DB.get('coach-decisions') && [];

[NoCoverage] ArrayDeclaration
src/components/modalManager.js:28:50
-       const entries = DB.get('coach-decisions') ?? [];
+       const entries = DB.get('coach-decisions') ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/components/modalManager.js:29:19
-       const entry = entries
-         .filter(e => e.date === today && !e.superseded)
-         .sort((a, b) => b.ts - a.ts)[0];
+       const entry = entries.filter(e => e.date === today && !e.superseded)[0];

[NoCoverage] MethodExpression
src/components/modalManager.js:29:19
-       const entry = entries
-         .filter(e => e.date === today && !e.superseded)
+       const entry = entries

[NoCoverage] ArrowFunction
src/components/modalManager.js:30:15
-         .filter(e => e.date === today && !e.superseded)
+         .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/components/modalManager.js:30:20
-         .filter(e => e.date === today && !e.superseded)
+         .filter(e => true)

[NoCoverage] ConditionalExpression
src/components/modalManager.js:30:20
-         .filter(e => e.date === today && !e.superseded)
+         .filter(e => false)

[NoCoverage] LogicalOperator
src/components/modalManager.js:30:20
-         .filter(e => e.date === today && !e.superseded)
+         .filter(e => e.date === today || !e.superseded)

[NoCoverage] ConditionalExpression
src/components/modalManager.js:30:20
-         .filter(e => e.date === today && !e.superseded)
+         .filter(e => true && !e.superseded)

[NoCoverage] EqualityOperator
src/components/modalManager.js:30:20
-         .filter(e => e.date === today && !e.superseded)
+         .filter(e => e.date !== today && !e.superseded)

[NoCoverage] BooleanLiteral
src/components/modalManager.js:30:40
-         .filter(e => e.date === today && !e.superseded)
+         .filter(e => e.date === today && e.superseded)

[NoCoverage] ArrowFunction
src/components/modalManager.js:31:13
-         .sort((a, b) => b.ts - a.ts)[0];
+         .sort(() => undefined)[0];

[NoCoverage] ArithmeticOperator
src/components/modalManager.js:31:23
-         .sort((a, b) => b.ts - a.ts)[0];
+         .sort((a, b) => b.ts + a.ts)[0];

[NoCoverage] BooleanLiteral
src/components/modalManager.js:32:9
-       if (!entry) return;
+       if (entry) return;

[NoCoverage] ConditionalExpression
src/components/modalManager.js:32:9
-       if (!entry) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/components/modalManager.js:32:9
-       if (!entry) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/components/modalManager.js:33:17
-       entry.ext = entry.ext ?? {};
+       entry.ext = entry.ext && {};

[NoCoverage] LogicalOperator
src/components/modalManager.js:34:32
-       entry.ext.modalDismisses = entry.ext.modalDismisses ?? [];
+       entry.ext.modalDismisses = entry.ext.modalDismisses && [];

[NoCoverage] ArrayDeclaration
src/components/modalManager.js:34:60
-       entry.ext.modalDismisses = entry.ext.modalDismisses ?? [];
+       entry.ext.modalDismisses = entry.ext.modalDismisses ?? ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/components/modalManager.js:35:35
-       entry.ext.modalDismisses.push({ modalId, ts: Date.now(), dismissed: true });
+       entry.ext.modalDismisses.push({});

[NoCoverage] BooleanLiteral
src/components/modalManager.js:35:73
-       entry.ext.modalDismisses.push({ modalId, ts: Date.now(), dismissed: true });
+       entry.ext.modalDismisses.push({ modalId, ts: Date.now(), dismissed: false });

[NoCoverage] BlockStatement
src/components/modalManager.js:46:45
-   function _getConsecutiveDismissals(modalId) {
-     try {
-       const entries = (DB.get('coach-decisions') ?? [])
-         .filter(e => !e.superseded)
-         .sort((a, b) => b.ts - a.ts)
-         .slice(0, 5);
-       let count = 0;
-       for (const e of entries) {
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
-           count++;
-         } else {
-           break;
-         }
-       }
-       return count;
-     } catch { return 0; }
-   }
+   function _getConsecutiveDismissals(modalId) {}

[NoCoverage] BlockStatement
src/components/modalManager.js:47:7
-     try {
-       const entries = (DB.get('coach-decisions') ?? [])
-         .filter(e => !e.superseded)
-         .sort((a, b) => b.ts - a.ts)
-         .slice(0, 5);
-       let count = 0;
-       for (const e of entries) {
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
-           count++;
-         } else {
-           break;
-         }
-       }
-       return count;
-     } catch { return 0; }
+     try {} catch { return 0; }

[NoCoverage] MethodExpression
src/components/modalManager.js:48:21
-       const entries = (DB.get('coach-decisions') ?? [])
-         .filter(e => !e.superseded)
-         .sort((a, b) => b.ts - a.ts)
-         .slice(0, 5);
+       const entries = (DB.get('coach-decisions') ?? []).filter(e => !e.superseded).sort((a, b) => b.ts - a.ts);

[NoCoverage] MethodExpression
src/components/modalManager.js:48:21
-       const entries = (DB.get('coach-decisions') ?? [])
-         .filter(e => !e.superseded)
-         .sort((a, b) => b.ts - a.ts)
+       const entries = (DB.get('coach-decisions') ?? []).filter(e => !e.superseded)

[NoCoverage] MethodExpression
src/components/modalManager.js:48:21
-       const entries = (DB.get('coach-decisions') ?? [])
-         .filter(e => !e.superseded)
+       const entries = DB.get('coach-decisions') ?? []

[NoCoverage] LogicalOperator
src/components/modalManager.js:48:22
-       const entries = (DB.get('coach-decisions') ?? [])
+       const entries = (DB.get('coach-decisions') && [])

[NoCoverage] ArrayDeclaration
src/components/modalManager.js:48:51
-       const entries = (DB.get('coach-decisions') ?? [])
+       const entries = (DB.get('coach-decisions') ?? ["Stryker was here"])

[NoCoverage] ArrowFunction
src/components/modalManager.js:49:15
-         .filter(e => !e.superseded)
+         .filter(() => undefined)

[NoCoverage] BooleanLiteral
src/components/modalManager.js:49:20
-         .filter(e => !e.superseded)
+         .filter(e => e.superseded)

[NoCoverage] ArrowFunction
src/components/modalManager.js:50:13
-         .sort((a, b) => b.ts - a.ts)
+         .sort(() => undefined)

[NoCoverage] ArithmeticOperator
src/components/modalManager.js:50:23
-         .sort((a, b) => b.ts - a.ts)
+         .sort((a, b) => b.ts + a.ts)

[NoCoverage] BlockStatement
src/components/modalManager.js:53:30
-       for (const e of entries) {
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
-           count++;
-         } else {
-           break;
-         }
-       }
+       for (const e of entries) {}

[NoCoverage] ConditionalExpression
src/components/modalManager.js:54:11
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:54:11
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (false) {
