[NoCoverage] MethodExpression
src/components/modalManager.js:54:11
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.every(d => d.modalId === modalId && d.dismissed)) {

[NoCoverage] OptionalChaining
src/components/modalManager.js:54:11
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses.some(d => d.modalId === modalId && d.dismissed)) {

[NoCoverage] OptionalChaining
src/components/modalManager.js:54:11
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {

[NoCoverage] ArrowFunction
src/components/modalManager.js:54:39
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.some(() => undefined)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:54:44
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.some(d => true)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:54:44
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.some(d => false)) {

[NoCoverage] LogicalOperator
src/components/modalManager.js:54:44
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId || d.dismissed)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:54:44
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.some(d => true && d.dismissed)) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:54:44
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
+         if (e.ext?.modalDismisses?.some(d => d.modalId !== modalId && d.dismissed)) {

[NoCoverage] BlockStatement
src/components/modalManager.js:54:83
-         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {
-           count++;
-         } else {
+         if (e.ext?.modalDismisses?.some(d => d.modalId === modalId && d.dismissed)) {} else {

[NoCoverage] UpdateOperator
src/components/modalManager.js:55:9
-           count++;
+           count--;

[NoCoverage] BlockStatement
src/components/modalManager.js:56:14
-         } else {
-           break;
-         }
+         } else {}

[NoCoverage] BlockStatement
src/components/modalManager.js:61:11
-     } catch { return 0; }
+     } catch {}

[NoCoverage] BlockStatement
src/components/modalManager.js:64:26
-   function _processQueue() {
-     if (!_queue.length) return;
-     const next = _queue.shift();
-     _doShow(next);
-   }
+   function _processQueue() {}

[NoCoverage] BooleanLiteral
src/components/modalManager.js:65:7
-     if (!_queue.length) return;
+     if (_queue.length) return;

[NoCoverage] ConditionalExpression
src/components/modalManager.js:65:7
-     if (!_queue.length) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/components/modalManager.js:65:7
-     if (!_queue.length) return;
+     if (false) return;

[NoCoverage] BlockStatement
src/components/modalManager.js:70:26
-   function _deactivate(id) {
-     const idx = _active.findIndex(m => m.id === id);
-     if (idx !== -1) _active.splice(idx, 1);
-     _processQueue();
-   }
+   function _deactivate(id) {}

[NoCoverage] ArrowFunction
src/components/modalManager.js:71:33
-     const idx = _active.findIndex(m => m.id === id);
+     const idx = _active.findIndex(() => undefined);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:71:38
-     const idx = _active.findIndex(m => m.id === id);
+     const idx = _active.findIndex(m => true);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:71:38
-     const idx = _active.findIndex(m => m.id === id);
+     const idx = _active.findIndex(m => false);

[NoCoverage] EqualityOperator
src/components/modalManager.js:71:38
-     const idx = _active.findIndex(m => m.id === id);
+     const idx = _active.findIndex(m => m.id !== id);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:72:7
-     if (idx !== -1) _active.splice(idx, 1);
+     if (true) _active.splice(idx, 1);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:72:7
-     if (idx !== -1) _active.splice(idx, 1);
+     if (false) _active.splice(idx, 1);

[NoCoverage] EqualityOperator
src/components/modalManager.js:72:7
-     if (idx !== -1) _active.splice(idx, 1);
+     if (idx === -1) _active.splice(idx, 1);

[NoCoverage] UnaryOperator
src/components/modalManager.js:72:15
-     if (idx !== -1) _active.splice(idx, 1);
+     if (idx !== +1) _active.splice(idx, 1);

[NoCoverage] BlockStatement
src/components/modalManager.js:83:26
-   function _doShow(config) {
-     const entry = {
-       id: config.id,
-       category: config.category ?? 'coaching',
-       sticky: config.sticky ?? false,
-     };
-     _active.push(entry);
-   
-     Promise.resolve().then(async () => {
-       try {
-         const result = await config.present();
-         _deactivate(config.id);
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
-         config.onComplete?.(result);
-       } catch {
-         _deactivate(config.id);
-       }
-     });
-   }
+   function _doShow(config) {}

[NoCoverage] ObjectLiteral
src/components/modalManager.js:84:17
-     const entry = {
-       id: config.id,
-       category: config.category ?? 'coaching',
-       sticky: config.sticky ?? false,
-     };
+     const entry = {};

[NoCoverage] LogicalOperator
src/components/modalManager.js:86:15
-       category: config.category ?? 'coaching',
+       category: config.category && 'coaching',

[NoCoverage] LogicalOperator
src/components/modalManager.js:87:13
-       sticky: config.sticky ?? false,
+       sticky: config.sticky && false,

[NoCoverage] BooleanLiteral
src/components/modalManager.js:87:30
-       sticky: config.sticky ?? false,
+       sticky: config.sticky ?? true,

[NoCoverage] BlockStatement
src/components/modalManager.js:91:38
-     Promise.resolve().then(async () => {
-       try {
-         const result = await config.present();
-         _deactivate(config.id);
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
-         config.onComplete?.(result);
-       } catch {
-         _deactivate(config.id);
-       }
-     });
+     Promise.resolve().then(async () => {});

[NoCoverage] BlockStatement
src/components/modalManager.js:92:9
-       try {
-         const result = await config.present();
-         _deactivate(config.id);
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
-         config.onComplete?.(result);
-       } catch {
+       try {} catch {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:95:25
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = true;

[NoCoverage] ConditionalExpression
src/components/modalManager.js:95:25
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = false;

[NoCoverage] LogicalOperator
src/components/modalManager.js:95:25
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = result?.source === 'backdrop' && result?.source === 'swipe';

[NoCoverage] ConditionalExpression
src/components/modalManager.js:95:25
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = false || result?.source === 'swipe';

[NoCoverage] EqualityOperator
src/components/modalManager.js:95:25
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = result?.source !== 'backdrop' || result?.source === 'swipe';

[NoCoverage] OptionalChaining
src/components/modalManager.js:95:25
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = result.source === 'backdrop' || result?.source === 'swipe';

[NoCoverage] ConditionalExpression
src/components/modalManager.js:95:58
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = result?.source === 'backdrop' || false;

[NoCoverage] EqualityOperator
src/components/modalManager.js:95:58
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = result?.source === 'backdrop' || result?.source !== 'swipe';

[NoCoverage] OptionalChaining
src/components/modalManager.js:95:58
-         const isDismiss = result?.source === 'backdrop' || result?.source === 'swipe';
+         const isDismiss = result?.source === 'backdrop' || result.source === 'swipe';

[NoCoverage] ConditionalExpression
src/components/modalManager.js:96:11
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
+         if (true) _logDismiss(config.id);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:96:11
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
+         if (false) _logDismiss(config.id);

[NoCoverage] LogicalOperator
src/components/modalManager.js:96:11
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
+         if (isDismiss || !entry.sticky) _logDismiss(config.id);

[NoCoverage] BooleanLiteral
src/components/modalManager.js:96:24
-         if (isDismiss && !entry.sticky) _logDismiss(config.id);
+         if (isDismiss && entry.sticky) _logDismiss(config.id);

[NoCoverage] OptionalChaining
src/components/modalManager.js:97:7
-         config.onComplete?.(result);
+         config.onComplete(result);

[NoCoverage] BlockStatement
src/components/modalManager.js:98:13
-       } catch {
-         _deactivate(config.id);
-       }
+       } catch {}

[NoCoverage] ConditionalExpression
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
-           && config.id === 'aa-friction'
-           && window._suppressAAFrictionModal === true) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
-           && config.id === 'aa-friction'
-           && window._suppressAAFrictionModal === true) {
+       if (false) {

[NoCoverage] LogicalOperator
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
-           && config.id === 'aa-friction'
-           && window._suppressAAFrictionModal === true) {
+       if (typeof window !== 'undefined' && config.id === 'aa-friction' || window._suppressAAFrictionModal === true) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
-           && config.id === 'aa-friction'
+       if (true

[NoCoverage] LogicalOperator
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
-           && config.id === 'aa-friction'
+       if (typeof window !== 'undefined' || config.id === 'aa-friction'

[NoCoverage] ConditionalExpression
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
+       if (true

[NoCoverage] EqualityOperator
src/components/modalManager.js:122:9
-       if (typeof window !== 'undefined'
+       if (typeof window === 'undefined'

[NoCoverage] ConditionalExpression
src/components/modalManager.js:123:12
-           && config.id === 'aa-friction'
+           && true

[NoCoverage] EqualityOperator
src/components/modalManager.js:123:12
-           && config.id === 'aa-friction'
+           && config.id !== 'aa-friction'

[NoCoverage] ConditionalExpression
src/components/modalManager.js:124:12
-           && window._suppressAAFrictionModal === true) {
+           && true) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:124:12
-           && window._suppressAAFrictionModal === true) {
+           && window._suppressAAFrictionModal !== true) {

[NoCoverage] BooleanLiteral
src/components/modalManager.js:124:48
-           && window._suppressAAFrictionModal === true) {
+           && window._suppressAAFrictionModal === false) {

[NoCoverage] BlockStatement
src/components/modalManager.js:124:54
-           && window._suppressAAFrictionModal === true) {
-         return;
-       }
+           && window._suppressAAFrictionModal === true) {}

[NoCoverage] ConditionalExpression
src/components/modalManager.js:129:9
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:129:9
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (false) {

[NoCoverage] LogicalOperator
src/components/modalManager.js:129:9
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id === config.id) && _queue.some(m => m.id === config.id)) {

[NoCoverage] MethodExpression
src/components/modalManager.js:129:9
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.every(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {

[NoCoverage] ArrowFunction
src/components/modalManager.js:129:22
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(() => undefined) || _queue.some(m => m.id === config.id)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:129:27
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => true) || _queue.some(m => m.id === config.id)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:129:27
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => false) || _queue.some(m => m.id === config.id)) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:129:27
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id !== config.id) || _queue.some(m => m.id === config.id)) {

[NoCoverage] MethodExpression
src/components/modalManager.js:129:50
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id === config.id) || _queue.every(m => m.id === config.id)) {

[NoCoverage] ArrowFunction
src/components/modalManager.js:129:62
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id === config.id) || _queue.some(() => undefined)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:129:67
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id === config.id) || _queue.some(m => true)) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:129:67
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id === config.id) || _queue.some(m => false)) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:129:67
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
+       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id !== config.id)) {

[NoCoverage] BlockStatement
src/components/modalManager.js:129:88
-       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {
-         return;
-       }
+       if (_active.some(m => m.id === config.id) || _queue.some(m => m.id === config.id)) {}

[NoCoverage] ConditionalExpression
src/components/modalManager.js:133:9
-       if (config.category === 'safety') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:133:9
-       if (config.category === 'safety') {
+       if (false) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:133:9
-       if (config.category === 'safety') {
+       if (config.category !== 'safety') {

[NoCoverage] BlockStatement
src/components/modalManager.js:133:39
-       if (config.category === 'safety') {
-         // Safety modals always shown immediately, always sticky.
-         _doShow({ ...config, sticky: true });
-         return;
-       }
+       if (config.category === 'safety') {}

[NoCoverage] ObjectLiteral
src/components/modalManager.js:135:15
-         _doShow({ ...config, sticky: true });
+         _doShow({});

[NoCoverage] BooleanLiteral
src/components/modalManager.js:135:36
-         _doShow({ ...config, sticky: true });
+         _doShow({ ...config, sticky: false });

[NoCoverage] MethodExpression
src/components/modalManager.js:140:22
-       const coaching = _active.filter(m => m.category === 'coaching');
+       const coaching = _active;

[NoCoverage] ArrowFunction
src/components/modalManager.js:140:37
-       const coaching = _active.filter(m => m.category === 'coaching');
+       const coaching = _active.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:140:42
-       const coaching = _active.filter(m => m.category === 'coaching');
+       const coaching = _active.filter(m => true);

[NoCoverage] ConditionalExpression
src/components/modalManager.js:140:42
-       const coaching = _active.filter(m => m.category === 'coaching');
+       const coaching = _active.filter(m => false);

[NoCoverage] EqualityOperator
src/components/modalManager.js:140:42
-       const coaching = _active.filter(m => m.category === 'coaching');
+       const coaching = _active.filter(m => m.category !== 'coaching');

[NoCoverage] ConditionalExpression
src/components/modalManager.js:141:9
-       if (coaching.length >= _COACHING_MAX) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/components/modalManager.js:141:9
-       if (coaching.length >= _COACHING_MAX) {
+       if (false) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:141:9
-       if (coaching.length >= _COACHING_MAX) {
+       if (coaching.length > _COACHING_MAX) {

[NoCoverage] EqualityOperator
src/components/modalManager.js:141:9
-       if (coaching.length >= _COACHING_MAX) {
+       if (coaching.length < _COACHING_MAX) {

[NoCoverage] BlockStatement
src/components/modalManager.js:141:43
-       if (coaching.length >= _COACHING_MAX) {
-         _queue.push(config);
-         return;
-       }
+       if (coaching.length >= _COACHING_MAX) {}

[NoCoverage] BlockStatement
src/components/modalManager.js:155:25
-     isSuppressed(modalId) {
-       return _getConsecutiveDismissals(modalId) >= 3;
-     },
+     isSuppressed(modalId) {},

[NoCoverage] ConditionalExpression
src/components/modalManager.js:156:12
-       return _getConsecutiveDismissals(modalId) >= 3;
+       return true;

[NoCoverage] ConditionalExpression
src/components/modalManager.js:156:12
-       return _getConsecutiveDismissals(modalId) >= 3;
+       return false;

[NoCoverage] EqualityOperator
src/components/modalManager.js:156:12
-       return _getConsecutiveDismissals(modalId) >= 3;
+       return _getConsecutiveDismissals(modalId) > 3;

[NoCoverage] EqualityOperator
src/components/modalManager.js:156:12
-       return _getConsecutiveDismissals(modalId) >= 3;
+       return _getConsecutiveDismissals(modalId) < 3;

[NoCoverage] BlockStatement
src/components/modalManager.js:160:21
-     get activeCount() { return _active.length; },
+     get activeCount() {},

[NoCoverage] BlockStatement
src/components/modalManager.js:163:21
-     get queueLength() { return _queue.length; },
+     get queueLength() {},

[Survived] ArrayDeclaration
src/components/modalManager.js:14:17
-   const _active = [];
+   const _active = ["Stryker was here"];
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/components/modalManager.js:17:16
-   const _queue = [];
+   const _queue = ["Stryker was here"];
Ran all tests for this mutant.

[NoCoverage] ConditionalExpression
src/components/recoveryEmailLostModal.js:22:53
-   export function openRecoveryEmailLostModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openRecoveryEmailLostModal({ doc = (true ? document : null) } = {}) {

[NoCoverage] ConditionalExpression
src/components/recoveryEmailLostModal.js:22:53
-   export function openRecoveryEmailLostModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openRecoveryEmailLostModal({ doc = (false ? document : null) } = {}) {

[NoCoverage] EqualityOperator
src/components/recoveryEmailLostModal.js:22:53
-   export function openRecoveryEmailLostModal({ doc = (typeof document !== 'undefined' ? document : null) } = {}) {
+   export function openRecoveryEmailLostModal({ doc = (typeof document === 'undefined' ? document : null) } = {}) {

[NoCoverage] BlockStatement
src/components/safetyBanner.js:137:9
-     catch { return null; }
+     catch {}

[NoCoverage] BooleanLiteral
src/components/safetyBanner.js:141:38
-     if (!storage || !dismissId) return false;
+     if (!storage || !dismissId) return true;

[NoCoverage] BlockStatement
src/components/safetyBanner.js:143:9
-     catch { return false; }
+     catch {}

[NoCoverage] BooleanLiteral
src/components/safetyBanner.js:143:18
-     catch { return false; }
+     catch { return true; }

[Survived] ConditionalExpression
src/components/safetyBanner.js:49:7
-     if (dismissId) el.setAttribute('data-dismiss-id', dismissId);
+     if (true) el.setAttribute('data-dismiss-id', dismissId);
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 15 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:49:7
-     if (dismissId) el.setAttribute('data-dismiss-id', dismissId);
+     if (false) el.setAttribute('data-dismiss-id', dismissId);
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 15 more tests!

[Survived] ArrayDeclaration
src/components/safetyBanner.js:56:20
-     const cleanups = [];
+     const cleanups = ["Stryker was here"];
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 15 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:58:17
-     if (action && typeof action.onClick === 'function') {
+     if (action && true) {
Tests ran:
    safetyBanner — action button renders action button with label and fires onClick
    safetyBanner — action button falls back to "OK" label when none provided
    safetyBanner — dispose cleans up listeners exposes a dispose function that does not throw
  and 2 more tests!

[Survived] ArrowFunction
src/components/safetyBanner.js:65:19
-       cleanups.push(() => btn.removeEventListener('click', handler));
+       cleanups.push(() => undefined);
Tests ran:
    safetyBanner — action button renders action button with label and fires onClick
    safetyBanner — action button falls back to "OK" label when none provided
    safetyBanner — dispose cleans up listeners exposes a dispose function that does not throw
  and 2 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:79:11
-         if (dismissId) _markDismissed(storage, dismissId);
+         if (true) _markDismissed(storage, dismissId);
Tests ran:
    safetyBanner — dismiss button dismiss click removes the banner from DOM
    safetyBanner — dismiss persistence per session does not persist dismiss when no dismissId provided
    safetyBanner — dismiss persistence per session persists dismiss flag when dismissId provided

[Survived] BlockStatement
src/components/safetyBanner.js:90:43
-       dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }),
+       dispose: () => cleanups.forEach(fn => {}),
Tests ran:
    safetyBanner — dispose cleans up listeners exposes a dispose function that does not throw

[Survived] BlockStatement
src/components/safetyBanner.js:90:49
-       dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }),
+       dispose: () => cleanups.forEach(fn => { try {} catch {} }),
Tests ran:
    safetyBanner — dispose cleans up listeners exposes a dispose function that does not throw

[Survived] ArrowFunction
src/components/safetyBanner.js:83:19
-       cleanups.push(() => dismissBtn.removeEventListener('click', onDismiss));
+       cleanups.push(() => undefined);
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders the message text in a <p>
  and 13 more tests!

[Survived] BooleanLiteral
src/components/safetyBanner.js:89:16
-       dismissed: false,
+       dismissed: true,
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 15 more tests!

[Survived] ArrowFunction
src/components/safetyBanner.js:90:14
-       dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }),
+       dispose: () => undefined,
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 15 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:103:7
-     if (!s || !dismissId) return;
+     if (false) return;
Tests ran:
    safetyBanner — dismiss persistence per session resetDismiss clears the persisted flag
    safetyBanner — dismiss persistence per session resetDismiss is no-op on missing storage / id

[Survived] LogicalOperator
src/components/safetyBanner.js:103:7
-     if (!s || !dismissId) return;
+     if (!s && !dismissId) return;
Tests ran:
    safetyBanner — dismiss persistence per session resetDismiss clears the persisted flag
    safetyBanner — dismiss persistence per session resetDismiss is no-op on missing storage / id

[Survived] LogicalOperator
src/components/safetyBanner.js:121:7
-     if (!opts || typeof opts !== 'object') {
+     if (!opts && typeof opts !== 'object') {
Tests ran:
    safetyBanner — input validation throws on missing opts
    safetyBanner — input validation throws on invalid severity
    safetyBanner — input validation throws on empty message
  and 20 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:121:16
-     if (!opts || typeof opts !== 'object') {
+     if (!opts || false) {
Tests ran:
    safetyBanner — input validation throws on invalid severity
    safetyBanner — input validation throws on empty message
    safetyBanner — input validation throws on non-string message
  and 19 more tests!

[Survived] BlockStatement
src/components/safetyBanner.js:136:7
-     try { return typeof window !== 'undefined' ? window.sessionStorage : null; }
+     try {}
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 10 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:136:16
-     try { return typeof window !== 'undefined' ? window.sessionStorage : null; }
+     try { return true ? window.sessionStorage : null; }
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 10 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:136:16
-     try { return typeof window !== 'undefined' ? window.sessionStorage : null; }
+     try { return false ? window.sessionStorage : null; }
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 10 more tests!
