[Survived] EqualityOperator
src/components/safetyBanner.js:136:16
-     try { return typeof window !== 'undefined' ? window.sessionStorage : null; }
+     try { return typeof window === 'undefined' ? window.sessionStorage : null; }
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 10 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:135:7
-     if (override) return override;
+     if (true) return override;
Tests ran:
    safetyBanner — rendering by severity renders info severity with role=status
    safetyBanner — rendering by severity renders warning severity with role=status
    safetyBanner — rendering by severity renders critical severity with role=alert
  and 18 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:141:7
-     if (!storage || !dismissId) return false;
+     if (false) return false;
Tests ran:
    safetyBanner — dismiss persistence per session persists dismiss flag when dismissId provided
    safetyBanner — dismiss persistence per session returns null element when dismissId already dismissed
    safetyBanner — dismiss persistence per session resetDismiss clears the persisted flag
  and 4 more tests!

[Survived] LogicalOperator
src/components/safetyBanner.js:141:7
-     if (!storage || !dismissId) return false;
+     if (!storage && !dismissId) return false;
Tests ran:
    safetyBanner — dismiss persistence per session persists dismiss flag when dismissId provided
    safetyBanner — dismiss persistence per session returns null element when dismissId already dismissed
    safetyBanner — dismiss persistence per session resetDismiss clears the persisted flag
  and 4 more tests!

[Survived] ConditionalExpression
src/components/safetyBanner.js:147:7
-     if (!storage || !dismissId) return;
+     if (false) return;
Tests ran:
    safetyBanner — dismiss persistence per session persists dismiss flag when dismissId provided

[Survived] LogicalOperator
src/components/safetyBanner.js:147:7
-     if (!storage || !dismissId) return;
+     if (!storage && !dismissId) return;
Tests ran:
    safetyBanner — dismiss persistence per session persists dismiss flag when dismissId provided

[Survived] MethodExpression
src/components/safetyBannerWiring.js:89:55
-     const tech = (typeof opts.technique === 'string' && opts.technique.trim())
+     const tech = (typeof opts.technique === 'string' && opts.technique)
Tests ran:
    Wiring 3 — Plateau §27 two-layer Layer 2 — warning severity with weeks + technique
    Wiring 3 — Plateau §27 two-layer Layer 2 — gracefully omits weeks part when missing
    Wiring 3 — Plateau §27 two-layer Layer 2 — Anti-RE: no efficacy % or backend numerics
  and 1 more test!

[Survived] MethodExpression
src/components/safetyBannerWiring.js:90:7
-       ? opts.technique.trim()
+       ? opts.technique
Tests ran:
    Wiring 3 — Plateau §27 two-layer Layer 2 — warning severity with weeks + technique
    Wiring 3 — Plateau §27 two-layer Layer 2 — gracefully omits weeks part when missing
    Wiring 3 — Plateau §27 two-layer Layer 2 — Anti-RE: no efficacy % or backend numerics
  and 1 more test!

[Survived] LogicalOperator
src/components/safetyBannerWiring.js:92:22
-     const weeksPart = (Number.isFinite(weeks) && weeks >= 3)
+     const weeksPart = (Number.isFinite(weeks) || weeks >= 3)
Tests ran:
    Wiring 3 — Plateau §27 two-layer Layer 2 — warning severity with weeks + technique
    Wiring 3 — Plateau §27 two-layer Layer 2 — gracefully omits weeks part when missing
    Wiring 3 — Plateau §27 two-layer Layer 2 — fallback technique when missing
  and 2 more tests!

[Survived] ConditionalExpression
src/components/safetyBannerWiring.js:92:48
-     const weeksPart = (Number.isFinite(weeks) && weeks >= 3)
+     const weeksPart = (Number.isFinite(weeks) && true)
Tests ran:
    Wiring 3 — Plateau §27 two-layer Layer 2 — warning severity with weeks + technique
    Wiring 3 — Plateau §27 two-layer Layer 2 — fallback technique when missing
    Wiring 3 — Plateau §27 two-layer Layer 2 — Anti-RE: no efficacy % or backend numerics
  and 1 more test!

[Survived] EqualityOperator
src/components/safetyBannerWiring.js:92:48
-     const weeksPart = (Number.isFinite(weeks) && weeks >= 3)
+     const weeksPart = (Number.isFinite(weeks) && weeks > 3)
Tests ran:
    Wiring 3 — Plateau §27 two-layer Layer 2 — warning severity with weeks + technique
    Wiring 3 — Plateau §27 two-layer Layer 2 — fallback technique when missing
    Wiring 3 — Plateau §27 two-layer Layer 2 — Anti-RE: no efficacy % or backend numerics
  and 1 more test!

[Survived] BlockStatement
src/config/user.js:28:13
-       } catch {
-         return USER_DEFAULTS;
-       }
+       } catch {}
Tests ran:
    storage/db — namespace resolution falls back to "anonymous" when config throws
    getUserConfig falls back to defaults on malformed localStorage JSON

[Survived] ConditionalExpression
src/config/user.js:25:7
-     if (override) {
+     if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 59 more tests!

[NoCoverage] BlockStatement
src/config/weights.js:59:54
-   export function getNextWeight(current, exerciseName) {
-     const list = getList(exerciseName);
-     const idx = list.findIndex(w => w >= current);
-     if (idx === -1) return list[list.length - 1];
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
-     return list[idx];
-   }
+   export function getNextWeight(current, exerciseName) {}

[NoCoverage] ArrowFunction
src/config/weights.js:61:30
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(() => undefined);

[NoCoverage] ConditionalExpression
src/config/weights.js:61:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => true);

[NoCoverage] ConditionalExpression
src/config/weights.js:61:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => false);

[NoCoverage] EqualityOperator
src/config/weights.js:61:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => w > current);

[NoCoverage] EqualityOperator
src/config/weights.js:61:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => w < current);

[NoCoverage] ConditionalExpression
src/config/weights.js:62:7
-     if (idx === -1) return list[list.length - 1];
+     if (true) return list[list.length - 1];

[NoCoverage] ConditionalExpression
src/config/weights.js:62:7
-     if (idx === -1) return list[list.length - 1];
+     if (false) return list[list.length - 1];

[NoCoverage] EqualityOperator
src/config/weights.js:62:7
-     if (idx === -1) return list[list.length - 1];
+     if (idx !== -1) return list[list.length - 1];

[NoCoverage] UnaryOperator
src/config/weights.js:62:15
-     if (idx === -1) return list[list.length - 1];
+     if (idx === +1) return list[list.length - 1];

[NoCoverage] ArithmeticOperator
src/config/weights.js:62:31
-     if (idx === -1) return list[list.length - 1];
+     if (idx === -1) return list[list.length + 1];

[NoCoverage] ConditionalExpression
src/config/weights.js:63:7
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
+     if (true) return list[Math.min(idx + 1, list.length - 1)];

[NoCoverage] ConditionalExpression
src/config/weights.js:63:7
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
+     if (false) return list[Math.min(idx + 1, list.length - 1)];

[NoCoverage] EqualityOperator
src/config/weights.js:63:7
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
+     if (list[idx] !== current) return list[Math.min(idx + 1, list.length - 1)];

[NoCoverage] MethodExpression
src/config/weights.js:63:42
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
+     if (list[idx] === current) return list[Math.max(idx + 1, list.length - 1)];

[NoCoverage] ArithmeticOperator
src/config/weights.js:63:51
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
+     if (list[idx] === current) return list[Math.min(idx - 1, list.length - 1)];

[NoCoverage] ArithmeticOperator
src/config/weights.js:63:60
-     if (list[idx] === current) return list[Math.min(idx + 1, list.length - 1)];
+     if (list[idx] === current) return list[Math.min(idx + 1, list.length + 1)];

[NoCoverage] BlockStatement
src/config/weights.js:81:48
-   export function getEquipmentType(exerciseName) {
-     return EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
-   }
+   export function getEquipmentType(exerciseName) {}

[NoCoverage] ConditionalExpression
src/config/weights.js:82:10
-     return EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
+     return true;

[NoCoverage] ConditionalExpression
src/config/weights.js:82:10
-     return EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
+     return false;

[NoCoverage] LogicalOperator
src/config/weights.js:82:10
-     return EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
+     return EXERCISE_EQUIPMENT_MAP[exerciseName] && 'bailib_stack';

[Survived] ConditionalExpression
src/config/weights.js:55:21
-     const equipType = EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
+     const equipType = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 28 more tests!

[Survived] BlockStatement
src/config/weights.js:67:54
-   export function getPrevWeight(current, exerciseName) {
-     const list = getList(exerciseName);
-     const idx = list.findIndex(w => w >= current);
-     if (idx <= 0) return list[0];
-     return list[idx - 1];
-   }
+   export function getPrevWeight(current, exerciseName) {}
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] ConditionalExpression
src/config/weights.js:55:21
-     const equipType = EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
+     const equipType = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 28 more tests!

[Survived] LogicalOperator
src/config/weights.js:55:21
-     const equipType = EXERCISE_EQUIPMENT_MAP[exerciseName] || 'bailib_stack';
+     const equipType = EXERCISE_EQUIPMENT_MAP[exerciseName] && 'bailib_stack';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 28 more tests!

[Survived] ArrowFunction
src/config/weights.js:69:30
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(() => undefined);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] ConditionalExpression
src/config/weights.js:69:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => true);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] ConditionalExpression
src/config/weights.js:69:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => false);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] EqualityOperator
src/config/weights.js:69:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => w > current);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] LogicalOperator
src/config/weights.js:56:10
-     return EQUIPMENT_WEIGHTS[equipType] || EQUIPMENT_WEIGHTS['bailib_stack'];
+     return EQUIPMENT_WEIGHTS[equipType] && EQUIPMENT_WEIGHTS['bailib_stack'];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 28 more tests!

[Survived] EqualityOperator
src/config/weights.js:69:35
-     const idx = list.findIndex(w => w >= current);
+     const idx = list.findIndex(w => w < current);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] ConditionalExpression
src/config/weights.js:70:7
-     if (idx <= 0) return list[0];
+     if (true) return list[0];
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] ConditionalExpression
src/config/weights.js:70:7
-     if (idx <= 0) return list[0];
+     if (false) return list[0];
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] EqualityOperator
src/config/weights.js:70:7
-     if (idx <= 0) return list[0];
+     if (idx < 0) return list[0];
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] EqualityOperator
src/config/weights.js:70:7
-     if (idx <= 0) return list[0];
+     if (idx > 0) return list[0];
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] ArithmeticOperator
src/config/weights.js:71:15
-     return list[idx - 1];
+     return list[idx + 1];
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps

[Survived] EqualityOperator
src/config/weights.js:77:5
-       Math.abs(curr - weight) < Math.abs(prev - weight) ? curr : prev
+       Math.abs(curr - weight) <= Math.abs(prev - weight) ? curr : prev
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ArrayDeclaration
src/config/weights.js:15:18
-     'leg_machine': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160],
+     'leg_machine': [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/config/weights.js:18:23
-     'leg_press_plates': [20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 180, 200, 220, 240, 260, 280, 300, 320],
+     'leg_press_plates': [],
Ran all tests for this mutant.

[Survived] ArrowFunction
src/config/weights.js:88:46
-     Object.entries(EXERCISE_EQUIPMENT_MAP).map(([ex, t]) => [ex, t])
+     Object.entries(EXERCISE_EQUIPMENT_MAP).map(() => undefined)
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/config/weights.js:88:59
-     Object.entries(EXERCISE_EQUIPMENT_MAP).map(([ex, t]) => [ex, t])
+     Object.entries(EXERCISE_EQUIPMENT_MAP).map(([ex, t]) => [])
Ran all tests for this mutant.

[NoCoverage] ConditionalExpression
src/engine/composite-signal/lifecycle.js:32:5
-       default:
-         return state;
+       default:

[Survived] ConditionalExpression
src/engine/composite-signal/lifecycle.js:21:11
-         if (session.triggerDetected) return { status: 'flagged', sessionsInState: 0 };
+         if (true) return { status: 'flagged', sessionsInState: 0 };
Tests ran:
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) lifecycle idle → flagged → cooldown → resolving → idle
    Composite Signal §36.41 — Lifecycle idle → flagged on detection

[Survived] EqualityOperator
src/engine/composite-signal/trigger-3-metrici.js:25:7
-     if (input.performanceDropPct > PERFORMANCE_DROP_THRESHOLD)         fired.push('performance_drop');
+     if (input.performanceDropPct >= PERFORMANCE_DROP_THRESHOLD)         fired.push('performance_drop');
Tests ran:
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) all clean — no trigger
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) one flag (only performance drop) — no trigger
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) two flags — no trigger (3/3 strict)
  and 3 more tests!

[Survived] EqualityOperator
src/engine/composite-signal/trigger-3-metrici.js:26:7
-     if (input.restTimeMultiplier > REST_TIME_MULTIPLIER_THRESHOLD)     fired.push('rest_time_excessive');
+     if (input.restTimeMultiplier >= REST_TIME_MULTIPLIER_THRESHOLD)     fired.push('rest_time_excessive');
Tests ran:
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) all clean — no trigger
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) one flag (only performance drop) — no trigger
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) two flags — no trigger (3/3 strict)
  and 3 more tests!

[Survived] EqualityOperator
src/engine/composite-signal/trigger-3-metrici.js:28:7
-     if (rirMismatch >= RIR_MISMATCH_THRESHOLD)                         fired.push('rir_mismatch');
+     if (rirMismatch > RIR_MISMATCH_THRESHOLD)                         fired.push('rir_mismatch');
Tests ran:
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) all clean — no trigger
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) one flag (only performance drop) — no trigger
    Golden Master — Composite Signal Layer (3/3 simultaneous threshold) two flags — no trigger (3/3 strict)
  and 3 more tests!

[Survived] ArrayDeclaration
src/engine/dimensions/autoAggressionAdapter.js:27:88
-     const warnings = Array.isArray(clusterSession?.warnings) ? clusterSession.warnings : [];
+     const warnings = Array.isArray(clusterSession?.warnings) ? clusterSession.warnings : ["Stryker was here"];
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 1. tier none — autoAggression missing entirely
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionAdapter.js:28:33
-     const aa = warnings.find(w => w?.source === AA_DIMENSION_ID);
+     const aa = warnings.find(w => true);
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 14 more tests!

[Survived] OptionalChaining
src/engine/dimensions/autoAggressionAdapter.js:28:33
-     const aa = warnings.find(w => w?.source === AA_DIMENSION_ID);
+     const aa = warnings.find(w => w.source === AA_DIMENSION_ID);
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 14 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionAdapter.js:51:37
-         requiresFrictionConfirmation: aa.requiresFrictionConfirmation === true,
+         requiresFrictionConfirmation: true,
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 6 more tests!

[Survived] OptionalChaining
src/engine/dimensions/autoAggressionAdapter.js:53:37
-       const exercises = Array.isArray(originalBaseSession?.exercises)
+       const exercises = Array.isArray(originalBaseSession.exercises)
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 6 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionAdapter.js:59:37
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.max(2, Math.floor((true) * 0.7)),
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionAdapter.js:59:37
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.max(2, Math.floor((false) * 0.7)),
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 5 more tests!

[Survived] LogicalOperator
src/engine/dimensions/autoAggressionAdapter.js:59:37
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.max(2, Math.floor((e.sets && 3) * 0.7)),
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 5 more tests!

[NoCoverage] ObjectLiteral
src/engine/dimensions/autoAggressionDimension.js:94:32
-     return createDimensionResult({
-       id: DIMENSION_ID,
-       tier: 'none',
-       confidence: 'low',
-       meta: { aaTier: aa.tier },
-     });
+     return createDimensionResult({});

[NoCoverage] ObjectLiteral
src/engine/dimensions/autoAggressionDimension.js:98:11
-       meta: { aaTier: aa.tier },
+       meta: {},

[Survived] BlockStatement
src/engine/dimensions/autoAggressionDimension.js:23:34
-   function _coerceSignals(signals) {
-     if (!Array.isArray(signals)) return [];
-     return signals.filter(s => typeof s === 'string');
-   }
+   function _coerceSignals(signals) {}
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:24:7
-     if (!Array.isArray(signals)) return [];
+     if (true) return [];
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] ArrayDeclaration
src/engine/dimensions/autoAggressionDimension.js:24:39
-     if (!Array.isArray(signals)) return [];
+     if (!Array.isArray(signals)) return ["Stryker was here"];
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)

[Survived] MethodExpression
src/engine/dimensions/autoAggressionDimension.js:25:10
-     return signals.filter(s => typeof s === 'string');
+     return signals;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 3 more tests!

[Survived] ArrowFunction
src/engine/dimensions/autoAggressionDimension.js:25:25
-     return signals.filter(s => typeof s === 'string');
+     return signals.filter(() => undefined);
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:25:30
-     return signals.filter(s => typeof s === 'string');
+     return signals.filter(s => true);
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:25:30
-     return signals.filter(s => typeof s === 'string');
+     return signals.filter(s => false);
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
  and 2 more tests!

[Survived] EqualityOperator
src/engine/dimensions/autoAggressionDimension.js:25:30
-     return signals.filter(s => typeof s === 'string');
+     return signals.filter(s => typeof s !== 'string');
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
  and 2 more tests!

[Survived] OptionalChaining
src/engine/dimensions/autoAggressionDimension.js:35:14
-     const aa = input?.ctx?.autoAggression;
+     const aa = input?.ctx.autoAggression;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 1. tier none — autoAggression missing entirely
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
  and 9 more tests!
