[Survived] OptionalChaining
src/engine/dimensions/autoAggressionDimension.js:35:14
-     const aa = input?.ctx?.autoAggression;
+     const aa = input.ctx?.autoAggression;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 1. tier none — autoAggression missing entirely
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
  and 9 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:37:14
-     if (!aa || aa.tier === 'none' || aa.tier === 'LOW') {
+     if (!aa || false || aa.tier === 'LOW') {
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
    Strangler AA — golden-master parity (legacy === cluster+adapter) 4. tier LOW — signals=["volume_creep"] (no mutation expected)
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:37:36
-     if (!aa || aa.tier === 'none' || aa.tier === 'LOW') {
+     if (!aa || aa.tier === 'none' || false) {
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
    Strangler AA — golden-master parity (legacy === cluster+adapter) 4. tier LOW — signals=["volume_creep"] (no mutation expected)
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
  and 6 more tests!

[Survived] ObjectLiteral
src/engine/dimensions/autoAggressionDimension.js:42:13
-         meta: { aaTier: aa?.tier ?? 'none' },
+         meta: {},
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 1. tier none — autoAggression missing entirely
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
  and 2 more tests!

[Survived] LogicalOperator
src/engine/dimensions/autoAggressionDimension.js:42:23
-         meta: { aaTier: aa?.tier ?? 'none' },
+         meta: { aaTier: aa?.tier && 'none' },
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 1. tier none — autoAggression missing entirely
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
    Strangler AA — golden-master parity (legacy === cluster+adapter) 3. tier LOW — signals empty (no mutation expected)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:47:22
-     const escalating = aa.escalating === true;
+     const escalating = true;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:47:22
-     const escalating = aa.escalating === true;
+     const escalating = false;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] EqualityOperator
src/engine/dimensions/autoAggressionDimension.js:47:22
-     const escalating = aa.escalating === true;
+     const escalating = aa.escalating !== true;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] BooleanLiteral
src/engine/dimensions/autoAggressionDimension.js:47:40
-     const escalating = aa.escalating === true;
+     const escalating = aa.escalating === false;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:48:21
-     const amplified = aa.amplified === true;
+     const amplified = true;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:48:21
-     const amplified = aa.amplified === true;
+     const amplified = false;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] EqualityOperator
src/engine/dimensions/autoAggressionDimension.js:48:21
-     const amplified = aa.amplified === true;
+     const amplified = aa.amplified !== true;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] BooleanLiteral
src/engine/dimensions/autoAggressionDimension.js:48:38
-     const amplified = aa.amplified === true;
+     const amplified = aa.amplified === false;
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 4 more tests!

[Survived] ObjectLiteral
src/engine/dimensions/autoAggressionDimension.js:67:13
-         meta: { aaTier: 'MED', escalating, amplified },
+         meta: {},
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 5. tier MED — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 6. tier MED — escalating=true, 3 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 7. tier MED — signals empty (defensive edge)
  and 1 more test!

[Survived] ConditionalExpression
src/engine/dimensions/autoAggressionDimension.js:71:7
-     if (aa.tier === 'HIGH') {
+     if (true) {
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 1 more test!

[Survived] ObjectLiteral
src/engine/dimensions/autoAggressionDimension.js:89:13
-         meta: { aaTier: 'HIGH', escalating, amplified },
+         meta: {},
Tests ran:
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
    Strangler AA — golden-master parity (legacy === cluster+adapter) 10. tier HIGH — signals undefined (defensive edge)
  and 1 more test!

[NoCoverage] ConditionalExpression
src/engine/pain-button/pain-input.js:27:5
-       default:
-         return { action: 'skip', rationale: 'unknown_pain_key' };
+       default:

[NoCoverage] ObjectLiteral
src/engine/pain-button/pain-input.js:28:14
-         return { action: 'skip', rationale: 'unknown_pain_key' };
+         return {};

[NoCoverage] BlockStatement
src/engine/self-correction/profile-validation.js:41:23
-     if (!drift.trigger) {
-       return { shouldPrompt: false, placeholderId: null, reason: 'no_drift_detected' };
-     }
+     if (!drift.trigger) {}

[NoCoverage] ObjectLiteral
src/engine/self-correction/profile-validation.js:42:12
-       return { shouldPrompt: false, placeholderId: null, reason: 'no_drift_detected' };
+       return {};

[NoCoverage] BooleanLiteral
src/engine/self-correction/profile-validation.js:42:28
-       return { shouldPrompt: false, placeholderId: null, reason: 'no_drift_detected' };
+       return { shouldPrompt: true, placeholderId: null, reason: 'no_drift_detected' };

[Survived] EqualityOperator
src/engine/self-correction/profile-validation.js:31:7
-     if (ctx.sessionCount < ROLLING_WINDOW_SESSIONS) {
+     if (ctx.sessionCount <= ROLLING_WINDOW_SESSIONS) {
Tests ran:
    Self-Correction — Profile Validation §36.34 window not full (<8 sessions) → no prompt
    Self-Correction — Profile Validation §36.34 cooldown active (<24 sessions since refusal) → no prompt
    Self-Correction — Profile Validation §36.34 drift detected + window full + no cooldown → prompt

[Survived] ConditionalExpression
src/engine/self-correction/profile-validation.js:36:48
-     if (ctx.sessionsSinceLastRefusal !== null && ctx.sessionsSinceLastRefusal < COOLDOWN_AFTER_REFUSAL_SESSIONS) {
+     if (ctx.sessionsSinceLastRefusal !== null && true) {
Tests ran:
    Self-Correction — Profile Validation §36.34 cooldown active (<24 sessions since refusal) → no prompt

[Survived] EqualityOperator
src/engine/self-correction/profile-validation.js:36:48
-     if (ctx.sessionsSinceLastRefusal !== null && ctx.sessionsSinceLastRefusal < COOLDOWN_AFTER_REFUSAL_SESSIONS) {
+     if (ctx.sessionsSinceLastRefusal !== null && ctx.sessionsSinceLastRefusal <= COOLDOWN_AFTER_REFUSAL_SESSIONS) {
Tests ran:
    Self-Correction — Profile Validation §36.34 cooldown active (<24 sessions since refusal) → no prompt

[Survived] ConditionalExpression
src/engine/self-correction/profile-validation.js:41:7
-     if (!drift.trigger) {
+     if (false) {
Tests ran:
    Self-Correction — Profile Validation §36.34 drift detected + window full + no cooldown → prompt

[NoCoverage] ArrayDeclaration
src/engine/self-correction/realtime-per-set.js:18:18
-     const { rpes = [], reps = [], rMax } = sessionState;
+     const { rpes = ["Stryker was here"], reps = [], rMax } = sessionState;

[NoCoverage] ArrayDeclaration
src/engine/self-correction/realtime-per-set.js:18:29
-     const { rpes = [], reps = [], rMax } = sessionState;
+     const { rpes = [], reps = ["Stryker was here"], rMax } = sessionState;

[NoCoverage] ObjectLiteral
src/engine/self-correction/realtime-per-set.js:31:10
-     return { direction: 'none', reason: null };
+     return {};

[Survived] MethodExpression
src/engine/self-correction/realtime-per-set.js:21:21
-     const last2Rpes = rpes.slice(-2);
+     const last2Rpes = rpes;
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× RPE 10 → adjust DOWN
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] MethodExpression
src/engine/self-correction/realtime-per-set.js:22:7
-     if (last2Rpes.every(r => r >= 10)) {
+     if (last2Rpes.some(r => r >= 10)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× RPE 10 → adjust DOWN
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] MethodExpression
src/engine/self-correction/realtime-per-set.js:26:21
-     const last2Reps = reps.slice(-2);
+     const last2Reps = reps;
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] UnaryOperator
src/engine/self-correction/realtime-per-set.js:26:32
-     const last2Reps = reps.slice(-2);
+     const last2Reps = reps.slice(+2);
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] ConditionalExpression
src/engine/self-correction/realtime-per-set.js:27:7
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (true) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] LogicalOperator
src/engine/self-correction/realtime-per-set.js:27:7
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (last2Rpes.every(r => r <= 6.5) || last2Reps.every(r => r >= rMax)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] MethodExpression
src/engine/self-correction/realtime-per-set.js:27:7
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (last2Rpes.some(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] ConditionalExpression
src/engine/self-correction/realtime-per-set.js:27:28
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (last2Rpes.every(r => true) && last2Reps.every(r => r >= rMax)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] EqualityOperator
src/engine/self-correction/realtime-per-set.js:27:28
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (last2Rpes.every(r => r < 6.5) && last2Reps.every(r => r >= rMax)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] MethodExpression
src/engine/self-correction/realtime-per-set.js:27:41
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (last2Rpes.every(r => r <= 6.5) && last2Reps.some(r => r >= rMax)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[Survived] ConditionalExpression
src/engine/self-correction/realtime-per-set.js:27:62
-     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => r >= rMax)) {
+     if (last2Rpes.every(r => r <= 6.5) && last2Reps.every(r => true)) {
Tests ran:
    Self-Correction — Realtime Per-Set §36.28 2× Easy + reps maxime → adjust UP

[NoCoverage] ObjectLiteral
src/engine/smart-routing/alternative-finder.js:19:34
-     if (!validNames.length) return { alternatives: [], shouldSkip: true };
+     if (!validNames.length) return {};

[NoCoverage] ArrayDeclaration
src/engine/smart-routing/alternative-finder.js:19:50
-     if (!validNames.length) return { alternatives: [], shouldSkip: true };
+     if (!validNames.length) return { alternatives: ["Stryker was here"], shouldSkip: true };

[NoCoverage] BooleanLiteral
src/engine/smart-routing/alternative-finder.js:19:66
-     if (!validNames.length) return { alternatives: [], shouldSkip: true };
+     if (!validNames.length) return { alternatives: [], shouldSkip: false };

[NoCoverage] ArithmeticOperator
src/engine/smart-routing/alternative-finder.js:29:21
-     }).sort((a, b) => b.similarity - a.similarity);
+     }).sort((a, b) => b.similarity + a.similarity);

[Survived] ConditionalExpression
src/engine/smart-routing/alternative-finder.js:16:7
-     if (!meta) return { alternatives: [], shouldSkip: true };
+     if (false) return { alternatives: [], shouldSkip: true };
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Golden Master — Smart Routing Equipment (tier-aware filtering) Unknown exercise → shouldSkip = true
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/smart-routing/alternative-finder.js:19:7
-     if (!validNames.length) return { alternatives: [], shouldSkip: true };
+     if (false) return { alternatives: [], shouldSkip: true };
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high
  and 1 more test!

[Survived] MethodExpression
src/engine/smart-routing/alternative-finder.js:22:18
-     const ranked = validNames.map(altName => {
-       const altMeta = EXERCISE_METADATA[altName];
-       let similarity = 0;
-       if (altMeta.muscle_target_primary === meta.muscle_target_primary) similarity += 3;
-       if (altMeta.equipment_type === meta.equipment_type) similarity += 1;
-       if (altMeta.force_demand === meta.force_demand) similarity += 2;
-       return { name: altName, similarity };
-     }).sort((a, b) => b.similarity - a.similarity);
+     const ranked = validNames.map(altName => {
+     const altMeta = EXERCISE_METADATA[altName];
+     let similarity = 0;
+     if (altMeta.muscle_target_primary === meta.muscle_target_primary) similarity += 3;
+     if (altMeta.equipment_type === meta.equipment_type) similarity += 1;
+     if (altMeta.force_demand === meta.force_demand) similarity += 2;
+     return {
+       name: altName,
+       similarity
+     };
+   });
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high
  and 1 more test!

[Survived] ConditionalExpression
src/engine/smart-routing/alternative-finder.js:25:9
-       if (altMeta.muscle_target_primary === meta.muscle_target_primary) similarity += 3;
+       if (true) similarity += 3;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high
  and 1 more test!

[Survived] ConditionalExpression
src/engine/smart-routing/alternative-finder.js:27:9
-       if (altMeta.force_demand === meta.force_demand) similarity += 2;
+       if (true) similarity += 2;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high
  and 1 more test!

[Survived] ArrowFunction
src/engine/smart-routing/alternative-finder.js:29:11
-     }).sort((a, b) => b.similarity - a.similarity);
+     }).sort(() => undefined);
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high
  and 1 more test!

[Survived] BooleanLiteral
src/engine/smart-routing/equipment-detection.js:16:19
-       skipExercise: false,
+       skipExercise: true,
Tests ran:
    Smart Routing §36.37 handleEquipmentBusy returns user-facing message

[Survived] ArrayDeclaration
src/engine/smart-routing/equipment-detection.js:17:19
-       alternatives: [],
+       alternatives: ["Stryker was here"],
Tests ran:
    Smart Routing §36.37 handleEquipmentBusy returns user-facing message

[Survived] ConditionalExpression
src/engine/suflet-andura/bias-detection.js:28:9
-       if (signals.whyTapRate > 0.05) fired.push('whyTapRate_high');
+       if (true) fired.push('whyTapRate_high');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 3 high signals → trigger
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 2 high signals → no trigger
    Suflet Andura — Bias Detection declared EXECUTOR + 3 high signals → trigger
  and 2 more tests!

[Survived] EqualityOperator
src/engine/suflet-andura/bias-detection.js:28:9
-       if (signals.whyTapRate > 0.05) fired.push('whyTapRate_high');
+       if (signals.whyTapRate >= 0.05) fired.push('whyTapRate_high');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 3 high signals → trigger
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 2 high signals → no trigger
    Suflet Andura — Bias Detection declared EXECUTOR + 3 high signals → trigger
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/suflet-andura/bias-detection.js:29:9
-       if (signals.avgSummaryDwellMs > 15000) fired.push('summaryDwell_high');
+       if (true) fired.push('summaryDwell_high');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 3 high signals → trigger
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 2 high signals → no trigger
    Suflet Andura — Bias Detection declared EXECUTOR + 3 high signals → trigger
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/suflet-andura/bias-detection.js:31:14
-     } else if (signals.declaredMode === 'STRATEGIC') {
+     } else if (true) {
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] EqualityOperator
src/engine/suflet-andura/bias-detection.js:29:9
-       if (signals.avgSummaryDwellMs > 15000) fired.push('summaryDwell_high');
+       if (signals.avgSummaryDwellMs >= 15000) fired.push('summaryDwell_high');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 3 high signals → trigger
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 2 high signals → no trigger
    Suflet Andura — Bias Detection declared EXECUTOR + 3 high signals → trigger
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/suflet-andura/bias-detection.js:32:9
-       if (signals.whyTapRate < 0.02) fired.push('whyTapRate_low');
+       if (true) fired.push('whyTapRate_low');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] EqualityOperator
src/engine/suflet-andura/bias-detection.js:32:9
-       if (signals.whyTapRate < 0.02) fired.push('whyTapRate_low');
+       if (signals.whyTapRate <= 0.02) fired.push('whyTapRate_low');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] EqualityOperator
src/engine/suflet-andura/bias-detection.js:30:9
-       if (signals.repRangeOverrideRate > 0.30) fired.push('repRangeOverride_high');
+       if (signals.repRangeOverrideRate >= 0.30) fired.push('repRangeOverride_high');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 3 high signals → trigger
    Golden Master — Bias Detection 3/3 simultaneous EXECUTOR + 2 high signals → no trigger
    Suflet Andura — Bias Detection declared EXECUTOR + 3 high signals → trigger
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/suflet-andura/bias-detection.js:33:9
-       if (signals.avgSummaryDwellMs < 5000) fired.push('summaryDwell_low');
+       if (true) fired.push('summaryDwell_low');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] EqualityOperator
src/engine/suflet-andura/bias-detection.js:33:9
-       if (signals.avgSummaryDwellMs < 5000) fired.push('summaryDwell_low');
+       if (signals.avgSummaryDwellMs <= 5000) fired.push('summaryDwell_low');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] ConditionalExpression
src/engine/suflet-andura/bias-detection.js:34:9
-       if (signals.repRangeOverrideRate < 0.05) fired.push('repRangeOverride_low');
+       if (true) fired.push('repRangeOverride_low');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] EqualityOperator
src/engine/suflet-andura/bias-detection.js:34:9
-       if (signals.repRangeOverrideRate < 0.05) fired.push('repRangeOverride_low');
+       if (signals.repRangeOverrideRate <= 0.05) fired.push('repRangeOverride_low');
Tests ran:
    Golden Master — Bias Detection 3/3 simultaneous STRATEGIC + 3 low signals → trigger

[Survived] ArrayDeclaration
src/engine/suflet-andura/cascade-defense.js:30:86
-     if (!recommendations || !recommendations.length) return { winner: null, runnerUps: [] };
+     if (!recommendations || !recommendations.length) return { winner: null, runnerUps: ["Stryker was here"] };
Tests ran:
    Suflet Andura — Cascade Defense empty list → null winner

[Survived] LogicalOperator
src/engine/suflet-andura/cascade-defense.js:35:13
-       return (b.priority ?? 0) - (a.priority ?? 0);
+       return (b.priority && 0) - (a.priority ?? 0);
Tests ran:
    Suflet Andura — Cascade Defense within layer, higher priority wins

[NoCoverage] MethodExpression
src/engine/suflet-andura/outlier-filter.js:34:19
-     const weights = window.map(s => s.weight).sort((a, b) => a - b);
+     const weights = window.map(s => s.weight);

[NoCoverage] ArrowFunction
src/engine/suflet-andura/outlier-filter.js:34:30
-     const weights = window.map(s => s.weight).sort((a, b) => a - b);
+     const weights = window.map(() => undefined).sort((a, b) => a - b);

[NoCoverage] ArrowFunction
src/engine/suflet-andura/outlier-filter.js:34:50
-     const weights = window.map(s => s.weight).sort((a, b) => a - b);
+     const weights = window.map(s => s.weight).sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/engine/suflet-andura/outlier-filter.js:34:60
-     const weights = window.map(s => s.weight).sort((a, b) => a - b);
+     const weights = window.map(s => s.weight).sort((a, b) => a + b);

[NoCoverage] ArithmeticOperator
src/engine/suflet-andura/outlier-filter.js:35:37
-     const median = weights[Math.floor(weights.length / 2)];
+     const median = weights[Math.floor(weights.length * 2)];

[NoCoverage] ArithmeticOperator
src/engine/suflet-andura/outlier-filter.js:36:15
-     const mad = median - weights[0]; // simplified MAD estimate
+     const mad = median + weights[0]; // simplified MAD estimate

[NoCoverage] ArithmeticOperator
src/engine/suflet-andura/outlier-filter.js:38:30
-     const deviation = Math.abs(candidate.weight - median);
+     const deviation = Math.abs(candidate.weight + median);

[NoCoverage] ConditionalExpression
src/engine/suflet-andura/outlier-filter.js:39:7
-     if (deviation > 3 * mad && mad > 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/suflet-andura/outlier-filter.js:39:7
-     if (deviation > 3 * mad && mad > 0) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/suflet-andura/outlier-filter.js:39:7
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation > 3 * mad || mad > 0) {

[NoCoverage] ConditionalExpression
src/engine/suflet-andura/outlier-filter.js:39:7
-     if (deviation > 3 * mad && mad > 0) {
+     if (true && mad > 0) {

[NoCoverage] EqualityOperator
src/engine/suflet-andura/outlier-filter.js:39:7
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation >= 3 * mad && mad > 0) {

[NoCoverage] EqualityOperator
src/engine/suflet-andura/outlier-filter.js:39:7
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation <= 3 * mad && mad > 0) {

[NoCoverage] ArithmeticOperator
src/engine/suflet-andura/outlier-filter.js:39:19
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation > 3 / mad && mad > 0) {

[NoCoverage] ConditionalExpression
src/engine/suflet-andura/outlier-filter.js:39:30
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation > 3 * mad && true) {

[NoCoverage] EqualityOperator
src/engine/suflet-andura/outlier-filter.js:39:30
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation > 3 * mad && mad >= 0) {

[NoCoverage] EqualityOperator
src/engine/suflet-andura/outlier-filter.js:39:30
-     if (deviation > 3 * mad && mad > 0) {
+     if (deviation > 3 * mad && mad <= 0) {

[NoCoverage] BlockStatement
src/engine/suflet-andura/outlier-filter.js:39:39
-     if (deviation > 3 * mad && mad > 0) {
-       return { isOutlier: true, reason: 'weight_3xmad_above_median' };
-     }
+     if (deviation > 3 * mad && mad > 0) {}

[NoCoverage] ObjectLiteral
src/engine/suflet-andura/outlier-filter.js:40:12
-       return { isOutlier: true, reason: 'weight_3xmad_above_median' };
+       return {};
