[Survived] MethodExpression
src/engine/aa.js:24:48
-       const fatigue  = last3Sessions.filter(s => s.some(l => (l.notes||[]).includes('fatigue'))).length;
+       const fatigue  = last3Sessions.filter(s => s.every(l => (l.notes || []).includes('fatigue'))).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ArrowFunction
src/engine/aa.js:25:43
-       const strong   = last3Sessions.filter(s => s.some(l => (l.notes||[]).includes('strong'))).length;
+       const strong   = last3Sessions.filter(() => undefined).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] MethodExpression
src/engine/aa.js:25:48
-       const strong   = last3Sessions.filter(s => s.some(l => (l.notes||[]).includes('strong'))).length;
+       const strong   = last3Sessions.filter(s => s.every(l => (l.notes || []).includes('strong'))).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ArrowFunction
src/engine/aa.js:25:55
-       const strong   = last3Sessions.filter(s => s.some(l => (l.notes||[]).includes('strong'))).length;
+       const strong   = last3Sessions.filter(s => s.some(() => undefined)).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] LogicalOperator
src/engine/aa.js:25:61
-       const strong   = last3Sessions.filter(s => s.some(l => (l.notes||[]).includes('strong'))).length;
+       const strong   = last3Sessions.filter(s => s.some(l => (l.notes && []).includes('strong'))).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] MethodExpression
src/engine/aa.js:28:9
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex === ex))
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] MethodExpression
src/engine/aa.js:28:32
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s).filter(s => s.length > 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ArrowFunction
src/engine/aa.js:28:41
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(() => undefined)).filter(s => s.length > 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ConditionalExpression
src/engine/aa.js:28:46
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => true)).filter(s => s.length > 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ConditionalExpression
src/engine/aa.js:28:46
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => false)).filter(s => s.length > 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] EqualityOperator
src/engine/aa.js:28:46
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex !== ex)).filter(s => s.length > 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ArrowFunction
src/engine/aa.js:28:67
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(() => undefined)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ConditionalExpression
src/engine/aa.js:28:72
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => true)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ConditionalExpression
src/engine/aa.js:28:72
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => false)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] EqualityOperator
src/engine/aa.js:28:72
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length >= 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] EqualityOperator
src/engine/aa.js:28:72
-         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length > 0)
+         ? last3Sessions.map(s => s.filter(l => l.ex === ex)).filter(s => s.length <= 0)
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ArrowFunction
src/engine/aa.js:30:39
-       const formBad = exSessions.filter(s => s.some(l => (l.notes||[]).includes('form'))).length;
+       const formBad = exSessions.filter(() => undefined).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] MethodExpression
src/engine/aa.js:30:44
-       const formBad = exSessions.filter(s => s.some(l => (l.notes||[]).includes('form'))).length;
+       const formBad = exSessions.filter(s => s.every(l => (l.notes || []).includes('form'))).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] ArrowFunction
src/engine/aa.js:30:51
-       const formBad = exSessions.filter(s => s.some(l => (l.notes||[]).includes('form'))).length;
+       const formBad = exSessions.filter(s => s.some(() => undefined)).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] LogicalOperator
src/engine/aa.js:30:57
-       const formBad = exSessions.filter(s => s.some(l => (l.notes||[]).includes('form'))).length;
+       const formBad = exSessions.filter(s => s.some(l => (l.notes && []).includes('form'))).length;
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions
    AA.getRecoveryContext forceDeload when fatigue >= 3
  and 1 more test!

[Survived] BooleanLiteral
src/engine/aa.js:35:13
-           ok: false,
+           ok: true,
Tests ran:
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions

[Survived] BooleanLiteral
src/engine/aa.js:37:27
-           suppressIncrease: false,
+           suppressIncrease: true,
Tests ran:
    AA.getRecoveryContext suppressDecrease when sleep bad in 2+ sessions

[Survived] ConditionalExpression
src/engine/aa.js:44:26
-       if (fatigue >= 3 || (fatigue >= 2 && formBad >= 2)) {
+       if (fatigue >= 3 || (false)) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:44:26
-       if (fatigue >= 3 || (fatigue >= 2 && formBad >= 2)) {
+       if (fatigue >= 3 || (true && formBad >= 2)) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] LogicalOperator
src/engine/aa.js:44:26
-       if (fatigue >= 3 || (fatigue >= 2 && formBad >= 2)) {
+       if (fatigue >= 3 || (fatigue >= 2 || formBad >= 2)) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] EqualityOperator
src/engine/aa.js:44:26
-       if (fatigue >= 3 || (fatigue >= 2 && formBad >= 2)) {
+       if (fatigue >= 3 || (fatigue > 2 && formBad >= 2)) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] EqualityOperator
src/engine/aa.js:44:26
-       if (fatigue >= 3 || (fatigue >= 2 && formBad >= 2)) {
+       if (fatigue >= 3 || (fatigue < 2 && formBad >= 2)) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] BooleanLiteral
src/engine/aa.js:46:13
-           ok: false,
+           ok: true,
Tests ran:
    AA.getRecoveryContext forceDeload when fatigue >= 3

[Survived] BooleanLiteral
src/engine/aa.js:47:27
-           suppressDecrease: false,
+           suppressDecrease: true,
Tests ran:
    AA.getRecoveryContext forceDeload when fatigue >= 3

[Survived] ConditionalExpression
src/engine/aa.js:56:9
-       if (formBad >= 2) {
+       if (false) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] EqualityOperator
src/engine/aa.js:56:9
-       if (formBad >= 2) {
+       if (formBad > 2) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] EqualityOperator
src/engine/aa.js:68:9
-       if (strong >= 3) {
+       if (strong > 3) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:68:9
-       if (strong >= 3) {
+       if (false) {
Tests ran:
    AA.getRecoveryContext returns ok:true when no notes
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:85:9
-       if (lastAdj) {
+       if (true) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] ConditionalExpression
src/engine/aa.js:85:9
-       if (lastAdj) {
+       if (false) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] MethodExpression
src/engine/aa.js:90:18
-       const logs = DP.getLogs(ex, 9).filter(l => !l.baseline);
+       const logs = DP.getLogs(ex, 9);
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] ArrowFunction
src/engine/aa.js:90:43
-       const logs = DP.getLogs(ex, 9).filter(l => !l.baseline);
+       const logs = DP.getLogs(ex, 9).filter(() => undefined);
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] BooleanLiteral
src/engine/aa.js:90:48
-       const logs = DP.getLogs(ex, 9).filter(l => !l.baseline);
+       const logs = DP.getLogs(ex, 9).filter(l => l.baseline);
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] ConditionalExpression
src/engine/aa.js:91:9
-       if (logs.length < 4) return null;
+       if (true) return null;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] ConditionalExpression
src/engine/aa.js:91:9
-       if (logs.length < 4) return null;
+       if (false) return null;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] EqualityOperator
src/engine/aa.js:91:9
-       if (logs.length < 4) return null;
+       if (logs.length <= 4) return null;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] EqualityOperator
src/engine/aa.js:91:9
-       if (logs.length < 4) return null;
+       if (logs.length >= 4) return null;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)
    AA.check — notes-only, no RPE dependency returns null with fewer than 4 logs

[Survived] ConditionalExpression
src/engine/aa.js:94:19
-       const lastW = logs[0].w || 20;
+       const lastW = true;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:94:19
-       const lastW = logs[0].w || 20;
+       const lastW = false;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] LogicalOperator
src/engine/aa.js:94:19
-       const lastW = logs[0].w || 20;
+       const lastW = logs[0].w && 20;
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:98:9
-       if (recovery.forceDeload) {
+       if (false) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:109:9
-       if (!recovery.ok && recovery.suppressIncrease) {
+       if (false) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] LogicalOperator
src/engine/aa.js:109:9
-       if (!recovery.ok && recovery.suppressIncrease) {
+       if (!recovery.ok || recovery.suppressIncrease) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] BooleanLiteral
src/engine/aa.js:109:9
-       if (!recovery.ok && recovery.suppressIncrease) {
+       if (recovery.ok && recovery.suppressIncrease) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ArrayDeclaration
src/engine/aa.js:119:49
-       const earlyStops = DB.get('early-stops') || [];
+       const earlyStops = DB.get('early-stops') || ["Stryker was here"];
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] MethodExpression
src/engine/aa.js:120:29
-       const hasPhysicalStop = earlyStops.slice(-3).some(
+       const hasPhysicalStop = earlyStops.some(
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] UnaryOperator
src/engine/aa.js:120:46
-       const hasPhysicalStop = earlyStops.slice(-3).some(
+       const hasPhysicalStop = earlyStops.slice(+3).some(
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ArrowFunction
src/engine/aa.js:121:7
-         s => s.reason === 'Oboseală extremă' || s.reason === 'Am dureri'
+         () => undefined
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:123:9
-       if (hasPhysicalStop) {
+       if (false) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] ConditionalExpression
src/engine/aa.js:135:9
-       if (recovery.formIssue && logs.filter(l => (l.notes||[]).includes('form')).length >= 2) {
+       if (false) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[Survived] LogicalOperator
src/engine/aa.js:135:9
-       if (recovery.formIssue && logs.filter(l => (l.notes||[]).includes('form')).length >= 2) {
+       if (recovery.formIssue || logs.filter(l => (l.notes || []).includes('form')).length >= 2) {
Tests ran:
    AA.check — notes-only, no RPE dependency returns null with no signals (no RPE increase trigger)

[NoCoverage] AssignmentOperator
src/engine/adherence.js:24:35
-     if (kcals[today] !== undefined) score += 25;
+     if (kcals[today] !== undefined) score -= 25;

[NoCoverage] ConditionalExpression
src/engine/adherence.js:27:37
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (prots[today] !== undefined && true) score += 25;

[NoCoverage] EqualityOperator
src/engine/adherence.js:27:37
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (prots[today] !== undefined && prots[today] > 150) score += 25;

[NoCoverage] EqualityOperator
src/engine/adherence.js:27:37
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (prots[today] !== undefined && prots[today] < 150) score += 25;

[NoCoverage] AssignmentOperator
src/engine/adherence.js:27:58
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (prots[today] !== undefined && prots[today] >= 150) score -= 25;

[NoCoverage] AssignmentOperator
src/engine/adherence.js:50:32
-     if (ws[today] !== undefined) score += 20;
+     if (ws[today] !== undefined) score -= 20;

[NoCoverage] BlockStatement
src/engine/adherence.js:53:20
-     if (score >= 80) {
-       color = 'var(--green)';
-       label = 'Excelent';
-     } else if (score >= 50) {
+     if (score >= 80) {} else if (score >= 50) {

[NoCoverage] BlockStatement
src/engine/adherence.js:56:27
-     } else if (score >= 50) {
-       color = 'var(--accent)';
-       label = 'OK';
-     } else {
+     } else if (score >= 50) {} else {

[NoCoverage] ConditionalExpression
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
-       e.synthetic !== true &&
-       e.outcome != null
+       true

[NoCoverage] ConditionalExpression
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
-       e.synthetic !== true &&
-       e.outcome != null
+       false

[NoCoverage] LogicalOperator
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
-       e.synthetic !== true &&
-       e.outcome != null
+       e.date >= cutoffStr && e.synthetic !== true || e.outcome != null

[NoCoverage] ConditionalExpression
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
-       e.synthetic !== true &&
+       true &&

[NoCoverage] LogicalOperator
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
-       e.synthetic !== true &&
+       e.date >= cutoffStr || e.synthetic !== true &&

[NoCoverage] ConditionalExpression
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
+       true &&

[NoCoverage] EqualityOperator
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
+       e.date > cutoffStr &&

[NoCoverage] EqualityOperator
src/engine/adherence.js:91:5
-       e.date >= cutoffStr &&
+       e.date < cutoffStr &&

[NoCoverage] ConditionalExpression
src/engine/adherence.js:92:5
-       e.synthetic !== true &&
+       true &&

[NoCoverage] EqualityOperator
src/engine/adherence.js:92:5
-       e.synthetic !== true &&
+       e.synthetic === true &&

[NoCoverage] BooleanLiteral
src/engine/adherence.js:92:21
-       e.synthetic !== true &&
+       e.synthetic !== false &&

[NoCoverage] ConditionalExpression
src/engine/adherence.js:93:5
-       e.outcome != null
+       true

[NoCoverage] EqualityOperator
src/engine/adherence.js:93:5
-       e.outcome != null
+       e.outcome == null

[Survived] ConditionalExpression
src/engine/adherence.js:10:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:10:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:11:17
-     const prots = DB.get('prots') || {};
+     const prots = true;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:11:17
-     const prots = DB.get('prots') || {};
+     const prots = false;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:12:14
-     const ws = DB.get('weights') || {};
+     const ws = true;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:12:14
-     const ws = DB.get('weights') || {};
+     const ws = false;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ArrayDeclaration
src/engine/adherence.js:13:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];
Tests ran:
    getAdherenceScore — CDL workout pillar rest day (Monday/PROG[0]=off) → automatic +30p regardless of CDL or logs
    getAdherenceScore — CDL workout pillar workout day + CDL executed=true → +30p workout
    getAdherenceScore — CDL workout pillar workout day + CDL executed=false → 0p (no kcal/prot/weight in setup)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:24:7
-     if (kcals[today] !== undefined) score += 25;
+     if (false) score += 25;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:27:7
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (false) score += 25;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] LogicalOperator
src/engine/adherence.js:27:7
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (prots[today] !== undefined || prots[today] >= 150) score += 25;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:27:7
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (true && prots[today] >= 150) score += 25;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] EqualityOperator
src/engine/adherence.js:27:7
-     if (prots[today] !== undefined && prots[today] >= 150) score += 25;
+     if (prots[today] === undefined && prots[today] >= 150) score += 25;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:44:42
-         const todayLogs = logs.filter(l => l.date === today && !l.baseline && l.ex !== '__early_stop__');
+         const todayLogs = logs.filter(l => true && l.ex !== '__early_stop__');
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 2 more tests!

[Survived] LogicalOperator
src/engine/adherence.js:44:42
-         const todayLogs = logs.filter(l => l.date === today && !l.baseline && l.ex !== '__early_stop__');
+         const todayLogs = logs.filter(l => l.date === today || !l.baseline && l.ex !== '__early_stop__');
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 2 more tests!
