[Survived] ConditionalExpression
src/engine/adherence.js:44:42
-         const todayLogs = logs.filter(l => l.date === today && !l.baseline && l.ex !== '__early_stop__');
+         const todayLogs = logs.filter(l => true && !l.baseline && l.ex !== '__early_stop__');
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:50:7
-     if (ws[today] !== undefined) score += 20;
+     if (false) score += 20;
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:53:7
-     if (score >= 80) {
+     if (true) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:53:7
-     if (score >= 80) {
+     if (false) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] EqualityOperator
src/engine/adherence.js:53:7
-     if (score >= 80) {
+     if (score > 80) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] EqualityOperator
src/engine/adherence.js:53:7
-     if (score >= 80) {
+     if (score < 80) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:56:14
-     } else if (score >= 50) {
+     } else if (true) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:56:14
-     } else if (score >= 50) {
+     } else if (false) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] EqualityOperator
src/engine/adherence.js:56:14
-     } else if (score >= 50) {
+     } else if (score > 50) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] EqualityOperator
src/engine/adherence.js:56:14
-     } else if (score >= 50) {
+     } else if (score < 50) {
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] BlockStatement
src/engine/adherence.js:59:10
-     } else {
-       color = 'var(--accent2)';
-       label = 'Slab';
-     }
+     } else {}
Tests ran:
    getAdherenceScore — workout compliance counts 3 real sets as workout done
    getAdherenceScore — workout compliance does NOT count __early_stop__ marker as a workout set
    getAdherenceScore — workout compliance counts real sets even when early_stop marker is also present
  and 7 more tests!

[Survived] MethodExpression
src/engine/adherence.js:87:3
-     cutoffDate.setDate(cutoffDate.getDate() - windowDays);
+     cutoffDate.setTime(cutoffDate.getDate() - windowDays);
Tests ran:
    computeAdherence — CDL pure empty CDL → score null, all zeros
    computeAdherence — CDL pure all executed=true → score 100
    computeAdherence — CDL pure 2 executed + 2 partial → score 75
  and 4 more tests!

[Survived] ArithmeticOperator
src/engine/adherence.js:87:22
-     cutoffDate.setDate(cutoffDate.getDate() - windowDays);
+     cutoffDate.setDate(cutoffDate.getDate() + windowDays);
Tests ran:
    computeAdherence — CDL pure empty CDL → score null, all zeros
    computeAdherence — CDL pure all executed=true → score 100
    computeAdherence — CDL pure 2 executed + 2 partial → score 75
  and 4 more tests!

[Survived] MethodExpression
src/engine/adherence.js:88:21
-     const cutoffStr = cutoffDate.toISOString().slice(0, 10);
+     const cutoffStr = cutoffDate.toISOString();
Tests ran:
    computeAdherence — CDL pure empty CDL → score null, all zeros
    computeAdherence — CDL pure all executed=true → score 100
    computeAdherence — CDL pure 2 executed + 2 partial → score 75
  and 4 more tests!

[Survived] ArrowFunction
src/engine/adherence.js:90:50
-     const entries = coachDecisionLog.readAllActive(e =>
-       e.date >= cutoffStr &&
-       e.synthetic !== true &&
-       e.outcome != null
+     const entries = coachDecisionLog.readAllActive(() => undefined
Tests ran:
    computeAdherence — CDL pure empty CDL → score null, all zeros
    computeAdherence — CDL pure all executed=true → score 100
    computeAdherence — CDL pure 2 executed + 2 partial → score 75
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/adherence.js:115:14
-       else if (o.executed === false) skipped++;
+       else if (true) skipped++;
Tests ran:
    computeAdherence — CDL pure all skipped → score 0
    computeAdherence — CDL pure mixed: 1 exec + 1 partial + 1 skipped + 1 deviated → score 38

[Survived] ArithmeticOperator
src/engine/adherence.js:119:22
-     const rawScore = ((executed * 1.0) + (partial * 0.5)) / proposed * 100;
+     const rawScore = ((executed / 1.0) + (partial * 0.5)) / proposed * 100;
Tests ran:
    computeAdherence — CDL pure all executed=true → score 100
    computeAdherence — CDL pure 2 executed + 2 partial → score 75
    computeAdherence — CDL pure all skipped → score 0
  and 3 more tests!

[NoCoverage] ArrayDeclaration
src/engine/alternativeEngine.js:59:70
-   export function getAlternatives(exerciseName, unavailableEquipment = []) {
+   export function getAlternatives(exerciseName, unavailableEquipment = ["Stryker was here"]) {

[NoCoverage] BooleanLiteral
src/engine/alternativeEngine.js:65:24
-       if (!equip) return true; // bodyweight or unknown — assume available
+       if (!equip) return false; // bodyweight or unknown — assume available

[NoCoverage] ArrayDeclaration
src/engine/alternativeEngine.js:76:70
-   export function resolveExercise(exerciseName, unavailableEquipment = []) {
+   export function resolveExercise(exerciseName, unavailableEquipment = ["Stryker was here"]) {

[NoCoverage] ObjectLiteral
src/engine/alternativeEngine.js:85:33
-     if (alts.length === 0) return { exercise: exerciseName, isAlternative: false, noAlt: true };
+     if (alts.length === 0) return {};

[NoCoverage] BooleanLiteral
src/engine/alternativeEngine.js:85:74
-     if (alts.length === 0) return { exercise: exerciseName, isAlternative: false, noAlt: true };
+     if (alts.length === 0) return { exercise: exerciseName, isAlternative: true, noAlt: true };

[NoCoverage] BooleanLiteral
src/engine/alternativeEngine.js:85:88
-     if (alts.length === 0) return { exercise: exerciseName, isAlternative: false, noAlt: true };
+     if (alts.length === 0) return { exercise: exerciseName, isAlternative: false, noAlt: false };

[Survived] ConditionalExpression
src/engine/alternativeEngine.js:65:9
-       if (!equip) return true; // bodyweight or unknown — assume available
+       if (false) return true; // bodyweight or unknown — assume available
Tests ran:
    getAlternatives returns alternatives for Lat Pulldown
    getAlternatives filters out alternatives requiring unavailable equipment
    getAlternatives returns all alternatives when no equipment is unavailable
  and 1 more test!

[Survived] LogicalOperator
src/engine/alternativeEngine.js:66:36
-       return !unavailLower.some(u => u.includes(equip) || equip.includes(u));
+       return !unavailLower.some(u => u.includes(equip) && equip.includes(u));
Tests ran:
    getAlternatives filters out alternatives requiring unavailable equipment
    getAlternatives returns all alternatives when no equipment is unavailable
    resolveExercise returns alternative when cable is unavailable

[Survived] LogicalOperator
src/engine/alternativeEngine.js:80:31
-       && unavailLower.some(u => u.includes(requiredEquip) || requiredEquip.includes(u));
+       && unavailLower.some(u => u.includes(requiredEquip) && requiredEquip.includes(u));
Tests ran:
    CoachDirector — Equipment availability should respect unavailable pec_deck equipment
    CoachDirector — Equipment availability should respect unavailable dumbbell equipment
    resolveExercise returns alternative when cable is unavailable
  and 1 more test!

[Survived] ConditionalExpression
src/engine/alternativeEngine.js:85:7
-     if (alts.length === 0) return { exercise: exerciseName, isAlternative: false, noAlt: true };
+     if (false) return { exercise: exerciseName, isAlternative: false, noAlt: true };
Tests ran:
    resolveExercise returns alternative when cable is unavailable

[Survived] ArrayDeclaration
src/engine/alternativeEngine.js:31:14
-     pec_deck:  ['Pec Deck / Cable Fly'],
+     pec_deck:  [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/alternativeEngine.js:32:14
-     barbell:   ['Barbell OHP', 'Barbell Row', 'Flat Barbell Press', 'Incline Barbell Press',
-                  'Leg Press', 'Romanian Deadlift', 'Stiff Leg Deadlift', 'Good Morning'],
+     barbell:   [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/alternativeEngine.js:34:14
-     machine:   ['Machine Shoulder Press', 'Machine Row', 'Machine Lateral Raise', 'Leg Press',
-                  'Leg Curl', 'Leg Extension', 'Hack Squat', 'Calf Raise'],
+     machine:   [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/alternativeEngine.js:36:14
-     dumbbells: ['Incline DB Press', 'Flat DB Press', 'DB Shoulder Press', 'Incline DB Curl',
-                  'DB Row', 'DB Fly'],
+     dumbbells: [],
Ran all tests for this mutant.

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:25:7
-     if (signalCount === 1) return 'LOW';
+     if (true) return 'LOW';

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:25:7
-     if (signalCount === 1) return 'LOW';
+     if (false) return 'LOW';

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:25:7
-     if (signalCount === 1) return 'LOW';
+     if (signalCount !== 1) return 'LOW';

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:26:7
-     if (signalCount <= 3) return 'MED';
+     if (true) return 'MED';

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:26:7
-     if (signalCount <= 3) return 'MED';
+     if (false) return 'MED';

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:26:7
-     if (signalCount <= 3) return 'MED';
+     if (signalCount < 3) return 'MED';

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:26:7
-     if (signalCount <= 3) return 'MED';
+     if (signalCount > 3) return 'MED';

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:38:49
-   export function _computeCompositeFatigue(entry) {
-     const outcome = entry?.outcome;
-     if (!outcome) return false;
-     const setsRPE = outcome.setsRPE;
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
-       const rated = setsRPE.filter(r => typeof r === 'number');
-       if (rated.length === 0) return false;
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
-       return hardCount / rated.length >= 0.5;
-     }
-     // Proxy fallback: numeric rating ≤2 (pre-RPE-per-set entries)
-     const rating = outcome.rating;
-     if (typeof rating === 'number') return rating <= 2;
-     return false;
-   }
+   export function _computeCompositeFatigue(entry) {}

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:39:19
-     const outcome = entry?.outcome;
+     const outcome = entry.outcome;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:40:7
-     if (!outcome) return false;
+     if (outcome) return false;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:40:7
-     if (!outcome) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:40:7
-     if (!outcome) return false;
+     if (false) return false;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:40:24
-     if (!outcome) return false;
+     if (!outcome) return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:43:7
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:43:7
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:43:7
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
+     if (Array.isArray(setsRPE) || setsRPE.length > 0) {

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:43:33
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
+     if (Array.isArray(setsRPE) && true) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:43:33
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
+     if (Array.isArray(setsRPE) && setsRPE.length >= 0) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:43:33
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
+     if (Array.isArray(setsRPE) && setsRPE.length <= 0) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:43:53
-     if (Array.isArray(setsRPE) && setsRPE.length > 0) {
-       const rated = setsRPE.filter(r => typeof r === 'number');
-       if (rated.length === 0) return false;
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
-       return hardCount / rated.length >= 0.5;
-     }
+     if (Array.isArray(setsRPE) && setsRPE.length > 0) {}

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:44:19
-       const rated = setsRPE.filter(r => typeof r === 'number');
+       const rated = setsRPE;

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:44:34
-       const rated = setsRPE.filter(r => typeof r === 'number');
+       const rated = setsRPE.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:44:39
-       const rated = setsRPE.filter(r => typeof r === 'number');
+       const rated = setsRPE.filter(r => true);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:44:39
-       const rated = setsRPE.filter(r => typeof r === 'number');
+       const rated = setsRPE.filter(r => false);

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:44:39
-       const rated = setsRPE.filter(r => typeof r === 'number');
+       const rated = setsRPE.filter(r => typeof r !== 'number');

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:45:9
-       if (rated.length === 0) return false;
+       if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:45:9
-       if (rated.length === 0) return false;
+       if (false) return false;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:45:9
-       if (rated.length === 0) return false;
+       if (rated.length !== 0) return false;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:45:36
-       if (rated.length === 0) return false;
+       if (rated.length === 0) return true;

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:46:23
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
+       const hardCount = rated.length;  // RPE 9=Hard, 10=Very Hard

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:46:36
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
+       const hardCount = rated.filter(() => undefined).length;  // RPE 9=Hard, 10=Very Hard

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:46:41
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
+       const hardCount = rated.filter(r => true).length;  // RPE 9=Hard, 10=Very Hard

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:46:41
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
+       const hardCount = rated.filter(r => false).length;  // RPE 9=Hard, 10=Very Hard

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:46:41
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
+       const hardCount = rated.filter(r => r > 9).length;  // RPE 9=Hard, 10=Very Hard

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:46:41
-       const hardCount = rated.filter(r => r >= 9).length;  // RPE 9=Hard, 10=Very Hard
+       const hardCount = rated.filter(r => r < 9).length;  // RPE 9=Hard, 10=Very Hard

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:47:12
-       return hardCount / rated.length >= 0.5;
+       return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:47:12
-       return hardCount / rated.length >= 0.5;
+       return false;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:47:12
-       return hardCount / rated.length >= 0.5;
+       return hardCount / rated.length > 0.5;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:47:12
-       return hardCount / rated.length >= 0.5;
+       return hardCount / rated.length < 0.5;

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:47:12
-       return hardCount / rated.length >= 0.5;
+       return hardCount * rated.length >= 0.5;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:52:7
-     if (typeof rating === 'number') return rating <= 2;
+     if (true) return rating <= 2;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:52:7
-     if (typeof rating === 'number') return rating <= 2;
+     if (false) return rating <= 2;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:52:7
-     if (typeof rating === 'number') return rating <= 2;
+     if (typeof rating !== 'number') return rating <= 2;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:52:42
-     if (typeof rating === 'number') return rating <= 2;
+     if (typeof rating === 'number') return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:52:42
-     if (typeof rating === 'number') return rating <= 2;
+     if (typeof rating === 'number') return false;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:52:42
-     if (typeof rating === 'number') return rating <= 2;
+     if (typeof rating === 'number') return rating < 2;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:52:42
-     if (typeof rating === 'number') return rating <= 2;
+     if (typeof rating === 'number') return rating > 2;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:53:10
-     return false;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:74:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:74:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i <= workouts.length; i++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:74:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i >= workouts.length; i++) {

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:74:40
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i < workouts.length; i--) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:74:45
-     for (let i = 0; i < workouts.length; i++) {
-       const isCreep = workouts[i].outcome?.deviation === true &&
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
-       if (isCreep) {
-         if (streakLen === 0) streakStart = i;
-         streakLen++;
-         if (streakLen >= 3) {
-           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) / MS_PER_DAY;
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
-         }
-       } else {
-         streakLen = 0;
-       }
-     }
+     for (let i = 0; i < workouts.length; i++) {}

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:75:21
-       const isCreep = workouts[i].outcome?.deviation === true &&
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+       const isCreep = true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:75:21
-       const isCreep = workouts[i].outcome?.deviation === true &&
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+       const isCreep = false;

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:75:21
-       const isCreep = workouts[i].outcome?.deviation === true &&
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+       const isCreep = workouts[i].outcome?.deviation === true || (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:75:21
-       const isCreep = workouts[i].outcome?.deviation === true &&
+       const isCreep = true &&

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:75:21
-       const isCreep = workouts[i].outcome?.deviation === true &&
+       const isCreep = workouts[i].outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:75:21
-       const isCreep = workouts[i].outcome?.deviation === true &&
+       const isCreep = workouts[i].outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:75:56
-       const isCreep = workouts[i].outcome?.deviation === true &&
+       const isCreep = workouts[i].outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:76:21
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:76:21
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       (workouts[i].outcome?.actualSets ?? 0) >= (workouts[i].outcome?.proposedSets ?? 0);

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:76:21
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       (workouts[i].outcome?.actualSets ?? 0) <= (workouts[i].outcome?.proposedSets ?? 0);

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:76:22
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       (workouts[i].outcome?.actualSets && 0) > (workouts[i].outcome?.proposedSets ?? 0);

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:76:22
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       (workouts[i].outcome.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:76:63
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets && 0);

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:76:63
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
+                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome.proposedSets ?? 0);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:78:9
-       if (isCreep) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:78:9
-       if (isCreep) {
+       if (false) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:78:18
-       if (isCreep) {
-         if (streakLen === 0) streakStart = i;
-         streakLen++;
-         if (streakLen >= 3) {
-           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) / MS_PER_DAY;
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
-         }
-       } else {
+       if (isCreep) {} else {

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:79:11
-         if (streakLen === 0) streakStart = i;
+         if (true) streakStart = i;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:79:11
-         if (streakLen === 0) streakStart = i;
+         if (false) streakStart = i;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:79:11
-         if (streakLen === 0) streakStart = i;
+         if (streakLen !== 0) streakStart = i;

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:80:7
-         streakLen++;
+         streakLen--;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:81:11
-         if (streakLen >= 3) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:81:11
-         if (streakLen >= 3) {
+         if (false) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:81:11
-         if (streakLen >= 3) {
+         if (streakLen > 3) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:81:11
-         if (streakLen >= 3) {
+         if (streakLen < 3) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:81:27
-         if (streakLen >= 3) {
-           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) / MS_PER_DAY;
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
-         }
+         if (streakLen >= 3) {}

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:82:26
-           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) / MS_PER_DAY;
+           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) * MS_PER_DAY;

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:82:27
-           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) / MS_PER_DAY;
+           const spanDays = (new Date(workouts[i].date) + new Date(workouts[streakStart].date)) / MS_PER_DAY;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:83:13
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
+           if (true) return true;  // 21-day anti-stale window

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:83:13
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
+           if (false) return true;  // 21-day anti-stale window

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:83:13
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
+           if (spanDays < 21) return true;  // 21-day anti-stale window

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:83:13
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
+           if (spanDays > 21) return true;  // 21-day anti-stale window
