[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:83:36
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
+           if (spanDays <= 21) return false;  // 21-day anti-stale window

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:85:12
-       } else {
-         streakLen = 0;
-       }
+       } else {}

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:89:10
-     return false;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:104:19
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:104:19
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; i <= withKcal.length; i++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:104:19
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; i >= withKcal.length; i++) {

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:104:40
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; i < withKcal.length; i--) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:104:45
-     for (let i = 0; i < withKcal.length; i++) {
-       const anchor = new Date(withKcal[i].date);
-       const cutoff = new Date(anchor);
-       cutoff.setDate(anchor.getDate() + 7);
-       const window = withKcal.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d <= cutoff;
-       });
-       if (window.length < 2) continue;
-       const maxKcal = Math.max(...window.map(e => e.context.kcal_target));
-       const minKcal = Math.min(...window.map(e => e.context.kcal_target));
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
-     }
+     for (let i = 0; i < withKcal.length; i++) {}

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:107:5
-       cutoff.setDate(anchor.getDate() + 7);
+       cutoff.setTime(anchor.getDate() + 7);

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:107:20
-       cutoff.setDate(anchor.getDate() + 7);
+       cutoff.setDate(anchor.getDate() - 7);

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:109:20
-       const window = withKcal.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d <= cutoff;
-       });
+       const window = withKcal;

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:109:41
-       const window = withKcal.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d <= cutoff;
-       });
+       const window = withKcal.filter(e => {});

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:111:14
-         return d >= anchor && d <= cutoff;
+         return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:111:14
-         return d >= anchor && d <= cutoff;
+         return false;

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:111:14
-         return d >= anchor && d <= cutoff;
+         return d >= anchor || d <= cutoff;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:111:14
-         return d >= anchor && d <= cutoff;
+         return true && d <= cutoff;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:111:14
-         return d >= anchor && d <= cutoff;
+         return d > anchor && d <= cutoff;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:111:14
-         return d >= anchor && d <= cutoff;
+         return d < anchor && d <= cutoff;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:111:29
-         return d >= anchor && d <= cutoff;
+         return d >= anchor && true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:111:29
-         return d >= anchor && d <= cutoff;
+         return d >= anchor && d < cutoff;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:111:29
-         return d >= anchor && d <= cutoff;
+         return d >= anchor && d > cutoff;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:113:9
-       if (window.length < 2) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:113:9
-       if (window.length < 2) continue;
+       if (false) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:113:9
-       if (window.length < 2) continue;
+       if (window.length <= 2) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:113:9
-       if (window.length < 2) continue;
+       if (window.length >= 2) continue;

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:115:21
-       const maxKcal = Math.max(...window.map(e => e.context.kcal_target));
+       const maxKcal = Math.min(...window.map(e => e.context.kcal_target));

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:115:44
-       const maxKcal = Math.max(...window.map(e => e.context.kcal_target));
+       const maxKcal = Math.max(...window.map(() => undefined));

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:116:21
-       const minKcal = Math.min(...window.map(e => e.context.kcal_target));
+       const minKcal = Math.max(...window.map(e => e.context.kcal_target));

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:116:44
-       const minKcal = Math.min(...window.map(e => e.context.kcal_target));
+       const minKcal = Math.min(...window.map(() => undefined));

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:117:9
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
+       if (true) return true;  // >300 kcal drop threshold

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:117:9
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
+       if (false) return true;  // >300 kcal drop threshold

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:117:9
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
+       if (maxKcal - minKcal >= 300) return true;  // >300 kcal drop threshold

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:117:9
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
+       if (maxKcal - minKcal <= 300) return true;  // >300 kcal drop threshold

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:117:9
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
+       if (maxKcal + minKcal > 300) return true;  // >300 kcal drop threshold

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:117:41
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
+       if (maxKcal - minKcal > 300) return false;  // >300 kcal drop threshold

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:119:10
-     return false;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:134:55
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = typeof rating === 'number' && true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:134:55
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = typeof rating === 'number' && rating < 2;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:134:55
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = typeof rating === 'number' && rating > 2;

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:138:5
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day forward window
+       windowEnd.setTime(windowEnd.getDate() + 14);  // 14-day forward window

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:138:23
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day forward window
+       windowEnd.setDate(windowEnd.getDate() - 14);  // 14-day forward window

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:140:21
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; false; j++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:140:21
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; j <= workouts.length; j++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:140:21
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; j >= workouts.length; j++) {

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:140:42
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; j < workouts.length; j--) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:140:47
-       for (let j = i; j < workouts.length; j++) {
-         if (new Date(workouts[j].date) > windowEnd) break;
-         const hasCreep = workouts[j].outcome?.deviation === true &&
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
-         if (hasCreep) return true;
-       }
+       for (let j = i; j < workouts.length; j++) {}

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:141:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (true) break;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:141:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (false) break;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:141:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (new Date(workouts[j].date) >= windowEnd) break;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:141:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (new Date(workouts[j].date) <= windowEnd) break;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:142:24
-         const hasCreep = workouts[j].outcome?.deviation === true &&
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+         const hasCreep = true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:142:24
-         const hasCreep = workouts[j].outcome?.deviation === true &&
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+         const hasCreep = false;

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:142:24
-         const hasCreep = workouts[j].outcome?.deviation === true &&
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+         const hasCreep = workouts[j].outcome?.deviation === true || (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:142:24
-         const hasCreep = workouts[j].outcome?.deviation === true &&
+         const hasCreep = true &&

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:142:24
-         const hasCreep = workouts[j].outcome?.deviation === true &&
+         const hasCreep = workouts[j].outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:142:24
-         const hasCreep = workouts[j].outcome?.deviation === true &&
+         const hasCreep = workouts[j].outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:142:59
-         const hasCreep = workouts[j].outcome?.deviation === true &&
+         const hasCreep = workouts[j].outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:143:24
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:143:24
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          (workouts[j].outcome?.actualSets ?? 0) >= (workouts[j].outcome?.proposedSets ?? 0);

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:143:24
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          (workouts[j].outcome?.actualSets ?? 0) <= (workouts[j].outcome?.proposedSets ?? 0);

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:143:25
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          (workouts[j].outcome?.actualSets && 0) > (workouts[j].outcome?.proposedSets ?? 0);

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:143:25
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          (workouts[j].outcome.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:143:66
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets && 0);

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:143:66
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
+                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome.proposedSets ?? 0);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:144:11
-         if (hasCreep) return true;
+         if (true) return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:144:11
-         if (hasCreep) return true;
+         if (false) return true;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:144:28
-         if (hasCreep) return true;
+         if (hasCreep) return false;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:162:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:162:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i <= workouts.length; i++) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:162:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i >= workouts.length; i++) {

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:162:40
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i < workouts.length; i--) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:162:45
-     for (let i = 0; i < workouts.length; i++) {
-       const anchor = new Date(workouts[i].date);
-       const cutoff = new Date(anchor);
-       cutoff.setDate(anchor.getDate() + 7);
-       const window = workouts.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d < cutoff;
-       });
-       if (window.length < 2) continue;
-       const fatigueSessions = window.filter(e => _computeCompositeFatigue(e));
-       if (fatigueSessions.length < 2) continue;
-       // Condition: no early-stop (would indicate recovery was acknowledged)
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
-       // Condition: volume not dropped in fatigue sessions (user keeps pushing)
-       const volumeDropped = fatigueSessions.some(
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
-       );
-       if (volumeDropped) continue;
-       return true;
-     }
+     for (let i = 0; i < workouts.length; i++) {}

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:165:5
-       cutoff.setDate(anchor.getDate() + 7);
+       cutoff.setTime(anchor.getDate() + 7);

[NoCoverage] ArithmeticOperator
src/engine/autoAggressionDetection.js:165:20
-       cutoff.setDate(anchor.getDate() + 7);
+       cutoff.setDate(anchor.getDate() - 7);

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:167:20
-       const window = workouts.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d < cutoff;
-       });
+       const window = workouts;

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:167:41
-       const window = workouts.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d < cutoff;
-       });
+       const window = workouts.filter(e => {});

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:169:14
-         return d >= anchor && d < cutoff;
+         return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:169:14
-         return d >= anchor && d < cutoff;
+         return false;

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:169:14
-         return d >= anchor && d < cutoff;
+         return d >= anchor || d < cutoff;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:169:14
-         return d >= anchor && d < cutoff;
+         return true && d < cutoff;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:169:14
-         return d >= anchor && d < cutoff;
+         return d > anchor && d < cutoff;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:169:14
-         return d >= anchor && d < cutoff;
+         return d < anchor && d < cutoff;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:169:29
-         return d >= anchor && d < cutoff;
+         return d >= anchor && true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:169:29
-         return d >= anchor && d < cutoff;
+         return d >= anchor && d <= cutoff;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:169:29
-         return d >= anchor && d < cutoff;
+         return d >= anchor && d >= cutoff;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:171:9
-       if (window.length < 2) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:171:9
-       if (window.length < 2) continue;
+       if (false) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:171:9
-       if (window.length < 2) continue;
+       if (window.length <= 2) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:171:9
-       if (window.length < 2) continue;
+       if (window.length >= 2) continue;

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:173:29
-       const fatigueSessions = window.filter(e => _computeCompositeFatigue(e));
+       const fatigueSessions = window;

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:173:43
-       const fatigueSessions = window.filter(e => _computeCompositeFatigue(e));
+       const fatigueSessions = window.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:174:9
-       if (fatigueSessions.length < 2) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:174:9
-       if (fatigueSessions.length < 2) continue;
+       if (false) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:174:9
-       if (fatigueSessions.length < 2) continue;
+       if (fatigueSessions.length <= 2) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:174:9
-       if (fatigueSessions.length < 2) continue;
+       if (fatigueSessions.length >= 2) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:177:9
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:177:9
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (false) continue;

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:177:9
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.every(e => e.outcome?.earlyStop === true)) continue;

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:177:21
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.some(() => undefined)) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:177:26
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.some(e => true)) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:177:26
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.some(e => false)) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:177:26
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.some(e => e.outcome?.earlyStop !== true)) continue;

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:177:26
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.some(e => e.outcome.earlyStop === true)) continue;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:177:51
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
+       if (window.some(e => e.outcome?.earlyStop === false)) continue;

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:180:27
-       const volumeDropped = fatigueSessions.some(
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
-       );
+       const volumeDropped = fatigueSessions.every(e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0));

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:181:7
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         () => undefined

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:181:12
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => true

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:181:12
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => false

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:181:12
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => (e.outcome?.actualSets ?? 0) <= (e.outcome?.proposedSets ?? 0)

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:181:12
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => (e.outcome?.actualSets ?? 0) >= (e.outcome?.proposedSets ?? 0)

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:181:13
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => (e.outcome?.actualSets && 0) < (e.outcome?.proposedSets ?? 0)

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:181:13
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => (e.outcome.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:181:44
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets && 0)

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:181:44
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
+         e => (e.outcome?.actualSets ?? 0) < (e.outcome.proposedSets ?? 0)

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:183:9
-       if (volumeDropped) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:183:9
-       if (volumeDropped) continue;
+       if (false) continue;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:185:12
-       return true;
+       return false;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:187:10
-     return false;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:205:46
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed === false && true) {

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:205:46
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed === false && entry.outcome?.rest_marked !== true) {

[NoCoverage] OptionalChaining
src/engine/autoAggressionDetection.js:205:46
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed === false && entry.outcome.rest_marked === true) {

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:205:77
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === false) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:205:83
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
-         byWeek[week]++;
-       }
+       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {}

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:206:7
-         byWeek[week]++;
+         byWeek[week]--;

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:214:35
-     for (const week of sortedWeeks) {
-       if (byWeek[week] < 2) {  // <2 rest days threshold
-         streak++;
-         if (streak >= 3) return true;
-       } else {
-         streak = 0;  // streak breaks at week with ≥2 rest days
-       }
-     }
+     for (const week of sortedWeeks) {}

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:215:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold
+       if (true) {  // <2 rest days threshold

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:215:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold
+       if (false) {  // <2 rest days threshold

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:215:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold
+       if (byWeek[week] <= 2) {  // <2 rest days threshold

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:215:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold
+       if (byWeek[week] >= 2) {  // <2 rest days threshold

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:215:27
-       if (byWeek[week] < 2) {  // <2 rest days threshold
-         streak++;
-         if (streak >= 3) return true;
-       } else {
+       if (byWeek[week] < 2) {} else {

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:216:7
-         streak++;
+         streak--;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:217:11
-         if (streak >= 3) return true;
+         if (true) return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:217:11
-         if (streak >= 3) return true;
+         if (false) return true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:217:11
-         if (streak >= 3) return true;
+         if (streak > 3) return true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:217:11
-         if (streak >= 3) return true;
+         if (streak < 3) return true;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:217:31
-         if (streak >= 3) return true;
+         if (streak >= 3) return false;

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:218:12
-       } else {
-         streak = 0;  // streak breaks at week with ≥2 rest days
-       }
+       } else {}

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:222:10
-     return false;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:234:21
-     const amplified = daysWithHyperfocus >= 4;  // 4+ days/week at 8h+ threshold
+     const amplified = true;  // 4+ days/week at 8h+ threshold

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:234:21
-     const amplified = daysWithHyperfocus >= 4;  // 4+ days/week at 8h+ threshold
+     const amplified = false;  // 4+ days/week at 8h+ threshold

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:234:21
-     const amplified = daysWithHyperfocus >= 4;  // 4+ days/week at 8h+ threshold
+     const amplified = daysWithHyperfocus > 4;  // 4+ days/week at 8h+ threshold

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:234:21
-     const amplified = daysWithHyperfocus >= 4;  // 4+ days/week at 8h+ threshold
+     const amplified = daysWithHyperfocus < 4;  // 4+ days/week at 8h+ threshold

[NoCoverage] ObjectLiteral
src/engine/autoAggressionDetection.js:235:10
-     return {
-       amplified,
-       reason: amplified ? 'hyperfocus_pattern_8h_4days_per_week' : null,
-     };
+     return {};
