[NoCoverage] ArrayDeclaration
src/engine/autoAggressionDetection.js:251:33
-     const withAA = (cdlEntries ?? []).filter(e => e.outcome?.autoAggression?.tier != null);
+     const withAA = (cdlEntries ?? ["Stryker was here"]).filter(e => e.outcome?.autoAggression?.tier != null);

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:255:31
-     for (const entry of withAA) {
-       const week = isoWeek(entry.date);
-       if (!byWeek[week]) byWeek[week] = [];
-       byWeek[week].push(entry.outcome.autoAggression.tier);
-     }
+     for (const entry of withAA) {}

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:257:9
-       if (!byWeek[week]) byWeek[week] = [];
+       if (byWeek[week]) byWeek[week] = [];

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:257:9
-       if (!byWeek[week]) byWeek[week] = [];
+       if (true) byWeek[week] = [];

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:257:9
-       if (!byWeek[week]) byWeek[week] = [];
+       if (false) byWeek[week] = [];

[NoCoverage] ArrayDeclaration
src/engine/autoAggressionDetection.js:257:39
-       if (!byWeek[week]) byWeek[week] = [];
+       if (!byWeek[week]) byWeek[week] = ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:261:23
-     const sortedWeeks = Object.keys(byWeek).sort();
+     const sortedWeeks = Object.keys(byWeek);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:262:7
-     if (sortedWeeks.length < 2) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:262:7
-     if (sortedWeeks.length < 2) return false;
+     if (false) return false;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:262:7
-     if (sortedWeeks.length < 2) return false;
+     if (sortedWeeks.length <= 2) return false;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:262:7
-     if (sortedWeeks.length < 2) return false;
+     if (sortedWeeks.length >= 2) return false;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:262:38
-     if (sortedWeeks.length < 2) return false;
+     if (sortedWeeks.length < 2) return true;

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:265:35
-     for (const week of sortedWeeks) {
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
-       if (hasMedOrHigher) {
-         streak++;
-         if (streak >= 2) return true;
-       } else {
-         streak = 0;
-       }
-     }
+     for (const week of sortedWeeks) {}

[NoCoverage] MethodExpression
src/engine/autoAggressionDetection.js:266:28
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].every(t => t === 'MED' || t === 'HIGH');

[NoCoverage] ArrowFunction
src/engine/autoAggressionDetection.js:266:46
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:266:51
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => true);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:266:51
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => false);

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:266:51
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' && t === 'HIGH');

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:266:51
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => false || t === 'HIGH');

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:266:51
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => t !== 'MED' || t === 'HIGH');

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:266:66
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || false);

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:266:66
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
+       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t !== 'HIGH');

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:267:9
-       if (hasMedOrHigher) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:267:9
-       if (hasMedOrHigher) {
+       if (false) {

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:267:25
-       if (hasMedOrHigher) {
-         streak++;
-         if (streak >= 2) return true;
-       } else {
+       if (hasMedOrHigher) {} else {

[NoCoverage] UpdateOperator
src/engine/autoAggressionDetection.js:268:7
-         streak++;
+         streak--;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:269:11
-         if (streak >= 2) return true;
+         if (true) return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:269:11
-         if (streak >= 2) return true;
+         if (false) return true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:269:11
-         if (streak >= 2) return true;
+         if (streak > 2) return true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:269:11
-         if (streak >= 2) return true;
+         if (streak < 2) return true;

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:269:31
-         if (streak >= 2) return true;
+         if (streak >= 2) return false;

[NoCoverage] BlockStatement
src/engine/autoAggressionDetection.js:270:12
-       } else {
-         streak = 0;
-       }
+       } else {}

[NoCoverage] BooleanLiteral
src/engine/autoAggressionDetection.js:274:10
-     return false;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:294:16
-       if (!aa || aa.tier === 'none') continue;
+       if (!aa || false) continue;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:294:16
-       if (!aa || aa.tier === 'none') continue;
+       if (!aa || aa.tier !== 'none') continue;

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:295:22
-       for (const s of (aa.signals ?? [])) signalSet.add(s);
+       for (const s of (aa.signals && [])) signalSet.add(s);

[NoCoverage] ArrayDeclaration
src/engine/autoAggressionDetection.js:295:36
-       for (const s of (aa.signals ?? [])) signalSet.add(s);
+       for (const s of (aa.signals ?? ["Stryker was here"])) signalSet.add(s);

[NoCoverage] LogicalOperator
src/engine/autoAggressionDetection.js:304:40
-     const amplifierReason = amplified ? (amplifiedEntry.outcome.autoAggression.amplifierReason ?? null) : null;
+     const amplifierReason = amplified ? (amplifiedEntry.outcome.autoAggression.amplifierReason && null) : null;

[NoCoverage] ArrayDeclaration
src/engine/autoAggressionDetection.js:322:70
-   export function detectAutoAggression({ currentEntry, recentEntries = [], hyperfocusData = null }) {
+   export function detectAutoAggression({ currentEntry, recentEntries = ["Stryker was here"], hyperfocusData = null }) {

[NoCoverage] ArrayDeclaration
src/engine/autoAggressionDetection.js:323:44
-     const allEntries = [...(recentEntries ?? []), currentEntry].filter(Boolean);
+     const allEntries = [...(recentEntries ?? ["Stryker was here"]), currentEntry].filter(Boolean);

[NoCoverage] ConditionalExpression
src/engine/autoAggressionDetection.js:333:43
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
+     const recoveryDebt = rawRecoveryDebt && true;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:333:43
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
+     const recoveryDebt = rawRecoveryDebt && otherCount > 1;

[NoCoverage] EqualityOperator
src/engine/autoAggressionDetection.js:333:43
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
+     const recoveryDebt = rawRecoveryDebt && otherCount < 1;

[NoCoverage] ArrayDeclaration
src/engine/autoAggressionDetection.js:344:57
-     const escalating = computeEscalation(recentEntries ?? []);
+     const escalating = computeEscalation(recentEntries ?? ["Stryker was here"]);

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:64:45
-   export function _detectVolumeCreep(entries) {
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
-     if (workouts.length < 3) return false;
-     let streakStart = 0;
-     let streakLen = 0;
-     for (let i = 0; i < workouts.length; i++) {
-       const isCreep = workouts[i].outcome?.deviation === true &&
-                       (workouts[i].outcome?.actualSets ?? 0) > (workouts[i].outcome?.proposedSets ?? 0);
-       if (isCreep) {
-         if (streakLen === 0) streakStart = i;
-         streakLen++;
-         if (streakLen >= 3) {
-           const spanDays = (new Date(workouts[i].date) - new Date(workouts[streakStart].date)) / MS_PER_DAY;
-           if (spanDays <= 21) return true;  // 21-day anti-stale window
-         }
-       } else {
-         streakLen = 0;
-       }
-     }
-     return false;
-   }
+   export function _detectVolumeCreep(entries) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:65:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
+     const workouts = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:23:43
-   export function _computeTier(signalCount) {
-     if (signalCount <= 0) return 'none';
-     if (signalCount === 1) return 'LOW';
-     if (signalCount <= 3) return 'MED';
-     return 'HIGH';
-   }
+   export function _computeTier(signalCount) {}
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:24:7
-     if (signalCount <= 0) return 'none';
+     if (true) return 'none';
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:24:7
-     if (signalCount <= 0) return 'none';
+     if (false) return 'none';
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:24:7
-     if (signalCount <= 0) return 'none';
+     if (signalCount < 0) return 'none';
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:24:7
-     if (signalCount <= 0) return 'none';
+     if (signalCount > 0) return 'none';
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:65:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+     const workouts = entries
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:66:13
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(() => undefined)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:66:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => true)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:66:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:66:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:66:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:66:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:66:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:66:42
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:66:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || false)
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:66:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:66:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:67:11
-       .sort((a, b) => a.date.localeCompare(b.date));
+       .sort(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:69:7
-     if (workouts.length < 3) return false;
+     if (true) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:69:7
-     if (workouts.length < 3) return false;
+     if (false) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:69:7
-     if (workouts.length < 3) return false;
+     if (workouts.length <= 3) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:69:7
-     if (workouts.length < 3) return false;
+     if (workouts.length >= 3) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:69:35
-     if (workouts.length < 3) return false;
+     if (workouts.length < 3) return true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:97:53
-   export function _detectCalorieAcceleration(entries) {
-     const withKcal = entries
-       .filter(e => typeof e.context?.kcal_target === 'number')
-       .sort((a, b) => a.date.localeCompare(b.date));
-     if (withKcal.length < 2) return false;
-     for (let i = 0; i < withKcal.length; i++) {
-       const anchor = new Date(withKcal[i].date);
-       const cutoff = new Date(anchor);
-       cutoff.setDate(anchor.getDate() + 7);
-       const window = withKcal.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d <= cutoff;
-       });
-       if (window.length < 2) continue;
-       const maxKcal = Math.max(...window.map(e => e.context.kcal_target));
-       const minKcal = Math.min(...window.map(e => e.context.kcal_target));
-       if (maxKcal - minKcal > 300) return true;  // >300 kcal drop threshold
-     }
-     return false;
-   }
+   export function _detectCalorieAcceleration(entries) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:98:20
-     const withKcal = entries
-       .filter(e => typeof e.context?.kcal_target === 'number')
-       .sort((a, b) => a.date.localeCompare(b.date));
+     const withKcal = entries.filter(e => typeof e.context?.kcal_target === 'number');
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:98:20
-     const withKcal = entries
-       .filter(e => typeof e.context?.kcal_target === 'number')
+     const withKcal = entries
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:99:13
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(() => undefined)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:99:18
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => true)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:99:18
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => false)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:99:18
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => typeof e.context?.kcal_target !== 'number')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:99:25
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => typeof e.context.kcal_target === 'number')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:102:7
-     if (withKcal.length < 2) return false;
+     if (true) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:100:11
-       .sort((a, b) => a.date.localeCompare(b.date));
+       .sort(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:102:7
-     if (withKcal.length < 2) return false;
+     if (false) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:102:7
-     if (withKcal.length < 2) return false;
+     if (withKcal.length <= 2) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!
