[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:102:7
-     if (withKcal.length < 2) return false;
+     if (withKcal.length >= 2) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:102:35
-     if (withKcal.length < 2) return false;
+     if (withKcal.length < 2) return true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:127:52
-   export function _detectFrustrationMarkers(entries) {
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
-     for (let i = 0; i < workouts.length; i++) {
-       const rating = workouts[i].outcome?.rating;
-       const isLowRating = typeof rating === 'number' && rating <= 2;
-       if (!isLowRating) continue;
-       const windowEnd = new Date(workouts[i].date);
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day forward window
-       for (let j = i; j < workouts.length; j++) {
-         if (new Date(workouts[j].date) > windowEnd) break;
-         const hasCreep = workouts[j].outcome?.deviation === true &&
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
-         if (hasCreep) return true;
-       }
-     }
-     return false;
-   }
+   export function _detectFrustrationMarkers(entries) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:128:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
+     const workouts = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:128:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+     const workouts = entries
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:129:13
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(() => undefined)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:129:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => true)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:129:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:129:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:129:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:129:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:129:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:129:42
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:129:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || false)
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:129:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:129:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:130:11
-       .sort((a, b) => a.date.localeCompare(b.date));
+       .sort(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:132:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; false; i++) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:132:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i >= workouts.length; i++) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:132:45
-     for (let i = 0; i < workouts.length; i++) {
-       const rating = workouts[i].outcome?.rating;
-       const isLowRating = typeof rating === 'number' && rating <= 2;
-       if (!isLowRating) continue;
-       const windowEnd = new Date(workouts[i].date);
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day forward window
-       for (let j = i; j < workouts.length; j++) {
-         if (new Date(workouts[j].date) > windowEnd) break;
-         const hasCreep = workouts[j].outcome?.deviation === true &&
-                          (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0);
-         if (hasCreep) return true;
-       }
-     }
+     for (let i = 0; i < workouts.length; i++) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:133:20
-       const rating = workouts[i].outcome?.rating;
+       const rating = workouts[i].outcome.rating;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:134:25
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:134:25
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:134:25
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = typeof rating === 'number' || rating <= 2;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:134:25
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = true && rating <= 2;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:134:25
-       const isLowRating = typeof rating === 'number' && rating <= 2;
+       const isLowRating = typeof rating !== 'number' && rating <= 2;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:135:9
-       if (!isLowRating) continue;
+       if (isLowRating) continue;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:135:9
-       if (!isLowRating) continue;
+       if (true) continue;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:135:9
-       if (!isLowRating) continue;
+       if (false) continue;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:147:10
-     return false;
+     return true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:155:48
-   export function _detectIgnoreRecovery(entries) {
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
-     if (workouts.length < 2) return false;
-     for (let i = 0; i < workouts.length; i++) {
-       const anchor = new Date(workouts[i].date);
-       const cutoff = new Date(anchor);
-       cutoff.setDate(anchor.getDate() + 7);
-       const window = workouts.filter(e => {
-         const d = new Date(e.date);
-         return d >= anchor && d < cutoff;
-       });
-       if (window.length < 2) continue;
-       const fatigueSessions = window.filter(e => _computeCompositeFatigue(e));
-       if (fatigueSessions.length < 2) continue;
-       // Condition: no early-stop (would indicate recovery was acknowledged)
-       if (window.some(e => e.outcome?.earlyStop === true)) continue;
-       // Condition: volume not dropped in fatigue sessions (user keeps pushing)
-       const volumeDropped = fatigueSessions.some(
-         e => (e.outcome?.actualSets ?? 0) < (e.outcome?.proposedSets ?? 0)
-       );
-       if (volumeDropped) continue;
-       return true;
-     }
-     return false;
-   }
+   export function _detectIgnoreRecovery(entries) {}

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:156:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
+     const workouts = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:156:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+     const workouts = entries
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:157:13
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(() => undefined)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:157:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => true)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:157:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:157:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:157:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:157:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:157:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:157:42
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:157:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || false)
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:157:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:157:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial')
Tests ran:
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:158:11
-       .sort((a, b) => a.date.localeCompare(b.date));
+       .sort(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:160:7
-     if (workouts.length < 2) return false;
+     if (true) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:160:7
-     if (workouts.length < 2) return false;
+     if (false) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:160:7
-     if (workouts.length < 2) return false;
+     if (workouts.length <= 2) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:160:7
-     if (workouts.length < 2) return false;
+     if (workouts.length >= 2) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:160:35
-     if (workouts.length < 2) return false;
+     if (workouts.length < 2) return true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:197:46
-   export function _detectRecoveryDebt(entries) {
-     const byWeek = {};
-     for (const entry of entries) {
-       if (!entry.date) continue;
-       const week = isoWeek(entry.date);
-       if (!byWeek[week]) byWeek[week] = 0;
-       // Only count explicit rest_marked=true on non-executed days (per ADR 011 rest semantics)
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
-         byWeek[week]++;
-       }
-     }
-     const sortedWeeks = Object.keys(byWeek).sort();
-     if (sortedWeeks.length < 3) return false;
-     let streak = 0;
-     for (const week of sortedWeeks) {
-       if (byWeek[week] < 2) {  // <2 rest days threshold
-         streak++;
-         if (streak >= 3) return true;
-       } else {
-         streak = 0;  // streak breaks at week with ≥2 rest days
-       }
-     }
-     return false;
-   }
+   export function _detectRecoveryDebt(entries) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
