[Survived] BlockStatement
src/engine/autoAggressionDetection.js:200:32
-     for (const entry of entries) {
-       if (!entry.date) continue;
-       const week = isoWeek(entry.date);
-       if (!byWeek[week]) byWeek[week] = 0;
-       // Only count explicit rest_marked=true on non-executed days (per ADR 011 rest semantics)
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
-         byWeek[week]++;
-       }
-     }
+     for (const entry of entries) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:201:9
-       if (!entry.date) continue;
+       if (entry.date) continue;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:201:9
-       if (!entry.date) continue;
+       if (true) continue;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:201:9
-       if (!entry.date) continue;
+       if (false) continue;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:203:9
-       if (!byWeek[week]) byWeek[week] = 0;
+       if (byWeek[week]) byWeek[week] = 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:203:9
-       if (!byWeek[week]) byWeek[week] = 0;
+       if (true) byWeek[week] = 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:203:9
-       if (!byWeek[week]) byWeek[week] = 0;
+       if (false) byWeek[week] = 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:205:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:205:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (false) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:205:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed === false || entry.outcome?.rest_marked === true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:205:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (true && entry.outcome?.rest_marked === true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:205:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed !== false && entry.outcome?.rest_marked === true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:205:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome.executed === false && entry.outcome?.rest_marked === true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:205:37
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) {
+       if (entry.outcome?.executed === true && entry.outcome?.rest_marked === true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:210:23
-     const sortedWeeks = Object.keys(byWeek).sort();
+     const sortedWeeks = Object.keys(byWeek);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:211:7
-     if (sortedWeeks.length < 3) return false;
+     if (true) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:211:7
-     if (sortedWeeks.length < 3) return false;
+     if (false) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:211:7
-     if (sortedWeeks.length < 3) return false;
+     if (sortedWeeks.length <= 3) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:211:7
-     if (sortedWeeks.length < 3) return false;
+     if (sortedWeeks.length >= 3) return false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:211:38
-     if (sortedWeeks.length < 3) return false;
+     if (sortedWeeks.length < 3) return true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:232:7
-     if (!hyperfocusData) return { amplified: false, reason: null };
+     if (true) return { amplified: false, reason: null };
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/engine/autoAggressionDetection.js:232:31
-     if (!hyperfocusData) return { amplified: false, reason: null };
+     if (!hyperfocusData) return {};
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:232:44
-     if (!hyperfocusData) return { amplified: false, reason: null };
+     if (!hyperfocusData) return { amplified: true, reason: null };
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:251:49
-     const withAA = (cdlEntries ?? []).filter(e => e.outcome?.autoAggression?.tier != null);
+     const withAA = (cdlEntries ?? []).filter(e => false);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:250:47
-   export function computeEscalation(cdlEntries) {
-     const withAA = (cdlEntries ?? []).filter(e => e.outcome?.autoAggression?.tier != null);
-     if (withAA.length < 1) return false;
-     const byWeek = {};
-     for (const entry of withAA) {
-       const week = isoWeek(entry.date);
-       if (!byWeek[week]) byWeek[week] = [];
-       byWeek[week].push(entry.outcome.autoAggression.tier);
-     }
-     const sortedWeeks = Object.keys(byWeek).sort();
-     if (sortedWeeks.length < 2) return false;
-     let streak = 0;
-     for (const week of sortedWeeks) {
-       const hasMedOrHigher = byWeek[week].some(t => t === 'MED' || t === 'HIGH');
-       if (hasMedOrHigher) {
-         streak++;
-         if (streak >= 2) return true;
-       } else {
-         streak = 0;
-       }
-     }
-     return false;
-   }
+   export function computeEscalation(cdlEntries) {}
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:251:19
-     const withAA = (cdlEntries ?? []).filter(e => e.outcome?.autoAggression?.tier != null);
+     const withAA = (cdlEntries && []).filter(e => e.outcome?.autoAggression?.tier != null);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:251:44
-     const withAA = (cdlEntries ?? []).filter(e => e.outcome?.autoAggression?.tier != null);
+     const withAA = (cdlEntries ?? []).filter(() => undefined);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:251:49
-     const withAA = (cdlEntries ?? []).filter(e => e.outcome?.autoAggression?.tier != null);
+     const withAA = (cdlEntries ?? []).filter(e => e.outcome.autoAggression?.tier != null);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:252:7
-     if (withAA.length < 1) return false;
+     if (true) return false;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:252:7
-     if (withAA.length < 1) return false;
+     if (false) return false;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:252:7
-     if (withAA.length < 1) return false;
+     if (withAA.length <= 1) return false;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:252:33
-     if (withAA.length < 1) return false;
+     if (withAA.length < 1) return true;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:252:7
-     if (withAA.length < 1) return false;
+     if (withAA.length >= 1) return false;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 6 more tests!

[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:285:117
-     const empty = { signals: [], tier: 'none', escalating: false, amplified: false, amplifierReason: null, riskFlags: [] };
+     const empty = { signals: [], tier: 'none', escalating: false, amplified: false, amplifierReason: null, riskFlags: ["Stryker was here"] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:286:7
-     if (!cdlEntries || cdlEntries.length === 0) return empty;
+     if (true) return empty;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:286:7
-     if (!cdlEntries || cdlEntries.length === 0) return empty;
+     if (false) return empty;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:286:7
-     if (!cdlEntries || cdlEntries.length === 0) return empty;
+     if (!cdlEntries && cdlEntries.length === 0) return empty;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:286:7
-     if (!cdlEntries || cdlEntries.length === 0) return empty;
+     if (cdlEntries || cdlEntries.length === 0) return empty;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:288:16
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:288:34
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(() => undefined);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:288:39
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(e => true);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:286:22
-     if (!cdlEntries || cdlEntries.length === 0) return empty;
+     if (!cdlEntries || false) return empty;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:288:39
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(e => false);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:286:22
-     if (!cdlEntries || cdlEntries.length === 0) return empty;
+     if (!cdlEntries || cdlEntries.length !== 0) return empty;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:288:39
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(e => !e.synthetic || e.outcome != null);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:288:39
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(e => e.synthetic && e.outcome != null);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:288:55
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(e => !e.synthetic && true);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:288:55
-     const real = cdlEntries.filter(e => !e.synthetic && e.outcome != null);
+     const real = cdlEntries.filter(e => !e.synthetic && e.outcome == null);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:289:7
-     if (real.length === 0) return empty;
+     if (true) return empty;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:289:7
-     if (real.length === 0) return empty;
+     if (false) return empty;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:292:29
-     for (const entry of real) {
-       const aa = entry.outcome?.autoAggression;
-       if (!aa || aa.tier === 'none') continue;
-       for (const s of (aa.signals ?? [])) signalSet.add(s);
-     }
+     for (const entry of real) {}
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] EqualityOperator
src/engine/autoAggressionDetection.js:289:7
-     if (real.length === 0) return empty;
+     if (real.length !== 0) return empty;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:293:16
-       const aa = entry.outcome?.autoAggression;
+       const aa = entry.outcome.autoAggression;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:294:9
-       if (!aa || aa.tier === 'none') continue;
+       if (true) continue;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!
