[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:298:19
-     const signals = [...signalSet];
+     const signals = [];
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ArrowFunction
src/engine/autoAggressionDetection.js:302:36
-     const amplifiedEntry = real.find(e => e.outcome?.autoAggression?.amplified === true);
+     const amplifiedEntry = real.find(() => undefined);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:302:41
-     const amplifiedEntry = real.find(e => e.outcome?.autoAggression?.amplified === true);
+     const amplifiedEntry = real.find(e => false);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] OptionalChaining
src/engine/autoAggressionDetection.js:302:41
-     const amplifiedEntry = real.find(e => e.outcome?.autoAggression?.amplified === true);
+     const amplifiedEntry = real.find(e => e.outcome.autoAggression?.amplified === true);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] BooleanLiteral
src/engine/autoAggressionDetection.js:302:82
-     const amplifiedEntry = real.find(e => e.outcome?.autoAggression?.amplified === true);
+     const amplifiedEntry = real.find(e => e.outcome?.autoAggression?.amplified === false);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] BlockStatement
src/engine/autoAggressionDetection.js:322:99
-   export function detectAutoAggression({ currentEntry, recentEntries = [], hyperfocusData = null }) {
-     const allEntries = [...(recentEntries ?? []), currentEntry].filter(Boolean);
-     const volumeCreep       = _detectVolumeCreep(allEntries);
-     const calorieAccel      = _detectCalorieAcceleration(allEntries);
-     const frustration       = _detectFrustrationMarkers(allEntries);
-     const ignoreRecovery    = _detectIgnoreRecovery(allEntries);
-     const rawRecoveryDebt   = _detectRecoveryDebt(allEntries);
-     // Recovery debt only when combined with ≥1 other active signal (ADR 013 §1)
-     const otherCount = [volumeCreep, calorieAccel, frustration, ignoreRecovery].filter(Boolean).length;
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
-     const signals = [
-       volumeCreep     && 'volume_creep',
-       calorieAccel    && 'calorie_acceleration',
-       frustration     && 'frustration',
-       ignoreRecovery  && 'ignore_recovery',
-       recoveryDebt    && 'recovery_debt',
-     ].filter(Boolean);
-     const tier = _computeTier(signals.length);
-     const escalating = computeEscalation(recentEntries ?? []);
-     const { amplified, reason: amplifierReason } = _detectHyperfocusAmplifier(hyperfocusData);
-     return { tier, signals, escalating, amplified, amplifierReason, riskFlags: [] };
-   }
+   export function detectAutoAggression({ currentEntry, recentEntries =

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:303:21
-     const amplified = amplifiedEntry != null;
+     const amplified = false;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:323:22
-     const allEntries = [...(recentEntries ?? []), currentEntry].filter(Boolean);
+     const allEntries = [...(recentEntries ?? []), currentEntry];
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/engine/autoAggressionDetection.js:306:10
-     return { signals, tier, escalating, amplified, amplifierReason, riskFlags: [] };
+     return {};
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:323:22
-     const allEntries = [...(recentEntries ?? []), currentEntry].filter(Boolean);
+     const allEntries = [].filter(Boolean);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:323:27
-     const allEntries = [...(recentEntries ?? []), currentEntry].filter(Boolean);
+     const allEntries = [...(recentEntries && []), currentEntry].filter(Boolean);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:332:22
-     const otherCount = [volumeCreep, calorieAccel, frustration, ignoreRecovery].filter(Boolean).length;
+     const otherCount = [volumeCreep, calorieAccel, frustration, ignoreRecovery].length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:306:78
-     return { signals, tier, escalating, amplified, amplifierReason, riskFlags: [] };
+     return { signals, tier, escalating, amplified, amplifierReason, riskFlags: ["Stryker was here"] };
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:332:22
-     const otherCount = [volumeCreep, calorieAccel, frustration, ignoreRecovery].filter(Boolean).length;
+     const otherCount = [].filter(Boolean).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:333:24
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
+     const recoveryDebt = true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:333:24
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
+     const recoveryDebt = false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:333:24
-     const recoveryDebt = rawRecoveryDebt && otherCount >= 1;
+     const recoveryDebt = rawRecoveryDebt || otherCount >= 1;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/engine/autoAggressionDetection.js:335:19
-     const signals = [
-       volumeCreep     && 'volume_creep',
-       calorieAccel    && 'calorie_acceleration',
-       frustration     && 'frustration',
-       ignoreRecovery  && 'ignore_recovery',
-       recoveryDebt    && 'recovery_debt',
-     ].filter(Boolean);
+     const signals = [volumeCreep && 'volume_creep', calorieAccel && 'calorie_acceleration', frustration && 'frustration', ignoreRecovery && 'ignore_recovery', recoveryDebt && 'recovery_debt'];
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:335:19
-     const signals = [
-       volumeCreep     && 'volume_creep',
-       calorieAccel    && 'calorie_acceleration',
-       frustration     && 'frustration',
-       ignoreRecovery  && 'ignore_recovery',
-       recoveryDebt    && 'recovery_debt',
-     ].filter(Boolean);
+     const signals = [].filter(Boolean);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:336:5
-       volumeCreep     && 'volume_creep',
+       true,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:336:5
-       volumeCreep     && 'volume_creep',
+       false,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:336:5
-       volumeCreep     && 'volume_creep',
+       volumeCreep || 'volume_creep',
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:337:5
-       calorieAccel    && 'calorie_acceleration',
+       true,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:337:5
-       calorieAccel    && 'calorie_acceleration',
+       false,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:337:5
-       calorieAccel    && 'calorie_acceleration',
+       calorieAccel || 'calorie_acceleration',
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:338:5
-       frustration     && 'frustration',
+       true,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:338:5
-       frustration     && 'frustration',
+       false,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:338:5
-       frustration     && 'frustration',
+       frustration || 'frustration',
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:339:5
-       ignoreRecovery  && 'ignore_recovery',
+       true,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:339:5
-       ignoreRecovery  && 'ignore_recovery',
+       false,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:340:5
-       recoveryDebt    && 'recovery_debt',
+       true,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:339:5
-       ignoreRecovery  && 'ignore_recovery',
+       ignoreRecovery || 'ignore_recovery',
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/autoAggressionDetection.js:340:5
-       recoveryDebt    && 'recovery_debt',
+       false,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:340:5
-       recoveryDebt    && 'recovery_debt',
+       recoveryDebt || 'recovery_debt',
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/engine/autoAggressionDetection.js:344:40
-     const escalating = computeEscalation(recentEntries ?? []);
+     const escalating = computeEscalation(recentEntries && []);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/engine/autoAggressionDetection.js:347:10
-     return { tier, signals, escalating, amplified, amplifierReason, riskFlags: [] };
+     return {};
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrayDeclaration
src/engine/autoAggressionDetection.js:347:78
-     return { tier, signals, escalating, amplified, amplifierReason, riskFlags: [] };
+     return { tier, signals, escalating, amplified, amplifierReason, riskFlags: ["Stryker was here"] };
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[NoCoverage] ArrayDeclaration
src/engine/calibration.js:154:34
-     const allLogs = ctx.allLogs ?? [];
+     const allLogs = ctx.allLogs ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/calibration.js:163:52
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s : s);

[NoCoverage] ConditionalExpression
src/engine/calibration.js:222:5
-       case 'monthly_or_trigger': return hoursSince >= 24 * 30;
+       case 'monthly_or_trigger':

[NoCoverage] ConditionalExpression
src/engine/calibration.js:222:39
-       case 'monthly_or_trigger': return hoursSince >= 24 * 30;
+       case 'monthly_or_trigger': return true;

[NoCoverage] ConditionalExpression
src/engine/calibration.js:222:39
-       case 'monthly_or_trigger': return hoursSince >= 24 * 30;
+       case 'monthly_or_trigger': return false;

[NoCoverage] EqualityOperator
src/engine/calibration.js:222:39
-       case 'monthly_or_trigger': return hoursSince >= 24 * 30;
+       case 'monthly_or_trigger': return hoursSince > 24 * 30;

[NoCoverage] EqualityOperator
src/engine/calibration.js:222:39
-       case 'monthly_or_trigger': return hoursSince >= 24 * 30;
+       case 'monthly_or_trigger': return hoursSince < 24 * 30;

[NoCoverage] ArithmeticOperator
src/engine/calibration.js:222:53
-       case 'monthly_or_trigger': return hoursSince >= 24 * 30;
+       case 'monthly_or_trigger': return hoursSince >= 24 / 30;

[NoCoverage] ConditionalExpression
src/engine/calibration.js:223:5
-       default:                   return false;
+       default:

[NoCoverage] BooleanLiteral
src/engine/calibration.js:223:39
-       default:                   return false;
+       default:                   return true;

[Survived] ConditionalExpression
src/engine/calibration.js:143:7
-     if (currentIdx === -1) return currentLevel;
+     if (false) return currentLevel;
Tests ran:
    _applyInactivityDecay 60 inactive days → -1 tier (OPTIMIZED → PERSONALIZED)
    _applyInactivityDecay 119 inactive days → -1 tier (not yet 120)
    _applyInactivityDecay 120 inactive days → -2 tiers (OPTIMIZED → PERSONALIZING)
  and 2 more tests!

[Survived] UnaryOperator
src/engine/calibration.js:143:22
-     if (currentIdx === -1) return currentLevel;
+     if (currentIdx === +1) return currentLevel;
Tests ran:
    _applyInactivityDecay 60 inactive days → -1 tier (OPTIMIZED → PERSONALIZED)
    _applyInactivityDecay 119 inactive days → -1 tier (not yet 120)
    _applyInactivityDecay 120 inactive days → -2 tiers (OPTIMIZED → PERSONALIZING)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/calibration.js:141:7
-     if (decayLevels === 0) return currentLevel;
+     if (false) return currentLevel;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    detectCalibrationLevel — correct tier with full history returns PERSONALIZING (not COLD_START) with 15 sessions over 35 days
  and 14 more tests!

[Survived] LogicalOperator
src/engine/calibration.js:159:17
-       const key = log.session ?? log.date;
+       const key = log.session && log.date;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] ConditionalExpression
src/engine/calibration.js:160:9
-       if (!key) continue;
+       if (false) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\D{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\d-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\d{4}-\d-\d{2}/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\d{4}-\D{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\d{4}-\d{2}-\d/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] Regex
src/engine/calibration.js:163:21
-       sessionKeys.add(/^\d{4}-\d{2}-\d{2}/.test(s) ? s.slice(0, 10) : s);
+       sessionKeys.add(/^\d{4}-\d{2}-\D{2}/.test(s) ? s.slice(0, 10) : s);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 13 more tests!

[Survived] LogicalOperator
src/engine/calibration.js:165:25
-     const sessionsCount = ctx.allSessions?.length ?? sessionKeys.size;
+     const sessionsCount = ctx.allSessions?.length && sessionKeys.size;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 38 more tests!

[Survived] MethodExpression
src/engine/calibration.js:168:17
-     const dates = allLogs
-       .map(l => {
-         const raw = l.date || l.ts;
-         const d = raw ? new Date(raw) : null;
-         return d && !isNaN(d.getTime()) ? d : null;
-       })
-       .filter(Boolean);
+     const dates = allLogs.map(l => {
+     const raw = l.date || l.ts;
+     const d = raw ? new Date(raw) : null;
+     return d && !isNaN(d.getTime()) ? d : null;
+   });
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 38 more tests!
