[Survived] ConditionalExpression
src/engine/calibrationReconciliation.js:267:9
-       if (e == null) continue;
+       if (false) continue;
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] ConditionalExpression
src/engine/calibrationReconciliation.js:268:16
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = true ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] ConditionalExpression
src/engine/calibrationReconciliation.js:268:16
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = false ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] LogicalOperator
src/engine/calibrationReconciliation.js:268:16
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = typeof e === 'object' || e.event_id != null ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] ConditionalExpression
src/engine/calibrationReconciliation.js:268:16
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = true && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] EqualityOperator
src/engine/calibrationReconciliation.js:268:16
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = typeof e !== 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] ConditionalExpression
src/engine/calibrationReconciliation.js:268:41
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = typeof e === 'object' && true ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] EqualityOperator
src/engine/calibrationReconciliation.js:268:41
-       const id = typeof e === 'object' && e.event_id != null ? String(e.event_id) : JSON.stringify(e);
+       const id = typeof e === 'object' && e.event_id == null ? String(e.event_id) : JSON.stringify(e);
Tests ran:
    mergeObservations dedupes AA HIGH events by event_id
    reconcile — EC-4: defensive against missing/empty branch (Tier 2 restore) reconcile with empty initial state gracefully restores from non-empty branch

[Survived] LogicalOperator
src/engine/calibrationReconciliation.js:282:10
-     return Number.isFinite(n) && n >= 0 ? n : 0;
+     return Number.isFinite(n) || n >= 0 ? n : 0;
Tests ran:
    mergeVersionVector takes element-wise MAX of overlapping keys
    mergeVersionVector unions disjoint device keys
    mergeVersionVector handles undefined inputs gracefully
  and 17 more tests!

[Survived] ConditionalExpression
src/engine/calibrationReconciliation.js:282:32
-     return Number.isFinite(n) && n >= 0 ? n : 0;
+     return Number.isFinite(n) && true ? n : 0;
Tests ran:
    mergeVersionVector takes element-wise MAX of overlapping keys
    mergeVersionVector unions disjoint device keys
    mergeVersionVector handles undefined inputs gracefully
  and 13 more tests!

[Survived] EqualityOperator
src/engine/calibrationReconciliation.js:282:32
-     return Number.isFinite(n) && n >= 0 ? n : 0;
+     return Number.isFinite(n) && n > 0 ? n : 0;
Tests ran:
    mergeVersionVector takes element-wise MAX of overlapping keys
    mergeVersionVector unions disjoint device keys
    mergeVersionVector handles undefined inputs gracefully
  and 13 more tests!

[NoCoverage] ObjectLiteral
src/engine/coachContext.js:84:29
-       const readinessPoints = { 5: 40, 4: 35, 3: 25, 2: 15, 1: 0 };
+       const readinessPoints = {};

[NoCoverage] MethodExpression
src/engine/coachContext.js:85:12
-       return Math.max(10, Math.min(100, 60 + (readinessPoints[val] ?? 0)));
+       return Math.min(10, Math.min(100, 60 + (readinessPoints[val] ?? 0)));

[NoCoverage] MethodExpression
src/engine/coachContext.js:85:25
-       return Math.max(10, Math.min(100, 60 + (readinessPoints[val] ?? 0)));
+       return Math.max(10, Math.max(100, 60 + (readinessPoints[val] ?? 0)));

[NoCoverage] ArithmeticOperator
src/engine/coachContext.js:85:39
-       return Math.max(10, Math.min(100, 60 + (readinessPoints[val] ?? 0)));
+       return Math.max(10, Math.min(100, 60 - (readinessPoints[val] ?? 0)));

[NoCoverage] LogicalOperator
src/engine/coachContext.js:85:45
-       return Math.max(10, Math.min(100, 60 + (readinessPoints[val] ?? 0)));
+       return Math.max(10, Math.min(100, 60 + (readinessPoints[val] && 0)));

[NoCoverage] BlockStatement
src/engine/coachContext.js:86:11
-     } catch { return null; }
+     } catch {}

[NoCoverage] ObjectLiteral
src/engine/coachContext.js:96:22
-       const emojiMap = { 5: '🔥', 4: '😊', 3: '😐', 2: '😕', 1: '😴' };
+       const emojiMap = {};

[NoCoverage] ConditionalExpression
src/engine/coachContext.js:97:12
-       return emojiMap[val] || '😐';
+       return true;

[NoCoverage] ConditionalExpression
src/engine/coachContext.js:97:12
-       return emojiMap[val] || '😐';
+       return false;

[NoCoverage] LogicalOperator
src/engine/coachContext.js:97:12
-       return emojiMap[val] || '😐';
+       return emojiMap[val] && '😐';

[NoCoverage] BlockStatement
src/engine/coachContext.js:98:11
-     } catch { return '😐'; }
+     } catch {}

[NoCoverage] BlockStatement
src/engine/coachContext.js:107:11
-     } catch { return false; }
+     } catch {}

[NoCoverage] BooleanLiteral
src/engine/coachContext.js:107:20
-     } catch { return false; }
+     } catch { return true; }

[NoCoverage] BlockStatement
src/engine/coachContext.js:119:11
-     } catch { return 'AUTO'; }
+     } catch {}

[NoCoverage] BlockStatement
src/engine/coachContext.js:128:11
-     } catch { return KCAL_TARGET; }
+     } catch {}

[NoCoverage] BlockStatement
src/engine/coachContext.js:133:9
-     catch { return null; }
+     catch {}

[NoCoverage] BlockStatement
src/engine/coachContext.js:163:11
-     } catch { return getUserConfig().bio.currentKgFallback; }
+     } catch {}

[NoCoverage] ArithmeticOperator
src/engine/coachContext.js:171:34
-       const oldest = weights[dates[dates.length - 1]];
+       const oldest = weights[dates[dates.length + 1]];

[NoCoverage] ArithmeticOperator
src/engine/coachContext.js:173:12
-       return newest - oldest;
+       return newest + oldest;

[NoCoverage] BlockStatement
src/engine/coachContext.js:174:11
-     } catch { return 0; }
+     } catch {}

[NoCoverage] BlockStatement
src/engine/coachContext.js:184:11
-     } catch {
-       return ['matrix_cable', 'bailib_stack', 'pec_deck', 'leg_machine', 'leg_press_plates', 'dumbbell'];
-     }
+     } catch {}

[NoCoverage] ArrayDeclaration
src/engine/coachContext.js:185:12
-       return ['matrix_cable', 'bailib_stack', 'pec_deck', 'leg_machine', 'leg_press_plates', 'dumbbell'];
+       return [];

[NoCoverage] BlockStatement
src/engine/coachContext.js:191:9
-     catch { return []; }
+     catch {}

[NoCoverage] ArrayDeclaration
src/engine/coachContext.js:191:18
-     catch { return []; }
+     catch { return ["Stryker was here"]; }

[NoCoverage] BlockStatement
src/engine/coachContext.js:204:11
-     } catch { return 0; }
+     } catch {}

[NoCoverage] ConditionalExpression
src/engine/coachContext.js:211:5
-       case 'HIGH_DEVIATION': return (pattern.deviationRate ?? 0) / 100;
+       case 'HIGH_DEVIATION':

[NoCoverage] ArithmeticOperator
src/engine/coachContext.js:211:35
-       case 'HIGH_DEVIATION': return (pattern.deviationRate ?? 0) / 100;
+       case 'HIGH_DEVIATION': return (pattern.deviationRate ?? 0) * 100;

[NoCoverage] LogicalOperator
src/engine/coachContext.js:211:36
-       case 'HIGH_DEVIATION': return (pattern.deviationRate ?? 0) / 100;
+       case 'HIGH_DEVIATION': return (pattern.deviationRate && 0) / 100;

[NoCoverage] ConditionalExpression
src/engine/coachContext.js:212:5
-       case 'STAGNATION':   return 0.85;
+       case 'STAGNATION':

[NoCoverage] ConditionalExpression
src/engine/coachContext.js:213:5
-       default:             return 0.5;
+       default:

[NoCoverage] BlockStatement
src/engine/coachContext.js:227:17
-       } catch (e) {
-         console.warn('[coachContext] analyzeFromCDL failed:', e);
-       }
+       } catch (e) {}

[Survived] BlockStatement
src/engine/coachContext.js:26:63
-     const _recentCDLForAA = coachDecisionLog.readAllActive(e => {
-       const d = new Date(e.date);
-       return d >= _aaCutoff;
-     });
+     const _recentCDLForAA = coachDecisionLog.readAllActive(e => {});
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:28:12
-       return d >= _aaCutoff;
+       return true;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:28:12
-       return d >= _aaCutoff;
+       return false;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 2 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:28:12
-       return d >= _aaCutoff;
+       return d > _aaCutoff;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 2 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:25:3
-     _aaCutoff.setDate(_aaCutoff.getDate() - 30);
+     _aaCutoff.setTime(_aaCutoff.getDate() - 30);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ArithmeticOperator
src/engine/coachContext.js:25:21
-     _aaCutoff.setDate(_aaCutoff.getDate() - 30);
+     _aaCutoff.setDate(_aaCutoff.getDate() + 30);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:28:12
-       return d >= _aaCutoff;
+       return d < _aaCutoff;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:58:26
-       isBeforeJuly20_2026: now < july20_2026,
+       isBeforeJuly20_2026: true,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:58:26
-       isBeforeJuly20_2026: now < july20_2026,
+       isBeforeJuly20_2026: now <= july20_2026,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:59:16
-       isDeficit: kcalTarget < 2200,
+       isDeficit: true,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:59:16
-       isDeficit: kcalTarget < 2200,
+       isDeficit: kcalTarget <= 2200,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:60:14
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: true
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:60:34
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (false)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:60:34
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (phase === 'AUTO' || now < july20_2026)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:60:34
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (true && now < july20_2026)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:60:34
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (phase !== 'AUTO' && now < july20_2026)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:60:54
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (phase === 'AUTO' && true)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:60:54
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (phase === 'AUTO' && now <= july20_2026)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:66:7
-     if (readinessScore >= READINESS_PR)   return 1.1;
+     if (true)   return 1.1;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:66:7
-     if (readinessScore >= READINESS_PR)   return 1.1;
+     if (false)   return 1.1;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:66:7
-     if (readinessScore >= READINESS_PR)   return 1.1;
+     if (readinessScore > READINESS_PR)   return 1.1;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:60:54
-       isInCut: phase === 'CUT' || (phase === 'AUTO' && now < july20_2026)
+       isInCut: phase === 'CUT' || (phase === 'AUTO' && now >= july20_2026)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:67:7
-     if (readinessScore >= READINESS_HIGH) return 1.0;
+     if (true) return 1.0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:66:7
-     if (readinessScore >= READINESS_PR)   return 1.1;
+     if (readinessScore < READINESS_PR)   return 1.1;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:65:7
-     if (readinessScore === null) return 1.0;
+     if (true) return 1.0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:67:7
-     if (readinessScore >= READINESS_HIGH) return 1.0;
+     if (false) return 1.0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:67:7
-     if (readinessScore >= READINESS_HIGH) return 1.0;
+     if (readinessScore > READINESS_HIGH) return 1.0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:67:7
-     if (readinessScore >= READINESS_HIGH) return 1.0;
+     if (readinessScore < READINESS_HIGH) return 1.0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:68:7
-     if (readinessScore >= READINESS_MED)  return 0.85;
+     if (true)  return 0.85;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/coachContext.js:68:7
-     if (readinessScore >= READINESS_MED)  return 0.85;
+     if (false)  return 0.85;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/coachContext.js:68:7
-     if (readinessScore >= READINESS_MED)  return 0.85;
+     if (readinessScore > READINESS_MED)  return 0.85;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/coachContext.js:68:7
-     if (readinessScore >= READINESS_MED)  return 0.85;
+     if (readinessScore < READINESS_MED)  return 0.85;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/coachContext.js:69:7
-     if (readinessScore >= READINESS_LOW)  return 0.7;
+     if (true)  return 0.7;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40

[Survived] ConditionalExpression
src/engine/coachContext.js:69:7
-     if (readinessScore >= READINESS_LOW)  return 0.7;
+     if (false)  return 0.7;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40

[Survived] EqualityOperator
src/engine/coachContext.js:69:7
-     if (readinessScore >= READINESS_LOW)  return 0.7;
+     if (readinessScore > READINESS_LOW)  return 0.7;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40

[Survived] EqualityOperator
src/engine/coachContext.js:69:7
-     if (readinessScore >= READINESS_LOW)  return 0.7;
+     if (readinessScore < READINESS_LOW)  return 0.7;
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40

[Survived] ConditionalExpression
src/engine/coachContext.js:82:9
-       if (typeof val === 'object' && val.score !== undefined) return val.score;
+       if (true) return val.score;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:82:9
-       if (typeof val === 'object' && val.score !== undefined) return val.score;
+       if (typeof val === 'object' || val.score !== undefined) return val.score;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:82:9
-       if (typeof val === 'object' && val.score !== undefined) return val.score;
+       if (true && val.score !== undefined) return val.score;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:81:9
-       if (val === null || val === undefined) return null;
+       if (false || val === undefined) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:82:36
-       if (typeof val === 'object' && val.score !== undefined) return val.score;
+       if (typeof val === 'object' && true) return val.score;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:89:35
-   function getTodayReadinessEmoji() {
-     try {
-       const todayDate = tod();
-       const all = JSON.parse(localStorage.getItem('readiness') || '{}');
-       const val = all[todayDate];
-       if (!val) return '😐';
-       if (typeof val === 'object' && val.emoji) return val.emoji;
-       const emojiMap = { 5: '🔥', 4: '😊', 3: '😐', 2: '😕', 1: '😴' };
-       return emojiMap[val] || '😐';
-     } catch { return '😐'; }
-   }
+   function getTodayReadinessEmoji() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:90:7
-     try {
-       const todayDate = tod();
-       const all = JSON.parse(localStorage.getItem('readiness') || '{}');
-       const val = all[todayDate];
-       if (!val) return '😐';
-       if (typeof val === 'object' && val.emoji) return val.emoji;
-       const emojiMap = { 5: '🔥', 4: '😊', 3: '😐', 2: '😕', 1: '😴' };
-       return emojiMap[val] || '😐';
-     } catch { return '😐'; }
+     try {} catch { return '😐'; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!
