[Survived] ConditionalExpression
src/engine/coachContext.js:92:28
-       const all = JSON.parse(localStorage.getItem('readiness') || '{}');
+       const all = JSON.parse(true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:92:28
-       const all = JSON.parse(localStorage.getItem('readiness') || '{}');
+       const all = JSON.parse(false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:92:28
-       const all = JSON.parse(localStorage.getItem('readiness') || '{}');
+       const all = JSON.parse(localStorage.getItem('readiness') && '{}');
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BooleanLiteral
src/engine/coachContext.js:94:9
-       if (!val) return '😐';
+       if (val) return '😐';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:95:9
-       if (typeof val === 'object' && val.emoji) return val.emoji;
+       if (true) return val.emoji;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:95:9
-       if (typeof val === 'object' && val.emoji) return val.emoji;
+       if (false) return val.emoji;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:95:9
-       if (typeof val === 'object' && val.emoji) return val.emoji;
+       if (typeof val === 'object' || val.emoji) return val.emoji;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:95:9
-       if (typeof val === 'object' && val.emoji) return val.emoji;
+       if (true && val.emoji) return val.emoji;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:95:9
-       if (typeof val === 'object' && val.emoji) return val.emoji;
+       if (typeof val !== 'object' && val.emoji) return val.emoji;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:94:9
-       if (!val) return '😐';
+       if (true) return '😐';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:94:9
-       if (!val) return '😐';
+       if (false) return '😐';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:106:33
-       return val !== undefined && val !== null;
+       return val !== undefined && true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] BooleanLiteral
src/engine/coachContext.js:115:9
-       if (!raw) return 'AUTO';
+       if (raw) return 'AUTO';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:115:9
-       if (!raw) return 'AUTO';
+       if (true) return 'AUTO';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:115:9
-       if (!raw) return 'AUTO';
+       if (false) return 'AUTO';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:125:9
-       if (raw === null) return KCAL_TARGET;
+       if (true) return KCAL_TARGET;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:125:9
-       if (raw === null) return KCAL_TARGET;
+       if (false) return KCAL_TARGET;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:125:9
-       if (raw === null) return KCAL_TARGET;
+       if (raw !== null) return KCAL_TARGET;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:131:31
-   function getPhaseChangeDate() {
-     try { return DB.get('phase-change-date') || null; }
-     catch { return null; }
-   }
+   function getPhaseChangeDate() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:132:7
-     try { return DB.get('phase-change-date') || null; }
+     try {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:132:16
-     try { return DB.get('phase-change-date') || null; }
+     try { return true; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:132:16
-     try { return DB.get('phase-change-date') || null; }
+     try { return false; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:132:16
-     try { return DB.get('phase-change-date') || null; }
+     try { return DB.get('phase-change-date') && null; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ArrayDeclaration
src/engine/coachContext.js:140:18
-     catch { return []; }
+     catch { return ["Stryker was here"]; }
Tests ran:
    CoachDirector — Defensive programming should handle corrupted localStorage gracefully

[Survived] BlockStatement
src/engine/coachContext.js:146:27
-     for (const log of logs) {
-       const date = log.date;
-       if (!date) continue;
-       if (!byDate[date]) byDate[date] = [];
-       byDate[date].push(log);
-     }
+     for (const log of logs) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] BooleanLiteral
src/engine/coachContext.js:148:9
-       if (!date) continue;
+       if (date) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:148:9
-       if (!date) continue;
+       if (true) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:148:9
-       if (!date) continue;
+       if (false) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:149:9
-       if (!byDate[date]) byDate[date] = [];
+       if (true) byDate[date] = [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ArrayDeclaration
src/engine/coachContext.js:149:39
-       if (!byDate[date]) byDate[date] = [];
+       if (!byDate[date]) byDate[date] = ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:152:17
-     const dates = Object.keys(byDate).sort().reverse().slice(0, n);
+     const dates = Object.keys(byDate).sort().slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:152:17
-     const dates = Object.keys(byDate).sort().reverse().slice(0, n);
+     const dates = Object.keys(byDate).reverse().slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:158:29
-   function getCurrentWeight() {
-     try {
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
-       const dates = Object.keys(weights).sort().reverse();
-       return dates.length > 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
-     } catch { return getUserConfig().bio.currentKgFallback; }
-   }
+   function getCurrentWeight() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:159:7
-     try {
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
-       const dates = Object.keys(weights).sort().reverse();
-       return dates.length > 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
-     } catch { return getUserConfig().bio.currentKgFallback; }
+     try {} catch { return getUserConfig().bio.currentKgFallback; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:160:32
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
+       const weights = JSON.parse(true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:160:32
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
+       const weights = JSON.parse(false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:160:32
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
+       const weights = JSON.parse(localStorage.getItem('weights') && '{}');
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:161:19
-       const dates = Object.keys(weights).sort().reverse();
+       const dates = Object.keys(weights).sort();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:161:19
-       const dates = Object.keys(weights).sort().reverse();
+       const dates = Object.keys(weights).reverse();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:162:12
-       return dates.length > 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
+       return true ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:162:12
-       return dates.length > 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
+       return false ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:162:12
-       return dates.length > 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
+       return dates.length >= 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:162:12
-       return dates.length > 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
+       return dates.length <= 0 ? weights[dates[0]] : getUserConfig().bio.currentKgFallback;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:166:33
-   function getBodyweightTrend7d() {
-     try {
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
-       const dates = Object.keys(weights).sort().reverse().slice(0, 7);
-       if (dates.length < 2) return 0;
-       const oldest = weights[dates[dates.length - 1]];
-       const newest = weights[dates[0]];
-       return newest - oldest;
-     } catch { return 0; }
-   }
+   function getBodyweightTrend7d() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:167:7
-     try {
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
-       const dates = Object.keys(weights).sort().reverse().slice(0, 7);
-       if (dates.length < 2) return 0;
-       const oldest = weights[dates[dates.length - 1]];
-       const newest = weights[dates[0]];
-       return newest - oldest;
-     } catch { return 0; }
+     try {} catch { return 0; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:168:32
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
+       const weights = JSON.parse(true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:168:32
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
+       const weights = JSON.parse(false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:168:32
-       const weights = JSON.parse(localStorage.getItem('weights') || '{}');
+       const weights = JSON.parse(localStorage.getItem('weights') && '{}');
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:169:19
-       const dates = Object.keys(weights).sort().reverse().slice(0, 7);
+       const dates = Object.keys(weights).sort().reverse();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:169:19
-       const dates = Object.keys(weights).sort().reverse().slice(0, 7);
+       const dates = Object.keys(weights).sort().slice(0, 7);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/coachContext.js:169:19
-       const dates = Object.keys(weights).sort().reverse().slice(0, 7);
+       const dates = Object.keys(weights).reverse().slice(0, 7);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:170:9
-       if (dates.length < 2) return 0;
+       if (true) return 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:170:9
-       if (dates.length < 2) return 0;
+       if (false) return 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:170:9
-       if (dates.length < 2) return 0;
+       if (dates.length <= 2) return 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] EqualityOperator
src/engine/coachContext.js:170:9
-       if (dates.length < 2) return 0;
+       if (dates.length >= 2) return 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:189:36
-   function getUnavailableEquipment() {
-     try { return JSON.parse(localStorage.getItem('unavailable-equipment') || '[]'); }
-     catch { return []; }
-   }
+   function getUnavailableEquipment() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] BlockStatement
src/engine/coachContext.js:190:7
-     try { return JSON.parse(localStorage.getItem('unavailable-equipment') || '[]'); }
+     try {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:190:27
-     try { return JSON.parse(localStorage.getItem('unavailable-equipment') || '[]'); }
+     try { return JSON.parse(true); }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:190:27
-     try { return JSON.parse(localStorage.getItem('unavailable-equipment') || '[]'); }
+     try { return JSON.parse(false); }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] LogicalOperator
src/engine/coachContext.js:190:27
-     try { return JSON.parse(localStorage.getItem('unavailable-equipment') || '[]'); }
+     try { return JSON.parse(localStorage.getItem('unavailable-equipment') && '[]'); }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!
