[Survived] ConditionalExpression
src/engine/coachContext.js:201:7
-         e.outcome != null &&
+         true &&
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/coachContext.js:209:33
-       case 'EARLY_END':    return (pattern.earlyEndRate ?? 0) / 100;
+       case 'EARLY_END':    return (pattern.earlyEndRate ?? 0) * 100;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachContext.js:202:7
-         e.outcome.executed != null
+         true
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 14. realCDLCount === 2 (below 3) → patternsSuppressed === true, patterns === []
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachContext.js:210:5
-       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate ?? 100)) / 100);
+       case 'LOW_ADHERENCE':
Tests ran:
    ctx.patterns suppression flow 15. realCDLCount === 5 → patternsSuppressed === false, patterns from analyzeFromCDL

[Survived] MethodExpression
src/engine/coachContext.js:210:34
-       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate ?? 100)) / 100);
+       case 'LOW_ADHERENCE': return Math.min(0, (100 - (pattern.adherenceRate ?? 100)) / 100);
Tests ran:
    ctx.patterns suppression flow 15. realCDLCount === 5 → patternsSuppressed === false, patterns from analyzeFromCDL

[Survived] ArithmeticOperator
src/engine/coachContext.js:210:46
-       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate ?? 100)) / 100);
+       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate ?? 100)) * 100);
Tests ran:
    ctx.patterns suppression flow 15. realCDLCount === 5 → patternsSuppressed === false, patterns from analyzeFromCDL

[Survived] ArithmeticOperator
src/engine/coachContext.js:210:47
-       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate ?? 100)) / 100);
+       case 'LOW_ADHERENCE': return Math.max(0, (100 + (pattern.adherenceRate ?? 100)) / 100);
Tests ran:
    ctx.patterns suppression flow 15. realCDLCount === 5 → patternsSuppressed === false, patterns from analyzeFromCDL

[Survived] LogicalOperator
src/engine/coachContext.js:210:54
-       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate ?? 100)) / 100);
+       case 'LOW_ADHERENCE': return Math.max(0, (100 - (pattern.adherenceRate && 100)) / 100);
Tests ran:
    ctx.patterns suppression flow 15. realCDLCount === 5 → patternsSuppressed === false, patterns from analyzeFromCDL

[Survived] EqualityOperator
src/engine/coachContext.js:219:30
-     const patternsSuppressed = realCDLCount < CALIBRATION_LEVELS.INITIAL.minSessions;
+     const patternsSuppressed = realCDLCount <= CALIBRATION_LEVELS.INITIAL.minSessions;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/coachContext.js:221:7
-     if (!patternsSuppressed) {
+     if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ObjectLiteral
src/engine/coachContext.js:223:33
-         patterns = analyzeFromCDL({ windowDays: 30 }).map(p => ({
+         patterns = analyzeFromCDL({}).map(p => ({
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ctx.patterns suppression flow 15. realCDLCount === 5 → patternsSuppressed === false, patterns from analyzeFromCDL

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:36:46
-           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed ?? true },
+           context: { patterns: ctx.patterns ?? ["Stryker was here"], patternsSuppressed: ctx.patternsSuppressed ?? true },

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:36:96
-           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed ?? true },
+           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed ?? false },

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:41:36
-       const allLogs = ctx.allLogs ?? [];
+       const allLogs = ctx.allLogs ?? ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:52:39
-         ctx.patterns = (ctx.patterns || []).filter(
+         ctx.patterns = (ctx.patterns || ["Stryker was here"]).filter(

[NoCoverage] BlockStatement
src/engine/coachDirector.js:58:42
-       if (calibration.rollingWindowMonths) {
-         ctx.allLogs = applyRollingWindow(allLogs, calibration);
-       }
+       if (calibration.rollingWindowMonths) {}

[NoCoverage] BlockStatement
src/engine/coachDirector.js:66:95
-           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') ?? {}; } catch { return {}; }
+           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') ?? {}; } catch {}

[NoCoverage] BlockStatement
src/engine/coachDirector.js:98:41
-       if (ruleResult.action === 'deload') {
-         ctx._deload = true;
-       }
+       if (ruleResult.action === 'deload') {}

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:99:21
-         ctx._deload = true;
+         ctx._deload = false;

[NoCoverage] BlockStatement
src/engine/coachDirector.js:107:97
-           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch { return {}; } })(),
+           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch {} })(),

[NoCoverage] BlockStatement
src/engine/coachDirector.js:108:101
-           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch { return {}; } })(),
+           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch {} })(),

[NoCoverage] BlockStatement
src/engine/coachDirector.js:109:97
-           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch { return {}; } })(),
+           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch {} })(),

[NoCoverage] BlockStatement
src/engine/coachDirector.js:110:99
-           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch { return {}; } })(),
+           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch {} })(),

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:111:54
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
+           logs: ctx.recentLogs?.flatMap(s => s.logs ?? ["Stryker was here"]) ?? [],

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:111:61
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
+           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? ["Stryker was here"],

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:118:64
-       const unavailableEquipment = ctx.equipment?.unavailable ?? [];
+       const unavailableEquipment = ctx.equipment?.unavailable ?? ["Stryker was here"];

[NoCoverage] BlockStatement
src/engine/coachDirector.js:122:37
-           if (resolved.isAlternative) {
-             return { ...ex, name: resolved.exercise, isAlternative: true, original: resolved.original };
-           }
+           if (resolved.isAlternative) {}

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:123:18
-             return { ...ex, name: resolved.exercise, isAlternative: true, original: resolved.original };
+             return {};

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:123:67
-             return { ...ex, name: resolved.exercise, isAlternative: true, original: resolved.original };
+             return { ...ex, name: resolved.exercise, isAlternative: false, original: resolved.original };

[NoCoverage] BlockStatement
src/engine/coachDirector.js:138:16
-           } else {
-             const lastLog = getLastLogFromContext(exercise.name, ctx.recentLogs);
-             const baseWeight = lastLog ? (lastLog.w ?? 20) : 20;
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
-           }
+           } else {}

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:140:41
-             const baseWeight = lastLog ? (lastLog.w ?? 20) : 20;
+             const baseWeight = lastLog ? (lastLog.w && 20) : 20;

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:141:37
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = {};

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:141:90
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: true };

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:141:90
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: false };

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:141:90
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets && 3 };

[NoCoverage] OptionalChaining
src/engine/coachDirector.js:145:28
-           if (ctx._deload && exercise.recommendation?.kg) {
+           if (ctx._deload && exercise.recommendation.kg) {

[NoCoverage] BlockStatement
src/engine/coachDirector.js:145:57
-           if (ctx._deload && exercise.recommendation?.kg) {
-             const deloadKg = Math.round(exercise.recommendation.kg * 0.7 * 2) / 2;
-             exercise.recommendation = { ...exercise.recommendation, kg: deloadKg, weight: deloadKg };
-           }
+           if (ctx._deload && exercise.recommendation?.kg) {}

[NoCoverage] ArithmeticOperator
src/engine/coachDirector.js:146:28
-             const deloadKg = Math.round(exercise.recommendation.kg * 0.7 * 2) / 2;
+             const deloadKg = Math.round(exercise.recommendation.kg * 0.7 * 2) * 2;

[NoCoverage] ArithmeticOperator
src/engine/coachDirector.js:146:39
-             const deloadKg = Math.round(exercise.recommendation.kg * 0.7 * 2) / 2;
+             const deloadKg = Math.round(exercise.recommendation.kg * 0.7 / 2) / 2;

[NoCoverage] ArithmeticOperator
src/engine/coachDirector.js:146:39
-             const deloadKg = Math.round(exercise.recommendation.kg * 0.7 * 2) / 2;
+             const deloadKg = Math.round(exercise.recommendation.kg / 0.7 * 2) / 2;

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:147:37
-             exercise.recommendation = { ...exercise.recommendation, kg: deloadKg, weight: deloadKg };
+             exercise.recommendation = {};

[NoCoverage] BlockStatement
src/engine/coachDirector.js:153:49
-           if (exercise.recommendation?.technique) {
-             exercise.technique = exercise.recommendation.technique.toLowerCase().startsWith('drop')
-               ? 'drop'
-               : exercise.recommendation.technique;
-           }
+           if (exercise.recommendation?.technique) {}

[NoCoverage] MethodExpression
src/engine/coachDirector.js:154:32
-             exercise.technique = exercise.recommendation.technique.toLowerCase().startsWith('drop')
+             exercise.technique = exercise.recommendation.technique.toLowerCase().endsWith('drop')

[NoCoverage] MethodExpression
src/engine/coachDirector.js:154:32
-             exercise.technique = exercise.recommendation.technique.toLowerCase().startsWith('drop')
+             exercise.technique = exercise.recommendation.technique.toUpperCase().startsWith('drop')

[NoCoverage] BlockStatement
src/engine/coachDirector.js:159:17
-       } catch (e) {
-         for (const exercise of session.exercises) {
-           if (!exercise.recommendation) {
-             const lastLog = getLastLogFromContext(exercise.name, ctx.recentLogs);
-             const baseWeight = lastLog ? (lastLog.w ?? 20) : 20;
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
-           }
-         }
-       }
+       } catch (e) {}

[NoCoverage] BlockStatement
src/engine/coachDirector.js:160:49
-         for (const exercise of session.exercises) {
-           if (!exercise.recommendation) {
-             const lastLog = getLastLogFromContext(exercise.name, ctx.recentLogs);
-             const baseWeight = lastLog ? (lastLog.w ?? 20) : 20;
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
-           }
-         }
+         for (const exercise of session.exercises) {}

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:161:13
-           if (!exercise.recommendation) {
+           if (exercise.recommendation) {

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:161:13
-           if (!exercise.recommendation) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:161:13
-           if (!exercise.recommendation) {
+           if (false) {

[NoCoverage] BlockStatement
src/engine/coachDirector.js:161:39
-           if (!exercise.recommendation) {
-             const lastLog = getLastLogFromContext(exercise.name, ctx.recentLogs);
-             const baseWeight = lastLog ? (lastLog.w ?? 20) : 20;
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
-           }
+           if (!exercise.recommendation) {}

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:163:41
-             const baseWeight = lastLog ? (lastLog.w ?? 20) : 20;
+             const baseWeight = lastLog ? (lastLog.w && 20) : 20;

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:164:37
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = {};

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:164:90
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: true };

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:164:90
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: false };

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:164:90
-             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets || 3 };
+             exercise.recommendation = { kg: baseWeight, weight: baseWeight, reps: 8, sets: exercise.sets && 3 };

[NoCoverage] BlockStatement
src/engine/coachDirector.js:175:11
-         try {
-           const baseSessionForAA = session;
-           const activeDims = getActiveDimensions(ctx, { flags: { aa_via_cluster: true } });
-           const aaEntries = activeDims.filter(d => d.id === AA_DIMENSION_ID);
-           if (aaEntries.length > 0) {
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
-             const results = await Promise.all(
-               aaEntries.map(d => Promise.resolve(d.module.analyze(dimInput)))
-             );
-             const cluster = new DecisionCluster();
-             const { session: clusterSession, trace } = await cluster.execute(
-               results, baseSessionForAA, { entries: aaEntries }
-             );
-             session = aaClusterOutputToLegacyShape(clusterSession, baseSessionForAA);
-             _aaClusterTrace = trace;
-           }
-         } catch (err) {
+         try {} catch (err) {

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:177:53
-           const activeDims = getActiveDimensions(ctx, { flags: { aa_via_cluster: true } });
+           const activeDims = getActiveDimensions(ctx, {});

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:177:62
-           const activeDims = getActiveDimensions(ctx, { flags: { aa_via_cluster: true } });
+           const activeDims = getActiveDimensions(ctx, { flags: {} });

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:177:80
-           const activeDims = getActiveDimensions(ctx, { flags: { aa_via_cluster: true } });
+           const activeDims = getActiveDimensions(ctx, { flags: { aa_via_cluster: false } });

[NoCoverage] MethodExpression
src/engine/coachDirector.js:178:27
-           const aaEntries = activeDims.filter(d => d.id === AA_DIMENSION_ID);
+           const aaEntries = activeDims;

[NoCoverage] ArrowFunction
src/engine/coachDirector.js:178:45
-           const aaEntries = activeDims.filter(d => d.id === AA_DIMENSION_ID);
+           const aaEntries = activeDims.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:178:50
-           const aaEntries = activeDims.filter(d => d.id === AA_DIMENSION_ID);
+           const aaEntries = activeDims.filter(d => true);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:178:50
-           const aaEntries = activeDims.filter(d => d.id === AA_DIMENSION_ID);
+           const aaEntries = activeDims.filter(d => false);

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:178:50
-           const aaEntries = activeDims.filter(d => d.id === AA_DIMENSION_ID);
+           const aaEntries = activeDims.filter(d => d.id !== AA_DIMENSION_ID);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:179:13
-           if (aaEntries.length > 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:179:13
-           if (aaEntries.length > 0) {
+           if (false) {

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:179:13
-           if (aaEntries.length > 0) {
+           if (aaEntries.length >= 0) {

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:179:13
-           if (aaEntries.length > 0) {
+           if (aaEntries.length <= 0) {

[NoCoverage] BlockStatement
src/engine/coachDirector.js:179:35
-           if (aaEntries.length > 0) {
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
-             const results = await Promise.all(
-               aaEntries.map(d => Promise.resolve(d.module.analyze(dimInput)))
-             );
-             const cluster = new DecisionCluster();
-             const { session: clusterSession, trace } = await cluster.execute(
-               results, baseSessionForAA, { entries: aaEntries }
-             );
-             session = aaClusterOutputToLegacyShape(clusterSession, baseSessionForAA);
-             _aaClusterTrace = trace;
-           }
+           if (aaEntries.length > 0) {}

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:180:28
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
+             const dimInput = {};

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:180:40
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
+             const dimInput = { ctx, cdl: ["Stryker was here"], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:180:57
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
+             const dimInput = { ctx, cdl: [], userProfile: ctx.user && {}, flags: { aa_via_cluster: true } };

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:180:80
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
+             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: {} };

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:180:98
-             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: true } };
+             const dimInput = { ctx, cdl: [], userProfile: ctx.user ?? {}, flags: { aa_via_cluster: false } };

[NoCoverage] ArrowFunction
src/engine/coachDirector.js:182:27
-               aaEntries.map(d => Promise.resolve(d.module.analyze(dimInput)))
+               aaEntries.map(() => undefined)

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:186:40
-               results, baseSessionForAA, { entries: aaEntries }
+               results, baseSessionForAA, {}

[NoCoverage] BlockStatement
src/engine/coachDirector.js:191:21
-         } catch (err) {
-           console.error('[CoachDirector] AA cluster route failed — falling back to legacy:', err);
-           try {
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
-               window.Sentry.captureException(err, { tags: { component: 'coachDirector', op: 'aa_cluster_route' } });
-             }
-           } catch (_) { /* swallow */ }
-           session = this.applyAAAdjustments(session, ctx);
-         }
+         } catch (err) {}

[NoCoverage] BlockStatement
src/engine/coachDirector.js:193:13
-           try {
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
-               window.Sentry.captureException(err, { tags: { component: 'coachDirector', op: 'aa_cluster_route' } });
-             }
-           } catch (_) { /* swallow */ }
+           try {} catch (_) { /* swallow */ }

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:194:15
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+             if (true) {

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:194:15
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+             if (false) {

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:194:15
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+             if (typeof window !== 'undefined' || window.Sentry?.captureException) {

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:194:15
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+             if (true && window.Sentry?.captureException) {

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:194:15
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+             if (typeof window === 'undefined' && window.Sentry?.captureException) {

[NoCoverage] OptionalChaining
src/engine/coachDirector.js:194:48
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+             if (typeof window !== 'undefined' && window.Sentry.captureException) {

[NoCoverage] BlockStatement
src/engine/coachDirector.js:194:81
-             if (typeof window !== 'undefined' && window.Sentry?.captureException) {
-               window.Sentry.captureException(err, { tags: { component: 'coachDirector', op: 'aa_cluster_route' } });
-             }
+             if (typeof window !== 'undefined' && window.Sentry?.captureException) {}

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:195:49
-               window.Sentry.captureException(err, { tags: { component: 'coachDirector', op: 'aa_cluster_route' } });
+               window.Sentry.captureException(err, {});

[NoCoverage] ObjectLiteral
src/engine/coachDirector.js:195:57
-               window.Sentry.captureException(err, { tags: { component: 'coachDirector', op: 'aa_cluster_route' } });
+               window.Sentry.captureException(err, { tags: {} });

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:220:33
-         patterns: ctx.patterns ?? [],
+         patterns: ctx.patterns ?? ["Stryker was here"],

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:221:53
-         patternsSuppressed: ctx.patternsSuppressed ?? true,
+         patternsSuppressed: ctx.patternsSuppressed ?? false,

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:237:70
-           weakGroups: Array.isArray(ctx.weakGroups) ? ctx.weakGroups : [],
+           weakGroups: Array.isArray(ctx.weakGroups) ? ctx.weakGroups : ["Stryker was here"],

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:240:57
-             isHighRisk: ctx.predictionToday.isHighRisk ?? false,
+             isHighRisk: ctx.predictionToday.isHighRisk ?? true,

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:251:13
-             : []
+             : ["Stryker was here"]

[NoCoverage] BlockStatement
src/engine/coachDirector.js:254:48
-         if (_useClusterForAA && _aaClusterTrace) {
-           const _clusterRationale = clusterTraceToRationale(_aaClusterTrace);
-           if (_clusterRationale.winnerId !== RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {
-             _rationale = _clusterRationale;
-           }
-         }
+         if (_useClusterForAA && _aaClusterTrace) {}

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:256:13
-           if (_clusterRationale.winnerId !== RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:256:13
-           if (_clusterRationale.winnerId !== RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {
+           if (false) {

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:256:13
-           if (_clusterRationale.winnerId !== RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {
+           if (_clusterRationale.winnerId === RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {

[NoCoverage] BlockStatement
src/engine/coachDirector.js:256:82
-           if (_clusterRationale.winnerId !== RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {
-             _rationale = _clusterRationale;
-           }
+           if (_clusterRationale.winnerId !== RESERVED_RATIONALE_IDS.NO_RULE_FIRED) {}

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:266:13
-             : [],
+             : ["Stryker was here"],

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:334:74
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || false)) {

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:334:74
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) >= 0.6)) {

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:334:74
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) <= 0.6)) {

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:334:75
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence && 0) > 0.6)) {

[NoCoverage] ArithmeticOperator
src/engine/coachDirector.js:340:75
-             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence ?? 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
+             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence ?? 0) / 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:340:76
-             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence ?? 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
+             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence && 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
