[NoCoverage] BlockStatement
src/engine/coachDirector.js:352:58
-   function getLastLogFromContext(exerciseName, recentLogs) {
-     if (!recentLogs || !recentLogs.length) return null;
-     for (const session of recentLogs) {
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
-       if (log) return log;
-     }
-     return null;
-   }
+   function getLastLogFromContext(exerciseName, recentLogs) {}

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:353:7
-     if (!recentLogs || !recentLogs.length) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:353:7
-     if (!recentLogs || !recentLogs.length) return null;
+     if (false) return null;

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:353:7
-     if (!recentLogs || !recentLogs.length) return null;
+     if (!recentLogs && !recentLogs.length) return null;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:353:7
-     if (!recentLogs || !recentLogs.length) return null;
+     if (recentLogs || !recentLogs.length) return null;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:353:22
-     if (!recentLogs || !recentLogs.length) return null;
+     if (!recentLogs || recentLogs.length) return null;

[NoCoverage] BlockStatement
src/engine/coachDirector.js:354:37
-     for (const session of recentLogs) {
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
-       if (log) return log;
-     }
+     for (const session of recentLogs) {}

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:355:18
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (true).find(l => l.ex === exerciseName);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:355:18
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (false).find(l => l.ex === exerciseName);

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:355:18
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (session.logs && []).find(l => l.ex === exerciseName);

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:355:34
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (session.logs || ["Stryker was here"]).find(l => l.ex === exerciseName);

[NoCoverage] ArrowFunction
src/engine/coachDirector.js:355:43
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (session.logs || []).find(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:355:48
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (session.logs || []).find(l => true);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:355:48
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (session.logs || []).find(l => false);

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:355:48
-       const log = (session.logs || []).find(l => l.ex === exerciseName);
+       const log = (session.logs || []).find(l => l.ex !== exerciseName);

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:356:9
-       if (log) return log;
+       if (true) return log;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:356:9
-       if (log) return log;
+       if (false) return log;

[NoCoverage] BlockStatement
src/engine/coachDirector.js:361:50
-   function _hasRecentLog(exerciseName, recentLogs) {
-     if (!recentLogs || !recentLogs.length) return false;
-     for (const session of recentLogs) {
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
-     }
-     return false;
-   }
+   function _hasRecentLog(exerciseName, recentLogs) {}

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:362:7
-     if (!recentLogs || !recentLogs.length) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:362:7
-     if (!recentLogs || !recentLogs.length) return false;
+     if (false) return false;

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:362:7
-     if (!recentLogs || !recentLogs.length) return false;
+     if (!recentLogs && !recentLogs.length) return false;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:362:7
-     if (!recentLogs || !recentLogs.length) return false;
+     if (recentLogs || !recentLogs.length) return false;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:362:22
-     if (!recentLogs || !recentLogs.length) return false;
+     if (!recentLogs || recentLogs.length) return false;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:362:49
-     if (!recentLogs || !recentLogs.length) return false;
+     if (!recentLogs || !recentLogs.length) return true;

[NoCoverage] BlockStatement
src/engine/coachDirector.js:363:37
-     for (const session of recentLogs) {
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
-     }
+     for (const session of recentLogs) {}

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:364:9
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if (true) return true;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:364:9
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if (false) return true;

[NoCoverage] MethodExpression
src/engine/coachDirector.js:364:9
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || []).every(l => l.ex === exerciseName)) return true;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:364:10
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((true).some(l => l.ex === exerciseName)) return true;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:364:10
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((false).some(l => l.ex === exerciseName)) return true;

[NoCoverage] LogicalOperator
src/engine/coachDirector.js:364:10
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs && []).some(l => l.ex === exerciseName)) return true;

[NoCoverage] ArrayDeclaration
src/engine/coachDirector.js:364:26
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || ["Stryker was here"]).some(l => l.ex === exerciseName)) return true;

[NoCoverage] ArrowFunction
src/engine/coachDirector.js:364:35
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || []).some(() => undefined)) return true;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:364:40
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || []).some(l => true)) return true;

[NoCoverage] ConditionalExpression
src/engine/coachDirector.js:364:40
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || []).some(l => false)) return true;

[NoCoverage] EqualityOperator
src/engine/coachDirector.js:364:40
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || []).some(l => l.ex !== exerciseName)) return true;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:364:71
-       if ((session.logs || []).some(l => l.ex === exerciseName)) return true;
+       if ((session.logs || []).some(l => l.ex === exerciseName)) return false;

[NoCoverage] BooleanLiteral
src/engine/coachDirector.js:366:10
-     return false;
+     return true;

[Survived] ArrayDeclaration
src/engine/coachDirector.js:35:20
-           exercises: [],
+           exercises: ["Stryker was here"],
Tests ran:
    CoachDirector — Readiness behavior should NOT assume readiness when not set (Bug #9)
    CoachDirector — Week 1.5 fixes should require readiness input when not set today

[Survived] ObjectLiteral
src/engine/coachDirector.js:36:18
-           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed ?? true },
+           context: {},
Tests ran:
    CoachDirector — Readiness behavior should NOT assume readiness when not set (Bug #9)
    CoachDirector — Week 1.5 fixes should require readiness input when not set today

[Survived] LogicalOperator
src/engine/coachDirector.js:36:30
-           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed ?? true },
+           context: { patterns: ctx.patterns && [], patternsSuppressed: ctx.patternsSuppressed ?? true },
Tests ran:
    CoachDirector — Readiness behavior should NOT assume readiness when not set (Bug #9)
    CoachDirector — Week 1.5 fixes should require readiness input when not set today

[Survived] LogicalOperator
src/engine/coachDirector.js:36:70
-           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed ?? true },
+           context: { patterns: ctx.patterns ?? [], patternsSuppressed: ctx.patternsSuppressed && true },
Tests ran:
    CoachDirector — Readiness behavior should NOT assume readiness when not set (Bug #9)
    CoachDirector — Week 1.5 fixes should require readiness input when not set today

[Survived] LogicalOperator
src/engine/coachDirector.js:41:21
-       const allLogs = ctx.allLogs ?? [];
+       const allLogs = ctx.allLogs && [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:49:9
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:49:9
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
+       if (!calibration.patternsEnabled || ctx.patternsSuppressed !== false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] BooleanLiteral
src/engine/coachDirector.js:49:9
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
+       if (calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:49:41
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
+       if (!calibration.patternsEnabled && true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 22 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:49:41
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
+       if (!calibration.patternsEnabled && ctx.patternsSuppressed === false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 22 more tests!

[Survived] BooleanLiteral
src/engine/coachDirector.js:49:68
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
+       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 22 more tests!

[Survived] ArrayDeclaration
src/engine/coachDirector.js:50:22
-         ctx.patterns = [];
+         ctx.patterns = ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 22 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:49:75
-       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {
-         ctx.patterns = [];
-       } else if (calibration.patternMinConfidence != null) {
+       if (!calibration.patternsEnabled && ctx.patternsSuppressed !== false) {} else if (calibration.patternMinConfidence != null) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 22 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:51:16
-       } else if (calibration.patternMinConfidence != null) {
+       } else if (true) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:51:16
-       } else if (calibration.patternMinConfidence != null) {
+       } else if (false) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] EqualityOperator
src/engine/coachDirector.js:51:16
-       } else if (calibration.patternMinConfidence != null) {
+       } else if (calibration.patternMinConfidence == null) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] BlockStatement
src/engine/coachDirector.js:51:58
-       } else if (calibration.patternMinConfidence != null) {
-         ctx.patterns = (ctx.patterns || []).filter(
-           p => (p.confidence ?? 0.5) >= calibration.patternMinConfidence
-         );
-       }
+       } else if (calibration.patternMinConfidence != null) {}
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] MethodExpression
src/engine/coachDirector.js:52:22
-         ctx.patterns = (ctx.patterns || []).filter(
-           p => (p.confidence ?? 0.5) >= calibration.patternMinConfidence
-         );
+         ctx.patterns = ctx.patterns || [];
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:53:14
-           p => (p.confidence ?? 0.5) >= calibration.patternMinConfidence
+           p => true
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] EqualityOperator
src/engine/coachDirector.js:53:14
-           p => (p.confidence ?? 0.5) >= calibration.patternMinConfidence
+           p => (p.confidence ?? 0.5) > calibration.patternMinConfidence
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:58:9
-       if (calibration.rollingWindowMonths) {
+       if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:58:9
-       if (calibration.rollingWindowMonths) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:66:13
-           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') ?? {}; } catch { return {}; }
+           try {} catch { return {}; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:65:35
-         const workoutSkips = (() => {
-           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') ?? {}; } catch { return {}; }
-         })();
+         const workoutSkips = (() => {})();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:66:22
-           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') ?? {}; } catch { return {}; }
+           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') && {}; } catch { return {}; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:66:33
-           try { return JSON.parse(localStorage.getItem('workout-skips') ?? '{}') ?? {}; } catch { return {}; }
+           try { return JSON.parse(localStorage.getItem('workout-skips') && '{}') ?? {}; } catch { return {}; }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ArrayDeclaration
src/engine/coachDirector.js:71:11
-           : [];
+           : ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] BooleanLiteral
src/engine/coachDirector.js:79:25
-           : { isHighRisk: false, probability: 0, recommendation: null };
+           : { isHighRisk: true, probability: 0, recommendation: null };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ObjectLiteral
src/engine/coachDirector.js:79:11
-           : { isHighRisk: false, probability: 0, recommendation: null };
+           : {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ObjectLiteral
src/engine/coachDirector.js:81:39
-         const recompile = recompileWeek({ logs: logsForEngines, readinessScore: ctx.readiness.score });
+         const recompile = recompileWeek({});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:83:28
-         ctx.missedSessions = recompile.deficit > 0 ? 1 : 0;
+         ctx.missedSessions = true ? 1 : 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:83:28
-         ctx.missedSessions = recompile.deficit > 0 ? 1 : 0;
+         ctx.missedSessions = false ? 1 : 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:83:28
-         ctx.missedSessions = recompile.deficit > 0 ? 1 : 0;
+         ctx.missedSessions = recompile.deficit >= 0 ? 1 : 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:83:28
-         ctx.missedSessions = recompile.deficit > 0 ? 1 : 0;
+         ctx.missedSessions = recompile.deficit <= 0 ? 1 : 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:84:26
-         ctx.fatigueIndex = ctx.readiness.score < READINESS_MED ? 0.9 : 0;
+         ctx.fatigueIndex = false ? 0.9 : 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:84:26
-         ctx.fatigueIndex = ctx.readiness.score < READINESS_MED ? 0.9 : 0;
+         ctx.fatigueIndex = ctx.readiness.score <= READINESS_MED ? 0.9 : 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ArrayDeclaration
src/engine/coachDirector.js:93:20
-           exercises: [],
+           exercises: ["Stryker was here"],
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40

[Survived] ConditionalExpression
src/engine/coachDirector.js:98:9
-       if (ruleResult.action === 'deload') {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrayDeclaration
src/engine/coachDirector.js:103:27
-       let proactiveAlerts = [];
+       let proactiveAlerts = ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:104:9
-       try {
-         proactiveAlerts = runProactiveChecks({
-           ...ctx,
-           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch { return {}; } })(),
-           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch { return {}; } })(),
-           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch { return {}; } })(),
-           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch { return {}; } })(),
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
-         });
-       } catch { /* proactive checks are non-blocking */ }
+       try {} catch { /* proactive checks are non-blocking */ }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ObjectLiteral
src/engine/coachDirector.js:105:44
-         proactiveAlerts = runProactiveChecks({
-           ...ctx,
-           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch { return {}; } })(),
-           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch { return {}; } })(),
-           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch { return {}; } })(),
-           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch { return {}; } })(),
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
-         });
+         proactiveAlerts = runProactiveChecks({});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:107:23
-           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch { return {}; } })(),
+           prots: (() => {})(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:107:49
-           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch { return {}; } })(),
+           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') && '{}'); } catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!
