[Survived] BlockStatement
src/engine/coachDirector.js:107:29
-           prots: (() => { try { return JSON.parse(localStorage.getItem('prots') ?? '{}'); } catch { return {}; } })(),
+           prots: (() => { try {} catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:108:25
-           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch { return {}; } })(),
+           weights: (() => {})(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:108:31
-           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch { return {}; } })(),
+           weights: (() => { try {} catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:108:51
-           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') ?? '{}'); } catch { return {}; } })(),
+           weights: (() => { try { return JSON.parse(localStorage.getItem('weights') && '{}'); } catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:109:23
-           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch { return {}; } })(),
+           kcals: (() => {})(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:109:29
-           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch { return {}; } })(),
+           kcals: (() => { try {} catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:109:49
-           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') ?? '{}'); } catch { return {}; } })(),
+           kcals: (() => { try { return JSON.parse(localStorage.getItem('kcals') && '{}'); } catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:110:24
-           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch { return {}; } })(),
+           waters: (() => {})(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:110:30
-           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch { return {}; } })(),
+           waters: (() => { try {} catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:110:50
-           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') ?? '{}'); } catch { return {}; } })(),
+           waters: (() => { try { return JSON.parse(localStorage.getItem('waters') && '{}'); } catch { return {}; } })(),
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:111:15
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
+           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) && [],
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:111:15
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
+           logs: ctx.recentLogs.flatMap(s => s.logs ?? []) ?? [],
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrowFunction
src/engine/coachDirector.js:111:39
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
+           logs: ctx.recentLogs?.flatMap(() => undefined) ?? [],
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:111:44
-           logs: ctx.recentLogs?.flatMap(s => s.logs ?? []) ?? [],
+           logs: ctx.recentLogs?.flatMap(s => s.logs && []) ?? [],
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] LogicalOperator
src/engine/coachDirector.js:118:34
-       const unavailableEquipment = ctx.equipment?.unavailable ?? [];
+       const unavailableEquipment = ctx.equipment?.unavailable && [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:118:34
-       const unavailableEquipment = ctx.equipment?.unavailable ?? [];
+       const unavailableEquipment = ctx.equipment.unavailable ?? [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:119:9
-       if (unavailableEquipment.length > 0) {
+       if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:119:9
-       if (unavailableEquipment.length > 0) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:119:9
-       if (unavailableEquipment.length > 0) {
+       if (unavailableEquipment.length >= 0) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:119:9
-       if (unavailableEquipment.length > 0) {
+       if (unavailableEquipment.length <= 0) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:119:42
-       if (unavailableEquipment.length > 0) {
-         session.exercises = session.exercises.map(ex => {
-           const resolved = resolveExercise(ex.name, unavailableEquipment);
-           if (resolved.isAlternative) {
-             return { ...ex, name: resolved.exercise, isAlternative: true, original: resolved.original };
-           }
-           return ex;
-         });
-       }
+       if (unavailableEquipment.length > 0) {}
Tests ran:
    CoachDirector — Equipment availability should respect unavailable pec_deck equipment
    CoachDirector — Equipment availability should respect unavailable dumbbell equipment

[Survived] ConditionalExpression
src/engine/coachDirector.js:122:13
-           if (resolved.isAlternative) {
+           if (true) {
Tests ran:
    CoachDirector — Equipment availability should respect unavailable pec_deck equipment
    CoachDirector — Equipment availability should respect unavailable dumbbell equipment

[Survived] ConditionalExpression
src/engine/coachDirector.js:122:13
-           if (resolved.isAlternative) {
+           if (false) {
Tests ran:
    CoachDirector — Equipment availability should respect unavailable pec_deck equipment
    CoachDirector — Equipment availability should respect unavailable dumbbell equipment

[Survived] ConditionalExpression
src/engine/coachDirector.js:131:13
-           if (dpModule.DP && dpModule.DP.getSmartRecommendation) {
+           if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:131:13
-           if (dpModule.DP && dpModule.DP.getSmartRecommendation) {
+           if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:131:13
-           if (dpModule.DP && dpModule.DP.getSmartRecommendation) {
+           if (dpModule.DP || dpModule.DP.getSmartRecommendation) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:131:64
-           if (dpModule.DP && dpModule.DP.getSmartRecommendation) {
-             const dpRec = dpModule.DP.getSmartRecommendation(exercise.name, ctx.readiness.score, null);
-             if (dpRec.status === 'INIT') {
-               exercise.recommendation = dpModule.getInitialRecommendation(exercise.name, ctx);
-             } else {
-               exercise.recommendation = dpRec;
-             }
-           } else {
+           if (dpModule.DP && dpModule.DP.getSmartRecommendation) {} else {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:133:15
-             if (dpRec.status === 'INIT') {
+             if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:133:40
-             if (dpRec.status === 'INIT') {
-               exercise.recommendation = dpModule.getInitialRecommendation(exercise.name, ctx);
-             } else {
+             if (dpRec.status === 'INIT') {} else {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:135:18
-             } else {
-               exercise.recommendation = dpRec;
-             }
+             } else {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/coachDirector.js:145:13
-           if (ctx._deload && exercise.recommendation?.kg) {
+           if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:150:13
-           if (!exercise.recommendation.weight && exercise.recommendation.kg) {
+           if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:150:13
-           if (!exercise.recommendation.weight && exercise.recommendation.kg) {
+           if (!exercise.recommendation.weight || exercise.recommendation.kg) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:153:13
-           if (exercise.recommendation?.technique) {
+           if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:153:13
-           if (exercise.recommendation?.technique) {
+           if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:153:13
-           if (exercise.recommendation?.technique) {
+           if (exercise.recommendation.technique) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:174:9
-       if (_useClusterForAA) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:174:9
-       if (_useClusterForAA) {
+       if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:200:12
-       } else {
-         session = this.applyAAAdjustments(session, ctx);
-       }
+       } else {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:220:17
-         patterns: ctx.patterns ?? [],
+         patterns: ctx.patterns && [],
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:221:27
-         patternsSuppressed: ctx.patternsSuppressed ?? true,
+         patternsSuppressed: ctx.patternsSuppressed && true,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:231:27
-           calibrationLevel: ctx.calibrationLevel?.name || ctx.calibrationLevel || null,
+           calibrationLevel: true,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:231:27
-           calibrationLevel: ctx.calibrationLevel?.name || ctx.calibrationLevel || null,
+           calibrationLevel: false,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:231:27
-           calibrationLevel: ctx.calibrationLevel?.name || ctx.calibrationLevel || null,
+           calibrationLevel: (ctx.calibrationLevel?.name || ctx.calibrationLevel) && null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:231:27
-           calibrationLevel: ctx.calibrationLevel?.name || ctx.calibrationLevel || null,
+           calibrationLevel: false || null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:231:27
-           calibrationLevel: ctx.calibrationLevel?.name || ctx.calibrationLevel || null,
+           calibrationLevel: ctx.calibrationLevel?.name && ctx.calibrationLevel || null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:231:27
-           calibrationLevel: ctx.calibrationLevel?.name || ctx.calibrationLevel || null,
+           calibrationLevel: ctx.calibrationLevel.name || ctx.calibrationLevel || null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:232:25
-           readinessScore: ctx.readiness?.score ?? null,
+           readinessScore: ctx.readiness.score ?? null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:233:23
-           fatigueIndex: ctx.fatigueIndex ?? null,
+           fatigueIndex: ctx.fatigueIndex && null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:236:18
-           isInCut: ctx.isInCut ?? null,
+           isInCut: ctx.isInCut && null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:238:26
-           stagnationWeeks: ctx.stagnationWeeks ?? 0,
+           stagnationWeeks: ctx.stagnationWeeks && 0,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ObjectLiteral
src/engine/coachDirector.js:239:48
-           predictionToday: ctx.predictionToday ? {
-             isHighRisk: ctx.predictionToday.isHighRisk ?? false,
-             probability: ctx.predictionToday.probability ?? 0
-           } : null,
+           predictionToday: ctx.predictionToday ? {} : null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:240:23
-             isHighRisk: ctx.predictionToday.isHighRisk ?? false,
+             isHighRisk: ctx.predictionToday.isHighRisk && false,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:241:24
-             probability: ctx.predictionToday.probability ?? 0
+             probability: ctx.predictionToday.probability && 0
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:247:19
-           winnerId: ruleResult?.winner?.id ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
+           winnerId: ruleResult?.winner.id ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:247:19
-           winnerId: ruleResult?.winner?.id ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
+           winnerId: ruleResult.winner?.id ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:248:25
-           winnerPriority: ruleResult?.winner?.priority ?? null,
+           winnerPriority: ruleResult?.winner.priority ?? null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:248:25
-           winnerPriority: ruleResult?.winner?.priority ?? null,
+           winnerPriority: ruleResult.winner?.priority ?? null,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:249:35
-           overridden: Array.isArray(ruleResult?.overridden)
+           overridden: Array.isArray(ruleResult.overridden)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!
