[Survived] MethodExpression
src/engine/coachDirector.js:250:13
-             ? ruleResult.overridden.map(r => r?.id).filter(Boolean)
+             ? ruleResult.overridden.map(r => r?.id)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:250:44
-             ? ruleResult.overridden.map(r => r?.id).filter(Boolean)
+             ? ruleResult.overridden.map(r => r.id).filter(Boolean)
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    CoachDirector — CDL write (ADR 011) CDL proposed.rationale reflects ruleEngine winner

[Survived] ArrowFunction
src/engine/coachDirector.js:250:39
-             ? ruleResult.overridden.map(r => r?.id).filter(Boolean)
+             ? ruleResult.overridden.map(() => undefined).filter(Boolean)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:254:11
-         if (_useClusterForAA && _aaClusterTrace) {
+         if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:254:11
-         if (_useClusterForAA && _aaClusterTrace) {
+         if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:254:11
-         if (_useClusterForAA && _aaClusterTrace) {
+         if (_useClusterForAA || _aaClusterTrace) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] MethodExpression
src/engine/coachDirector.js:265:13
-             ? session.exercises.map(e => e?.name).filter(Boolean)
+             ? session.exercises.map(e => e?.name)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:264:34
-           exercises: Array.isArray(session?.exercises)
+           exercises: Array.isArray(session.exercises)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrowFunction
src/engine/coachDirector.js:265:35
-             ? session.exercises.map(e => e?.name).filter(Boolean)
+             ? session.exercises.map(() => undefined).filter(Boolean)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:265:40
-             ? session.exercises.map(e => e?.name).filter(Boolean)
+             ? session.exercises.map(e => e.name).filter(Boolean)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:267:37
-           proposedSets: Array.isArray(session?.exercises)
+           proposedSets: Array.isArray(session.exercises)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrowFunction
src/engine/coachDirector.js:268:38
-             ? session.exercises.reduce((sum, e) => sum + (e?.sets || 0), 0)
+             ? session.exercises.reduce(() => undefined, 0)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArithmeticOperator
src/engine/coachDirector.js:268:50
-             ? session.exercises.reduce((sum, e) => sum + (e?.sets || 0), 0)
+             ? session.exercises.reduce((sum, e) => sum - (e?.sets || 0), 0)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:268:57
-             ? session.exercises.reduce((sum, e) => sum + (e?.sets || 0), 0)
+             ? session.exercises.reduce((sum, e) => sum + (true), 0)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:268:57
-             ? session.exercises.reduce((sum, e) => sum + (e?.sets || 0), 0)
+             ? session.exercises.reduce((sum, e) => sum + (false), 0)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:268:57
-             ? session.exercises.reduce((sum, e) => sum + (e?.sets || 0), 0)
+             ? session.exercises.reduce((sum, e) => sum + (e?.sets && 0), 0)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:268:57
-             ? session.exercises.reduce((sum, e) => sum + (e?.sets || 0), 0)
+             ? session.exercises.reduce((sum, e) => sum + (e.sets || 0), 0)
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:270:27
-           volumeMultiplier: ctx.readiness?.volumeMultiplier ?? 1.0,
+           volumeMultiplier: ctx.readiness?.volumeMultiplier && 1.0,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] OptionalChaining
src/engine/coachDirector.js:270:27
-           volumeMultiplier: ctx.readiness?.volumeMultiplier ?? 1.0,
+           volumeMultiplier: ctx.readiness.volumeMultiplier ?? 1.0,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:284:13
-           if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+           if (true) {
Tests ran:
    CoachDirector — CDL write (ADR 011) CDL write failure → session still returned with cdlEntryId: null
    CoachDirector — CDL write (ADR 011) Sentry.captureException called on CDL write failure

[Survived] LogicalOperator
src/engine/coachDirector.js:284:13
-           if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+           if (typeof window !== 'undefined' || window.Sentry?.captureException) {
Tests ran:
    CoachDirector — CDL write (ADR 011) CDL write failure → session still returned with cdlEntryId: null
    CoachDirector — CDL write (ADR 011) Sentry.captureException called on CDL write failure

[Survived] ConditionalExpression
src/engine/coachDirector.js:284:13
-           if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+           if (true && window.Sentry?.captureException) {
Tests ran:
    CoachDirector — CDL write (ADR 011) CDL write failure → session still returned with cdlEntryId: null
    CoachDirector — CDL write (ADR 011) Sentry.captureException called on CDL write failure

[Survived] OptionalChaining
src/engine/coachDirector.js:284:46
-           if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+           if (typeof window !== 'undefined' && window.Sentry.captureException) {
Tests ran:
    CoachDirector — CDL write (ADR 011) CDL write failure → session still returned with cdlEntryId: null
    CoachDirector — CDL write (ADR 011) Sentry.captureException called on CDL write failure

[Survived] BlockStatement
src/engine/coachDirector.js:291:9
-       try { initAutoBackup(); } catch { /* non-blocking */ }
+       try {} catch { /* non-blocking */ }
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] MethodExpression
src/engine/coachDirector.js:324:13
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.min(2, Math.floor((e.sets || 3) * 0.7)),
Tests ran:
    CoachDirector — applyAAAdjustments (ADR 013) tier HIGH — aaBlocked populated, sets reduced 30% (Math.max(2, floor(sets*0.7)))
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:324:37
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.max(2, Math.floor((true) * 0.7)),
Tests ran:
    CoachDirector — applyAAAdjustments (ADR 013) tier HIGH — aaBlocked populated, sets reduced 30% (Math.max(2, floor(sets*0.7)))
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:324:37
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.max(2, Math.floor((false) * 0.7)),
Tests ran:
    CoachDirector — applyAAAdjustments (ADR 013) tier HIGH — aaBlocked populated, sets reduced 30% (Math.max(2, floor(sets*0.7)))
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
  and 2 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:324:37
-         sets: Math.max(2, Math.floor((e.sets || 3) * 0.7)),
+         sets: Math.max(2, Math.floor((e.sets && 3) * 0.7)),
Tests ran:
    CoachDirector — applyAAAdjustments (ADR 013) tier HIGH — aaBlocked populated, sets reduced 30% (Math.max(2, floor(sets*0.7)))
    Strangler AA — golden-master parity (legacy === cluster+adapter) 8. tier HIGH — escalating=false, single signal
    Strangler AA — golden-master parity (legacy === cluster+adapter) 9. tier HIGH — escalating=true, 4 signals
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:332:9
-       if (!ctx.patterns || ctx.patterns.length === 0) return session;
+       if (false) return session;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:332:9
-       if (!ctx.patterns || ctx.patterns.length === 0) return session;
+       if (!ctx.patterns && ctx.patterns.length === 0) return session;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:332:26
-       if (!ctx.patterns || ctx.patterns.length === 0) return session;
+       if (!ctx.patterns || false) return session;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:334:11
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (true) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] LogicalOperator
src/engine/coachDirector.js:334:11
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' || pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:334:11
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (true && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:334:44
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (true)) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] LogicalOperator
src/engine/coachDirector.js:334:44
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 && (pattern.confidence ?? 0) > 0.6)) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:334:44
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (false || (pattern.confidence ?? 0) > 0.6)) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] EqualityOperator
src/engine/coachDirector.js:334:44
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate > 60 || (pattern.confidence ?? 0) > 0.6)) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] EqualityOperator
src/engine/coachDirector.js:334:44
-         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate >= 60 || (pattern.confidence ?? 0) > 0.6)) {
+         if (pattern.type === 'EARLY_END' && (pattern.earlyEndRate < 60 || (pattern.confidence ?? 0) > 0.6)) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] MethodExpression
src/engine/coachDirector.js:336:26
-           const newCount = Math.max(3, Math.ceil(originalCount * 0.8));
+           const newCount = Math.min(3, Math.ceil(originalCount * 0.8));
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:340:40
-             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence ?? 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
+             reason: `Pattern detectat: ${false}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:340:40
-             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence ?? 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
+             reason: `Pattern detectat: ${true}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] LogicalOperator
src/engine/coachDirector.js:340:40
-             reason: `Pattern detectat: ${pattern.earlyEndRate || Math.round((pattern.confidence ?? 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
+             reason: `Pattern detectat: ${pattern.earlyEndRate && Math.round((pattern.confidence ?? 0) * 100)}% sesiuni terminate devreme. Redus la ${newCount} exerciții.`,
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] BlockStatement
src/engine/coachDirector.js:369:48
-   function _computeDaysSinceLastSession(allLogs) {
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
-     const sessionTimestamps = [...new Set(allLogs.map(l => l.session).filter(Boolean))];
-     if (sessionTimestamps.length === 0) return null;
-     const lastTs = Math.max(...sessionTimestamps);
-     return Math.floor((Date.now() - lastTs) / MS_PER_DAY);
-   }
+   function _computeDaysSinceLastSession(allLogs) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:370:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:370:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:370:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (!Array.isArray(allLogs) && allLogs.length === 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BooleanLiteral
src/engine/coachDirector.js:370:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (Array.isArray(allLogs) || allLogs.length === 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:370:34
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (!Array.isArray(allLogs) || false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:370:34
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (!Array.isArray(allLogs) || allLogs.length !== 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrayDeclaration
src/engine/coachDirector.js:371:29
-     const sessionTimestamps = [...new Set(allLogs.map(l => l.session).filter(Boolean))];
+     const sessionTimestamps = [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] MethodExpression
src/engine/coachDirector.js:371:41
-     const sessionTimestamps = [...new Set(allLogs.map(l => l.session).filter(Boolean))];
+     const sessionTimestamps = [...new Set(allLogs.map(l => l.session))];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArrowFunction
src/engine/coachDirector.js:371:53
-     const sessionTimestamps = [...new Set(allLogs.map(l => l.session).filter(Boolean))];
+     const sessionTimestamps = [...new Set(allLogs.map(() => undefined).filter(Boolean))];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:372:7
-     if (sessionTimestamps.length === 0) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:372:7
-     if (sessionTimestamps.length === 0) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] EqualityOperator
src/engine/coachDirector.js:372:7
-     if (sessionTimestamps.length === 0) return null;
+     if (sessionTimestamps.length !== 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] MethodExpression
src/engine/coachDirector.js:373:18
-     const lastTs = Math.max(...sessionTimestamps);
+     const lastTs = Math.min(...sessionTimestamps);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/coachDirector.js:374:21
-     return Math.floor((Date.now() - lastTs) / MS_PER_DAY);
+     return Math.floor((Date.now() - lastTs) * MS_PER_DAY);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/coachDirector.js:374:22
-     return Math.floor((Date.now() - lastTs) / MS_PER_DAY);
+     return Math.floor((Date.now() + lastTs) / MS_PER_DAY);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!
