[Survived] BlockStatement
src/engine/coachDirector.js:377:43
-   function _computeLastSessionType(allLogs) {
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
-     const bySession = {};
-     for (const l of allLogs) {
-       if (!l.session || !l.ex) continue;
-       bySession[l.session] = bySession[l.session] || new Set();
-       bySession[l.session].add(l.ex);
-     }
-     const sortedTs = Object.keys(bySession).sort((a, b) => Number(b) - Number(a));
-     if (sortedTs.length === 0) return null;
-     return inferSessionType([...bySession[sortedTs[0]]]);
-   }
+   function _computeLastSessionType(allLogs) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:378:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:378:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/coachDirector.js:378:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (!Array.isArray(allLogs) && allLogs.length === 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BooleanLiteral
src/engine/coachDirector.js:378:7
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (Array.isArray(allLogs) || allLogs.length === 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/coachDirector.js:378:34
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (!Array.isArray(allLogs) || false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/coachDirector.js:378:34
-     if (!Array.isArray(allLogs) || allLogs.length === 0) return null;
+     if (!Array.isArray(allLogs) || allLogs.length !== 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/coachDirector.js:380:28
-     for (const l of allLogs) {
-       if (!l.session || !l.ex) continue;
-       bySession[l.session] = bySession[l.session] || new Set();
-       bySession[l.session].add(l.ex);
-     }
+     for (const l of allLogs) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:381:9
-       if (!l.session || !l.ex) continue;
+       if (true) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:381:9
-       if (!l.session || !l.ex) continue;
+       if (false) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] LogicalOperator
src/engine/coachDirector.js:381:9
-       if (!l.session || !l.ex) continue;
+       if (!l.session && !l.ex) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] BooleanLiteral
src/engine/coachDirector.js:381:9
-       if (!l.session || !l.ex) continue;
+       if (l.session || !l.ex) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] BooleanLiteral
src/engine/coachDirector.js:381:23
-       if (!l.session || !l.ex) continue;
+       if (!l.session || l.ex) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:382:28
-       bySession[l.session] = bySession[l.session] || new Set();
+       bySession[l.session] = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:382:28
-       bySession[l.session] = bySession[l.session] || new Set();
+       bySession[l.session] = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] LogicalOperator
src/engine/coachDirector.js:382:28
-       bySession[l.session] = bySession[l.session] || new Set();
+       bySession[l.session] = bySession[l.session] && new Set();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] MethodExpression
src/engine/coachDirector.js:385:20
-     const sortedTs = Object.keys(bySession).sort((a, b) => Number(b) - Number(a));
+     const sortedTs = Object.keys(bySession);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArrowFunction
src/engine/coachDirector.js:385:48
-     const sortedTs = Object.keys(bySession).sort((a, b) => Number(b) - Number(a));
+     const sortedTs = Object.keys(bySession).sort(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/coachDirector.js:385:58
-     const sortedTs = Object.keys(bySession).sort((a, b) => Number(b) - Number(a));
+     const sortedTs = Object.keys(bySession).sort((a, b) => Number(b) + Number(a));
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises

[Survived] ConditionalExpression
src/engine/coachDirector.js:386:7
-     if (sortedTs.length === 0) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/coachDirector.js:386:7
-     if (sortedTs.length === 0) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] EqualityOperator
src/engine/coachDirector.js:386:7
-     if (sortedTs.length === 0) return null;
+     if (sortedTs.length !== 0) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArrayDeclaration
src/engine/coachDirector.js:387:27
-     return inferSessionType([...bySession[sortedTs[0]]]);
+     return inferSessionType([]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:6:22
-   const BASE_WEIGHTS = {
-     'DB Shoulder Press': 10,
-     'Incline DB Press': 15,
-     'Pec Deck': 20,
-     'Lateral Raises': 5,
-     'Pushdown': 15,
-     'Lat Pulldown': 30,
-     'Cable Row': 30,
-     'Face Pulls': 15,
-     'Bayesian Curl': 8,
-     'Incline DB Curl': 5,
-     'Overhead Triceps': 15,
-     'Rear Delt Fly': 15,
-     'Cable Curl': 10,
-     'Preacher Curl': 8,
-     'Leg Press': 80,
-     'Leg Extension': 30,
-     'Leg Curl': 25,
-   };
+   const BASE_WEIGHTS = {};

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:26:31
-   const EXPERIENCE_MULTIPLIER = { beginner: 0.7, intermediate: 1.0, advanced: 1.3 };
+   const EXPERIENCE_MULTIPLIER = {};

[NoCoverage] BlockStatement
src/engine/coldStartGuidelines.js:28:55
-   function suggestStartWeight(exerciseName, experience) {
-     const base = BASE_WEIGHTS[exerciseName] ?? 10;
-     const mult = EXPERIENCE_MULTIPLIER[experience] ?? 1.0;
-     return Math.round(base * mult);
-   }
+   function suggestStartWeight(exerciseName, experience) {}

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:29:16
-     const base = BASE_WEIGHTS[exerciseName] ?? 10;
+     const base = BASE_WEIGHTS[exerciseName] && 10;

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:30:16
-     const mult = EXPERIENCE_MULTIPLIER[experience] ?? 1.0;
+     const mult = EXPERIENCE_MULTIPLIER[experience] && 1.0;

[NoCoverage] ArithmeticOperator
src/engine/coldStartGuidelines.js:31:21
-     return Math.round(base * mult);
+     return Math.round(base / mult);

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:35:9
-     PUSH: {
-       beginner: [
-         { name: 'DB Shoulder Press', sets: 3, reps: '10-12' },
-         { name: 'Incline DB Press',  sets: 3, reps: '8-10'  },
-         { name: 'Pec Deck',          sets: 3, reps: '12-15' },
-         { name: 'Lateral Raises',    sets: 3, reps: '12-15' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
-       intermediate: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '10-12' },
-         { name: 'Incline DB Press',  sets: 4, reps: '8-10'  },
-         { name: 'Pec Deck',          sets: 3, reps: '12-15' },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Overhead Triceps',  sets: 3, reps: '10-12' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
-       advanced: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '8-12'  },
-         { name: 'Incline DB Press',  sets: 4, reps: '6-10'  },
-         { name: 'Pec Deck',          sets: 4, reps: '10-15' },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Overhead Triceps',  sets: 3, reps: '8-12'  },
-         { name: 'Pushdown',          sets: 3, reps: '8-12'  },
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
-       ],
-     },
+     PUSH: {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:36:15
-       beginner: [
-         { name: 'DB Shoulder Press', sets: 3, reps: '10-12' },
-         { name: 'Incline DB Press',  sets: 3, reps: '8-10'  },
-         { name: 'Pec Deck',          sets: 3, reps: '12-15' },
-         { name: 'Lateral Raises',    sets: 3, reps: '12-15' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
+       beginner: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:37:7
-         { name: 'DB Shoulder Press', sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:38:7
-         { name: 'Incline DB Press',  sets: 3, reps: '8-10'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:39:7
-         { name: 'Pec Deck',          sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:40:7
-         { name: 'Lateral Raises',    sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:41:7
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:43:19
-       intermediate: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '10-12' },
-         { name: 'Incline DB Press',  sets: 4, reps: '8-10'  },
-         { name: 'Pec Deck',          sets: 3, reps: '12-15' },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Overhead Triceps',  sets: 3, reps: '10-12' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
+       intermediate: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:44:7
-         { name: 'DB Shoulder Press', sets: 4, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:45:7
-         { name: 'Incline DB Press',  sets: 4, reps: '8-10'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:46:7
-         { name: 'Pec Deck',          sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:47:7
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:48:7
-         { name: 'Overhead Triceps',  sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:49:7
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:51:15
-       advanced: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '8-12'  },
-         { name: 'Incline DB Press',  sets: 4, reps: '6-10'  },
-         { name: 'Pec Deck',          sets: 4, reps: '10-15' },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Overhead Triceps',  sets: 3, reps: '8-12'  },
-         { name: 'Pushdown',          sets: 3, reps: '8-12'  },
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
-       ],
+       advanced: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:52:7
-         { name: 'DB Shoulder Press', sets: 4, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:53:7
-         { name: 'Incline DB Press',  sets: 4, reps: '6-10'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:54:7
-         { name: 'Pec Deck',          sets: 4, reps: '10-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:55:7
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:56:7
-         { name: 'Overhead Triceps',  sets: 3, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:57:7
-         { name: 'Pushdown',          sets: 3, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:58:7
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:61:9
-     PULL: {
-       beginner: [
-         { name: 'Lat Pulldown',   sets: 3, reps: '8-12'  },
-         { name: 'Cable Row',      sets: 3, reps: '8-12'  },
-         { name: 'Face Pulls',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',  sets: 3, reps: '10-12' },
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
-       ],
-       intermediate: [
-         { name: 'Lat Pulldown',   sets: 4, reps: '8-12'  },
-         { name: 'Cable Row',      sets: 4, reps: '8-12'  },
-         { name: 'Face Pulls',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',  sets: 3, reps: '10-12' },
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
-         { name: 'Rear Delt Fly',  sets: 3, reps: '12-15' },
-       ],
-       advanced: [
-         { name: 'Lat Pulldown',   sets: 4, reps: '6-12'  },
-         { name: 'Cable Row',      sets: 4, reps: '6-12'  },
-         { name: 'Face Pulls',     sets: 4, reps: '12-15' },
-         { name: 'Bayesian Curl',  sets: 4, reps: '10-12' },
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
-         { name: 'Rear Delt Fly',  sets: 3, reps: '12-15' },
-       ],
-     },
+     PULL: {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:62:15
-       beginner: [
-         { name: 'Lat Pulldown',   sets: 3, reps: '8-12'  },
-         { name: 'Cable Row',      sets: 3, reps: '8-12'  },
-         { name: 'Face Pulls',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',  sets: 3, reps: '10-12' },
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
-       ],
+       beginner: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:63:7
-         { name: 'Lat Pulldown',   sets: 3, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:64:7
-         { name: 'Cable Row',      sets: 3, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:65:7
-         { name: 'Face Pulls',     sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:66:7
-         { name: 'Bayesian Curl',  sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:67:7
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:69:19
-       intermediate: [
-         { name: 'Lat Pulldown',   sets: 4, reps: '8-12'  },
-         { name: 'Cable Row',      sets: 4, reps: '8-12'  },
-         { name: 'Face Pulls',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',  sets: 3, reps: '10-12' },
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
-         { name: 'Rear Delt Fly',  sets: 3, reps: '12-15' },
-       ],
+       intermediate: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:70:7
-         { name: 'Lat Pulldown',   sets: 4, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:71:7
-         { name: 'Cable Row',      sets: 4, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:72:7
-         { name: 'Face Pulls',     sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:73:7
-         { name: 'Bayesian Curl',  sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:74:7
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:75:7
-         { name: 'Rear Delt Fly',  sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:77:15
-       advanced: [
-         { name: 'Lat Pulldown',   sets: 4, reps: '6-12'  },
-         { name: 'Cable Row',      sets: 4, reps: '6-12'  },
-         { name: 'Face Pulls',     sets: 4, reps: '12-15' },
-         { name: 'Bayesian Curl',  sets: 4, reps: '10-12' },
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
-         { name: 'Rear Delt Fly',  sets: 3, reps: '12-15' },
-       ],
+       advanced: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:78:7
-         { name: 'Lat Pulldown',   sets: 4, reps: '6-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:79:7
-         { name: 'Cable Row',      sets: 4, reps: '6-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:80:7
-         { name: 'Face Pulls',     sets: 4, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:81:7
-         { name: 'Bayesian Curl',  sets: 4, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:82:7
-         { name: 'Incline DB Curl',sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:83:7
-         { name: 'Rear Delt Fly',  sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:86:16
-     UMERI_BRATE: {
-       beginner: [
-         { name: 'DB Shoulder Press', sets: 3, reps: '10-12' },
-         { name: 'Lateral Raises',    sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',     sets: 3, reps: '10-12' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
-       intermediate: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '10-12' },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',     sets: 3, reps: '10-12' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
-       advanced: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '8-12'  },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',     sets: 4, reps: '10-12' },
-         { name: 'Overhead Triceps',  sets: 3, reps: '8-12'  },
-         { name: 'Pushdown',          sets: 3, reps: '8-12'  },
-       ],
-     },
+     UMERI_BRATE: {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:87:15
-       beginner: [
-         { name: 'DB Shoulder Press', sets: 3, reps: '10-12' },
-         { name: 'Lateral Raises',    sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',     sets: 3, reps: '10-12' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
+       beginner: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:88:7
-         { name: 'DB Shoulder Press', sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:89:7
-         { name: 'Lateral Raises',    sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:90:7
-         { name: 'Bayesian Curl',     sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:91:7
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:93:19
-       intermediate: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '10-12' },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',     sets: 3, reps: '10-12' },
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
-       ],
+       intermediate: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:94:7
-         { name: 'DB Shoulder Press', sets: 4, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:95:7
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:96:7
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:97:7
-         { name: 'Bayesian Curl',     sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:98:7
-         { name: 'Pushdown',          sets: 3, reps: '10-12' },
+         {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:100:15
-       advanced: [
-         { name: 'DB Shoulder Press', sets: 4, reps: '8-12'  },
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
-         { name: 'Bayesian Curl',     sets: 4, reps: '10-12' },
-         { name: 'Overhead Triceps',  sets: 3, reps: '8-12'  },
-         { name: 'Pushdown',          sets: 3, reps: '8-12'  },
-       ],
+       advanced: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:101:7
-         { name: 'DB Shoulder Press', sets: 4, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:102:7
-         { name: 'Lateral Raises',    sets: 4, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:103:7
-         { name: 'Rear Delt Fly',     sets: 3, reps: '12-15' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:104:7
-         { name: 'Bayesian Curl',     sets: 4, reps: '10-12' },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:105:7
-         { name: 'Overhead Triceps',  sets: 3, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:106:7
-         { name: 'Pushdown',          sets: 3, reps: '8-12'  },
+         {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:114:22
-   EXERCISE_BANK.LEGS = {
-     beginner:     [
-       { name: 'Leg Press',     sets: 3, reps: '10-12' },
-       { name: 'Leg Extension', sets: 3, reps: '12-15' },
-       { name: 'Leg Curl',      sets: 3, reps: '10-12' },
-     ],
-     intermediate: [
-       { name: 'Leg Press',     sets: 4, reps: '10-12' },
-       { name: 'Leg Extension', sets: 4, reps: '12-15' },
-       { name: 'Leg Curl',      sets: 3, reps: '10-12' },
-     ],
-     advanced: [
-       { name: 'Leg Press',     sets: 4, reps: '8-12'  },
-       { name: 'Leg Extension', sets: 4, reps: '12-15' },
-       { name: 'Leg Curl',      sets: 4, reps: '10-12' },
-     ],
-   };
+   EXERCISE_BANK.LEGS = {};

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:115:17
-     beginner:     [
-       { name: 'Leg Press',     sets: 3, reps: '10-12' },
-       { name: 'Leg Extension', sets: 3, reps: '12-15' },
-       { name: 'Leg Curl',      sets: 3, reps: '10-12' },
-     ],
+     beginner:     [],
