[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:116:5
-       { name: 'Leg Press',     sets: 3, reps: '10-12' },
+       {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:117:5
-       { name: 'Leg Extension', sets: 3, reps: '12-15' },
+       {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:118:5
-       { name: 'Leg Curl',      sets: 3, reps: '10-12' },
+       {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:120:17
-     intermediate: [
-       { name: 'Leg Press',     sets: 4, reps: '10-12' },
-       { name: 'Leg Extension', sets: 4, reps: '12-15' },
-       { name: 'Leg Curl',      sets: 3, reps: '10-12' },
-     ],
+     intermediate: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:121:5
-       { name: 'Leg Press',     sets: 4, reps: '10-12' },
+       {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:122:5
-       { name: 'Leg Extension', sets: 4, reps: '12-15' },
+       {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:123:5
-       { name: 'Leg Curl',      sets: 3, reps: '10-12' },
+       {},

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:125:13
-     advanced: [
-       { name: 'Leg Press',     sets: 4, reps: '8-12'  },
-       { name: 'Leg Extension', sets: 4, reps: '12-15' },
-       { name: 'Leg Curl',      sets: 4, reps: '10-12' },
-     ],
+     advanced: [],

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:126:5
-       { name: 'Leg Press',     sets: 4, reps: '8-12'  },
+       {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:127:5
-       { name: 'Leg Extension', sets: 4, reps: '12-15' },
+       {},

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:128:5
-       { name: 'Leg Curl',      sets: 4, reps: '10-12' },
+       {},

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:137:22
-     const experience = onboardingData.experience ?? 'beginner';
+     const experience = onboardingData.experience && 'beginner';

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:138:22
-     const goal       = onboardingData.goal ?? 'cut';
+     const goal       = onboardingData.goal && 'cut';

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:140:16
-     const bank = EXERCISE_BANK[sessionType] ?? EXERCISE_BANK.PULL;
+     const bank = EXERCISE_BANK[sessionType] && EXERCISE_BANK.PULL;

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:141:22
-     const exercises = (bank[experience] ?? bank.beginner ?? []).map(ex => {
+     const exercises = ((bank[experience] ?? bank.beginner) && []).map(ex => {

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:141:22
-     const exercises = (bank[experience] ?? bank.beginner ?? []).map(ex => {
+     const exercises = (bank[experience] && bank.beginner ?? []).map(ex => {

[NoCoverage] ArrayDeclaration
src/engine/coldStartGuidelines.js:141:59
-     const exercises = (bank[experience] ?? bank.beginner ?? []).map(ex => {
+     const exercises = (bank[experience] ?? bank.beginner ?? ["Stryker was here"]).map(ex => {

[NoCoverage] BlockStatement
src/engine/coldStartGuidelines.js:141:73
-     const exercises = (bank[experience] ?? bank.beginner ?? []).map(ex => {
-       const weight = suggestStartWeight(ex.name, experience);
-       let reps = ex.reps;
-   
-       // Cap rep range for CUT — isolation capped at 10, floor at 6
-       if (goal === 'cut' && typeof reps === 'string') {
-         const [min, max] = reps.split('-').map(Number);
-         reps = `${Math.min(Math.max(6, min), 10)}-${Math.min(10, max)}`;
-       }
-   
-       return {
-         name: ex.name,
-         sets: ex.sets,
-         reps,
-         recommendation: {
-           kg: weight,
-           weight,
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
-           status: 'INIT',
-           rationale: `Greutate de start pentru ${experience} (${goal})`,
-           isInitial: true,
-         },
-       };
-     });
+     const exercises = (bank[experience] ?? bank.beginner ?? []).map(ex => {});

[NoCoverage] ConditionalExpression
src/engine/coldStartGuidelines.js:146:9
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/coldStartGuidelines.js:146:9
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:146:9
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (goal === 'cut' || typeof reps === 'string') {

[NoCoverage] ConditionalExpression
src/engine/coldStartGuidelines.js:146:9
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (true && typeof reps === 'string') {

[NoCoverage] EqualityOperator
src/engine/coldStartGuidelines.js:146:9
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (goal !== 'cut' && typeof reps === 'string') {

[NoCoverage] ConditionalExpression
src/engine/coldStartGuidelines.js:146:27
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (goal === 'cut' && true) {

[NoCoverage] EqualityOperator
src/engine/coldStartGuidelines.js:146:27
-       if (goal === 'cut' && typeof reps === 'string') {
+       if (goal === 'cut' && typeof reps !== 'string') {

[NoCoverage] BlockStatement
src/engine/coldStartGuidelines.js:146:53
-       if (goal === 'cut' && typeof reps === 'string') {
-         const [min, max] = reps.split('-').map(Number);
-         reps = `${Math.min(Math.max(6, min), 10)}-${Math.min(10, max)}`;
-       }
+       if (goal === 'cut' && typeof reps === 'string') {}

[NoCoverage] MethodExpression
src/engine/coldStartGuidelines.js:148:17
-         reps = `${Math.min(Math.max(6, min), 10)}-${Math.min(10, max)}`;
+         reps = `${Math.max(Math.max(6, min), 10)}-${Math.min(10, max)}`;

[NoCoverage] MethodExpression
src/engine/coldStartGuidelines.js:148:26
-         reps = `${Math.min(Math.max(6, min), 10)}-${Math.min(10, max)}`;
+         reps = `${Math.min(Math.min(6, min), 10)}-${Math.min(10, max)}`;

[NoCoverage] MethodExpression
src/engine/coldStartGuidelines.js:148:51
-         reps = `${Math.min(Math.max(6, min), 10)}-${Math.min(10, max)}`;
+         reps = `${Math.min(Math.max(6, min), 10)}-${Math.max(10, max)}`;

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:151:12
-       return {
-         name: ex.name,
-         sets: ex.sets,
-         reps,
-         recommendation: {
-           kg: weight,
-           weight,
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
-           status: 'INIT',
-           rationale: `Greutate de start pentru ${experience} (${goal})`,
-           isInitial: true,
-         },
-       };
+       return {};

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:155:23
-         recommendation: {
-           kg: weight,
-           weight,
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
-           status: 'INIT',
-           rationale: `Greutate de start pentru ${experience} (${goal})`,
-           isInitial: true,
-         },
+         recommendation: {},

[NoCoverage] ConditionalExpression
src/engine/coldStartGuidelines.js:158:15
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
+           reps: true ? parseInt(reps.split('-')[1] ?? reps) : reps,

[NoCoverage] ConditionalExpression
src/engine/coldStartGuidelines.js:158:15
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
+           reps: false ? parseInt(reps.split('-')[1] ?? reps) : reps,

[NoCoverage] EqualityOperator
src/engine/coldStartGuidelines.js:158:15
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
+           reps: typeof reps !== 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,

[NoCoverage] LogicalOperator
src/engine/coldStartGuidelines.js:158:51
-           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] ?? reps) : reps,
+           reps: typeof reps === 'string' ? parseInt(reps.split('-')[1] && reps) : reps,

[NoCoverage] BooleanLiteral
src/engine/coldStartGuidelines.js:161:20
-           isInitial: true,
+           isInitial: false,

[NoCoverage] ObjectLiteral
src/engine/coldStartGuidelines.js:166:10
-     return {
-       type: sessionType,
-       coldStart: true,
-       exercises,
-       reason: `Guideline bazat pe experiență (${experience}) și obiectiv (${goal})`,
-       calibrationLevel: null, // filled by CoachDirector
-     };
+     return {};

[NoCoverage] BooleanLiteral
src/engine/coldStartGuidelines.js:168:16
-       coldStart: true,
+       coldStart: false,

[NoCoverage] MethodExpression
src/engine/decisionCluster.js:265:84
-         session = { ...session, setsCap: session.setsCap == null ? composedSetsCap : Math.min(session.setsCap, composedSetsCap) };
+         session = { ...session, setsCap: session.setsCap == null ? composedSetsCap : Math.max(session.setsCap, composedSetsCap) };

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:364:60
-           const warnings = Array.isArray(session.warnings) ? [...session.warnings] : [];
+           const warnings = Array.isArray(session.warnings) ? [] : [];

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:382:7
-         default:
-           this.logger.warn?.(`[DecisionCluster] Unknown ENHANCEMENT action '${rec.action}' — ignoring`);
-           return session;
+         default:

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:383:9
-           this.logger.warn?.(`[DecisionCluster] Unknown ENHANCEMENT action '${rec.action}' — ignoring`);
+           this.logger.warn(`[DecisionCluster] Unknown ENHANCEMENT action '${rec.action}' — ignoring`);

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:435:60
-       if (Array.isArray(session.warnings)) cloned.warnings = [...session.warnings];
+       if (Array.isArray(session.warnings)) cloned.warnings = [];

[NoCoverage] BooleanLiteral
src/engine/decisionCluster.js:493:7
-     if (!trace) {
+     if (trace) {

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:493:7
-     if (!trace) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:493:7
-     if (!trace) {
+     if (false) {

[NoCoverage] BlockStatement
src/engine/decisionCluster.js:493:15
-     if (!trace) {
-       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: [] };
-     }
+     if (!trace) {}

[NoCoverage] ObjectLiteral
src/engine/decisionCluster.js:494:12
-       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: [] };
+       return {};

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:494:96
-       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: [] };
+       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: ["Stryker was here"] };

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:497:7
-     if (trace.shortCircuited) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:497:7
-     if (trace.shortCircuited) {
+     if (false) {

[NoCoverage] BlockStatement
src/engine/decisionCluster.js:497:29
-     if (trace.shortCircuited) {
-       const winner = trace.stages?.GATE?.winner;
-       return {
-         winnerId: winner?.source ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
-         winnerPriority: winner?.priority ?? null,
-         overridden: (trace.stages?.GATE?.overridden ?? [])
-           .map(o => o?.source)
-           .filter(Boolean),
-       };
-     }
+     if (trace.shortCircuited) {}

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:498:20
-       const winner = trace.stages?.GATE?.winner;
+       const winner = trace.stages?.GATE.winner;

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:498:20
-       const winner = trace.stages?.GATE?.winner;
+       const winner = trace.stages.GATE?.winner;

[NoCoverage] ObjectLiteral
src/engine/decisionCluster.js:499:12
-       return {
-         winnerId: winner?.source ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
-         winnerPriority: winner?.priority ?? null,
-         overridden: (trace.stages?.GATE?.overridden ?? [])
-           .map(o => o?.source)
-           .filter(Boolean),
-       };
+       return {};

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:500:17
-         winnerId: winner?.source ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
+         winnerId: winner?.source && RESERVED_RATIONALE_IDS.NO_RULE_FIRED,

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:500:17
-         winnerId: winner?.source ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,
+         winnerId: winner.source ?? RESERVED_RATIONALE_IDS.NO_RULE_FIRED,

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:501:23
-         winnerPriority: winner?.priority ?? null,
+         winnerPriority: winner?.priority && null,

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:501:23
-         winnerPriority: winner?.priority ?? null,
+         winnerPriority: winner.priority ?? null,

[NoCoverage] MethodExpression
src/engine/decisionCluster.js:502:19
-         overridden: (trace.stages?.GATE?.overridden ?? [])
-           .map(o => o?.source)
-           .filter(Boolean),
+         overridden: (trace.stages?.GATE?.overridden ?? []).map(o => o?.source),

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:502:20
-         overridden: (trace.stages?.GATE?.overridden ?? [])
+         overridden: (trace.stages?.GATE?.overridden && [])

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:502:20
-         overridden: (trace.stages?.GATE?.overridden ?? [])
+         overridden: (trace.stages?.GATE.overridden ?? [])

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:502:20
-         overridden: (trace.stages?.GATE?.overridden ?? [])
+         overridden: (trace.stages.GATE?.overridden ?? [])

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:502:54
-         overridden: (trace.stages?.GATE?.overridden ?? [])
+         overridden: (trace.stages?.GATE?.overridden ?? ["Stryker was here"])

[NoCoverage] ArrowFunction
src/engine/decisionCluster.js:503:14
-           .map(o => o?.source)
+           .map(() => undefined)

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:503:19
-           .map(o => o?.source)
+           .map(o => o.source)

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:508:17
-     const fired = [
-       ...(trace.stages?.ADJUSTMENT?.fired ?? []),
-       ...(trace.stages?.ENHANCEMENT?.fired ?? []),
-     ];
+     const fired = [];

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:509:9
-       ...(trace.stages?.ADJUSTMENT?.fired ?? []),
+       ...(trace.stages?.ADJUSTMENT?.fired && []),

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:509:9
-       ...(trace.stages?.ADJUSTMENT?.fired ?? []),
+       ...(trace.stages?.ADJUSTMENT.fired ?? []),

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:509:9
-       ...(trace.stages?.ADJUSTMENT?.fired ?? []),
+       ...(trace.stages.ADJUSTMENT?.fired ?? []),

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:509:44
-       ...(trace.stages?.ADJUSTMENT?.fired ?? []),
+       ...(trace.stages?.ADJUSTMENT?.fired ?? ["Stryker was here"]),

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:510:9
-       ...(trace.stages?.ENHANCEMENT?.fired ?? []),
+       ...(trace.stages?.ENHANCEMENT?.fired && []),

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:510:9
-       ...(trace.stages?.ENHANCEMENT?.fired ?? []),
+       ...(trace.stages?.ENHANCEMENT.fired ?? []),

[NoCoverage] OptionalChaining
src/engine/decisionCluster.js:510:9
-       ...(trace.stages?.ENHANCEMENT?.fired ?? []),
+       ...(trace.stages.ENHANCEMENT?.fired ?? []),

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:510:45
-       ...(trace.stages?.ENHANCEMENT?.fired ?? []),
+       ...(trace.stages?.ENHANCEMENT?.fired ?? ["Stryker was here"]),

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:513:7
-     if (fired.length === 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/decisionCluster.js:513:7
-     if (fired.length === 0) {
+     if (false) {

[NoCoverage] EqualityOperator
src/engine/decisionCluster.js:513:7
-     if (fired.length === 0) {
+     if (fired.length !== 0) {

[NoCoverage] BlockStatement
src/engine/decisionCluster.js:513:27
-     if (fired.length === 0) {
-       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: [] };
-     }
+     if (fired.length === 0) {}

[NoCoverage] ObjectLiteral
src/engine/decisionCluster.js:514:12
-       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: [] };
+       return {};

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:514:96
-       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: [] };
+       return { winnerId: RESERVED_RATIONALE_IDS.NO_RULE_FIRED, winnerPriority: null, overridden: ["Stryker was here"] };

[NoCoverage] MethodExpression
src/engine/decisionCluster.js:517:18
-     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));
+     const sorted = [...fired];

[NoCoverage] ArrayDeclaration
src/engine/decisionCluster.js:517:18
-     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));
+     const sorted = [].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));

[NoCoverage] ArrowFunction
src/engine/decisionCluster.js:517:34
-     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));
+     const sorted = [...fired].sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/engine/decisionCluster.js:517:44
-     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));
+     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) + (a.priority ?? 0));

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:517:45
-     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));
+     const sorted = [...fired].sort((a, b) => (b.priority && 0) - (a.priority ?? 0));

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:517:65
-     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority ?? 0));
+     const sorted = [...fired].sort((a, b) => (b.priority ?? 0) - (a.priority && 0));

[NoCoverage] ObjectLiteral
src/engine/decisionCluster.js:519:10
-     return {
-       winnerId: winner.source,
-       winnerPriority: winner.priority ?? null,
-       overridden: sorted.slice(1).map(o => o.source).filter(Boolean),
-     };
+     return {};

[NoCoverage] LogicalOperator
src/engine/decisionCluster.js:521:21
-       winnerPriority: winner.priority ?? null,
+       winnerPriority: winner.priority && null,

[NoCoverage] MethodExpression
src/engine/decisionCluster.js:522:17
-       overridden: sorted.slice(1).map(o => o.source).filter(Boolean),
+       overridden: sorted.slice(1).map(o => o.source),

[NoCoverage] MethodExpression
src/engine/decisionCluster.js:522:17
-       overridden: sorted.slice(1).map(o => o.source).filter(Boolean),
+       overridden: sorted.map(o => o.source).filter(Boolean),

[NoCoverage] ArrowFunction
src/engine/decisionCluster.js:522:37
-       overridden: sorted.slice(1).map(o => o.source).filter(Boolean),
+       overridden: sorted.slice(1).map(() => undefined).filter(Boolean),

[Survived] ArrayDeclaration
src/engine/decisionCluster.js:71:50
-       const items = Array.isArray(input) ? input : [];
+       const items = Array.isArray(input) ? input : ["Stryker was here"];
Tests ran:
    decisionCluster — empty / no-op cases handles non-array input by treating as empty

[Survived] ArrayDeclaration
src/engine/decisionCluster.js:72:66
-       const entries = Array.isArray(opts.entries) ? opts.entries : [];
+       const entries = Array.isArray(opts.entries) ? opts.entries : ["Stryker was here"];
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 22 more tests!

[Survived] ObjectLiteral
src/engine/decisionCluster.js:84:37
-           this._reportError(s.reason, { index: i, op: 'dimension_promise_rejected' });
+           this._reportError(s.reason, {});
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) does not invoke Sentry when no sentry sink is provided

[Survived] BlockStatement
src/engine/decisionCluster.js:88:27
-         if (result == null) {
-           errors.push({ index: i, reason: 'null or undefined dimension result' });
-           this._reportError(new Error('null dimension result'), { index: i, op: 'dimension_null' });
-           continue;
-         }
+         if (result == null) {}
Tests ran:
    decisionCluster — async dimension support (DP-2) skips null / undefined results without crashing

[Survived] ObjectLiteral
src/engine/decisionCluster.js:89:21
-           errors.push({ index: i, reason: 'null or undefined dimension result' });
+           errors.push({});
Tests ran:
    decisionCluster — async dimension support (DP-2) skips null / undefined results without crashing

[Survived] ObjectLiteral
src/engine/decisionCluster.js:90:63
-           this._reportError(new Error('null dimension result'), { index: i, op: 'dimension_null' });
+           this._reportError(new Error('null dimension result'), {});
Tests ran:
    decisionCluster — async dimension support (DP-2) skips null / undefined results without crashing

[Survived] ConditionalExpression
src/engine/decisionCluster.js:88:11
-         if (result == null) {
+         if (false) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 34 more tests!

[Survived] ObjectLiteral
src/engine/decisionCluster.js:97:32
-           this._reportError(err, { index: i, op: 'dimension_invalid_shape' });
+           this._reportError(err, {});
Tests ran:
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones

[Survived] ArrayDeclaration
src/engine/decisionCluster.js:175:55
-           trace: { fired: [], winner: null, overridden: [] },
+           trace: { fired: [], winner: null, overridden: ["Stryker was here"] },
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 33 more tests!

[Survived] ArrowFunction
src/engine/decisionCluster.js:207:29
-           fired: gateRecs.map(g => ({ source: g.source, action: g.rec.action, priority: g.rec.priority })),
+           fired: gateRecs.map(() => undefined),
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden

[Survived] ObjectLiteral
src/engine/decisionCluster.js:207:35
-           fired: gateRecs.map(g => ({ source: g.source, action: g.rec.action, priority: g.rec.priority })),
+           fired: gateRecs.map(g => ({})),
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden

[Survived] LogicalOperator
src/engine/decisionCluster.js:244:11
-         if (rec.action === ACTIONS.REDUCE_VOLUME && typeof rec.payload?.multiplier === 'number') {
+         if (rec.action === ACTIONS.REDUCE_VOLUME || typeof rec.payload?.multiplier === 'number') {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 10 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:244:11
-         if (rec.action === ACTIONS.REDUCE_VOLUME && typeof rec.payload?.multiplier === 'number') {
+         if (true && typeof rec.payload?.multiplier === 'number') {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 10 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:244:51
-         if (rec.action === ACTIONS.REDUCE_VOLUME && typeof rec.payload?.multiplier === 'number') {
+         if (rec.action === ACTIONS.REDUCE_VOLUME && true) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 5 more tests!

[Survived] OptionalChaining
src/engine/decisionCluster.js:244:58
-         if (rec.action === ACTIONS.REDUCE_VOLUME && typeof rec.payload?.multiplier === 'number') {
+         if (rec.action === ACTIONS.REDUCE_VOLUME && typeof rec.payload.multiplier === 'number') {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:247:11
-         if (rec.action === ACTIONS.REDUCE_SETS && typeof rec.payload?.cap === 'number') {
+         if (true) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 10 more tests!

[Survived] LogicalOperator
src/engine/decisionCluster.js:247:11
-         if (rec.action === ACTIONS.REDUCE_SETS && typeof rec.payload?.cap === 'number') {
+         if (rec.action === ACTIONS.REDUCE_SETS || typeof rec.payload?.cap === 'number') {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 10 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:247:11
-         if (rec.action === ACTIONS.REDUCE_SETS && typeof rec.payload?.cap === 'number') {
+         if (true && typeof rec.payload?.cap === 'number') {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 10 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:247:49
-         if (rec.action === ACTIONS.REDUCE_SETS && typeof rec.payload?.cap === 'number') {
+         if (rec.action === ACTIONS.REDUCE_SETS && true) {
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT composes sets caps via minimum (most restrictive wins)

[Survived] OptionalChaining
src/engine/decisionCluster.js:247:56
-         if (rec.action === ACTIONS.REDUCE_SETS && typeof rec.payload?.cap === 'number') {
+         if (rec.action === ACTIONS.REDUCE_SETS && typeof rec.payload.cap === 'number') {
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT composes sets caps via minimum (most restrictive wins)

[Survived] ConditionalExpression
src/engine/decisionCluster.js:265:40
-         session = { ...session, setsCap: session.setsCap == null ? composedSetsCap : Math.min(session.setsCap, composedSetsCap) };
+         session = { ...session, setsCap: true ? composedSetsCap : Math.min(session.setsCap, composedSetsCap) };
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT composes sets caps via minimum (most restrictive wins)
