[Survived] ConditionalExpression
src/engine/decisionCluster.js:264:9
-       if (composedSetsCap != null) {
+       if (true) {
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 33 more tests!

[Survived] ArithmeticOperator
src/engine/decisionCluster.js:300:33
-       enhancements.sort((a, b) => b.rec.priority - a.rec.priority);
+       enhancements.sort((a, b) => b.rec.priority + a.rec.priority);
Tests ran:
    decisionCluster — multi-stage integration runs ADJUSTMENT then ENHANCEMENT in a single pipeline pass

[Survived] MethodExpression
src/engine/decisionCluster.js:300:5
-       enhancements.sort((a, b) => b.rec.priority - a.rec.priority);
+       enhancements;
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 33 more tests!

[Survived] ArrowFunction
src/engine/decisionCluster.js:300:23
-       enhancements.sort((a, b) => b.rec.priority - a.rec.priority);
+       enhancements.sort(() => undefined);
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 33 more tests!

[Survived] ObjectLiteral
src/engine/decisionCluster.js:304:18
-         fired.push({ source, action: rec.action, priority: rec.priority, rationale: rec.rationale });
+         fired.push({});
Tests ran:
    decisionCluster — Stage 3 ENHANCEMENT inject_warning appends to session.warnings with source attribution
    decisionCluster — Stage 3 ENHANCEMENT inject_banner appends to session.banners with source attribution
    decisionCluster — Stage 3 ENHANCEMENT shorten_session truncates exercises array
  and 11 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:332:7
-         case ACTIONS.REDUCE_VOLUME:
-           // Composition handled in caller (_runAdjustmentStage) for trace clarity.
-           return session;
+         case ACTIONS.REDUCE_VOLUME:
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 2 ADJUSTMENT composes volume multipliers multiplicatively (0.9 × 0.7 = 0.63)
    decisionCluster — Stage 2 ADJUSTMENT composed multiplier respects existing baseSession.volumeMultiplier
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:335:7
-         case ACTIONS.REDUCE_SETS:
-           // Composition handled in caller.
-           return session;
+         case ACTIONS.REDUCE_SETS:
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT composes sets caps via minimum (most restrictive wins)

[Survived] OptionalChaining
src/engine/decisionCluster.js:341:46
-           return { ...session, baselineVolume: rec.payload?.sets ?? null };
+           return { ...session, baselineVolume: rec.payload.sets ?? null };
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT applies set_baseline_volume + set_baseline_frequency

[Survived] OptionalChaining
src/engine/decisionCluster.js:343:49
-           return { ...session, baselineFrequency: rec.payload?.target ?? null };
+           return { ...session, baselineFrequency: rec.payload.target ?? null };
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT applies set_baseline_volume + set_baseline_frequency

[Survived] OptionalChaining
src/engine/decisionCluster.js:345:9
-           this.logger.warn?.(`[DecisionCluster] Unknown ADJUSTMENT action '${rec.action}' — ignoring`);
+           this.logger.warn(`[DecisionCluster] Unknown ADJUSTMENT action '${rec.action}' — ignoring`);
Tests ran:
    decisionCluster — Stage 2 ADJUSTMENT logs and ignores unknown ADJUSTMENT actions (extension hatch)
    decisionCluster — Stage validation accepts unknown action verbs (extension hatch)

[Survived] OptionalChaining
src/engine/decisionCluster.js:374:40
-           const count = Number.isInteger(rec.payload?.count) ? rec.payload.count : null;
+           const count = Number.isInteger(rec.payload.count) ? rec.payload.count : null;
Tests ran:
    decisionCluster — Stage 3 ENHANCEMENT shorten_session truncates exercises array
    decisionCluster — Stage 3 ENHANCEMENT shorten_session no-ops if exercises absent or count missing

[Survived] LogicalOperator
src/engine/decisionCluster.js:375:13
-           if (count == null || !Array.isArray(session.exercises)) return session;
+           if (count == null && !Array.isArray(session.exercises)) return session;
Tests ran:
    decisionCluster — Stage 3 ENHANCEMENT shorten_session truncates exercises array
    decisionCluster — Stage 3 ENHANCEMENT shorten_session no-ops if exercises absent or count missing

[Survived] ConditionalExpression
src/engine/decisionCluster.js:375:13
-           if (count == null || !Array.isArray(session.exercises)) return session;
+           if (false || !Array.isArray(session.exercises)) return session;
Tests ran:
    decisionCluster — Stage 3 ENHANCEMENT shorten_session truncates exercises array
    decisionCluster — Stage 3 ENHANCEMENT shorten_session no-ops if exercises absent or count missing

[Survived] LogicalOperator
src/engine/decisionCluster.js:410:28
-               expectedStage: ACTION_STAGE_MAP[rec.action] ?? null,
+               expectedStage: ACTION_STAGE_MAP[rec.action] && null,
Tests ran:
    decisionCluster — Stage validation records mismatch when dimension declared GATE but emits inject_warning
    decisionCluster — Stage validation throws on mismatch when strict=true

[Survived] OptionalChaining
src/engine/decisionCluster.js:417:11
-             this.logger.warn?.(msg);
+             this.logger.warn(msg);
Tests ran:
    decisionCluster — Stage validation records mismatch when dimension declared GATE but emits inject_warning

[Survived] ConditionalExpression
src/engine/decisionCluster.js:430:9
-       if (!session || typeof session !== 'object') return {};
+       if (false) return {};
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 36 more tests!

[Survived] LogicalOperator
src/engine/decisionCluster.js:430:9
-       if (!session || typeof session !== 'object') return {};
+       if (!session && typeof session !== 'object') return {};
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:430:21
-       if (!session || typeof session !== 'object') return {};
+       if (!session || false) return {};
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:432:9
-       if (Array.isArray(session.exercises)) {
+       if (false) {
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 36 more tests!

[Survived] BlockStatement
src/engine/decisionCluster.js:432:43
-       if (Array.isArray(session.exercises)) {
-         cloned.exercises = session.exercises.map(e => (e && typeof e === 'object' ? { ...e } : e));
-       }
+       if (Array.isArray(session.exercises)) {}
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
  and 13 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:433:54
-         cloned.exercises = session.exercises.map(e => (e && typeof e === 'object' ? { ...e } : e));
+         cloned.exercises = session.exercises.map(e => (true ? { ...e } : e));
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
  and 13 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:433:54
-         cloned.exercises = session.exercises.map(e => (e && typeof e === 'object' ? { ...e } : e));
+         cloned.exercises = session.exercises.map(e => (false ? { ...e } : e));
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
  and 13 more tests!

[Survived] LogicalOperator
src/engine/decisionCluster.js:433:54
-         cloned.exercises = session.exercises.map(e => (e && typeof e === 'object' ? { ...e } : e));
+         cloned.exercises = session.exercises.map(e => (e || typeof e === 'object' ? { ...e } : e));
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
  and 13 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:433:59
-         cloned.exercises = session.exercises.map(e => (e && typeof e === 'object' ? { ...e } : e));
+         cloned.exercises = session.exercises.map(e => (e && true ? { ...e } : e));
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
  and 13 more tests!

[Survived] EqualityOperator
src/engine/decisionCluster.js:433:59
-         cloned.exercises = session.exercises.map(e => (e && typeof e === 'object' ? { ...e } : e));
+         cloned.exercises = session.exercises.map(e => (e && typeof e !== 'object' ? { ...e } : e));
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
  and 13 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:435:9
-       if (Array.isArray(session.warnings)) cloned.warnings = [...session.warnings];
+       if (false) cloned.warnings = [...session.warnings];
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 36 more tests!

[Survived] ObjectLiteral
src/engine/decisionCluster.js:442:12
-       return {
-         action: rec.action,
-         priority: rec.priority,
-         payload: this._clonePayload(rec.payload),
-         rationale: rec.rationale,
-       };
+       return {};
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden

[Survived] ConditionalExpression
src/engine/decisionCluster.js:436:9
-       if (Array.isArray(session.banners)) cloned.banners = [...session.banners];
+       if (false) cloned.banners = [...session.banners];
Tests ran:
    decisionCluster — empty / no-op cases returns baseSession unchanged when no dimensions provided
    decisionCluster — empty / no-op cases handles non-array input by treating as empty
    decisionCluster — empty / no-op cases does not mutate the input baseSession
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:452:9
-       if (!payload || typeof payload !== 'object' || Array.isArray(payload)) return {};
+       if (false) return {};
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden
  and 12 more tests!

[Survived] LogicalOperator
src/engine/decisionCluster.js:452:9
-       if (!payload || typeof payload !== 'object' || Array.isArray(payload)) return {};
+       if ((!payload || typeof payload !== 'object') && Array.isArray(payload)) return {};
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:452:9
-       if (!payload || typeof payload !== 'object' || Array.isArray(payload)) return {};
+       if (false || Array.isArray(payload)) return {};
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden
  and 12 more tests!

[Survived] LogicalOperator
src/engine/decisionCluster.js:452:9
-       if (!payload || typeof payload !== 'object' || Array.isArray(payload)) return {};
+       if (!payload && typeof payload !== 'object' || Array.isArray(payload)) return {};
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:452:21
-       if (!payload || typeof payload !== 'object' || Array.isArray(payload)) return {};
+       if (!payload || false || Array.isArray(payload)) return {};
Tests ran:
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
    decisionCluster — Stage 1 GATE short-circuit all non-winning recommendations (across stages) are recorded as overridden
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:458:9
-       if (!err) return 'unknown';
+       if (false) return 'unknown';
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones
    decisionCluster — async dimension support (DP-2) does not invoke Sentry when no sentry sink is provided

[Survived] ConditionalExpression
src/engine/decisionCluster.js:459:9
-       if (err instanceof Error) return err.message || err.toString();
+       if (true) return err.message || err.toString();
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones
    decisionCluster — async dimension support (DP-2) does not invoke Sentry when no sentry sink is provided

[Survived] ConditionalExpression
src/engine/decisionCluster.js:459:9
-       if (err instanceof Error) return err.message || err.toString();
+       if (false) return err.message || err.toString();
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones
    decisionCluster — async dimension support (DP-2) does not invoke Sentry when no sentry sink is provided

[Survived] LogicalOperator
src/engine/decisionCluster.js:459:38
-       if (err instanceof Error) return err.message || err.toString();
+       if (err instanceof Error) return err.message && err.toString();
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones
    decisionCluster — async dimension support (DP-2) does not invoke Sentry when no sentry sink is provided

[Survived] OptionalChaining
src/engine/decisionCluster.js:465:5
-       this.logger.error?.('[DecisionCluster] dimension error:', err, ctx);
+       this.logger.error('[DecisionCluster] dimension error:', err, ctx);
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) skips null / undefined results without crashing
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones
  and 1 more test!

[Survived] ConditionalExpression
src/engine/decisionCluster.js:466:9
-       if (this.sentry?.captureException) {
+       if (true) {
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues
    decisionCluster — async dimension support (DP-2) skips null / undefined results without crashing
    decisionCluster — async dimension support (DP-2) rejects malformed result shape but continues with valid ones
  and 1 more test!

[Survived] ObjectLiteral
src/engine/decisionCluster.js:468:43
-           this.sentry.captureException(err, { tags: { component: 'decisionCluster', ...ctx } });
+           this.sentry.captureException(err, {});
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues

[Survived] ObjectLiteral
src/engine/decisionCluster.js:468:51
-           this.sentry.captureException(err, { tags: { component: 'decisionCluster', ...ctx } });
+           this.sentry.captureException(err, { tags: {} });
Tests ran:
    decisionCluster — async dimension support (DP-2) handles a rejected promise gracefully — logs to Sentry, continues

[Survived] ObjectLiteral
src/engine/decisionCluster.js:46:21
-   const NULL_LOGGER = { warn: () => {}, error: () => {} };
+   const NULL_LOGGER = {};
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/engine/dimensionContract.js:176:27
-       meta: partial.meta && typeof partial.meta === 'object' ? partial.meta : {},
+       meta: partial.meta && true ? partial.meta : {},
Tests ran:
    dimensionContract — createDimensionResult preserves caller-provided fields
    Strangler AA — golden-master parity (legacy === cluster+adapter) 1. tier none — autoAggression missing entirely
    Strangler AA — golden-master parity (legacy === cluster+adapter) 2. tier none — autoAggression.tier === "none"
  and 10 more tests!

[Survived] BlockStatement
src/engine/dimensionContract.js:210:47
-     if (!Array.isArray(result.recommendations)) {
-       throw new TypeError(`DimensionResult[${result.id}].recommendations must be an array`);
-     }
+     if (!Array.isArray(result.recommendations)) {}
Tests ran:
    dimensionContract — assertValidDimensionResult rejects non-array recommendations

[Survived] ConditionalExpression
src/engine/dimensionContract.js:210:7
-     if (!Array.isArray(result.recommendations)) {
+     if (false) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 39 more tests!

[Survived] ConditionalExpression
src/engine/dimensionContract.js:216:7
-     if (!result.trace || typeof result.trace !== 'object' || Array.isArray(result.trace)) {
+     if (false || Array.isArray(result.trace)) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 37 more tests!

[Survived] LogicalOperator
src/engine/dimensionContract.js:216:7
-     if (!result.trace || typeof result.trace !== 'object' || Array.isArray(result.trace)) {
+     if (!result.trace && typeof result.trace !== 'object' || Array.isArray(result.trace)) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 37 more tests!

[Survived] ConditionalExpression
src/engine/dimensionContract.js:216:24
-     if (!result.trace || typeof result.trace !== 'object' || Array.isArray(result.trace)) {
+     if (!result.trace || false || Array.isArray(result.trace)) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 37 more tests!

[Survived] ConditionalExpression
src/engine/dimensionContract.js:219:7
-     if (!result.meta || typeof result.meta !== 'object' || Array.isArray(result.meta)) {
+     if (false || Array.isArray(result.meta)) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 36 more tests!

[Survived] LogicalOperator
src/engine/dimensionContract.js:219:7
-     if (!result.meta || typeof result.meta !== 'object' || Array.isArray(result.meta)) {
+     if (!result.meta && typeof result.meta !== 'object' || Array.isArray(result.meta)) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/dimensionContract.js:219:23
-     if (!result.meta || typeof result.meta !== 'object' || Array.isArray(result.meta)) {
+     if (!result.meta || false || Array.isArray(result.meta)) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/dimensionContract.js:232:15
-     if (!rec || typeof rec !== 'object') {
+     if (!rec || false) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 33 more tests!

[Survived] EqualityOperator
src/engine/dimensionContract.js:238:43
-     if (typeof rec.priority !== 'number' || rec.priority < 0 || rec.priority > 100) {
+     if (typeof rec.priority !== 'number' || rec.priority <= 0 || rec.priority > 100) {
Tests ran:
    decisionCluster — empty / no-op cases does not mutate the input baseSession
    decisionCluster — Stage 1 GATE short-circuit short-circuits when a gate_session recommendation fires
    decisionCluster — Stage 1 GATE short-circuit highest-priority gate wins when multiple fire
  and 31 more tests!

[NoCoverage] BlockStatement
src/engine/dimensionRegistry.js:179:56
-       if (typeof entry.requiresCalibration !== 'string') {
-         throw new TypeError(`DimensionRegistryEntry[${entry.id}].requiresCalibration must be string|null`);
-       }
+       if (typeof entry.requiresCalibration !== 'string') {}

[Survived] OptionalChaining
src/engine/dimensionRegistry.js:109:46
-     const ctxLevel = _normalizeCalibrationName(ctx?.calibrationLevel);
+     const ctxLevel = _normalizeCalibrationName(ctx.calibrationLevel);
Tests ran:
    dimensionRegistry — getActiveDimensions returns empty array when given empty registry
    dimensionRegistry — getActiveDimensions keeps dimensions with no calibration requirement and no flag
    dimensionRegistry — getActiveDimensions filters dimensions whose calibration requirement is unmet
  and 10 more tests!

[Survived] OptionalChaining
src/engine/dimensionRegistry.js:116:46
-         } else if (!isEnabled(dim.enabledFlag, ctx?.userId)) {
+         } else if (!isEnabled(dim.enabledFlag, ctx.userId)) {
Tests ran:
    dimensionRegistry — getActiveDimensions delegates to featureFlags.isEnabled when no opts.flags supplied (production path)
    dimensionRegistry — getActiveDimensions integration with featureFlags uses real isEnabled when no opts.flags provided — dev override true keeps dimension
    dimensionRegistry — getActiveDimensions integration with featureFlags uses real isEnabled when no opts.flags provided — dev override false filters out
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:131:7
-     if (!ctxLevel) return false;
+     if (false) return false;
Tests ran:
    dimensionRegistry — isCalibrationGateOpen returns false when required tier specified but ctx tier missing
    dimensionRegistry — isCalibrationGateOpen returns true when ctx tier ≥ required (case-insensitive)
    dimensionRegistry — isCalibrationGateOpen returns false when ctx tier < required
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:134:24
-     if (reqIdx === -1 || ctxIdx === -1) return false;
+     if (reqIdx === -1 || false) return false;
Tests ran:
    dimensionRegistry — isCalibrationGateOpen returns true when ctx tier ≥ required (case-insensitive)
    dimensionRegistry — isCalibrationGateOpen returns false when ctx tier < required
    dimensionRegistry — isCalibrationGateOpen returns false for unknown tier names
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:163:24
-     if (!entry.module || typeof entry.module !== 'object') {
+     if (!entry.module || false) {
Tests ran:
    dimensionRegistry — DIMENSIONS array passes registry validation
    dimensionRegistry — assertValidDimensionEntry passes valid entry
    dimensionRegistry — assertValidDimensionEntry rejects entry whose module lacks an analyze function
  and 8 more tests!

[Survived] EqualityOperator
src/engine/dimensionRegistry.js:172:45
-     if (typeof entry.priority !== 'number' || entry.priority < 0 || entry.priority > 100) {
+     if (typeof entry.priority !== 'number' || entry.priority <= 0 || entry.priority > 100) {
Tests ran:
    dimensionRegistry — DIMENSIONS array passes registry validation
    dimensionRegistry — assertValidDimensionEntry passes valid entry
    dimensionRegistry — assertValidDimensionEntry rejects priority out of range
  and 6 more tests!

[Survived] EqualityOperator
src/engine/dimensionRegistry.js:172:67
-     if (typeof entry.priority !== 'number' || entry.priority < 0 || entry.priority > 100) {
+     if (typeof entry.priority !== 'number' || entry.priority < 0 || entry.priority >= 100) {
Tests ran:
    dimensionRegistry — DIMENSIONS array passes registry validation
    dimensionRegistry — assertValidDimensionEntry passes valid entry
    dimensionRegistry — assertValidDimensionEntry rejects priority out of range
  and 6 more tests!
