[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:179:9
-       if (typeof entry.requiresCalibration !== 'string') {
+       if (false) {
Tests ran:
    dimensionRegistry — assertValidDimensionEntry rejects unknown calibration tier
    dimensionRegistry — assertValidDimensionEntry accepts UPPERCASE and lowercase tier names
    dimensionRegistry — assertValidRegistry passes valid heterogeneous registry

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:189:7
-     if (typeof entry.schemaVersion !== 'number' || !Number.isInteger(entry.schemaVersion) || entry.schemaVersion < 1) {
+     if (false || !Number.isInteger(entry.schemaVersion) || entry.schemaVersion < 1) {
Tests ran:
    dimensionRegistry — DIMENSIONS array passes registry validation
    dimensionRegistry — assertValidDimensionEntry passes valid entry
    dimensionRegistry — assertValidDimensionEntry accepts UPPERCASE and lowercase tier names
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:215:7
-     if (!level) return null;
+     if (false) return null;
Tests ran:
    dimensionRegistry — getActiveDimensions returns empty array when given empty registry
    dimensionRegistry — getActiveDimensions keeps dimensions with no calibration requirement and no flag
    dimensionRegistry — getActiveDimensions filters dimensions whose calibration requirement is unmet
  and 10 more tests!

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:216:7
-     if (typeof level === 'string') return _normalizeTierName(level);
+     if (false) return _normalizeTierName(level);
Tests ran:
    dimensionRegistry — getActiveDimensions keeps dimensions with no calibration requirement and no flag
    dimensionRegistry — getActiveDimensions filters dimensions whose calibration requirement is unmet
    dimensionRegistry — getActiveDimensions accepts calibrationLevel as object with .name
  and 9 more tests!

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:217:7
-     if (typeof level === 'object' && typeof level.name === 'string') return _normalizeTierName(level.name);
+     if (true) return _normalizeTierName(level.name);
Tests ran:
    dimensionRegistry — getActiveDimensions accepts calibrationLevel as object with .name

[Survived] LogicalOperator
src/engine/dimensionRegistry.js:217:7
-     if (typeof level === 'object' && typeof level.name === 'string') return _normalizeTierName(level.name);
+     if (typeof level === 'object' || typeof level.name === 'string') return _normalizeTierName(level.name);
Tests ran:
    dimensionRegistry — getActiveDimensions accepts calibrationLevel as object with .name

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:217:7
-     if (typeof level === 'object' && typeof level.name === 'string') return _normalizeTierName(level.name);
+     if (true && typeof level.name === 'string') return _normalizeTierName(level.name);
Tests ran:
    dimensionRegistry — getActiveDimensions accepts calibrationLevel as object with .name

[Survived] ConditionalExpression
src/engine/dimensionRegistry.js:217:36
-     if (typeof level === 'object' && typeof level.name === 'string') return _normalizeTierName(level.name);
+     if (typeof level === 'object' && true) return _normalizeTierName(level.name);
Tests ran:
    dimensionRegistry — getActiveDimensions accepts calibrationLevel as object with .name

[NoCoverage] ArrayDeclaration
src/engine/dp.js:115:42
-       const range = this.REP_RANGES[ex] || [8,12];
+       const range = this.REP_RANGES[ex] || [];

[NoCoverage] MethodExpression
src/engine/dp.js:123:46
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length >= 3 && last3W.some(w => w === last3W[0]);

[NoCoverage] ArrowFunction
src/engine/dp.js:123:59
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length >= 3 && last3W.every(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/dp.js:123:64
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length >= 3 && last3W.every(w => true);

[NoCoverage] ConditionalExpression
src/engine/dp.js:123:64
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length >= 3 && last3W.every(w => false);

[NoCoverage] EqualityOperator
src/engine/dp.js:123:64
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length >= 3 && last3W.every(w => w !== last3W[0]);

[NoCoverage] BlockStatement
src/engine/dp.js:173:43
-       if (lastReps < Math.ceil(rMin * 0.5)) {
-         const prevKg = getPrevWeight(lastW, ex);
-         return {
-           kg: prevKg, repsTarget: rMin, rir: 3,
-           status: 'SCALE BACK', statusColor: 'var(--accent2)',
-           statusLabel: '🟡 Scădem un pas',
-           progressionNote: `${lastW} kg → ${prevKg} kg · Nu am ajuns la intervalul de reps minim.`,
-           progressionStage: 1
-         };
-       }
+       if (lastReps < Math.ceil(rMin * 0.5)) {}

[NoCoverage] ObjectLiteral
src/engine/dp.js:175:14
-         return {
-           kg: prevKg, repsTarget: rMin, rir: 3,
-           status: 'SCALE BACK', statusColor: 'var(--accent2)',
-           statusLabel: '🟡 Scădem un pas',
-           progressionNote: `${lastW} kg → ${prevKg} kg · Nu am ajuns la intervalul de reps minim.`,
-           progressionStage: 1
-         };
+         return {};

[NoCoverage] BlockStatement
src/engine/dp.js:185:34
-       if (maxKg && lastW >= maxKg) {
-         // Don't add weight — focus on reps and quality
-         const targetReps = Math.min(rMax + 4, lastReps + 1); // can exceed normal range
-         if (lastReps >= rMax + 4) {
-           // At both weight cap AND rep cap → maintain, focus on technique/feel
-           return {
-             kg: lastW, repsTarget: rMax, rir: 2,
-             status: 'PEAK',
-             statusColor: 'var(--purple)',
-             statusLabel: '🟢 La vârf',
-             progressionNote: `${lastW} kg este plafonul pe acest exercițiu. Focus pe o execuție impecabilă.`,
-             progressionStage: 1
-           };
-         }
-         return {
-           kg: lastW, repsTarget: targetReps, rir: 2,
-           status: 'CAP REPS',
-           statusColor: 'var(--accent)',
-           statusLabel: '🟢 Creștem reps',
-           progressionNote: `Suntem la plafonul de greutate (${maxKg} kg). Astăzi urcăm la ${targetReps} reps.`,
-           progressionStage: 1
-         };
-       }
+       if (maxKg && lastW >= maxKg) {}

[NoCoverage] MethodExpression
src/engine/dp.js:187:26
-         const targetReps = Math.min(rMax + 4, lastReps + 1); // can exceed normal range
+         const targetReps = Math.max(rMax + 4, lastReps + 1); // can exceed normal range

[NoCoverage] ArithmeticOperator
src/engine/dp.js:187:35
-         const targetReps = Math.min(rMax + 4, lastReps + 1); // can exceed normal range
+         const targetReps = Math.min(rMax - 4, lastReps + 1); // can exceed normal range

[NoCoverage] ArithmeticOperator
src/engine/dp.js:187:45
-         const targetReps = Math.min(rMax + 4, lastReps + 1); // can exceed normal range
+         const targetReps = Math.min(rMax + 4, lastReps - 1); // can exceed normal range

[NoCoverage] ConditionalExpression
src/engine/dp.js:188:11
-         if (lastReps >= rMax + 4) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/dp.js:188:11
-         if (lastReps >= rMax + 4) {
+         if (false) {

[NoCoverage] EqualityOperator
src/engine/dp.js:188:11
-         if (lastReps >= rMax + 4) {
+         if (lastReps > rMax + 4) {

[NoCoverage] EqualityOperator
src/engine/dp.js:188:11
-         if (lastReps >= rMax + 4) {
+         if (lastReps < rMax + 4) {

[NoCoverage] ArithmeticOperator
src/engine/dp.js:188:23
-         if (lastReps >= rMax + 4) {
+         if (lastReps >= rMax - 4) {

[NoCoverage] BlockStatement
src/engine/dp.js:188:33
-         if (lastReps >= rMax + 4) {
-           // At both weight cap AND rep cap → maintain, focus on technique/feel
-           return {
-             kg: lastW, repsTarget: rMax, rir: 2,
-             status: 'PEAK',
-             statusColor: 'var(--purple)',
-             statusLabel: '🟢 La vârf',
-             progressionNote: `${lastW} kg este plafonul pe acest exercițiu. Focus pe o execuție impecabilă.`,
-             progressionStage: 1
-           };
-         }
+         if (lastReps >= rMax + 4) {}

[NoCoverage] ObjectLiteral
src/engine/dp.js:190:16
-           return {
-             kg: lastW, repsTarget: rMax, rir: 2,
-             status: 'PEAK',
-             statusColor: 'var(--purple)',
-             statusLabel: '🟢 La vârf',
-             progressionNote: `${lastW} kg este plafonul pe acest exercițiu. Focus pe o execuție impecabilă.`,
-             progressionStage: 1
-           };
+           return {};

[NoCoverage] ObjectLiteral
src/engine/dp.js:199:14
-         return {
-           kg: lastW, repsTarget: targetReps, rir: 2,
-           status: 'CAP REPS',
-           statusColor: 'var(--accent)',
-           statusLabel: '🟢 Creștem reps',
-           progressionNote: `Suntem la plafonul de greutate (${maxKg} kg). Astăzi urcăm la ${targetReps} reps.`,
-           progressionStage: 1
-         };
+         return {};

[NoCoverage] ConditionalExpression
src/engine/dp.js:236:9
-       if (isStagnant && extraSets === 0) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/dp.js:236:9
-       if (isStagnant && extraSets === 0) {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/dp.js:236:9
-       if (isStagnant && extraSets === 0) {
+       if (isStagnant || extraSets === 0) {

[NoCoverage] ConditionalExpression
src/engine/dp.js:236:23
-       if (isStagnant && extraSets === 0) {
+       if (isStagnant && true) {

[NoCoverage] EqualityOperator
src/engine/dp.js:236:23
-       if (isStagnant && extraSets === 0) {
+       if (isStagnant && extraSets !== 0) {

[NoCoverage] BlockStatement
src/engine/dp.js:236:40
-       if (isStagnant && extraSets === 0) {
-         DB.set(`ex-extra-sets-${ex}`, 1);
-         return {
-           kg: lastW, repsTarget: rMax, rir: 2,
-           status: 'STAGNANT +SET',
-           statusColor: 'var(--accent2)',
-           statusLabel: '🟡 Plus un set azi',
-           progressionNote: `Greutate constantă 3 sesiuni · Astăzi adăugăm 1 set`,
-           progressionStage: 3
-         };
-       }
+       if (isStagnant && extraSets === 0) {}

[NoCoverage] ObjectLiteral
src/engine/dp.js:238:14
-         return {
-           kg: lastW, repsTarget: rMax, rir: 2,
-           status: 'STAGNANT +SET',
-           statusColor: 'var(--accent2)',
-           statusLabel: '🟡 Plus un set azi',
-           progressionNote: `Greutate constantă 3 sesiuni · Astăzi adăugăm 1 set`,
-           progressionStage: 3
-         };
+         return {};

[NoCoverage] ConditionalExpression
src/engine/dp.js:249:9
-       if (isStagnant && extraSets >= 1) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/dp.js:249:9
-       if (isStagnant && extraSets >= 1) {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/dp.js:249:9
-       if (isStagnant && extraSets >= 1) {
+       if (isStagnant || extraSets >= 1) {

[NoCoverage] ConditionalExpression
src/engine/dp.js:249:23
-       if (isStagnant && extraSets >= 1) {
+       if (isStagnant && true) {

[NoCoverage] EqualityOperator
src/engine/dp.js:249:23
-       if (isStagnant && extraSets >= 1) {
+       if (isStagnant && extraSets > 1) {

[NoCoverage] EqualityOperator
src/engine/dp.js:249:23
-       if (isStagnant && extraSets >= 1) {
+       if (isStagnant && extraSets < 1) {

[NoCoverage] BlockStatement
src/engine/dp.js:249:39
-       if (isStagnant && extraSets >= 1) {
-         // Drop set nu în CUT — în deficit menții greutatea, straight sets cu execuție perfectă
-         const phaseOverride = DB.get('phase-override') || 'AUTO';
-         const isInCut = phaseOverride === 'CUT' ||
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
-         if (isInCut) {
-           return {
-             kg: lastW, repsTarget: rMax, rir: 2,
-             status: 'MAINTAIN',
-             statusColor: 'var(--accent)',
-             statusLabel: '🟡 Consolidare în definire',
-             progressionNote: `Stagnare 3 sesiuni la ${lastW} kg · În definire prioritizăm calitatea, nu greutatea`,
-             progressionStage: 3
-           };
-         }
-         return {
-           kg: lastW, repsTarget: rMax, rir: 1,
-           status: 'TECHNIQUE',
-           statusColor: 'var(--purple)',
-           statusLabel: '🟡 Drop set la final',
-           progressionNote: `Stagnare lungă · Drop set pe ultimul: −30% greutate pentru a sparge platoul`,
-           progressionStage: 4,
-           technique: 'DROP SET'
-         };
-       }
+       if (isStagnant && extraSets >= 1) {}

[NoCoverage] ConditionalExpression
src/engine/dp.js:251:29
-         const phaseOverride = DB.get('phase-override') || 'AUTO';
+         const phaseOverride = true;

[NoCoverage] ConditionalExpression
src/engine/dp.js:251:29
-         const phaseOverride = DB.get('phase-override') || 'AUTO';
+         const phaseOverride = false;

[NoCoverage] LogicalOperator
src/engine/dp.js:251:29
-         const phaseOverride = DB.get('phase-override') || 'AUTO';
+         const phaseOverride = DB.get('phase-override') && 'AUTO';

[NoCoverage] ConditionalExpression
src/engine/dp.js:252:23
-         const isInCut = phaseOverride === 'CUT' ||
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+         const isInCut = true;

[NoCoverage] ConditionalExpression
src/engine/dp.js:252:23
-         const isInCut = phaseOverride === 'CUT' ||
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+         const isInCut = false;

[NoCoverage] LogicalOperator
src/engine/dp.js:252:23
-         const isInCut = phaseOverride === 'CUT' ||
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+         const isInCut = phaseOverride === 'CUT' && phaseOverride === 'AUTO' && new Date() < TARGET_DATE;

[NoCoverage] ConditionalExpression
src/engine/dp.js:252:23
-         const isInCut = phaseOverride === 'CUT' ||
+         const isInCut = false ||

[NoCoverage] EqualityOperator
src/engine/dp.js:252:23
-         const isInCut = phaseOverride === 'CUT' ||
+         const isInCut = phaseOverride !== 'CUT' ||

[NoCoverage] ConditionalExpression
src/engine/dp.js:253:10
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (false);

[NoCoverage] LogicalOperator
src/engine/dp.js:253:10
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (phaseOverride === 'AUTO' || new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:253:10
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (true && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:253:10
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (phaseOverride !== 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:253:38
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (phaseOverride === 'AUTO' && true);

[NoCoverage] EqualityOperator
src/engine/dp.js:253:38
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (phaseOverride === 'AUTO' && new Date() <= TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:253:38
-           (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+           (phaseOverride === 'AUTO' && new Date() >= TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:254:11
-         if (isInCut) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/dp.js:254:11
-         if (isInCut) {
+         if (false) {

[NoCoverage] BlockStatement
src/engine/dp.js:254:20
-         if (isInCut) {
-           return {
-             kg: lastW, repsTarget: rMax, rir: 2,
-             status: 'MAINTAIN',
-             statusColor: 'var(--accent)',
-             statusLabel: '🟡 Consolidare în definire',
-             progressionNote: `Stagnare 3 sesiuni la ${lastW} kg · În definire prioritizăm calitatea, nu greutatea`,
-             progressionStage: 3
-           };
-         }
+         if (isInCut) {}

[NoCoverage] ObjectLiteral
src/engine/dp.js:255:16
-           return {
-             kg: lastW, repsTarget: rMax, rir: 2,
-             status: 'MAINTAIN',
-             statusColor: 'var(--accent)',
-             statusLabel: '🟡 Consolidare în definire',
-             progressionNote: `Stagnare 3 sesiuni la ${lastW} kg · În definire prioritizăm calitatea, nu greutatea`,
-             progressionStage: 3
-           };
+           return {};

[NoCoverage] ObjectLiteral
src/engine/dp.js:264:14
-         return {
-           kg: lastW, repsTarget: rMax, rir: 1,
-           status: 'TECHNIQUE',
-           statusColor: 'var(--purple)',
-           statusLabel: '🟡 Drop set la final',
-           progressionNote: `Stagnare lungă · Drop set pe ultimul: −30% greutate pentru a sparge platoul`,
-           progressionStage: 4,
-           technique: 'DROP SET'
-         };
+         return {};

[NoCoverage] ObjectLiteral
src/engine/dp.js:276:12
-       return {
-         kg: lastW, repsTarget: Math.min(rMax, lastReps + 1), rir: 2,
-         status: 'ON TARGET',
-         statusColor: 'var(--green)',
-         statusLabel: '🟢 În țintă',
-         progressionNote: `Ultima: ${lastW} kg × ${lastReps} reps`,
-         progressionStage: 0
-       };
+       return {};

[NoCoverage] MethodExpression
src/engine/dp.js:277:30
-         kg: lastW, repsTarget: Math.min(rMax, lastReps + 1), rir: 2,
+         kg: lastW, repsTarget: Math.max(rMax, lastReps + 1), rir: 2,

[NoCoverage] ArithmeticOperator
src/engine/dp.js:277:45
-         kg: lastW, repsTarget: Math.min(rMax, lastReps + 1), rir: 2,
+         kg: lastW, repsTarget: Math.min(rMax, lastReps - 1), rir: 2,

[NoCoverage] ConditionalExpression
src/engine/dp.js:291:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (false);

[NoCoverage] LogicalOperator
src/engine/dp.js:291:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' || new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:291:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (true && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:291:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv !== 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:291:57
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && true);

[NoCoverage] EqualityOperator
src/engine/dp.js:291:57
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() <= TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:291:57
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() >= TARGET_DATE);

[NoCoverage] BlockStatement
src/engine/dp.js:315:20
-     getRepsRange(ex) {
-       const phOv = DB.get('phase-override') || 'AUTO';
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
-       return this.getPhaseAwareRepRange(ex, inCut);
-     },
+     getRepsRange(ex) {},

[NoCoverage] ConditionalExpression
src/engine/dp.js:316:18
-       const phOv = DB.get('phase-override') || 'AUTO';
+       const phOv = true;

[NoCoverage] ConditionalExpression
src/engine/dp.js:316:18
-       const phOv = DB.get('phase-override') || 'AUTO';
+       const phOv = false;

[NoCoverage] LogicalOperator
src/engine/dp.js:316:18
-       const phOv = DB.get('phase-override') || 'AUTO';
+       const phOv = DB.get('phase-override') && 'AUTO';

[NoCoverage] ConditionalExpression
src/engine/dp.js:317:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = true;

[NoCoverage] ConditionalExpression
src/engine/dp.js:317:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = false;

[NoCoverage] LogicalOperator
src/engine/dp.js:317:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' && phOv === 'AUTO' && new Date() < TARGET_DATE;

[NoCoverage] ConditionalExpression
src/engine/dp.js:317:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = false || (phOv === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:317:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv !== 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:317:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (false);

[NoCoverage] LogicalOperator
src/engine/dp.js:317:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' || new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:317:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (true && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:317:38
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv !== 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/dp.js:317:57
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && true);

[NoCoverage] EqualityOperator
src/engine/dp.js:317:57
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() <= TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/dp.js:317:57
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() >= TARGET_DATE);

[NoCoverage] BlockStatement
src/engine/dp.js:334:88
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
-         result.kg = this.getState(ex).lastW;
-         result.status = 'CONSOLIDATE';
-         result.statusLabel = '🟡 Consolidăm reps';
-         result.statusColor = 'var(--accent)';
-         result.progressionNote = `Recuperare incompletă · Menținem ${result.kg} kg azi`;
-       }
+       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {}

[NoCoverage] ArrayDeclaration
src/engine/dp.js:360:49
-     const recentLogs = (ctx && ctx.recentLogs) || [];
+     const recentLogs = (ctx && ctx.recentLogs) || ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/engine/dp.js:418:34
-       const logs = session.logs || [];
+       const logs = session.logs || ["Stryker was here"];

[Survived] ArrayDeclaration
src/engine/dp.js:92:42
-       const range = this.REP_RANGES[ex] || [8, 12];
+       const range = this.REP_RANGES[ex] || [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 19 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:95:9
-       if (rMax > 10 && rMax <= 15 && !COMPOUND_EX.includes(ex)) return [Math.min(rMin, 10), 10];
+       if (true && rMax <= 15 && !COMPOUND_EX.includes(ex)) return [Math.min(rMin, 10), 10];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 38 more tests!

[Survived] EqualityOperator
src/engine/dp.js:95:9
-       if (rMax > 10 && rMax <= 15 && !COMPOUND_EX.includes(ex)) return [Math.min(rMin, 10), 10];
+       if (rMax >= 10 && rMax <= 15 && !COMPOUND_EX.includes(ex)) return [Math.min(rMin, 10), 10];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 38 more tests!

[Survived] BlockStatement
src/engine/dp.js:99:20
-     getIncrement(ex) {
-       // Incrementul = 1 treaptă pe echipamentul exercițiului
-       return this.WEIGHT_STEPS[ex] || (COMPOUND_EX.includes(ex) ? 2.5 : 2.5);
-     },
+     getIncrement(ex) {},
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:101:12
-       return this.WEIGHT_STEPS[ex] || (COMPOUND_EX.includes(ex) ? 2.5 : 2.5);
+       return false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:101:12
-       return this.WEIGHT_STEPS[ex] || (COMPOUND_EX.includes(ex) ? 2.5 : 2.5);
+       return true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] LogicalOperator
src/engine/dp.js:101:12
-       return this.WEIGHT_STEPS[ex] || (COMPOUND_EX.includes(ex) ? 2.5 : 2.5);
+       return this.WEIGHT_STEPS[ex] && (COMPOUND_EX.includes(ex) ? 2.5 : 2.5);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 35 more tests!

[Survived] ArrayDeclaration
src/engine/dp.js:106:36
-       const logs = DB.get('logs') || [];
+       const logs = DB.get('logs') || ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
    CoachDirector — CUT phase logic should cap reps at 10 in CUT phase
  and 18 more tests!

[Survived] LogicalOperator
src/engine/dp.js:106:18
-       const logs = DB.get('logs') || [];
+       const logs = DB.get('logs') && [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] MethodExpression
src/engine/dp.js:107:12
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(l => l.ex === ex && l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] MethodExpression
src/engine/dp.js:107:12
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!
