[Survived] ArrowFunction
src/engine/dp.js:107:24
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(() => undefined).slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:107:29
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(l => true).slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:107:29
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(l => false).slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] LogicalOperator
src/engine/dp.js:107:29
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(l => l.ex === ex || l.w).slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] BooleanLiteral
src/engine/dp.js:113:9
-       if (!logs.length) return { stage:'INIT', level:0, logs:[] };
+       if (logs.length) return { stage:'INIT', level:0, logs:[] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:113:9
-       if (!logs.length) return { stage:'INIT', level:0, logs:[] };
+       if (true) return { stage:'INIT', level:0, logs:[] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:107:29
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(l => true && l.w).slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:113:9
-       if (!logs.length) return { stage:'INIT', level:0, logs:[] };
+       if (false) return { stage:'INIT', level:0, logs:[] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:107:29
-       return logs.filter(l => l.ex === ex && l.w).slice(0, n);
+       return logs.filter(l => l.ex !== ex && l.w).slice(0, n);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ObjectLiteral
src/engine/dp.js:113:30
-       if (!logs.length) return { stage:'INIT', level:0, logs:[] };
+       if (!logs.length) return {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:115:19
-       const range = this.REP_RANGES[ex] || [8,12];
+       const range = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:115:19
-       const range = this.REP_RANGES[ex] || [8,12];
+       const range = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:115:19
-       const range = this.REP_RANGES[ex] || [8,12];
+       const range = this.REP_RANGES[ex] && [8, 12];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:118:22
-       const lastReps = parseInt(logs[0].reps) || rMin;
+       const lastReps = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:118:22
-       const lastReps = parseInt(logs[0].reps) || rMin;
+       const lastReps = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:118:22
-       const lastReps = parseInt(logs[0].reps) || rMin;
+       const lastReps = parseInt(logs[0].reps) && rMin;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:119:21
-       const lastRPE = logs[0].rpe || 7;
+       const lastRPE = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:119:21
-       const lastRPE = logs[0].rpe || 7;
+       const lastRPE = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:119:21
-       const lastRPE = logs[0].rpe || 7;
+       const lastRPE = logs[0].rpe && 7;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] MethodExpression
src/engine/dp.js:122:20
-       const last3W = logs.slice(0,3).map(l=>l.w);
+       const last3W = logs.map(l=>l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ArrowFunction
src/engine/dp.js:122:40
-       const last3W = logs.slice(0,3).map(l=>l.w);
+       const last3W = logs.slice(0,3).map(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:123:24
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:123:24
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:123:24
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length >= 3 || last3W.every(w => w === last3W[0]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:123:24
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = true && last3W.every(w => w === last3W[0]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/dp.js:123:24
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length > 3 && last3W.every(w => w === last3W[0]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/dp.js:123:24
-       const isStagnant = last3W.length >= 3 && last3W.every(w => w === last3W[0]);
+       const isStagnant = last3W.length < 3 && last3W.every(w => w === last3W[0]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] MethodExpression
src/engine/dp.js:126:23
-       const last3Reps = logs.slice(0,3).map(l=>parseInt(l.reps)||rMin);
+       const last3Reps = logs.map(l=>parseInt(l.reps)||rMin);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ArrowFunction
src/engine/dp.js:126:43
-       const last3Reps = logs.slice(0,3).map(l=>parseInt(l.reps)||rMin);
+       const last3Reps = logs.slice(0,3).map(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:126:46
-       const last3Reps = logs.slice(0,3).map(l=>parseInt(l.reps)||rMin);
+       const last3Reps = logs.slice(0,3).map(l=>true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:126:46
-       const last3Reps = logs.slice(0,3).map(l=>parseInt(l.reps)||rMin);
+       const last3Reps = logs.slice(0,3).map(l=>false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:126:46
-       const last3Reps = logs.slice(0,3).map(l=>parseInt(l.reps)||rMin);
+       const last3Reps = logs.slice(0,3).map(l=>parseInt(l.reps) && rMin);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] MethodExpression
src/engine/dp.js:127:23
-       const atTopReps = last3Reps.every(r => r >= rMax);
+       const atTopReps = last3Reps.some(r => r >= rMax);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ArrowFunction
src/engine/dp.js:127:39
-       const atTopReps = last3Reps.every(r => r >= rMax);
+       const atTopReps = last3Reps.every(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:127:44
-       const atTopReps = last3Reps.every(r => r >= rMax);
+       const atTopReps = last3Reps.every(r => true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:127:44
-       const atTopReps = last3Reps.every(r => r >= rMax);
+       const atTopReps = last3Reps.every(r => false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/dp.js:127:44
-       const atTopReps = last3Reps.every(r => r >= rMax);
+       const atTopReps = last3Reps.every(r => r > rMax);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/dp.js:127:44
-       const atTopReps = last3Reps.every(r => r >= rMax);
+       const atTopReps = last3Reps.every(r => r < rMax);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:130:25
-       const currentSets = EX_SETS[ex] || 3;
+       const currentSets = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:130:25
-       const currentSets = EX_SETS[ex] || 3;
+       const currentSets = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:130:25
-       const currentSets = EX_SETS[ex] || 3;
+       const currentSets = EX_SETS[ex] && 3;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:131:23
-       const extraSets = DB.get(`ex-extra-sets-${ex}`) || 0;
+       const extraSets = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:131:23
-       const extraSets = DB.get(`ex-extra-sets-${ex}`) || 0;
+       const extraSets = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] LogicalOperator
src/engine/dp.js:131:23
-       const extraSets = DB.get(`ex-extra-sets-${ex}`) || 0;
+       const extraSets = DB.get(`ex-extra-sets-${ex}`) && 0;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ObjectLiteral
src/engine/dp.js:133:12
-       return {
-         lastW, lastReps, lastRPE, isStagnant, atTopReps,
-         range, rMin, rMax, currentSets, extraSets,
-         logs
-       };
+       return {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:144:9
-       if (result && result.kg) result.kg = this.roundToStep(result.kg, ex);
+       if (true) result.kg = this.roundToStep(result.kg, ex);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:144:9
-       if (result && result.kg) result.kg = this.roundToStep(result.kg, ex);
+       if (false) result.kg = this.roundToStep(result.kg, ex);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/dp.js:144:9
-       if (result && result.kg) result.kg = this.roundToStep(result.kg, ex);
+       if (result || result.kg) result.kg = this.roundToStep(result.kg, ex);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/dp.js:151:27
-       const phaseOverride = DB.get('phase-override') || 'AUTO';
+       const phaseOverride = DB.get('phase-override') && 'AUTO';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:152:21
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:152:49
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/dp.js:152:49
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' || new Date() < TARGET_DATE);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:152:49
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (phaseOverride !== 'AUTO' && new Date() < TARGET_DATE);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:152:49
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (true && new Date() < TARGET_DATE);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:152:77
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:152:77
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() <= TARGET_DATE);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:152:77
-       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() < TARGET_DATE);
+       const isInCut = phaseOverride === 'CUT' || (phaseOverride === 'AUTO' && new Date() >= TARGET_DATE);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:155:19
-       const maxKg = this.MAX_KG[ex] || null;
+       const maxKg = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] LogicalOperator
src/engine/dp.js:155:19
-       const maxKg = this.MAX_KG[ex] || null;
+       const maxKg = this.MAX_KG[ex] && null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:156:25
-       const capStrategy = this.WEIGHT_CAP_STRATEGY[ex] || null;
+       const capStrategy = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:156:25
-       const capStrategy = this.WEIGHT_CAP_STRATEGY[ex] || null;
+       const capStrategy = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] LogicalOperator
src/engine/dp.js:156:25
-       const capStrategy = this.WEIGHT_CAP_STRATEGY[ex] || null;
+       const capStrategy = this.WEIGHT_CAP_STRATEGY[ex] && null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:173:9
-       if (lastReps < Math.ceil(rMin * 0.5)) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
  and 2 more tests!

[Survived] EqualityOperator
src/engine/dp.js:173:9
-       if (lastReps < Math.ceil(rMin * 0.5)) {
+       if (lastReps <= Math.ceil(rMin * 0.5)) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:185:9
-       if (maxKg && lastW >= maxKg) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
  and 2 more tests!

[Survived] EqualityOperator
src/engine/dp.js:185:18
-       if (maxKg && lastW >= maxKg) {
+       if (maxKg && lastW > maxKg) {
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:210:9
-       if (lastRPE >= 9 || lastReps < rMax) {
+       if (false || lastReps < rMax) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
  and 2 more tests!

[Survived] EqualityOperator
src/engine/dp.js:210:9
-       if (lastRPE >= 9 || lastReps < rMax) {
+       if (lastRPE > 9 || lastReps < rMax) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
  and 2 more tests!

[Survived] MethodExpression
src/engine/dp.js:211:26
-         const targetReps = Math.min(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
+         const targetReps = Math.max(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ArithmeticOperator
src/engine/dp.js:211:41
-         const targetReps = Math.min(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
+         const targetReps = Math.min(rMax, lastReps - (lastRPE <= 7 ? 2 : 1));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)
