[Survived] ConditionalExpression
src/engine/dp.js:211:53
-         const targetReps = Math.min(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
+         const targetReps = Math.min(rMax, lastReps + (true ? 2 : 1));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:211:53
-         const targetReps = Math.min(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
+         const targetReps = Math.min(rMax, lastReps + (false ? 2 : 1));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:211:53
-         const targetReps = Math.min(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
+         const targetReps = Math.min(rMax, lastReps + (lastRPE < 7 ? 2 : 1));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:211:53
-         const targetReps = Math.min(rMax, lastReps + (lastRPE <= 7 ? 2 : 1));
+         const targetReps = Math.min(rMax, lastReps + (lastRPE > 7 ? 2 : 1));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:213:49
-           kg: lastW, repsTarget: targetReps, rir: lastRPE >= 9 ? 1 : 2,
+           kg: lastW, repsTarget: targetReps, rir: true ? 1 : 2,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:213:49
-           kg: lastW, repsTarget: targetReps, rir: lastRPE >= 9 ? 1 : 2,
+           kg: lastW, repsTarget: targetReps, rir: false ? 1 : 2,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:213:49
-           kg: lastW, repsTarget: targetReps, rir: lastRPE >= 9 ? 1 : 2,
+           kg: lastW, repsTarget: targetReps, rir: lastRPE > 9 ? 1 : 2,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:213:49
-           kg: lastW, repsTarget: targetReps, rir: lastRPE >= 9 ? 1 : 2,
+           kg: lastW, repsTarget: targetReps, rir: lastRPE < 9 ? 1 : 2,
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:214:17
-           status: lastRPE >= 9 ? 'TOO HEAVY' : 'CONSOLIDATE',
+           status: false ? 'TOO HEAVY' : 'CONSOLIDATE',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:214:17
-           status: lastRPE >= 9 ? 'TOO HEAVY' : 'CONSOLIDATE',
+           status: lastRPE > 9 ? 'TOO HEAVY' : 'CONSOLIDATE',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:215:22
-           statusColor: lastRPE >= 9 ? 'var(--red)' : 'var(--accent)',
+           statusColor: true ? 'var(--red)' : 'var(--accent)',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:215:22
-           statusColor: lastRPE >= 9 ? 'var(--red)' : 'var(--accent)',
+           statusColor: false ? 'var(--red)' : 'var(--accent)',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:215:22
-           statusColor: lastRPE >= 9 ? 'var(--red)' : 'var(--accent)',
+           statusColor: lastRPE > 9 ? 'var(--red)' : 'var(--accent)',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:215:22
-           statusColor: lastRPE >= 9 ? 'var(--red)' : 'var(--accent)',
+           statusColor: lastRPE < 9 ? 'var(--red)' : 'var(--accent)',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:223:9
-       if (atTopReps && lastRPE <= 8) {
+       if (true) {
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] ConditionalExpression
src/engine/dp.js:216:22
-           statusLabel: lastRPE >= 9 ? '🔴 E prea greu' : '🟡 Consolidăm reps',
+           statusLabel: true ? '🔴 E prea greu' : '🟡 Consolidăm reps',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] ConditionalExpression
src/engine/dp.js:216:22
-           statusLabel: lastRPE >= 9 ? '🔴 E prea greu' : '🟡 Consolidăm reps',
+           statusLabel: false ? '🔴 E prea greu' : '🟡 Consolidăm reps',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:216:22
-           statusLabel: lastRPE >= 9 ? '🔴 E prea greu' : '🟡 Consolidăm reps',
+           statusLabel: lastRPE > 9 ? '🔴 E prea greu' : '🟡 Consolidăm reps',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] EqualityOperator
src/engine/dp.js:216:22
-           statusLabel: lastRPE >= 9 ? '🔴 E prea greu' : '🟡 Consolidăm reps',
+           statusLabel: lastRPE < 9 ? '🔴 E prea greu' : '🟡 Consolidăm reps',
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 8 reps consolidates up to 10 (capped by rMax=10)

[Survived] LogicalOperator
src/engine/dp.js:223:9
-       if (atTopReps && lastRPE <= 8) {
+       if (atTopReps || lastRPE <= 8) {
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] ConditionalExpression
src/engine/dp.js:223:22
-       if (atTopReps && lastRPE <= 8) {
+       if (atTopReps && true) {
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] EqualityOperator
src/engine/dp.js:223:22
-       if (atTopReps && lastRPE <= 8) {
+       if (atTopReps && lastRPE < 8) {
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] ArithmeticOperator
src/engine/dp.js:224:21
-         const newKg = Math.round((lastW + inc) * 2) / 2;
+         const newKg = Math.round((lastW + inc) * 2) * 2;
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] ArithmeticOperator
src/engine/dp.js:224:32
-         const newKg = Math.round((lastW + inc) * 2) / 2;
+         const newKg = Math.round((lastW + inc) / 2) / 2;
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] ArithmeticOperator
src/engine/dp.js:224:33
-         const newKg = Math.round((lastW + inc) * 2) / 2;
+         const newKg = Math.round((lastW - inc) * 2) / 2;
Tests ran:
    DP._recommendRaw — CUT phase progression in CUT: Cable Curl at 10 reps × 3 sessions triggers INCREASE weight (not CONSOLIDATE reps)
    DP._recommendRaw — CUT phase progression in CUT: Lat Pulldown (compound) keeps [8, 12] range unaffected

[Survived] ConditionalExpression
src/engine/dp.js:290:18
-       const phOv = DB.get('phase-override') || 'AUTO';
+       const phOv = true;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:290:18
-       const phOv = DB.get('phase-override') || 'AUTO';
+       const phOv = false;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] LogicalOperator
src/engine/dp.js:290:18
-       const phOv = DB.get('phase-override') || 'AUTO';
+       const phOv = DB.get('phase-override') && 'AUTO';
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:291:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = true;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:291:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = false;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] LogicalOperator
src/engine/dp.js:291:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv === 'CUT' && phOv === 'AUTO' && new Date() < TARGET_DATE;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:291:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = false || (phOv === 'AUTO' && new Date() < TARGET_DATE);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] EqualityOperator
src/engine/dp.js:291:19
-       const inCut = phOv === 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
+       const inCut = phOv !== 'CUT' || (phOv === 'AUTO' && new Date() < TARGET_DATE);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 5 more tests!

[Survived] MethodExpression
src/engine/dp.js:299:35
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r >= 10)) {
+       if (recentRPEs.length >= 2 && recentRPEs.every(r => r >= 10)) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on 2× Very Hard (RPE 10)
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds drops weight on mixed [10, 10] regardless of reps
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:304:9
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
+       if (true) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps
  and 2 more tests!

[Survived] LogicalOperator
src/engine/dp.js:304:9
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
+       if (recentRPEs.length >= 2 || recentRPEs.slice(0, 2).every(r => r <= 6.5)) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:304:9
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
+       if (true && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps
  and 2 more tests!

[Survived] MethodExpression
src/engine/dp.js:304:35
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
+       if (recentRPEs.length >= 2 && recentRPEs.slice(0, 2).some(r => r <= 6.5)) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps
  and 1 more test!

[Survived] MethodExpression
src/engine/dp.js:304:35
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
+       if (recentRPEs.length >= 2 && recentRPEs.every(r => r <= 6.5)) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps
  and 1 more test!

[Survived] ConditionalExpression
src/engine/dp.js:304:68
-       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => r <= 6.5)) {
+       if (recentRPEs.length >= 2 && recentRPEs.slice(0,2).every(r => true)) {
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT drop weight on 2× Hard (RPE 9)
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps
  and 1 more test!

[Survived] ConditionalExpression
src/engine/dp.js:305:24
-         const lastReps = recentReps && recentReps.length ? Math.max(...recentReps.slice(0,2)) : 0;
+         const lastReps = true ? Math.max(...recentReps.slice(0,2)) : 0;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps

[Survived] MethodExpression
src/engine/dp.js:305:58
-         const lastReps = recentReps && recentReps.length ? Math.max(...recentReps.slice(0,2)) : 0;
+         const lastReps = recentReps && recentReps.length ? Math.min(...recentReps.slice(0, 2)) : 0;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps

[Survived] LogicalOperator
src/engine/dp.js:305:24
-         const lastReps = recentReps && recentReps.length ? Math.max(...recentReps.slice(0,2)) : 0;
+         const lastReps = recentReps || recentReps.length ? Math.max(...recentReps.slice(0,2)) : 0;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps

[Survived] MethodExpression
src/engine/dp.js:305:70
-         const lastReps = recentReps && recentReps.length ? Math.max(...recentReps.slice(0,2)) : 0;
+         const lastReps = recentReps && recentReps.length ? Math.max(...recentReps) : 0;
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps
    DP.checkInSessionAdjust — RPE 4-tap thresholds does NOT up weight on 2× Easy (RPE 6.5) with sub-max reps

[Survived] ArithmeticOperator
src/engine/dp.js:307:40
-           const newKg = this.roundToStep(dpState.lastW + inc, ex);
+           const newKg = this.roundToStep(dpState.lastW - inc, ex);
Tests ran:
    DP.checkInSessionAdjust — RPE 4-tap thresholds ups weight on 2× Easy (RPE 6.5) with max reps

[Survived] BlockStatement
src/engine/dp.js:328:59
-     getSmartRecommendation(ex, readinessScore, muscleState) {
-       const base = this.recommend(ex);
-       let result = { ...base };
-       result.intensityLabel = this.getIntensityLabel(result.rir ?? 2);
-   
-       // Readiness check: don't increase if tired
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
-         result.kg = this.getState(ex).lastW;
-         result.status = 'CONSOLIDATE';
-         result.statusLabel = '🟡 Consolidăm reps';
-         result.statusColor = 'var(--accent)';
-         result.progressionNote = `Recuperare incompletă · Menținem ${result.kg} kg azi`;
-       }
-   
-       // Rep range instead of fixed — phase-aware (CUT caps isolation to 10)
-       const phOv2 = DB.get('phase-override') || 'AUTO';
-       const inCut2 = phOv2 === 'CUT' || (phOv2 === 'AUTO' && new Date() < TARGET_DATE);
-       const range = this.getPhaseAwareRepRange(ex, inCut2);
-       const [rMin, rMax] = range;
-       const rTarget = result.repsTarget || rMin;
-       const rLow = Math.max(rMin, rTarget - 1);
-       const rHigh = Math.min(rMax + 2, rTarget + 1);
-       result.repsRange = `${rLow}–${rHigh}`;
-   
-       return result;
-     }
+     getSmartRecommendation(ex, readinessScore, muscleState) {}
Tests ran:

[Survived] LogicalOperator
src/engine/dp.js:331:52
-       result.intensityLabel = this.getIntensityLabel(result.rir ?? 2);
+       result.intensityLabel = this.getIntensityLabel(result.rir && 2);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:334:9
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/dp.js:334:9
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null && readinessScore < 60 || result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:334:9
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (true && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/dp.js:334:9
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null || readinessScore < 60 && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:334:9
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (true && readinessScore < 60 && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:334:9
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore == null && readinessScore < 60 && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:334:35
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null && true && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:334:35
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null && readinessScore <= 60 && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/dp.js:334:35
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null && readinessScore >= 60 && result.status === 'INCREASE') {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:334:58
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null && readinessScore < 60 && true) {
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/dp.js:334:58
-       if (readinessScore != null && readinessScore < 60 && result.status === 'INCREASE') {
+       if (readinessScore != null && readinessScore < 60 && result.status !== 'INCREASE') {
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/dp.js:343:19
-       const phOv2 = DB.get('phase-override') || 'AUTO';
+       const phOv2 = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/dp.js:343:19
-       const phOv2 = DB.get('phase-override') || 'AUTO';
+       const phOv2 = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!
