[NoCoverage] ConditionalExpression
src/engine/fatigue.js:29:42
-     const strong    = allNotes.filter(n => n === 'strong').length;
+     const strong    = allNotes.filter(n => true).length;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:29:42
-     const strong    = allNotes.filter(n => n === 'strong').length;
+     const strong    = allNotes.filter(n => false).length;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:29:42
-     const strong    = allNotes.filter(n => n === 'strong').length;
+     const strong    = allNotes.filter(n => n !== 'strong').length;

[NoCoverage] BlockStatement
src/engine/fatigue.js:32:38
-     const sessionRPEs = last4.map(s => {
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
-       return rpes.length ? rpes.reduce((a,b)=>a+b,0)/rpes.length : 7;
-     });
+     const sessionRPEs = last4.map(s => {});

[NoCoverage] MethodExpression
src/engine/fatigue.js:33:18
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.filter(l => l.rpe).map(l => l.rpe).sort((a, b) => b - a);

[NoCoverage] MethodExpression
src/engine/fatigue.js:33:18
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.filter(l => l.rpe).map(l => l.rpe).slice(0,2);

[NoCoverage] MethodExpression
src/engine/fatigue.js:33:18
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);

[NoCoverage] ArrowFunction
src/engine/fatigue.js:33:27
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.filter(() => undefined).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);

[NoCoverage] ArrowFunction
src/engine/fatigue.js:33:41
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.filter(l=>l.rpe).map(() => undefined).sort((a,b)=>b-a).slice(0,2);

[NoCoverage] ArrowFunction
src/engine/fatigue.js:33:56
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort(() => undefined).slice(0,2);

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:33:63
-       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b-a).slice(0,2);
+       const rpes = s.filter(l=>l.rpe).map(l=>l.rpe).sort((a,b)=>b + a).slice(0,2);

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:34:26
-       return rpes.length ? rpes.reduce((a,b)=>a+b,0)/rpes.length : 7;
+       return rpes.length ? rpes.reduce((a, b) => a + b, 0) * rpes.length : 7;

[NoCoverage] ArrowFunction
src/engine/fatigue.js:34:38
-       return rpes.length ? rpes.reduce((a,b)=>a+b,0)/rpes.length : 7;
+       return rpes.length ? rpes.reduce(() => undefined,0)/rpes.length : 7;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:34:45
-       return rpes.length ? rpes.reduce((a,b)=>a+b,0)/rpes.length : 7;
+       return rpes.length ? rpes.reduce((a,b)=>a - b,0)/rpes.length : 7;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:36:18
-     const avgRPE = sessionRPEs.reduce((a,b)=>a+b,0) / sessionRPEs.length;
+     const avgRPE = sessionRPEs.reduce((a, b) => a + b, 0) * sessionRPEs.length;

[NoCoverage] ArrowFunction
src/engine/fatigue.js:36:37
-     const avgRPE = sessionRPEs.reduce((a,b)=>a+b,0) / sessionRPEs.length;
+     const avgRPE = sessionRPEs.reduce(() => undefined,0) / sessionRPEs.length;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:36:44
-     const avgRPE = sessionRPEs.reduce((a,b)=>a+b,0) / sessionRPEs.length;
+     const avgRPE = sessionRPEs.reduce((a,b)=>a - b,0) / sessionRPEs.length;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:37:21
-     const rpeRising = sessionRPEs.length >= 3 &&
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+     const rpeRising = true;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:37:21
-     const rpeRising = sessionRPEs.length >= 3 &&
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+     const rpeRising = false;

[NoCoverage] LogicalOperator
src/engine/fatigue.js:37:21
-     const rpeRising = sessionRPEs.length >= 3 &&
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+     const rpeRising = sessionRPEs.length >= 3 || sessionRPEs[0] > sessionRPEs[sessionRPEs.length - 1] + 0.6;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:37:21
-     const rpeRising = sessionRPEs.length >= 3 &&
+     const rpeRising = true &&

[NoCoverage] EqualityOperator
src/engine/fatigue.js:37:21
-     const rpeRising = sessionRPEs.length >= 3 &&
+     const rpeRising = sessionRPEs.length > 3 &&

[NoCoverage] EqualityOperator
src/engine/fatigue.js:37:21
-     const rpeRising = sessionRPEs.length >= 3 &&
+     const rpeRising = sessionRPEs.length < 3 &&

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:38:5
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+       true;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:38:5
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+       sessionRPEs[0] >= sessionRPEs[sessionRPEs.length - 1] + 0.6;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:38:5
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+       sessionRPEs[0] <= sessionRPEs[sessionRPEs.length - 1] + 0.6;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:38:22
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+       sessionRPEs[0] > sessionRPEs[sessionRPEs.length - 1] - 0.6;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:38:34
-       sessionRPEs[0] > sessionRPEs[sessionRPEs.length-1] + 0.6;
+       sessionRPEs[0] > sessionRPEs[sessionRPEs.length + 1] + 0.6;

[NoCoverage] MethodExpression
src/engine/fatigue.js:41:23
-     const recentDates = Object.keys(wb).sort().reverse().slice(0, 4);
+     const recentDates = Object.keys(wb).sort().reverse();

[NoCoverage] MethodExpression
src/engine/fatigue.js:41:23
-     const recentDates = Object.keys(wb).sort().reverse().slice(0, 4);
+     const recentDates = Object.keys(wb).sort().slice(0, 4);

[NoCoverage] MethodExpression
src/engine/fatigue.js:41:23
-     const recentDates = Object.keys(wb).sort().reverse().slice(0, 4);
+     const recentDates = Object.keys(wb).reverse().slice(0, 4);

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:43:7
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce((a, d) => a + (wb[d]?.sleep || 3), 0) * recentDates.length

[NoCoverage] ArrowFunction
src/engine/fatigue.js:43:26
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce(() => undefined, 0) / recentDates.length

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:43:35
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce((a,d) => a - (wb[d]?.sleep || 3), 0) / recentDates.length

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:43:40
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce((a,d) => a + (true), 0) / recentDates.length

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:43:40
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce((a,d) => a + (false), 0) / recentDates.length

[NoCoverage] LogicalOperator
src/engine/fatigue.js:43:40
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep && 3), 0) / recentDates.length

[NoCoverage] OptionalChaining
src/engine/fatigue.js:43:40
-       ? recentDates.reduce((a,d) => a + (wb[d]?.sleep || 3), 0) / recentDates.length
+       ? recentDates.reduce((a,d) => a + (wb[d].sleep || 3), 0) / recentDates.length

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:48:3
-     score += sleepBad  * 13;
+     score -= sleepBad * 13;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:48:12
-     score += sleepBad  * 13;
+     score += sleepBad / 13;

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:49:3
-     score += fatigue   * 11;
+     score -= fatigue * 11;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:49:12
-     score += fatigue   * 11;
+     score += fatigue / 11;

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:50:3
-     score += formBad   * 7;
+     score -= formBad * 7;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:50:12
-     score += formBad   * 7;
+     score += formBad / 7;

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:51:3
-     score -= strong    * 9;
+     score += strong * 9;

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:51:12
-     score -= strong    * 9;
+     score -= strong / 9;

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:52:3
-     score += Math.max(0, (avgRPE - 7.5) * 11);
+     score -= Math.max(0, (avgRPE - 7.5) * 11);

[NoCoverage] MethodExpression
src/engine/fatigue.js:52:12
-     score += Math.max(0, (avgRPE - 7.5) * 11);
+     score += Math.min(0, (avgRPE - 7.5) * 11);

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:52:24
-     score += Math.max(0, (avgRPE - 7.5) * 11);
+     score += Math.max(0, (avgRPE - 7.5) / 11);

[NoCoverage] ArithmeticOperator
src/engine/fatigue.js:52:25
-     score += Math.max(0, (avgRPE - 7.5) * 11);
+     score += Math.max(0, (avgRPE + 7.5) * 11);

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:53:3
-     score += rpeRising ? 12 : 0;
+     score -= rpeRising ? 12 : 0;

[NoCoverage] AssignmentOperator
src/engine/fatigue.js:54:3
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score -= avgSleep <= 2.5 ? 18 : avgSleep <= 3.5 ? 7 : 0;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:54:13
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (true) ? 18 : (avgSleep <= 3.5) ? 7 : 0;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:54:13
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (false) ? 18 : (avgSleep <= 3.5) ? 7 : 0;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:54:13
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (avgSleep < 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:54:13
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (avgSleep > 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:54:38
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (avgSleep <= 2.5) ? 18 : (true) ? 7 : 0;

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:54:38
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (avgSleep <= 2.5) ? 18 : (false) ? 7 : 0;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:54:38
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (avgSleep <= 2.5) ? 18 : (avgSleep < 3.5) ? 7 : 0;

[NoCoverage] EqualityOperator
src/engine/fatigue.js:54:38
-     score += (avgSleep <= 2.5) ? 18 : (avgSleep <= 3.5) ? 7 : 0;
+     score += (avgSleep <= 2.5) ? 18 : (avgSleep > 3.5) ? 7 : 0;

[NoCoverage] MethodExpression
src/engine/fatigue.js:55:11
-     score = Math.max(0, Math.min(100, Math.round(score)));
+     score = Math.min(0, Math.min(100, Math.round(score)));

[NoCoverage] MethodExpression
src/engine/fatigue.js:55:23
-     score = Math.max(0, Math.min(100, Math.round(score)));
+     score = Math.max(0, Math.max(100, Math.round(score)));

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if ((score >= 65 || fatigue >= 4) && sleepBad >= 3) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (false || sleepBad >= 3) {

[NoCoverage] LogicalOperator
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 && fatigue >= 4 || sleepBad >= 3) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (false || fatigue >= 4 || sleepBad >= 3) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score > 65 || fatigue >= 4 || sleepBad >= 3) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:60:7
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score < 65 || fatigue >= 4 || sleepBad >= 3) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:60:22
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 || false || sleepBad >= 3) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:60:22
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 || fatigue > 4 || sleepBad >= 3) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:60:22
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 || fatigue < 4 || sleepBad >= 3) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:60:38
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 || fatigue >= 4 || false) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:60:38
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 || fatigue >= 4 || sleepBad > 3) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:60:38
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
+     if (score >= 65 || fatigue >= 4 || sleepBad < 3) {

[NoCoverage] BlockStatement
src/engine/fatigue.js:60:53
-     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {
-       key = 'HIGH_FATIGUE';
-       label = 'Azi mergem mai blând';
-       icon = '🔴';
-       color = 'var(--red)';
-       recommend = 'deload';
-       detail = 'Au fost câteva sesiuni grele recent. Volumul este calibrat mai conservator pentru o recuperare completă.';
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     if (score >= 65 || fatigue >= 4 || sleepBad >= 3) {} else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:67:14
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (true) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:67:14
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (false) {

[NoCoverage] LogicalOperator
src/engine/fatigue.js:67:14
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score >= 40 && avgRPE >= 8.7 && rpeRising) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:67:14
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (false || (avgRPE >= 8.7 && rpeRising)) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:67:14
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score > 40 || (avgRPE >= 8.7 && rpeRising)) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:67:14
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score < 40 || (avgRPE >= 8.7 && rpeRising)) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:67:30
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score >= 40 || (false)) {

[NoCoverage] LogicalOperator
src/engine/fatigue.js:67:30
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score >= 40 || (avgRPE >= 8.7 || rpeRising)) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:67:30
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score >= 40 || (true && rpeRising)) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:67:30
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score >= 40 || (avgRPE > 8.7 && rpeRising)) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:67:30
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
+     } else if (score >= 40 || (avgRPE < 8.7 && rpeRising)) {

[NoCoverage] BlockStatement
src/engine/fatigue.js:67:59
-     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {
-       key = 'MODERATE_FATIGUE';
-       label = 'Pas mai conservator';
-       icon = '🟡';
-       color = 'var(--accent2)';
-       recommend = 'reduce';
-       detail = 'Astăzi menținem greutățile, cu accent pe tehnică și control.';
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score >= 40 || (avgRPE >= 8.7 && rpeRising)) {} else if (score <= 15 && strong >= 2) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:74:14
-     } else if (score <= 15 && strong >= 2) {
+     } else if (true) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:74:14
-     } else if (score <= 15 && strong >= 2) {
+     } else if (false) {

[NoCoverage] LogicalOperator
src/engine/fatigue.js:74:14
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score <= 15 || strong >= 2) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:74:14
-     } else if (score <= 15 && strong >= 2) {
+     } else if (true && strong >= 2) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:74:14
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score < 15 && strong >= 2) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:74:14
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score > 15 && strong >= 2) {

[NoCoverage] ConditionalExpression
src/engine/fatigue.js:74:29
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score <= 15 && true) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:74:29
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score <= 15 && strong > 2) {

[NoCoverage] EqualityOperator
src/engine/fatigue.js:74:29
-     } else if (score <= 15 && strong >= 2) {
+     } else if (score <= 15 && strong < 2) {

[NoCoverage] BlockStatement
src/engine/fatigue.js:74:42
-     } else if (score <= 15 && strong >= 2) {
-       key = 'PEAK_FORM';
-       label = 'Suntem în formă bună';
-       icon = '🟢';
-       color = 'var(--green)';
-       recommend = 'push';
-       detail = 'Recuperarea este completă. Avem energie să plusăm pe bară astăzi.';
-     } else {
+     } else if (score <= 15 && strong >= 2) {} else {

[NoCoverage] BlockStatement
src/engine/fatigue.js:81:10
-     } else {
-       key = 'NORMAL';
-       label = 'Pe drum bun';
-       icon = '🟢';
-       color = 'var(--green)';
-       recommend = 'normal';
-       detail = 'Ritmul este sănătos. Mergem cu planul de astăzi.';
-     }
+     } else {}

[NoCoverage] ObjectLiteral
src/engine/fatigue.js:90:10
-     return { score, key, label, icon, color, recommend, detail, avgRPE, sleepBad, fatigue, strong };
+     return {};

[Survived] ArrayDeclaration
src/engine/fatigue.js:6:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] ConditionalExpression
src/engine/fatigue.js:7:14
-     const wb = DB.get('wellbeing') || {};
+     const wb = true;
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] ConditionalExpression
src/engine/fatigue.js:7:14
-     const wb = DB.get('wellbeing') || {};
+     const wb = false;
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] LogicalOperator
src/engine/fatigue.js:7:14
-     const wb = DB.get('wellbeing') || {};
+     const wb = DB.get('wellbeing') && {};
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] MethodExpression
src/engine/fatigue.js:11:3
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.forEach(l => {
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] ArrowFunction
src/engine/fatigue.js:11:15
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.filter(() => undefined).forEach(l => {
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] MethodExpression
src/engine/fatigue.js:15:17
-     const last4 = Object.values(sessions)
-       .sort((a,b) => b[0].ts - a[0].ts)
-       .slice(0, 4);
+     const last4 = Object.values(sessions).sort((a, b) => b[0].ts - a[0].ts);
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] MethodExpression
src/engine/fatigue.js:15:17
-     const last4 = Object.values(sessions)
-       .sort((a,b) => b[0].ts - a[0].ts)
+     const last4 = Object.values(sessions)
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] ArrowFunction
src/engine/fatigue.js:16:11
-       .sort((a,b) => b[0].ts - a[0].ts)
+       .sort(() => undefined)
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] ConditionalExpression
src/engine/fatigue.js:19:7
-     if (last4.length < 2) {
+     if (true) {
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[Survived] EqualityOperator
src/engine/fatigue.js:19:7
-     if (last4.length < 2) {
+     if (last4.length <= 2) {
Tests ran:
    Golden Master — fatigue.js verdicte (§36.58 LOCKED V1) insufficient sessions → DATE INSUFICIENTE

[NoCoverage] BlockStatement
src/engine/linearBlock.js:55:11
-     } catch {
-       return null;
-     }
+     } catch {}

[NoCoverage] ObjectLiteral
src/engine/linearBlock.js:126:32
-     const state = getState(s) || { cycleStartDate: _toIsoDate(new Date(now)) };
+     const state = getState(s) || {};

[NoCoverage] BooleanLiteral
src/engine/linearBlock.js:146:22
-     if (!start) return false;
+     if (!start) return true;

[NoCoverage] BlockStatement
src/engine/linearBlock.js:198:9
-     catch { return null; }
+     catch {}

[Survived] ConditionalExpression
src/engine/linearBlock.js:48:7
-     if (!s) return null;
+     if (false) return null;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation returns 1 when uninitialized
  and 21 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:51:9
-       if (!raw) return null;
+       if (false) return null;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation returns 1 when uninitialized
  and 21 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:53:9
-       if (!parsed || typeof parsed !== 'object') return null;
+       if (false) return null;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation Day 0 → Week 1
  and 20 more tests!

[Survived] LogicalOperator
src/engine/linearBlock.js:53:9
-       if (!parsed || typeof parsed !== 'object') return null;
+       if (!parsed && typeof parsed !== 'object') return null;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation Day 0 → Week 1
  and 20 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:53:20
-       if (!parsed || typeof parsed !== 'object') return null;
+       if (!parsed || false) return null;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation Day 0 → Week 1
  and 20 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:67:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation Day 0 → Week 1
  and 20 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:68:15
-     const now = typeof opts.now === 'number' ? opts.now : Date.now();
+     const now = true ? opts.now : Date.now();
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation Day 0 → Week 1
  and 20 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:87:7
-     if (!start) return 1;
+     if (false) return 1;
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:89:10
-     return ((daysElapsed % 35) >>> 0) >= 0
+     return true
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] EqualityOperator
src/engine/linearBlock.js:89:10
-     return ((daysElapsed % 35) >>> 0) >= 0
+     return daysElapsed % 35 >>> 0 > 0
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] ArithmeticOperator
src/engine/linearBlock.js:89:12
-     return ((daysElapsed % 35) >>> 0) >= 0
+     return ((daysElapsed * 35) >>> 0) >= 0
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:124:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip isDeloadSkipped false when not in deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:125:15
-     const now = typeof opts.now === 'number' ? opts.now : Date.now();
+     const now = true ? opts.now : Date.now();
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip isDeloadSkipped false when not in deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:125:15
-     const now = typeof opts.now === 'number' ? opts.now : Date.now();
+     const now = false ? opts.now : Date.now();
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip isDeloadSkipped false when not in deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
  and 2 more tests!

[Survived] EqualityOperator
src/engine/linearBlock.js:125:15
-     const now = typeof opts.now === 'number' ? opts.now : Date.now();
+     const now = typeof opts.now !== 'number' ? opts.now : Date.now();
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip isDeloadSkipped false when not in deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:141:7
-     if (!state || !state.deloadSkippedAt) return false;
+     if (false) return false;
Tests ran:
    deload skip isDeloadSkipped false when never skipped
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip isDeloadSkipped false when not in deload week
  and 4 more tests!

[Survived] LogicalOperator
src/engine/linearBlock.js:141:7
-     if (!state || !state.deloadSkippedAt) return false;
+     if (!state && !state.deloadSkippedAt) return false;
Tests ran:
    deload skip isDeloadSkipped false when never skipped
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip isDeloadSkipped false when not in deload week
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:146:7
-     if (!start) return false;
+     if (false) return false;
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
    deload skip banner returns banner with LOCKED wording when skipped
  and 1 more test!

[Survived] ConditionalExpression
src/engine/linearBlock.js:147:10
-     return state.deloadSkippedAt >= start.getTime();
+     return true;
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
    deload skip banner returns banner with LOCKED wording when skipped
  and 1 more test!
