[Survived] EqualityOperator
src/engine/linearBlock.js:147:10
-     return state.deloadSkippedAt >= start.getTime();
+     return state.deloadSkippedAt > start.getTime();
Tests ran:
    deload skip isDeloadSkipped true after markDeloadSkipped within deload week
    deload skip skip resets across cycles (cycleStartDate boundary)
    deload skip banner returns banner with LOCKED wording when skipped
  and 1 more test!

[Survived] ConditionalExpression
src/engine/linearBlock.js:186:7
-     if (typeof s !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
+     if (false) return null;
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] LogicalOperator
src/engine/linearBlock.js:186:7
-     if (typeof s !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
+     if (typeof s !== 'string' && !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:186:7
-     if (typeof s !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
+     if (false || !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] Regex
src/engine/linearBlock.js:186:33
-     if (typeof s !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
+     if (typeof s !== 'string' || !/\d{4}-\d{2}-\d{2}$/.test(s)) return null;
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] Regex
src/engine/linearBlock.js:186:33
-     if (typeof s !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(s)) return null;
+     if (typeof s !== 'string' || !/^\d{4}-\d{2}-\d{2}/.test(s)) return null;
Tests ran:
    getCycleWeek — 35-day rotation Day 0 → Week 1
    getCycleWeek — 35-day rotation Day 6 → Week 1 (last day of week 1)
    getCycleWeek — 35-day rotation Day 7 → Week 2
  and 16 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:196:7
-     if (override) return override;
+     if (false) return override;
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation returns 1 when uninitialized
  and 21 more tests!

[Survived] ConditionalExpression
src/engine/linearBlock.js:197:16
-     try { return typeof localStorage !== 'undefined' ? localStorage : null; }
+     try { return true ? localStorage : null; }
Tests ran:
    initCycle writes cycleStartDate today by default
    initCycle respects explicit cycleStartDate
    getCycleWeek — 35-day rotation returns 1 when uninitialized
  and 21 more tests!

[NoCoverage] BlockStatement
src/engine/masteryMilestone.js:36:11
-     } catch {
-       return {};
-     }
+     } catch {}

[NoCoverage] BlockStatement
src/engine/masteryMilestone.js:142:9
-     catch { return null; }
+     catch {}

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:30:7
-     if (!s) return {};
+     if (false) return {};
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 14 more tests!

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:33:9
-       if (!raw) return {};
+       if (false) return {};
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 14 more tests!

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:35:13
-       return (parsed && typeof parsed === 'object') ? parsed : {};
+       return (true) ? parsed : {};
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:35:23
-       return (parsed && typeof parsed === 'object') ? parsed : {};
+       return (parsed && true) ? parsed : {};
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 12 more tests!

[Survived] LogicalOperator
src/engine/masteryMilestone.js:35:13
-       return (parsed && typeof parsed === 'object') ? parsed : {};
+       return (parsed || typeof parsed === 'object') ? parsed : {};
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:51:7
-     if (!s || !exercise) return null;
+     if (false) return null;
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 12 more tests!

[Survived] LogicalOperator
src/engine/masteryMilestone.js:51:7
-     if (!s || !exercise) return null;
+     if (!s && !exercise) return null;
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:53:15
-     const now = typeof opts.now === 'number' ? opts.now : Date.now();
+     const now = true ? opts.now : Date.now();
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 11 more tests!

[Survived] OptionalChaining
src/engine/masteryMilestone.js:74:17
-     const count = counters[exercise]?.count || 0;
+     const count = counters[exercise].count || 0;
Tests ran:
    getCurrentMilestone null below threshold
    getCurrentMilestone returns Început at 10-29
    getCurrentMilestone returns Maestru at 120+

[Survived] EqualityOperator
src/engine/masteryMilestone.js:77:9
-       if (count >= m.count) current = m;
+       if (count > m.count) current = m;
Tests ran:
    getCurrentMilestone null below threshold
    getCurrentMilestone returns Început at 10-29
    getCurrentMilestone returns Maestru at 120+

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:135:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    resetCounters clears all counters

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:140:7
-     if (override) return override;
+     if (false) return override;
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 15 more tests!

[Survived] ConditionalExpression
src/engine/masteryMilestone.js:141:16
-     try { return typeof localStorage !== 'undefined' ? localStorage : null; }
+     try { return true ? localStorage : null; }
Tests ran:
    incrementCounter counts increments per exercise
    incrementCounter returns null when not crossing a threshold
    incrementCounter returns milestone exactly at session 10
  and 15 more tests!

[NoCoverage] ArrayDeclaration
src/engine/muscleMap.js:59:31
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || ["Stryker was here"]).filter(l => !l.baseline && l.ex && l.w);

[Survived] BlockStatement
src/engine/muscleMap.js:54:38
-   export function getMuscleState(logs) {
-     const now = Date.now();
-     const state = {};
-     Object.keys(MUSCLE_HEADS).forEach(m => { state[m] = 0; });
-   
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
-     recentLogs.forEach(l => {
-       const ms = EXERCISE_MUSCLES[l.ex];
-       if (!ms) return;
-       const logTime = l.ts || new Date(l.date).getTime();
-       const rpeContrib = l.rpe ? Math.min(l.rpe / 10, 1) : 0.7;
-       ms.primary.forEach(m => {
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
-         const decay = Math.exp(-hoursAgo / recovH);
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
-       });
-       ms.secondary.forEach(m => {
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
-         const decay = Math.exp(-hoursAgo / recovH);
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
-       });
-     });
-   
-     return state;
-   }
+   export function getMuscleState(logs) {}

[Survived] BlockStatement
src/engine/muscleMap.js:57:42
-     Object.keys(MUSCLE_HEADS).forEach(m => { state[m] = 0; });
+     Object.keys(MUSCLE_HEADS).forEach(m => {});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] MethodExpression
src/engine/muscleMap.js:59:22
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = logs || [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/muscleMap.js:59:47
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(l => true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] LogicalOperator
src/engine/muscleMap.js:59:23
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs && []).filter(l => !l.baseline && l.ex && l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ArrowFunction
src/engine/muscleMap.js:59:42
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ConditionalExpression
src/engine/muscleMap.js:59:47
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(l => false);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] LogicalOperator
src/engine/muscleMap.js:59:47
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex || l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/muscleMap.js:59:47
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(l => true && l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] LogicalOperator
src/engine/muscleMap.js:59:47
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(l => !l.baseline || l.ex && l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] BooleanLiteral
src/engine/muscleMap.js:59:47
-     const recentLogs = (logs || []).filter(l => !l.baseline && l.ex && l.w);
+     const recentLogs = (logs || []).filter(l => l.baseline && l.ex && l.w);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] BlockStatement
src/engine/muscleMap.js:60:27
-     recentLogs.forEach(l => {
-       const ms = EXERCISE_MUSCLES[l.ex];
-       if (!ms) return;
-       const logTime = l.ts || new Date(l.date).getTime();
-       const rpeContrib = l.rpe ? Math.min(l.rpe / 10, 1) : 0.7;
-       ms.primary.forEach(m => {
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
-         const decay = Math.exp(-hoursAgo / recovH);
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
-       });
-       ms.secondary.forEach(m => {
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
-         const decay = Math.exp(-hoursAgo / recovH);
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
-       });
-     });
+     recentLogs.forEach(l => {});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/muscleMap.js:63:21
-       const logTime = l.ts || new Date(l.date).getTime();
+       const logTime = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/muscleMap.js:63:21
-       const logTime = l.ts || new Date(l.date).getTime();
+       const logTime = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/muscleMap.js:62:9
-       if (!ms) return;
+       if (true) return;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] LogicalOperator
src/engine/muscleMap.js:63:21
-       const logTime = l.ts || new Date(l.date).getTime();
+       const logTime = l.ts && new Date(l.date).getTime();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] MethodExpression
src/engine/muscleMap.js:64:32
-       const rpeContrib = l.rpe ? Math.min(l.rpe / 10, 1) : 0.7;
+       const rpeContrib = l.rpe ? Math.max(l.rpe / 10, 1) : 0.7;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:64:41
-       const rpeContrib = l.rpe ? Math.min(l.rpe / 10, 1) : 0.7;
+       const rpeContrib = l.rpe ? Math.min(l.rpe * 10, 1) : 0.7;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/muscleMap.js:66:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/muscleMap.js:66:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] BlockStatement
src/engine/muscleMap.js:65:29
-       ms.primary.forEach(m => {
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
-         const decay = Math.exp(-hoursAgo / recovH);
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
-       });
+       ms.primary.forEach(m => {});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] LogicalOperator
src/engine/muscleMap.js:66:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = MUSCLE_HEADS[m]?.recoveryHours && 48;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] OptionalChaining
src/engine/muscleMap.js:66:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = MUSCLE_HEADS[m].recoveryHours || 48;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:67:24
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
+         const hoursAgo = (now - logTime) * MS_PER_HOUR;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:67:25
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
+         const hoursAgo = (now + logTime) / MS_PER_HOUR;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:68:30
-         const decay = Math.exp(-hoursAgo / recovH);
+         const decay = Math.exp(-hoursAgo * recovH);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] UnaryOperator
src/engine/muscleMap.js:68:30
-         const decay = Math.exp(-hoursAgo / recovH);
+         const decay = Math.exp(+hoursAgo / recovH);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] MethodExpression
src/engine/muscleMap.js:69:18
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
+         state[m] = Math.max(100, state[m] + 15 * 1.5 * rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:69:32
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] - 15 * 1.5 * rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:69:43
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib / decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:69:43
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] + 15 / 1.5 * rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] BlockStatement
src/engine/muscleMap.js:71:31
-       ms.secondary.forEach(m => {
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
-         const decay = Math.exp(-hoursAgo / recovH);
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
-       });
+       ms.secondary.forEach(m => {});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:69:43
-         state[m] = Math.min(100, state[m] + 15 * 1.5 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] + 15 * 1.5 / rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/muscleMap.js:72:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ConditionalExpression
src/engine/muscleMap.js:72:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] LogicalOperator
src/engine/muscleMap.js:72:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = MUSCLE_HEADS[m]?.recoveryHours && 48;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] OptionalChaining
src/engine/muscleMap.js:72:22
-         const recovH = MUSCLE_HEADS[m]?.recoveryHours || 48;
+         const recovH = MUSCLE_HEADS[m].recoveryHours || 48;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:73:24
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
+         const hoursAgo = (now - logTime) * MS_PER_HOUR;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:73:25
-         const hoursAgo = (now - logTime) / MS_PER_HOUR;
+         const hoursAgo = (now + logTime) / MS_PER_HOUR;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!
