[Survived] ArithmeticOperator
src/engine/muscleMap.js:74:30
-         const decay = Math.exp(-hoursAgo / recovH);
+         const decay = Math.exp(-hoursAgo * recovH);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] UnaryOperator
src/engine/muscleMap.js:74:30
-         const decay = Math.exp(-hoursAgo / recovH);
+         const decay = Math.exp(+hoursAgo / recovH);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] MethodExpression
src/engine/muscleMap.js:75:18
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
+         state[m] = Math.max(100, state[m] + 15 * 1.0 * rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:75:43
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib / decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:75:32
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] - 15 * 1.0 * rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:75:43
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] + 15 * 1.0 / rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/muscleMap.js:75:43
-         state[m] = Math.min(100, state[m] + 15 * 1.0 * rpeContrib * decay);
+         state[m] = Math.min(100, state[m] + 15 / 1.0 * rpeContrib * decay);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 1 more test!

[Survived] ObjectLiteral
src/engine/muscleMap.js:3:29
-   export const MUSCLE_HEADS = {
-     chest_upper: { recoveryHours: 60, label: 'Piept sus' },
-     chest_mid:   { recoveryHours: 60, label: 'Piept mijloc' },
-     chest_lower: { recoveryHours: 60, label: 'Piept jos' },
-     delt_front:  { recoveryHours: 48, label: 'Umăr față' },
-     delt_mid:    { recoveryHours: 48, label: 'Umăr lateral' },
-     delt_rear:   { recoveryHours: 48, label: 'Umăr spate' },
-     tri_long:    { recoveryHours: 48, label: 'Triceps lung' },
-     tri_lateral: { recoveryHours: 48, label: 'Triceps lateral' },
-     tri_medial:  { recoveryHours: 48, label: 'Triceps medial' },
-     bi_long:     { recoveryHours: 48, label: 'Biceps lung' },
-     bi_short:    { recoveryHours: 48, label: 'Biceps scurt' },
-     lat:         { recoveryHours: 72, label: 'Lat' },
-     mid_trap:    { recoveryHours: 72, label: 'Trapez mijloc' },
-     rear_delt_trap: { recoveryHours: 48, label: 'Delt spate/trapez' },
-     lower_back:  { recoveryHours: 72, label: 'Spate jos' },
-     quad:        { recoveryHours: 96, label: 'Cvadriceps' },
-     hamstring:   { recoveryHours: 96, label: 'Ischiogambieri' },
-     glute:       { recoveryHours: 72, label: 'Fese' },
-     calf:        { recoveryHours: 48, label: 'Gambă' },
-   };
+   export const MUSCLE_HEADS = {};
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:4:16
-     chest_upper: { recoveryHours: 60, label: 'Piept sus' },
+     chest_upper: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:5:16
-     chest_mid:   { recoveryHours: 60, label: 'Piept mijloc' },
+     chest_mid:   {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:6:16
-     chest_lower: { recoveryHours: 60, label: 'Piept jos' },
+     chest_lower: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:7:16
-     delt_front:  { recoveryHours: 48, label: 'Umăr față' },
+     delt_front:  {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:8:16
-     delt_mid:    { recoveryHours: 48, label: 'Umăr lateral' },
+     delt_mid:    {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:9:16
-     delt_rear:   { recoveryHours: 48, label: 'Umăr spate' },
+     delt_rear:   {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:10:16
-     tri_long:    { recoveryHours: 48, label: 'Triceps lung' },
+     tri_long:    {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:11:16
-     tri_lateral: { recoveryHours: 48, label: 'Triceps lateral' },
+     tri_lateral: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:12:16
-     tri_medial:  { recoveryHours: 48, label: 'Triceps medial' },
+     tri_medial:  {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:13:16
-     bi_long:     { recoveryHours: 48, label: 'Biceps lung' },
+     bi_long:     {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:14:16
-     bi_short:    { recoveryHours: 48, label: 'Biceps scurt' },
+     bi_short:    {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:15:16
-     lat:         { recoveryHours: 72, label: 'Lat' },
+     lat:         {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:16:16
-     mid_trap:    { recoveryHours: 72, label: 'Trapez mijloc' },
+     mid_trap:    {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:17:19
-     rear_delt_trap: { recoveryHours: 48, label: 'Delt spate/trapez' },
+     rear_delt_trap: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:18:16
-     lower_back:  { recoveryHours: 72, label: 'Spate jos' },
+     lower_back:  {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:19:16
-     quad:        { recoveryHours: 96, label: 'Cvadriceps' },
+     quad:        {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:20:16
-     hamstring:   { recoveryHours: 96, label: 'Ischiogambieri' },
+     hamstring:   {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:21:16
-     glute:       { recoveryHours: 72, label: 'Fese' },
+     glute:       {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:22:16
-     calf:        { recoveryHours: 48, label: 'Gambă' },
+     calf:        {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:26:68
-     'Incline DB Press':       { primary: ['chest_upper'], secondary: ['delt_front','tri_lateral'] },
+     'Incline DB Press':       { primary: ['chest_upper'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:27:29
-     'Flat DB Press':          { primary: ['chest_mid'], secondary: ['delt_front','tri_lateral'] },
+     'Flat DB Press':          {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:27:40
-     'Flat DB Press':          { primary: ['chest_mid'], secondary: ['delt_front','tri_lateral'] },
+     'Flat DB Press':          { primary: [], secondary: ['delt_front','tri_lateral'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:27:66
-     'Flat DB Press':          { primary: ['chest_mid'], secondary: ['delt_front','tri_lateral'] },
+     'Flat DB Press':          { primary: ['chest_mid'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:28:29
-     'Pec Deck / Cable Fly':   { primary: ['chest_mid','chest_upper'], secondary: [] },
+     'Pec Deck / Cable Fly':   {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:28:40
-     'Pec Deck / Cable Fly':   { primary: ['chest_mid','chest_upper'], secondary: [] },
+     'Pec Deck / Cable Fly':   { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:28:80
-     'Pec Deck / Cable Fly':   { primary: ['chest_mid','chest_upper'], secondary: [] },
+     'Pec Deck / Cable Fly':   { primary: ['chest_mid','chest_upper'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:29:29
-     'Cable Fly':              { primary: ['chest_mid','chest_upper'], secondary: [] },
+     'Cable Fly':              {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:29:40
-     'Cable Fly':              { primary: ['chest_mid','chest_upper'], secondary: [] },
+     'Cable Fly':              { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:29:80
-     'Cable Fly':              { primary: ['chest_mid','chest_upper'], secondary: [] },
+     'Cable Fly':              { primary: ['chest_mid','chest_upper'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:30:29
-     'Incline DB Press pump':  { primary: ['chest_upper'], secondary: ['delt_front','tri_lateral'] },
+     'Incline DB Press pump':  {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:30:40
-     'Incline DB Press pump':  { primary: ['chest_upper'], secondary: ['delt_front','tri_lateral'] },
+     'Incline DB Press pump':  { primary: [], secondary: ['delt_front','tri_lateral'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:30:68
-     'Incline DB Press pump':  { primary: ['chest_upper'], secondary: ['delt_front','tri_lateral'] },
+     'Incline DB Press pump':  { primary: ['chest_upper'], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:31:40
-     'DB Shoulder Press':      { primary: ['delt_front','delt_mid'], secondary: ['tri_lateral'] },
+     'DB Shoulder Press':      { primary: [], secondary: ['tri_lateral'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:31:78
-     'DB Shoulder Press':      { primary: ['delt_front','delt_mid'], secondary: ['tri_lateral'] },
+     'DB Shoulder Press':      { primary: ['delt_front','delt_mid'], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:32:40
-     'Lateral Raises':         { primary: ['delt_mid'], secondary: [] },
+     'Lateral Raises':         { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:32:29
-     'Lateral Raises':         { primary: ['delt_mid'], secondary: [] },
+     'Lateral Raises':         {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:32:65
-     'Lateral Raises':         { primary: ['delt_mid'], secondary: [] },
+     'Lateral Raises':         { primary: ['delt_mid'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:33:29
-     'Lateral Raises (cable)': { primary: ['delt_mid'], secondary: [] },
+     'Lateral Raises (cable)': {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:33:40
-     'Lateral Raises (cable)': { primary: ['delt_mid'], secondary: [] },
+     'Lateral Raises (cable)': { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:33:65
-     'Lateral Raises (cable)': { primary: ['delt_mid'], secondary: [] },
+     'Lateral Raises (cable)': { primary: ['delt_mid'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:34:29
-     'Rear Delt Fly':          { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Rear Delt Fly':          {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:34:40
-     'Rear Delt Fly':          { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Rear Delt Fly':          { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:34:83
-     'Rear Delt Fly':          { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Rear Delt Fly':          { primary: ['delt_rear','rear_delt_trap'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:35:29
-     'Rear Delt Cable':        { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Rear Delt Cable':        {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:35:40
-     'Rear Delt Cable':        { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Rear Delt Cable':        { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:35:83
-     'Rear Delt Cable':        { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Rear Delt Cable':        { primary: ['delt_rear','rear_delt_trap'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:36:29
-     'Face Pulls':             { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Face Pulls':             {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:36:40
-     'Face Pulls':             { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Face Pulls':             { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:36:83
-     'Face Pulls':             { primary: ['delt_rear','rear_delt_trap'], secondary: [] },
+     'Face Pulls':             { primary: ['delt_rear','rear_delt_trap'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:37:29
-     'Overhead Triceps':       { primary: ['tri_long'], secondary: ['tri_medial'] },
+     'Overhead Triceps':       {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:37:40
-     'Overhead Triceps':       { primary: ['tri_long'], secondary: ['tri_medial'] },
+     'Overhead Triceps':       { primary: [], secondary: ['tri_medial'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:37:65
-     'Overhead Triceps':       { primary: ['tri_long'], secondary: ['tri_medial'] },
+     'Overhead Triceps':       { primary: ['tri_long'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:38:29
-     'Pushdown':               { primary: ['tri_lateral','tri_medial'], secondary: [] },
+     'Pushdown':               {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:38:40
-     'Pushdown':               { primary: ['tri_lateral','tri_medial'], secondary: [] },
+     'Pushdown':               { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:38:81
-     'Pushdown':               { primary: ['tri_lateral','tri_medial'], secondary: [] },
+     'Pushdown':               { primary: ['tri_lateral','tri_medial'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:39:40
-     'Lat Pulldown':           { primary: ['lat'], secondary: ['bi_long','mid_trap'] },
+     'Lat Pulldown':           { primary: [], secondary: ['bi_long','mid_trap'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:39:60
-     'Lat Pulldown':           { primary: ['lat'], secondary: ['bi_long','mid_trap'] },
+     'Lat Pulldown':           { primary: ['lat'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:40:29
-     'Cable Row':              { primary: ['mid_trap','lat'], secondary: ['bi_short'] },
+     'Cable Row':              {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:40:40
-     'Cable Row':              { primary: ['mid_trap','lat'], secondary: ['bi_short'] },
+     'Cable Row':              { primary: [], secondary: ['bi_short'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:40:71
-     'Cable Row':              { primary: ['mid_trap','lat'], secondary: ['bi_short'] },
+     'Cable Row':              { primary: ['mid_trap','lat'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:41:29
-     'Chest-Supported Row':    { primary: ['mid_trap','lat'], secondary: ['bi_short'] },
+     'Chest-Supported Row':    {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:41:40
-     'Chest-Supported Row':    { primary: ['mid_trap','lat'], secondary: ['bi_short'] },
+     'Chest-Supported Row':    { primary: [], secondary: ['bi_short'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:41:71
-     'Chest-Supported Row':    { primary: ['mid_trap','lat'], secondary: ['bi_short'] },
+     'Chest-Supported Row':    { primary: ['mid_trap','lat'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:42:29
-     'Bayesian Curl':          { primary: ['bi_long'], secondary: [] },
+     'Bayesian Curl':          {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:42:40
-     'Bayesian Curl':          { primary: ['bi_long'], secondary: [] },
+     'Bayesian Curl':          { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:42:64
-     'Bayesian Curl':          { primary: ['bi_long'], secondary: [] },
+     'Bayesian Curl':          { primary: ['bi_long'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:43:29
-     'Incline DB Curl':        { primary: ['bi_long'], secondary: [] },
+     'Incline DB Curl':        {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:43:40
-     'Incline DB Curl':        { primary: ['bi_long'], secondary: [] },
+     'Incline DB Curl':        { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:43:64
-     'Incline DB Curl':        { primary: ['bi_long'], secondary: [] },
+     'Incline DB Curl':        { primary: ['bi_long'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:44:29
-     'Cable Curl':             { primary: ['bi_long','bi_short'], secondary: [] },
+     'Cable Curl':             {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:44:40
-     'Cable Curl':             { primary: ['bi_long','bi_short'], secondary: [] },
+     'Cable Curl':             { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:44:75
-     'Cable Curl':             { primary: ['bi_long','bi_short'], secondary: [] },
+     'Cable Curl':             { primary: ['bi_long','bi_short'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:45:29
-     'Preacher Curl':          { primary: ['bi_short'], secondary: [] },
+     'Preacher Curl':          {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:45:40
-     'Preacher Curl':          { primary: ['bi_short'], secondary: [] },
+     'Preacher Curl':          { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:45:65
-     'Preacher Curl':          { primary: ['bi_short'], secondary: [] },
+     'Preacher Curl':          { primary: ['bi_short'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:46:29
-     'Hammer Curl':            { primary: ['bi_long'], secondary: ['bi_short'] },
+     'Hammer Curl':            {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:46:40
-     'Hammer Curl':            { primary: ['bi_long'], secondary: ['bi_short'] },
+     'Hammer Curl':            { primary: [], secondary: ['bi_short'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:46:64
-     'Hammer Curl':            { primary: ['bi_long'], secondary: ['bi_short'] },
+     'Hammer Curl':            { primary: ['bi_long'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:47:29
-     'Leg Press':              { primary: ['quad','glute'], secondary: ['hamstring'] },
+     'Leg Press':              {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:47:40
-     'Leg Press':              { primary: ['quad','glute'], secondary: ['hamstring'] },
+     'Leg Press':              { primary: [], secondary: ['hamstring'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:47:69
-     'Leg Press':              { primary: ['quad','glute'], secondary: ['hamstring'] },
+     'Leg Press':              { primary: ['quad','glute'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:48:29
-     'Leg Extension':          { primary: ['quad'], secondary: [] },
+     'Leg Extension':          {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:48:40
-     'Leg Extension':          { primary: ['quad'], secondary: [] },
+     'Leg Extension':          { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:48:61
-     'Leg Extension':          { primary: ['quad'], secondary: [] },
+     'Leg Extension':          { primary: ['quad'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:49:29
-     'Leg Curl':               { primary: ['hamstring'], secondary: [] },
+     'Leg Curl':               {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:49:40
-     'Leg Curl':               { primary: ['hamstring'], secondary: [] },
+     'Leg Curl':               { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:49:66
-     'Leg Curl':               { primary: ['hamstring'], secondary: [] },
+     'Leg Curl':               { primary: ['hamstring'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:50:29
-     'Romanian Deadlift':      { primary: ['hamstring','glute'], secondary: ['lower_back'] },
+     'Romanian Deadlift':      {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:50:40
-     'Romanian Deadlift':      { primary: ['hamstring','glute'], secondary: ['lower_back'] },
+     'Romanian Deadlift':      { primary: [], secondary: ['lower_back'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:50:74
-     'Romanian Deadlift':      { primary: ['hamstring','glute'], secondary: ['lower_back'] },
+     'Romanian Deadlift':      { primary: ['hamstring','glute'], secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/muscleMap.js:51:29
-     'Calf Raises':            { primary: ['calf'], secondary: [] },
+     'Calf Raises':            {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:51:40
-     'Calf Raises':            { primary: ['calf'], secondary: [] },
+     'Calf Raises':            { primary: [], secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/muscleMap.js:51:61
-     'Calf Raises':            { primary: ['calf'], secondary: [] },
+     'Calf Raises':            { primary: ['calf'], secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[NoCoverage] ArrayDeclaration
src/engine/patternLearning.js:21:44
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:39:49
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => true).length / recentBurns.length;

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:39:49
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => false).length / recentBurns.length;

[NoCoverage] EqualityOperator
src/engine/patternLearning.js:39:49
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) > eightWeeksAgo).length / recentBurns.length;

[NoCoverage] EqualityOperator
src/engine/patternLearning.js:39:49
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) < eightWeeksAgo).length / recentBurns.length;

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:39:58
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => new Date(true) >= eightWeeksAgo).length / recentBurns.length;

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:39:58
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => new Date(false) >= eightWeeksAgo).length / recentBurns.length;

[NoCoverage] LogicalOperator
src/engine/patternLearning.js:39:58
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => new Date(e.date && 0) >= eightWeeksAgo).length / recentBurns.length;

[NoCoverage] BlockStatement
src/engine/patternLearning.js:40:29
-       if (earlyEndRate > 0.4) {
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
-         if (!alreadyApplied) {
-           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });
-         }
-       }
+       if (earlyEndRate > 0.4) {}

[NoCoverage] MethodExpression
src/engine/patternLearning.js:41:30
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
+         const alreadyApplied = applied.every(p => p.type === 'EARLY_END');

[NoCoverage] ArrowFunction
src/engine/patternLearning.js:41:43
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
+         const alreadyApplied = applied.some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:41:48
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
+         const alreadyApplied = applied.some(p => true);

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:41:48
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
+         const alreadyApplied = applied.some(p => false);
