[NoCoverage] EqualityOperator
src/engine/patternLearning.js:41:48
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
+         const alreadyApplied = applied.some(p => p.type !== 'EARLY_END');

[NoCoverage] BooleanLiteral
src/engine/patternLearning.js:42:11
-         if (!alreadyApplied) {
+         if (alreadyApplied) {

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:42:11
-         if (!alreadyApplied) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:42:11
-         if (!alreadyApplied) {
+         if (false) {

[NoCoverage] BlockStatement
src/engine/patternLearning.js:42:28
-         if (!alreadyApplied) {
-           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });
-         }
+         if (!alreadyApplied) {}

[NoCoverage] ObjectLiteral
src/engine/patternLearning.js:43:26
-           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });
+           newPatterns.push({});

[NoCoverage] ArithmeticOperator
src/engine/patternLearning.js:43:72
-           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });
+           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate / 100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });

[NoCoverage] ArithmeticOperator
src/engine/patternLearning.js:43:141
-           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });
+           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate / 100)}% sesiuni terminate devreme — program scurtat 20%` });

[NoCoverage] BlockStatement
src/engine/patternLearning.js:50:34
-     if (sessionHours.length >= 10) {
-       const hourCounts = {};
-       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h]||0)+1; });
-       const peakHour = Object.entries(hourCounts).sort((a,b)=>b[1]-a[1])[0]?.[0];
-       if (peakHour) {
-         const existing = DB.get('peak-hours') || {};
-         existing.detected = Number(peakHour);
-         DB.set('peak-hours', existing);
-       }
-     }
+     if (sessionHours.length >= 10) {}

[NoCoverage] BlockStatement
src/engine/patternLearning.js:52:31
-       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h]||0)+1; });
+       sessionHours.forEach(h => {});

[NoCoverage] ArithmeticOperator
src/engine/patternLearning.js:52:49
-       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h]||0)+1; });
+       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h] || 0) - 1; });

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:52:50
-       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h]||0)+1; });
+       sessionHours.forEach(h => { hourCounts[h] = (true)+1; });

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:52:50
-       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h]||0)+1; });
+       sessionHours.forEach(h => { hourCounts[h] = (false)+1; });

[NoCoverage] LogicalOperator
src/engine/patternLearning.js:52:50
-       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h]||0)+1; });
+       sessionHours.forEach(h => { hourCounts[h] = (hourCounts[h] && 0)+1; });

[NoCoverage] OptionalChaining
src/engine/patternLearning.js:53:22
-       const peakHour = Object.entries(hourCounts).sort((a,b)=>b[1]-a[1])[0]?.[0];
+       const peakHour = Object.entries(hourCounts).sort((a, b) => b[1] - a[1])[0][0];

[NoCoverage] MethodExpression
src/engine/patternLearning.js:53:22
-       const peakHour = Object.entries(hourCounts).sort((a,b)=>b[1]-a[1])[0]?.[0];
+       const peakHour = Object.entries(hourCounts)[0]?.[0];

[NoCoverage] ArrowFunction
src/engine/patternLearning.js:53:54
-       const peakHour = Object.entries(hourCounts).sort((a,b)=>b[1]-a[1])[0]?.[0];
+       const peakHour = Object.entries(hourCounts).sort(() => undefined)[0]?.[0];

[NoCoverage] ArithmeticOperator
src/engine/patternLearning.js:53:61
-       const peakHour = Object.entries(hourCounts).sort((a,b)=>b[1]-a[1])[0]?.[0];
+       const peakHour = Object.entries(hourCounts).sort((a,b)=>b[1] + a[1])[0]?.[0];

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:54:9
-       if (peakHour) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:54:9
-       if (peakHour) {
+       if (false) {

[NoCoverage] BlockStatement
src/engine/patternLearning.js:54:19
-       if (peakHour) {
-         const existing = DB.get('peak-hours') || {};
-         existing.detected = Number(peakHour);
-         DB.set('peak-hours', existing);
-       }
+       if (peakHour) {}

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:55:24
-         const existing = DB.get('peak-hours') || {};
+         const existing = true;

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:55:24
-         const existing = DB.get('peak-hours') || {};
+         const existing = false;

[NoCoverage] LogicalOperator
src/engine/patternLearning.js:55:24
-         const existing = DB.get('peak-hours') || {};
+         const existing = DB.get('peak-hours') && {};

[NoCoverage] ArrayDeclaration
src/engine/patternLearning.js:63:38
-     const exNames = [...new Set((logs||[]).filter(l=>!l.baseline&&l.ex).map(l=>l.ex))];
+     const exNames = [...new Set((logs||["Stryker was here"]).filter(l=>!l.baseline&&l.ex).map(l=>l.ex))];

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:74:46
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => true);

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:74:46
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => false);

[NoCoverage] LogicalOperator
src/engine/patternLearning.js:74:46
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' || Date.now() - p.appliedAt < 7 * 86400000);

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:74:46
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => true && Date.now() - p.appliedAt < 7*86400000);

[NoCoverage] EqualityOperator
src/engine/patternLearning.js:74:46
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type !== 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:74:73
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && true);

[NoCoverage] EqualityOperator
src/engine/patternLearning.js:74:73
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt <= 7 * 86400000);

[NoCoverage] EqualityOperator
src/engine/patternLearning.js:74:73
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt >= 7 * 86400000);

[NoCoverage] ArithmeticOperator
src/engine/patternLearning.js:74:73
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() + p.appliedAt < 7*86400000);

[NoCoverage] ArithmeticOperator
src/engine/patternLearning.js:74:100
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7 / 86400000);

[NoCoverage] ArrayDeclaration
src/engine/patternLearning.js:105:40
-     const exNames = [...new Set((logs || []).filter(l => !l.baseline && l.ex).map(l => l.ex))];
+     const exNames = [...new Set((logs || ["Stryker was here"]).filter(l => !l.baseline && l.ex).map(l => l.ex))];

[NoCoverage] BlockStatement
src/engine/patternLearning.js:184:38
-   export function getAppliedPatterns() {
-     return DB.get('applied-patterns') || [];
-   }
+   export function getAppliedPatterns() {}

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:185:10
-     return DB.get('applied-patterns') || [];
+     return true;

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:185:10
-     return DB.get('applied-patterns') || [];
+     return false;

[NoCoverage] LogicalOperator
src/engine/patternLearning.js:185:10
-     return DB.get('applied-patterns') || [];
+     return DB.get('applied-patterns') && [];

[NoCoverage] ArrayDeclaration
src/engine/patternLearning.js:185:40
-     return DB.get('applied-patterns') || [];
+     return DB.get('applied-patterns') || ["Stryker was here"];

[NoCoverage] BlockStatement
src/engine/patternLearning.js:188:39
-   export function dismissPattern(index) {
-     const all = DB.get('applied-patterns') || [];
-     all.splice(index, 1);
-     DB.set('applied-patterns', all);
-   }
+   export function dismissPattern(index) {}

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:189:15
-     const all = DB.get('applied-patterns') || [];
+     const all = true;

[NoCoverage] ConditionalExpression
src/engine/patternLearning.js:189:15
-     const all = DB.get('applied-patterns') || [];
+     const all = false;

[NoCoverage] LogicalOperator
src/engine/patternLearning.js:189:15
-     const all = DB.get('applied-patterns') || [];
+     const all = DB.get('applied-patterns') && [];

[NoCoverage] ArrayDeclaration
src/engine/patternLearning.js:189:45
-     const all = DB.get('applied-patterns') || [];
+     const all = DB.get('applied-patterns') || ["Stryker was here"];

[Survived] ConditionalExpression
src/engine/patternLearning.js:12:7
-     if (_patternAnalyzeInFlight) return;
+     if (false) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] BooleanLiteral
src/engine/patternLearning.js:13:29
-     _patternAnalyzeInFlight = true;
+     _patternAnalyzeInFlight = false;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:20:7
-     if (!logs || logs.length < 20) return;
+     if (false) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] LogicalOperator
src/engine/patternLearning.js:20:7
-     if (!logs || logs.length < 20) return;
+     if (!logs && logs.length < 20) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:20:16
-     if (!logs || logs.length < 20) return;
+     if (!logs || false) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:20:16
-     if (!logs || logs.length < 20) return;
+     if (!logs || logs.length <= 20) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrayDeclaration
src/engine/patternLearning.js:22:49
-     const applied = DB.get('applied-patterns') || [];
+     const applied = DB.get('applied-patterns') || ["Stryker was here"];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrayDeclaration
src/engine/patternLearning.js:23:23
-     const newPatterns = [];
+     const newPatterns = ["Stryker was here"];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:28:23
-     const recentBurns = burns.filter(b => new Date(b.date) >= eightWeeksAgo);
+     const recentBurns = burns;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:28:41
-     const recentBurns = burns.filter(b => new Date(b.date) >= eightWeeksAgo);
+     const recentBurns = burns.filter(b => true);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:28:41
-     const recentBurns = burns.filter(b => new Date(b.date) >= eightWeeksAgo);
+     const recentBurns = burns.filter(b => new Date(b.date) > eightWeeksAgo);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:31:7
-     if (recentBurns.length < 4) return;
+     if (false) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:31:7
-     if (recentBurns.length < 4) return;
+     if (recentBurns.length <= 4) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:32:7
-     if (burns.filter(b => new Date(b.date) >= fourWeeksAgo).length < 4) return;
+     if (false) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:32:7
-     if (burns.filter(b => new Date(b.date) >= fourWeeksAgo).length < 4) return;
+     if (burns.filter(b => new Date(b.date) >= fourWeeksAgo).length <= 4) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:32:7
-     if (burns.filter(b => new Date(b.date) >= fourWeeksAgo).length < 4) return;
+     if (burns.length < 4) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:32:25
-     if (burns.filter(b => new Date(b.date) >= fourWeeksAgo).length < 4) return;
+     if (burns.filter(b => true).length < 4) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:32:25
-     if (burns.filter(b => new Date(b.date) >= fourWeeksAgo).length < 4) return;
+     if (burns.filter(b => new Date(b.date) > fourWeeksAgo).length < 4) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrayDeclaration
src/engine/patternLearning.js:37:47
-     const earlyStops = DB.get('early-stops') || [];
+     const earlyStops = DB.get('early-stops') || ["Stryker was here"];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:38:7
-     if (recentBurns.length >= 5) {
+     if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:38:7
-     if (recentBurns.length >= 5) {
+     if (false) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:38:7
-     if (recentBurns.length >= 5) {
+     if (recentBurns.length > 5) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] BlockStatement
src/engine/patternLearning.js:38:32
-     if (recentBurns.length >= 5) {
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
-       if (earlyEndRate > 0.4) {
-         const alreadyApplied = applied.some(p => p.type === 'EARLY_END');
-         if (!alreadyApplied) {
-           newPatterns.push({ type: 'EARLY_END', earlyEndRate: Math.round(earlyEndRate*100), appliedAt: Date.now(), description: `${Math.round(earlyEndRate*100)}% sesiuni terminate devreme — program scurtat 20%` });
-         }
-       }
-     }
+     if (recentBurns.length >= 5) {}
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArithmeticOperator
src/engine/patternLearning.js:39:26
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length * recentBurns.length;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:38:7
-     if (recentBurns.length >= 5) {
+     if (recentBurns.length < 5) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:39:26
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.length / recentBurns.length;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrowFunction
src/engine/patternLearning.js:39:44
-       const earlyEndRate = earlyStops.filter(e => new Date(e.date || 0) >= eightWeeksAgo).length / recentBurns.length;
+       const earlyEndRate = earlyStops.filter(() => undefined).length / recentBurns.length;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:40:9
-       if (earlyEndRate > 0.4) {
+       if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:40:9
-       if (earlyEndRate > 0.4) {
+       if (false) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:40:9
-       if (earlyEndRate > 0.4) {
+       if (earlyEndRate >= 0.4) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:40:9
-       if (earlyEndRate > 0.4) {
+       if (earlyEndRate <= 0.4) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:49:24
-     const sessionHours = burns.filter(b => b.startHour != null).map(b => b.startHour);
+     const sessionHours = burns.map(b => b.startHour);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrowFunction
src/engine/patternLearning.js:49:37
-     const sessionHours = burns.filter(b => b.startHour != null).map(b => b.startHour);
+     const sessionHours = burns.filter(() => undefined).map(b => b.startHour);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:49:42
-     const sessionHours = burns.filter(b => b.startHour != null).map(b => b.startHour);
+     const sessionHours = burns.filter(b => true).map(b => b.startHour);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:49:42
-     const sessionHours = burns.filter(b => b.startHour != null).map(b => b.startHour);
+     const sessionHours = burns.filter(b => false).map(b => b.startHour);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:49:42
-     const sessionHours = burns.filter(b => b.startHour != null).map(b => b.startHour);
+     const sessionHours = burns.filter(b => b.startHour == null).map(b => b.startHour);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrowFunction
src/engine/patternLearning.js:49:67
-     const sessionHours = burns.filter(b => b.startHour != null).map(b => b.startHour);
+     const sessionHours = burns.filter(b => b.startHour != null).map(() => undefined);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:50:7
-     if (sessionHours.length >= 10) {
+     if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:50:7
-     if (sessionHours.length >= 10) {
+     if (false) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:50:7
-     if (sessionHours.length >= 10) {
+     if (sessionHours.length > 10) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:50:7
-     if (sessionHours.length >= 10) {
+     if (sessionHours.length < 10) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrayDeclaration
src/engine/patternLearning.js:62:24
-     const exStagnation = [];
+     const exStagnation = ["Stryker was here"];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:63:31
-     const exNames = [...new Set((logs||[]).filter(l=>!l.baseline&&l.ex).map(l=>l.ex))];
+     const exNames = [...new Set(logs || [].map(l=>l.ex))];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:63:52
-     const exNames = [...new Set((logs||[]).filter(l=>!l.baseline&&l.ex).map(l=>l.ex))];
+     const exNames = [...new Set((logs||[]).filter(l=>true).map(l=>l.ex))];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] LogicalOperator
src/engine/patternLearning.js:63:52
-     const exNames = [...new Set((logs||[]).filter(l=>!l.baseline&&l.ex).map(l=>l.ex))];
+     const exNames = [...new Set((logs||[]).filter(l=>!l.baseline || l.ex).map(l=>l.ex))];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:65:20
-       const exLogs = logs.filter(l=>l.ex===ex&&l.w).slice(0,12);
+       const exLogs = logs.filter(l => l.ex === ex && l.w);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:65:20
-       const exLogs = logs.filter(l=>l.ex===ex&&l.w).slice(0,12);
+       const exLogs = logs.slice(0,12);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:65:35
-       const exLogs = logs.filter(l=>l.ex===ex&&l.w).slice(0,12);
+       const exLogs = logs.filter(l=>true).slice(0,12);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)
