[Survived] LogicalOperator
src/engine/patternLearning.js:65:35
-       const exLogs = logs.filter(l=>l.ex===ex&&l.w).slice(0,12);
+       const exLogs = logs.filter(l=>l.ex === ex || l.w).slice(0,12);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] EqualityOperator
src/engine/patternLearning.js:65:35
-       const exLogs = logs.filter(l=>l.ex===ex&&l.w).slice(0,12);
+       const exLogs = logs.filter(l=>l.ex !== ex&&l.w).slice(0,12);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:65:35
-       const exLogs = logs.filter(l=>l.ex===ex&&l.w).slice(0,12);
+       const exLogs = logs.filter(l=>true&&l.w).slice(0,12);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ConditionalExpression
src/engine/patternLearning.js:66:9
-       if (exLogs.length < 9) return;
+       if (false) return;
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] MethodExpression
src/engine/patternLearning.js:67:20
-       const last3w = exLogs.slice(0,3).map(l=>l.w);
+       const last3w = exLogs.map(l=>l.w);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] MethodExpression
src/engine/patternLearning.js:68:20
-       const prev3w = exLogs.slice(6,9).map(l=>l.w);
+       const prev3w = exLogs.map(l=>l.w);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:69:9
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] LogicalOperator
src/engine/patternLearning.js:69:9
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) || last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:69:9
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (true && last3w[0]===prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] LogicalOperator
src/engine/patternLearning.js:69:9
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) || prev3w.every(w => w === prev3w[0]) && last3w[0]===prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] MethodExpression
src/engine/patternLearning.js:69:9
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.some(w => w === last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:69:25
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.every(w=>true) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] MethodExpression
src/engine/patternLearning.js:69:43
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.every(w=>w===last3w[0]) && prev3w.some(w => w === prev3w[0]) && last3w[0]===prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:69:59
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>true) && last3w[0]===prev3w[0]) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:69:77
-       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && last3w[0]===prev3w[0]) {
+       if (last3w.every(w=>w===last3w[0]) && prev3w.every(w=>w===prev3w[0]) && true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ObjectLiteral
src/engine/patternLearning.js:70:25
-         exStagnation.push({ ex, kg: last3w[0] });
+         exStagnation.push({});
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:73:7
-     if (exStagnation.length) {
+     if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrowFunction
src/engine/patternLearning.js:74:41
-       const alreadyApplied = applied.some(p => p.type === 'STAGNATION' && Date.now() - p.appliedAt < 7*86400000);
+       const alreadyApplied = applied.some(() => undefined);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:75:9
-       if (!alreadyApplied && exStagnation.length) {
+       if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] LogicalOperator
src/engine/patternLearning.js:75:9
-       if (!alreadyApplied && exStagnation.length) {
+       if (!alreadyApplied || exStagnation.length) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ObjectLiteral
src/engine/patternLearning.js:76:24
-         newPatterns.push({ type: 'STAGNATION', exercises: exStagnation.map(e=>e.ex), appliedAt: Date.now(), description: `${exStagnation.length} exerciții stagnate 3+ săptămâni` });
+         newPatterns.push({});
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ArrowFunction
src/engine/patternLearning.js:76:74
-         newPatterns.push({ type: 'STAGNATION', exercises: exStagnation.map(e=>e.ex), appliedAt: Date.now(), description: `${exStagnation.length} exerciții stagnate 3+ săptămâni` });
+         newPatterns.push({ type: 'STAGNATION', exercises: exStagnation.map(() => undefined), appliedAt: Date.now(), description: `${exStagnation.length} exerciții stagnate 3+ săptămâni` });
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ConditionalExpression
src/engine/patternLearning.js:80:7
-     if (newPatterns.length) {
+     if (true) {
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrayDeclaration
src/engine/patternLearning.js:81:17
-       const all = [...applied, ...newPatterns];
+       const all = [];
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] UnaryOperator
src/engine/patternLearning.js:82:42
-       DB.set('applied-patterns', all.slice(-20));
+       DB.set('applied-patterns', all.slice(+20));
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] MethodExpression
src/engine/patternLearning.js:82:32
-       DB.set('applied-patterns', all.slice(-20));
+       DB.set('applied-patterns', all);
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns

[Survived] ObjectLiteral
src/engine/patternLearning.js:87:40
-       const cdlPatterns = analyzeFromCDL({ windowDays: 30 });
+       const cdlPatterns = analyzeFromCDL({});
Tests ran:
    analyzeFromCDL analyzeAndApplyPatterns writes cdl-patterns key in parallel with applied-patterns
    analyzeFromCDL cdl-patterns written even when CDL is empty (empty array persisted)

[Survived] ArrayDeclaration
src/engine/patternLearning.js:103:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];
Tests ran:
    analyzeFromCDL returns [] when CDL is empty
    analyzeFromCDL filters out entries with null outcome
    analyzeFromCDL returns [] when weighted total < 4 (below MIN_CDL_WEIGHT)
  and 9 more tests!

[Survived] MethodExpression
src/engine/patternLearning.js:105:31
-     const exNames = [...new Set((logs || []).filter(l => !l.baseline && l.ex).map(l => l.ex))];
+     const exNames = [...new Set(logs || [].map(l => l.ex))];
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL returns [] when CDL is empty
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/patternLearning.js:105:56
-     const exNames = [...new Set((logs || []).filter(l => !l.baseline && l.ex).map(l => l.ex))];
+     const exNames = [...new Set((logs || []).filter(l => true).map(l => l.ex))];
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] LogicalOperator
src/engine/patternLearning.js:105:56
-     const exNames = [...new Set((logs || []).filter(l => !l.baseline && l.ex).map(l => l.ex))];
+     const exNames = [...new Set((logs || []).filter(l => !l.baseline || l.ex).map(l => l.ex))];
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] MethodExpression
src/engine/patternLearning.js:107:20
-       const exLogs = logs.filter(l => l.ex === ex && l.w).slice(0, 12);
+       const exLogs = logs.filter(l => l.ex === ex && l.w);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] MethodExpression
src/engine/patternLearning.js:107:20
-       const exLogs = logs.filter(l => l.ex === ex && l.w).slice(0, 12);
+       const exLogs = logs.slice(0, 12);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:107:37
-       const exLogs = logs.filter(l => l.ex === ex && l.w).slice(0, 12);
+       const exLogs = logs.filter(l => true).slice(0, 12);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] LogicalOperator
src/engine/patternLearning.js:107:37
-       const exLogs = logs.filter(l => l.ex === ex && l.w).slice(0, 12);
+       const exLogs = logs.filter(l => l.ex === ex || l.w).slice(0, 12);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:107:37
-       const exLogs = logs.filter(l => l.ex === ex && l.w).slice(0, 12);
+       const exLogs = logs.filter(l => true && l.w).slice(0, 12);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] MethodExpression
src/engine/patternLearning.js:109:20
-       const last3w = exLogs.slice(0, 3).map(l => l.w);
+       const last3w = exLogs.map(l => l.w);
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:108:9
-       if (exLogs.length < 9) return;
+       if (false) return;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] MethodExpression
src/engine/patternLearning.js:110:20
-       const prev3w = exLogs.slice(6, 9).map(l => l.w);
+       const prev3w = exLogs.map(l => l.w);
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:111:9
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (true) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] LogicalOperator
src/engine/patternLearning.js:111:9
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) || last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:111:9
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (true && last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] LogicalOperator
src/engine/patternLearning.js:111:9
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) || prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] MethodExpression
src/engine/patternLearning.js:111:9
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.some(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:111:27
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.every(w => true) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] MethodExpression
src/engine/patternLearning.js:111:47
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) && prev3w.some(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:111:65
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => true) && last3w[0] === prev3w[0]) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:111:85
-       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && last3w[0] === prev3w[0]) {
+       if (last3w.every(w => w === last3w[0]) && prev3w.every(w => w === prev3w[0]) && true) {
Tests ran:
    analyzeFromCDL fires STAGNATION from logs when exercise weights stagnate 9+ sessions

[Survived] ConditionalExpression
src/engine/patternLearning.js:129:12
-       return ts >= cutoff && e.outcome != null;
+       return true && e.outcome != null;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL filters out entries with null outcome
  and 8 more tests!

[Survived] EqualityOperator
src/engine/patternLearning.js:129:12
-       return ts >= cutoff && e.outcome != null;
+       return ts > cutoff && e.outcome != null;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL filters out entries with null outcome
  and 8 more tests!

[Survived] ConditionalExpression
src/engine/patternLearning.js:142:9
-       if (executed !== false) executedWeight += w;
+       if (true) executedWeight += w;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL returns [] when weighted total < 4 (below MIN_CDL_WEIGHT)
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/patternLearning.js:145:9
-       if (executed === 'partial' || earlyStop === true) earlyEndWeight += w;
+       if (false || earlyStop === true) earlyEndWeight += w;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL returns [] when weighted total < 4 (below MIN_CDL_WEIGHT)
  and 7 more tests!

[Survived] ConditionalExpression
src/engine/patternLearning.js:148:7
-     if (totalWeight < MIN_CDL_WEIGHT) return patterns;
+     if (false) return patterns;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL returns [] when CDL is empty
  and 12 more tests!

[Survived] ConditionalExpression
src/engine/patternLearning.js:152:24
-     const earlyEndRate = executedWeight > 0 ? earlyEndWeight / executedWeight : 0;
+     const earlyEndRate = true ? earlyEndWeight / executedWeight : 0;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
  and 6 more tests!

[Survived] EqualityOperator
src/engine/patternLearning.js:152:24
-     const earlyEndRate = executedWeight > 0 ? earlyEndWeight / executedWeight : 0;
+     const earlyEndRate = executedWeight >= 0 ? earlyEndWeight / executedWeight : 0;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
  and 6 more tests!

[Survived] ArithmeticOperator
src/engine/patternLearning.js:159:81
-         description: `Adherence scăzută ultimele ${windowDays} zile: ${Math.round(adherenceRate * 100)}%. Reducem volum și verificăm contextul.`,
+         description: `Adherence scăzută ultimele ${windowDays} zile: ${Math.round(adherenceRate / 100)}%. Reducem volum și verificăm contextul.`,
Tests ran:
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
    analyzeFromCDL synthetic at 0.5x can tip adherence below threshold
    analyzeFromCDL never produces SKIP_DAY pattern
  and 1 more test!

[Survived] ConditionalExpression
src/engine/patternLearning.js:163:7
-     if (deviationRate > 0.3) {
+     if (true) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
  and 6 more tests!

[Survived] EqualityOperator
src/engine/patternLearning.js:163:7
-     if (deviationRate > 0.3) {
+     if (deviationRate >= 0.3) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
  and 6 more tests!

[Survived] ArithmeticOperator
src/engine/patternLearning.js:168:53
-         description: `Deviation crescut: ${Math.round(deviationRate * 100)}% sesiuni diferite de propunere. Coach-ul ajustează propunerile.`,
+         description: `Deviation crescut: ${Math.round(deviationRate / 100)}% sesiuni diferite de propunere. Coach-ul ajustează propunerile.`,
Tests ran:
    analyzeFromCDL fires HIGH_DEVIATION when deviationRate > 30%

[Survived] ConditionalExpression
src/engine/patternLearning.js:172:7
-     if (earlyEndRate > 0.4) {
+     if (true) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
  and 6 more tests!

[Survived] EqualityOperator
src/engine/patternLearning.js:172:7
-     if (earlyEndRate > 0.4) {
+     if (earlyEndRate >= 0.4) {
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires LOW_ADHERENCE when adherenceRate < 50%
  and 6 more tests!

[Survived] ArithmeticOperator
src/engine/patternLearning.js:177:34
-         description: `${Math.round(earlyEndRate * 100)}% sesiuni terminate devreme — program scurtat 20%`,
+         description: `${Math.round(earlyEndRate / 100)}% sesiuni terminate devreme — program scurtat 20%`,
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    analyzeFromCDL fires EARLY_END from CDL when earlyStop rate > 40%

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:18:25
-       apply: exercise => ({ ...exercise, technique: 'rest_pause', restSeconds: 15 }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:25:25
-       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) + 4 }),
+       apply: exercise => ({}),

[NoCoverage] ArithmeticOperator
src/engine/plateauInterventions.js:25:74
-       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) + 4 }),
+       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) - 4 }),

[NoCoverage] ConditionalExpression
src/engine/plateauInterventions.js:25:75
-       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) + 4 }),
+       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (true) + 4 }),

[NoCoverage] ConditionalExpression
src/engine/plateauInterventions.js:25:75
-       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) + 4 }),
+       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (false) + 4 }),

[NoCoverage] LogicalOperator
src/engine/plateauInterventions.js:25:75
-       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) + 4 }),
+       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget && 8) + 4 }),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:32:25
-       apply: exercise => ({ ...exercise, technique: 'tempo', tempo: '3-1-3' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:39:25
-       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) * 1.1) }),
+       apply: exercise => ({}),

[NoCoverage] ArithmeticOperator
src/engine/plateauInterventions.js:39:56
-       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) * 1.1) }),
+       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) / 1.1) }),

[NoCoverage] ConditionalExpression
src/engine/plateauInterventions.js:39:57
-       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) * 1.1) }),
+       apply: exercise => ({ ...exercise, sets: Math.ceil((true) * 1.1) }),

[NoCoverage] ConditionalExpression
src/engine/plateauInterventions.js:39:57
-       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) * 1.1) }),
+       apply: exercise => ({ ...exercise, sets: Math.ceil((false) * 1.1) }),

[NoCoverage] LogicalOperator
src/engine/plateauInterventions.js:39:57
-       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) * 1.1) }),
+       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets && 3) * 1.1) }),

[NoCoverage] BlockStatement
src/engine/plateauInterventions.js:46:24
-       apply: exercise => {
-         const rec = exercise.recommendation ?? {};
-         const newKg = (rec.kg ?? rec.weight ?? 20) + 2.5;
-         return { ...exercise, recommendation: { ...rec, kg: newKg, weight: newKg } };
-       },
+       apply: exercise => {},

[NoCoverage] LogicalOperator
src/engine/plateauInterventions.js:47:19
-         const rec = exercise.recommendation ?? {};
+         const rec = exercise.recommendation && {};

[NoCoverage] ArithmeticOperator
src/engine/plateauInterventions.js:48:21
-         const newKg = (rec.kg ?? rec.weight ?? 20) + 2.5;
+         const newKg = (rec.kg ?? rec.weight ?? 20) - 2.5;

[NoCoverage] LogicalOperator
src/engine/plateauInterventions.js:48:22
-         const newKg = (rec.kg ?? rec.weight ?? 20) + 2.5;
+         const newKg = ((rec.kg ?? rec.weight) && 20) + 2.5;

[NoCoverage] LogicalOperator
src/engine/plateauInterventions.js:48:22
-         const newKg = (rec.kg ?? rec.weight ?? 20) + 2.5;
+         const newKg = (rec.kg && rec.weight ?? 20) + 2.5;

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:49:14
-         return { ...exercise, recommendation: { ...rec, kg: newKg, weight: newKg } };
+         return {};

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:49:45
-         return { ...exercise, recommendation: { ...rec, kg: newKg, weight: newKg } };
+         return { ...exercise, recommendation: {} };

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:57:25
-       apply: exercise => ({ ...exercise, swapRecommended: true }),
+       apply: exercise => ({}),

[NoCoverage] BooleanLiteral
src/engine/plateauInterventions.js:57:57
-       apply: exercise => ({ ...exercise, swapRecommended: true }),
+       apply: exercise => ({ ...exercise, swapRecommended: false }),
