[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:64:25
-       apply: exercise => ({ ...exercise, technique: 'superset' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:71:25
-       apply: exercise => ({ ...exercise, technique: 'pyramid_up' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:78:25
-       apply: exercise => ({ ...exercise, technique: 'pyramid_down' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:85:25
-       apply: exercise => ({ ...exercise, technique: 'cluster', restSeconds: 20 }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:92:25
-       apply: exercise => ({ ...exercise, technique: 'giant_set' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:111:25
-       apply: exercise => ({ ...exercise, unilateral: true }),
+       apply: exercise => ({}),

[NoCoverage] BooleanLiteral
src/engine/plateauInterventions.js:111:52
-       apply: exercise => ({ ...exercise, unilateral: true }),
+       apply: exercise => ({ ...exercise, unilateral: false }),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:118:25
-       apply: exercise => ({ ...exercise, technique: 'forced_reps', requiresSpotter: true }),
+       apply: exercise => ({}),

[NoCoverage] BooleanLiteral
src/engine/plateauInterventions.js:118:83
-       apply: exercise => ({ ...exercise, technique: 'forced_reps', requiresSpotter: true }),
+       apply: exercise => ({ ...exercise, technique: 'forced_reps', requiresSpotter: false }),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:125:25
-       apply: exercise => ({ ...exercise, technique: 'mechanical_drop' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:132:25
-       apply: exercise => ({ ...exercise, addFrequency: true }),
+       apply: exercise => ({}),

[NoCoverage] BooleanLiteral
src/engine/plateauInterventions.js:132:54
-       apply: exercise => ({ ...exercise, addFrequency: true }),
+       apply: exercise => ({ ...exercise, addFrequency: false }),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:139:25
-       apply: exercise => ({ ...exercise, technique: 'mind_muscle', tempo: '2-1-2' }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:146:25
-       apply: exercise => ({ ...exercise, technique: 'isometric', holdSeconds: 3 }),
+       apply: exercise => ({}),

[NoCoverage] ObjectLiteral
src/engine/plateauInterventions.js:153:25
-       apply: exercise => ({ ...exercise, technique: 'wave_load' }),
+       apply: exercise => ({}),

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:10:18
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:10:18
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks > 4 && !ctx.isInCut,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ObjectLiteral
src/engine/plateauInterventions.js:11:25
-       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) + 1 }),
+       apply: exercise => ({}),
Tests ran:
    applyBestIntervention applies intervention at stagnation 4+

[Survived] ArithmeticOperator
src/engine/plateauInterventions.js:11:65
-       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) + 1 }),
+       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) - 1 }),
Tests ran:
    applyBestIntervention applies intervention at stagnation 4+

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:11:66
-       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) + 1 }),
+       apply: exercise => ({ ...exercise, technique: 'drop', sets: (true) + 1 }),
Tests ran:
    applyBestIntervention applies intervention at stagnation 4+

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:11:66
-       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) + 1 }),
+       apply: exercise => ({ ...exercise, technique: 'drop', sets: (false) + 1 }),
Tests ran:
    applyBestIntervention applies intervention at stagnation 4+

[Survived] LogicalOperator
src/engine/plateauInterventions.js:11:66
-       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) + 1 }),
+       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets && 3) + 1 }),
Tests ran:
    applyBestIntervention applies intervention at stagnation 4+

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:17:18
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:17:18
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: ctx => ctx.stagnationWeeks > 4,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:24:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:24:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => ctx.stagnationWeeks > 3,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:31:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:31:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => ctx.stagnationWeeks > 3,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:38:18
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:38:18
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks > 4 && !ctx.isInCut,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] BooleanLiteral
src/engine/plateauInterventions.js:38:46
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks >= 4 && ctx.isInCut,
Tests ran:
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:45:18
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] LogicalOperator
src/engine/plateauInterventions.js:45:18
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks >= 6 || ctx.readiness?.score >= 75,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:45:18
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => true && ctx.readiness?.score >= 75,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:45:18
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks > 6 && ctx.readiness?.score >= 75,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:45:18
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks < 6 && ctx.readiness?.score >= 75,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:45:46
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks >= 6 && true,
Tests ran:
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] EqualityOperator
src/engine/plateauInterventions.js:45:46
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score > 75,
Tests ran:
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] EqualityOperator
src/engine/plateauInterventions.js:45:46
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score < 75,
Tests ran:
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] OptionalChaining
src/engine/plateauInterventions.js:45:46
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness.score >= 75,
Tests ran:
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:56:18
-       when: ctx => ctx.stagnationWeeks >= 6,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:56:18
-       when: ctx => ctx.stagnationWeeks >= 6,
+       when: ctx => ctx.stagnationWeeks > 6,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:63:18
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:63:18
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks > 4 && !ctx.isInCut,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] BooleanLiteral
src/engine/plateauInterventions.js:63:46
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks >= 4 && ctx.isInCut,
Tests ran:
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:70:18
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:70:18
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: ctx => ctx.stagnationWeeks > 4,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:77:18
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:77:18
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: ctx => ctx.stagnationWeeks > 4,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:84:18
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:84:18
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: ctx => ctx.stagnationWeeks > 5,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:91:18
-       when: ctx => ctx.stagnationWeeks >= 5 && !ctx.isInCut,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:91:18
-       when: ctx => ctx.stagnationWeeks >= 5 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks > 5 && !ctx.isInCut,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] BooleanLiteral
src/engine/plateauInterventions.js:91:46
-       when: ctx => ctx.stagnationWeeks >= 5 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks >= 5 && ctx.isInCut,
Tests ran:
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
    getApplicableInterventions filters out non-CUT-safe interventions in cut
  and 1 more test!

[Survived] LogicalOperator
src/engine/plateauInterventions.js:101:29
-         recommendation: { ...(exercise.recommendation ?? {}), kg: Math.round(((exercise.recommendation?.kg ?? 20) * 0.7) * 2) / 2 },
+         recommendation: { ...(exercise.recommendation && {}), kg: Math.round(((exercise.recommendation?.kg ?? 20) * 0.7) * 2) / 2 },
Tests ran:
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] OptionalChaining
src/engine/plateauInterventions.js:101:78
-         recommendation: { ...(exercise.recommendation ?? {}), kg: Math.round(((exercise.recommendation?.kg ?? 20) * 0.7) * 2) / 2 },
+         recommendation: { ...(exercise.recommendation ?? {}), kg: Math.round(((exercise.recommendation.kg ?? 20) * 0.7) * 2) / 2 },
Tests ran:
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:110:18
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:110:18
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: ctx => ctx.stagnationWeeks > 5,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:117:18
-       when: ctx => ctx.stagnationWeeks >= 6 && !ctx.isInCut,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:117:18
-       when: ctx => ctx.stagnationWeeks >= 6 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks > 6 && !ctx.isInCut,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] BooleanLiteral
src/engine/plateauInterventions.js:117:46
-       when: ctx => ctx.stagnationWeeks >= 6 && !ctx.isInCut,
+       when: ctx => ctx.stagnationWeeks >= 6 && ctx.isInCut,
Tests ran:
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:124:18
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:124:18
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: ctx => ctx.stagnationWeeks > 5,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:131:18
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:131:18
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: ctx => ctx.stagnationWeeks > 4 && (ctx.sessionFrequency ?? 3) <= 3,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:131:46
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: ctx => ctx.stagnationWeeks >= 4 && true,
Tests ran:
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
  and 3 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:131:46
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) < 3,
Tests ran:
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
  and 3 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:131:46
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) > 3,
Tests ran:
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
  and 3 more tests!

[Survived] LogicalOperator
src/engine/plateauInterventions.js:131:47
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency && 3) <= 3,
Tests ran:
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
    getApplicableInterventions deload_week fires at stagnationWeeks >= 8
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:138:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:138:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => ctx.stagnationWeeks > 3,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:145:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:145:18
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: ctx => ctx.stagnationWeeks > 3,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/plateauInterventions.js:152:18
-       when: ctx => ctx.stagnationWeeks >= 7,
+       when: ctx => false,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] EqualityOperator
src/engine/plateauInterventions.js:152:18
-       when: ctx => ctx.stagnationWeeks >= 7,
+       when: ctx => ctx.stagnationWeeks > 7,
Tests ran:
    getApplicableInterventions returns empty when stagnation < threshold
    getApplicableInterventions returns interventions at stagnationWeeks=4
    getApplicableInterventions sorts by efficacy DESC
  and 5 more tests!

[Survived] ObjectLiteral
src/engine/plateauInterventions.js:178:10
-     return { exercise: best.apply(exercise), intervention: best };
+     return {};
Tests ran:
    applyBestIntervention applies intervention at stagnation 4+
    applyBestIntervention deload_week reduces weight to ~70%

[Survived] ArrowFunction
src/engine/plateauInterventions.js:10:11
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:11:12
-       apply: exercise => ({ ...exercise, technique: 'drop', sets: (exercise.sets || 3) + 1 }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:17:11
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:18:12
-       apply: exercise => ({ ...exercise, technique: 'rest_pause', restSeconds: 15 }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:24:11
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:25:12
-       apply: exercise => ({ ...exercise, technique: 'partial', repsTarget: (exercise.repsTarget || 8) + 4 }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:31:11
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:32:12
-       apply: exercise => ({ ...exercise, technique: 'tempo', tempo: '3-1-3' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:38:11
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:39:12
-       apply: exercise => ({ ...exercise, sets: Math.ceil((exercise.sets || 3) * 1.1) }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:45:11
-       when: ctx => ctx.stagnationWeeks >= 6 && ctx.readiness?.score >= 75,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:56:11
-       when: ctx => ctx.stagnationWeeks >= 6,
+       when: () => undefined,
Ran all tests for this mutant.
