[Survived] ArrowFunction
src/engine/plateauInterventions.js:57:12
-       apply: exercise => ({ ...exercise, swapRecommended: true }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:63:11
-       when: ctx => ctx.stagnationWeeks >= 4 && !ctx.isInCut,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:64:12
-       apply: exercise => ({ ...exercise, technique: 'superset' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:70:11
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:71:12
-       apply: exercise => ({ ...exercise, technique: 'pyramid_up' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:77:11
-       when: ctx => ctx.stagnationWeeks >= 4,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:78:12
-       apply: exercise => ({ ...exercise, technique: 'pyramid_down' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:84:11
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:85:12
-       apply: exercise => ({ ...exercise, technique: 'cluster', restSeconds: 20 }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:91:11
-       when: ctx => ctx.stagnationWeeks >= 5 && !ctx.isInCut,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:92:12
-       apply: exercise => ({ ...exercise, technique: 'giant_set' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:110:11
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:111:12
-       apply: exercise => ({ ...exercise, unilateral: true }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:117:11
-       when: ctx => ctx.stagnationWeeks >= 6 && !ctx.isInCut,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:118:12
-       apply: exercise => ({ ...exercise, technique: 'forced_reps', requiresSpotter: true }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:124:11
-       when: ctx => ctx.stagnationWeeks >= 5,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:125:12
-       apply: exercise => ({ ...exercise, technique: 'mechanical_drop' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:131:11
-       when: ctx => ctx.stagnationWeeks >= 4 && (ctx.sessionFrequency ?? 3) <= 3,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:132:12
-       apply: exercise => ({ ...exercise, addFrequency: true }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:138:11
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:139:12
-       apply: exercise => ({ ...exercise, technique: 'mind_muscle', tempo: '2-1-2' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:145:11
-       when: ctx => ctx.stagnationWeeks >= 3,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:146:12
-       apply: exercise => ({ ...exercise, technique: 'isometric', holdSeconds: 3 }),
+       apply: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:152:11
-       when: ctx => ctx.stagnationWeeks >= 7,
+       when: () => undefined,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/engine/plateauInterventions.js:153:12
-       apply: exercise => ({ ...exercise, technique: 'wave_load' }),
+       apply: () => undefined,
Ran all tests for this mutant.

[NoCoverage] ArrayDeclaration
src/engine/predictionEngine.js:48:54
-     const sessionCounts = sessionsPerDayOfWeek(logs ?? []);
+     const sessionCounts = sessionsPerDayOfWeek(logs ?? ["Stryker was here"]);

[NoCoverage] ConditionalExpression
src/engine/predictionEngine.js:86:45
-     const isHighRisk = !today.insufficient && today.probability > 0.3;
+     const isHighRisk = !today.insufficient && true;

[NoCoverage] EqualityOperator
src/engine/predictionEngine.js:86:45
-     const isHighRisk = !today.insufficient && today.probability > 0.3;
+     const isHighRisk = !today.insufficient && today.probability >= 0.3;

[NoCoverage] EqualityOperator
src/engine/predictionEngine.js:86:45
-     const isHighRisk = !today.insufficient && today.probability > 0.3;
+     const isHighRisk = !today.insufficient && today.probability <= 0.3;

[NoCoverage] ArithmeticOperator
src/engine/predictionEngine.js:93:32
-         ? `Istoric: ${Math.round(today.probability * 100)}% șanse să sari azi. Sesiune scurtă recomandată.`
+         ? `Istoric: ${Math.round(today.probability / 100)}% șanse să sari azi. Sesiune scurtă recomandată.`

[Survived] LogicalOperator
src/engine/predictionEngine.js:16:16
-       const ts = log.session ?? log.ts;
+       const ts = log.session && log.ts;
Tests ran:
    absenceProbabilityByDay marks days as insufficient when < 3 total
    absenceProbabilityByDay calculates probability correctly
    absenceProbabilityByDay returns 0 probability for days with no skips
  and 1 more test!

[Survived] ConditionalExpression
src/engine/predictionEngine.js:17:9
-       if (!ts) continue;
+       if (false) continue;
Tests ran:
    absenceProbabilityByDay marks days as insufficient when < 3 total
    absenceProbabilityByDay calculates probability correctly
    absenceProbabilityByDay returns 0 probability for days with no skips
  and 1 more test!

[Survived] ConditionalExpression
src/engine/predictionEngine.js:21:9
-       if (!sessions.has(sessionKey)) {
+       if (true) {
Tests ran:
    absenceProbabilityByDay marks days as insufficient when < 3 total
    absenceProbabilityByDay calculates probability correctly
    absenceProbabilityByDay returns 0 probability for days with no skips
  and 1 more test!

[Survived] ConditionalExpression
src/engine/predictionEngine.js:38:9
-       if (dow >= 0 && dow <= 6) counts[dow]++;
+       if (true) counts[dow]++;
Tests ran:
    absenceProbabilityByDay calculates probability correctly
    getHighRiskDays flags days above threshold

[Survived] LogicalOperator
src/engine/predictionEngine.js:38:9
-       if (dow >= 0 && dow <= 6) counts[dow]++;
+       if (dow >= 0 || dow <= 6) counts[dow]++;
Tests ran:
    absenceProbabilityByDay calculates probability correctly
    getHighRiskDays flags days above threshold

[Survived] ConditionalExpression
src/engine/predictionEngine.js:38:9
-       if (dow >= 0 && dow <= 6) counts[dow]++;
+       if (true && dow <= 6) counts[dow]++;
Tests ran:
    absenceProbabilityByDay calculates probability correctly
    getHighRiskDays flags days above threshold

[Survived] EqualityOperator
src/engine/predictionEngine.js:38:9
-       if (dow >= 0 && dow <= 6) counts[dow]++;
+       if (dow > 0 && dow <= 6) counts[dow]++;
Tests ran:
    absenceProbabilityByDay calculates probability correctly
    getHighRiskDays flags days above threshold

[Survived] ConditionalExpression
src/engine/predictionEngine.js:38:21
-       if (dow >= 0 && dow <= 6) counts[dow]++;
+       if (dow >= 0 && true) counts[dow]++;
Tests ran:
    absenceProbabilityByDay calculates probability correctly
    getHighRiskDays flags days above threshold

[Survived] EqualityOperator
src/engine/predictionEngine.js:38:21
-       if (dow >= 0 && dow <= 6) counts[dow]++;
+       if (dow >= 0 && dow < 6) counts[dow]++;
Tests ran:
    absenceProbabilityByDay calculates probability correctly
    getHighRiskDays flags days above threshold

[Survived] EqualityOperator
src/engine/predictionEngine.js:54:9
-       if (total < 3) return { dow, day: DAY_NAMES[dow], probability: 0, sessions, skips, insufficient: true };
+       if (total <= 3) return { dow, day: DAY_NAMES[dow], probability: 0, sessions, skips, insufficient: true };
Tests ran:
    absenceProbabilityByDay returns 7 entries (one per day)
    absenceProbabilityByDay marks days as insufficient when < 3 total
    absenceProbabilityByDay calculates probability correctly
  and 6 more tests!

[Survived] LogicalOperator
src/engine/predictionEngine.js:69:18
-       .filter(d => !d.insufficient && d.probability > threshold)
+       .filter(d => !d.insufficient || d.probability > threshold)
Tests ran:
    getHighRiskDays returns empty for no high-risk days
    getHighRiskDays flags days above threshold

[Survived] ConditionalExpression
src/engine/predictionEngine.js:69:37
-       .filter(d => !d.insufficient && d.probability > threshold)
+       .filter(d => !d.insufficient && true)
Tests ran:
    getHighRiskDays flags days above threshold

[Survived] EqualityOperator
src/engine/predictionEngine.js:69:37
-       .filter(d => !d.insufficient && d.probability > threshold)
+       .filter(d => !d.insufficient && d.probability >= threshold)
Tests ran:
    getHighRiskDays flags days above threshold

[Survived] ArithmeticOperator
src/engine/predictionEngine.js:72:93
-         recommendation: `Planifică sesiunea mai scurtă sau mută-o. Risc absență: ${Math.round(d.probability * 100)}%`,
+         recommendation: `Planifică sesiunea mai scurtă sau mută-o. Risc absență: ${Math.round(d.probability / 100)}%`,
Tests ran:
    getHighRiskDays flags days above threshold

[Survived] ConditionalExpression
src/engine/predictionEngine.js:86:22
-     const isHighRisk = !today.insufficient && today.probability > 0.3;
+     const isHighRisk = false;
Tests ran:
    predictToday returns isHighRisk: false for clean history
    predictToday returns dow and day name

[Survived] LogicalOperator
src/engine/predictionEngine.js:86:22
-     const isHighRisk = !today.insufficient && today.probability > 0.3;
+     const isHighRisk = !today.insufficient || today.probability > 0.3;
Tests ran:
    predictToday returns isHighRisk: false for clean history
    predictToday returns dow and day name

[Survived] BooleanLiteral
src/engine/predictionEngine.js:86:22
-     const isHighRisk = !today.insufficient && today.probability > 0.3;
+     const isHighRisk = today.insufficient && today.probability > 0.3;
Tests ran:
    predictToday returns isHighRisk: false for clean history
    predictToday returns dow and day name

[NoCoverage] ConditionalExpression
src/engine/prEngine.js:68:32
-           (best, e) => (!best || Number(e.reps) > Number(best.reps)) ? e : best,
+           (best, e) => (!best || false) ? e : best,

[NoCoverage] EqualityOperator
src/engine/prEngine.js:68:32
-           (best, e) => (!best || Number(e.reps) > Number(best.reps)) ? e : best,
+           (best, e) => (!best || Number(e.reps) >= Number(best.reps)) ? e : best,

[NoCoverage] EqualityOperator
src/engine/prEngine.js:68:32
-           (best, e) => (!best || Number(e.reps) > Number(best.reps)) ? e : best,
+           (best, e) => (!best || Number(e.reps) <= Number(best.reps)) ? e : best,

[NoCoverage] BlockStatement
src/engine/prEngine.js:76:30
-     if (setVolume > maxVolume) {
-       const prevBest = prior.reduce(
-         (best, e) => {
-           const v = Number(e.w) * Number(e.reps);
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
-         },
-         null,
-       );
-       return { type: 'volume', kg: w, reps, prevBest };
-     }
+     if (setVolume > maxVolume) {}

[NoCoverage] BlockStatement
src/engine/prEngine.js:78:20
-         (best, e) => {
-           const v = Number(e.w) * Number(e.reps);
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
-         },
+         (best, e) => {},

[NoCoverage] ArithmeticOperator
src/engine/prEngine.js:79:19
-           const v = Number(e.w) * Number(e.reps);
+           const v = Number(e.w) / Number(e.reps);

[NoCoverage] ConditionalExpression
src/engine/prEngine.js:80:17
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (true) ? e : best;

[NoCoverage] ConditionalExpression
src/engine/prEngine.js:80:17
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (false) ? e : best;

[NoCoverage] LogicalOperator
src/engine/prEngine.js:80:17
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (!best && v > Number(best.w) * Number(best.reps)) ? e : best;

[NoCoverage] BooleanLiteral
src/engine/prEngine.js:80:17
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (best || v > (Number(best.w) * Number(best.reps))) ? e : best;

[NoCoverage] ConditionalExpression
src/engine/prEngine.js:80:26
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (!best || false) ? e : best;

[NoCoverage] EqualityOperator
src/engine/prEngine.js:80:26
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (!best || v >= Number(best.w) * Number(best.reps)) ? e : best;

[NoCoverage] EqualityOperator
src/engine/prEngine.js:80:26
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (!best || v <= Number(best.w) * Number(best.reps)) ? e : best;

[NoCoverage] ArithmeticOperator
src/engine/prEngine.js:80:31
-           return (!best || v > (Number(best.w) * Number(best.reps))) ? e : best;
+           return (!best || v > (Number(best.w) / Number(best.reps))) ? e : best;

[NoCoverage] ObjectLiteral
src/engine/prEngine.js:84:12
-       return { type: 'volume', kg: w, reps, prevBest };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/prEngine.js:108:5
-       default:
-         return `Record nou la ${exercise}: ${kg} kg × ${reps} reps.`;
+       default:

[Survived] ConditionalExpression
src/engine/prEngine.js:34:7
-     if (!Number.isFinite(w) || w <= 0) return null;
+     if (false) return null;
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 15 more tests!

[Survived] LogicalOperator
src/engine/prEngine.js:34:7
-     if (!Number.isFinite(w) || w <= 0) return null;
+     if (!Number.isFinite(w) && w <= 0) return null;
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 15 more tests!

[Survived] ConditionalExpression
src/engine/prEngine.js:34:30
-     if (!Number.isFinite(w) || w <= 0) return null;
+     if (!Number.isFinite(w) || false) return null;
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 15 more tests!

[Survived] EqualityOperator
src/engine/prEngine.js:34:30
-     if (!Number.isFinite(w) || w <= 0) return null;
+     if (!Number.isFinite(w) || w < 0) return null;
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 15 more tests!

[Survived] ConditionalExpression
src/engine/prEngine.js:39:5
-       Number(e.w) > 0 && Number(e.reps) > 0,
+       true && Number(e.reps) > 0,
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 11 more tests!

[Survived] EqualityOperator
src/engine/prEngine.js:39:5
-       Number(e.w) > 0 && Number(e.reps) > 0,
+       Number(e.w) >= 0 && Number(e.reps) > 0,
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 11 more tests!

[Survived] ConditionalExpression
src/engine/prEngine.js:39:24
-       Number(e.w) > 0 && Number(e.reps) > 0,
+       Number(e.w) > 0 && true,
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 11 more tests!

[Survived] EqualityOperator
src/engine/prEngine.js:39:24
-       Number(e.w) > 0 && Number(e.reps) > 0,
+       Number(e.w) > 0 && Number(e.reps) >= 0,
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 11 more tests!

[Survived] ArrowFunction
src/engine/prEngine.js:46:34
-     const maxVolume = prior.reduce((m, e) => Math.max(m, Number(e.w) * Number(e.reps)), 0);
+     const maxVolume = prior.reduce(() => undefined, 0);
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 11 more tests!

[Survived] ArithmeticOperator
src/engine/prEngine.js:47:21
-     const setVolume = w * reps;
+     const setVolume = w / reps;
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR does not flag at same max weight
  and 11 more tests!

[Survived] ConditionalExpression
src/engine/prEngine.js:52:21
-         (best, e) => (!best || Number(e.w) > Number(best.w)) ? e : best,
+         (best, e) => (true) ? e : best,
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer
    detectPR — weight PR only considers same exercise
  and 1 more test!

[Survived] EqualityOperator
src/engine/prEngine.js:52:30
-         (best, e) => (!best || Number(e.w) > Number(best.w)) ? e : best,
+         (best, e) => (!best || Number(e.w) >= Number(best.w)) ? e : best,
Tests ran:
    detectPR — weight PR flags new max weight
    detectPR — weight PR returns previous best entry pointer

[Survived] ConditionalExpression
src/engine/prEngine.js:61:7
-     if (sameOrHeavier.length) {
+     if (true) {
Tests ran:
    detectPR — weight PR does not flag at same max weight
    detectPR — weight PR does not flag below max weight
    detectPR — reps PR flags more reps at same weight
  and 7 more tests!

[Survived] ArrowFunction
src/engine/prEngine.js:68:9
-           (best, e) => (!best || Number(e.reps) > Number(best.reps)) ? e : best,
+           () => undefined,
Tests ran:
    detectPR — reps PR flags more reps at same weight
    detectPR — reps PR flags more reps at heavier weight too
    detectPR — volume PR reps PR pre-empts volume PR per detection order
  and 1 more test!

[Survived] ConditionalExpression
src/engine/prEngine.js:68:23
-           (best, e) => (!best || Number(e.reps) > Number(best.reps)) ? e : best,
+           (best, e) => (true) ? e : best,
Tests ran:
    detectPR — reps PR flags more reps at same weight
    detectPR — reps PR flags more reps at heavier weight too
    detectPR — volume PR reps PR pre-empts volume PR per detection order
  and 1 more test!

[Survived] ConditionalExpression
src/engine/prEngine.js:68:23
-           (best, e) => (!best || Number(e.reps) > Number(best.reps)) ? e : best,
+           (best, e) => (false) ? e : best,
Tests ran:
    detectPR — reps PR flags more reps at same weight
    detectPR — reps PR flags more reps at heavier weight too
    detectPR — volume PR reps PR pre-empts volume PR per detection order
  and 1 more test!

[Survived] ConditionalExpression
src/engine/prEngine.js:76:7
-     if (setVolume > maxVolume) {
+     if (false) {
Tests ran:
    detectPR — weight PR does not flag at same max weight
    detectPR — weight PR does not flag below max weight
    detectPR — reps PR does not flag same reps at same weight
  and 3 more tests!

[NoCoverage] OptionalChaining
src/engine/proactiveEngine.js:74:36
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return typeof r === 'object' ? r.score : (typeof r === 'number' ? r : null);

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:76:22
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (!todayScore || false) return null;

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:76:22
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (!todayScore || todayScore <= READINESS_PR) return null;

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:76:22
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (!todayScore || todayScore >= READINESS_PR) return null;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:79:23
-     const twoWeeksAgo = Date.now() - 14 * 24 * 3600 * 1000;
+     const twoWeeksAgo = Date.now() + 14 * 24 * 3600 * 1000;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:79:36
-     const twoWeeksAgo = Date.now() - 14 * 24 * 3600 * 1000;
+     const twoWeeksAgo = Date.now() - 14 * 24 * 3600 / 1000;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:79:36
-     const twoWeeksAgo = Date.now() - 14 * 24 * 3600 * 1000;
+     const twoWeeksAgo = Date.now() - 14 * 24 / 3600 * 1000;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:79:36
-     const twoWeeksAgo = Date.now() - 14 * 24 * 3600 * 1000;
+     const twoWeeksAgo = Date.now() - 14 / 24 * 3600 * 1000;

[NoCoverage] MethodExpression
src/engine/proactiveEngine.js:80:20
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.every(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);

[NoCoverage] ArrowFunction
src/engine/proactiveEngine.js:80:30
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:80:35
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => true);

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:80:35
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => false);

[NoCoverage] LogicalOperator
src/engine/proactiveEngine.js:80:35
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => l.isPR || (l.ts ?? 0) > twoWeeksAgo);

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:80:45
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => l.isPR && true);

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:80:45
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) >= twoWeeksAgo);

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:80:45
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) <= twoWeeksAgo);

[NoCoverage] LogicalOperator
src/engine/proactiveEngine.js:80:46
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
+     const recentPR = logs.some(l => l.isPR && (l.ts && 0) > twoWeeksAgo);

[NoCoverage] BooleanLiteral
src/engine/proactiveEngine.js:81:7
-     if (!recentPR) {
+     if (recentPR) {

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:81:7
-     if (!recentPR) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:81:7
-     if (!recentPR) {
+     if (false) {

[NoCoverage] BlockStatement
src/engine/proactiveEngine.js:81:18
-     if (!recentPR) {
-       return {
-         type: 'pr_opportunity',
-         severity: 'info',
-         message: `Readiness la ${todayScore} — zi bună pentru un PR. Nu ai mai setat niciun PR în 14 zile.`,
-         readinessScore: todayScore,
-       };
-     }
+     if (!recentPR) {}

[NoCoverage] ObjectLiteral
src/engine/proactiveEngine.js:82:12
-       return {
-         type: 'pr_opportunity',
-         severity: 'info',
-         message: `Readiness la ${todayScore} — zi bună pentru un PR. Nu ai mai setat niciun PR în 14 zile.`,
-         readinessScore: todayScore,
-       };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:188:21
-     if (!peakHours || Object.keys(peakHours).length === 0) return null;
+     if (!peakHours || false) return null;

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:188:21
-     if (!peakHours || Object.keys(peakHours).length === 0) return null;
+     if (!peakHours || Object.keys(peakHours).length !== 0) return null;

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:192:7
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:192:7
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/proactiveEngine.js:192:7
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (peakStart !== undefined || hour > peakStart + 2) {

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:192:7
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (true && hour > peakStart + 2) {

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:192:7
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (peakStart === undefined && hour > peakStart + 2) {

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:192:34
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (peakStart !== undefined && true) {

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:192:34
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (peakStart !== undefined && hour >= peakStart + 2) {

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:192:34
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (peakStart !== undefined && hour <= peakStart + 2) {

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:192:41
-     if (peakStart !== undefined && hour > peakStart + 2) {
+     if (peakStart !== undefined && hour > peakStart - 2) {

[NoCoverage] BlockStatement
src/engine/proactiveEngine.js:192:56
-     if (peakStart !== undefined && hour > peakStart + 2) {
-       return {
-         type: 'past_peak_hours',
-         severity: 'info',
-         message: `Ați depășit orele de vârf (${peakStart}:00–${peakStart + 2}:00). Totuși antrenează-te — orice sesiune contează.`,
-       };
-     }
+     if (peakStart !== undefined && hour > peakStart + 2) {}

[NoCoverage] ObjectLiteral
src/engine/proactiveEngine.js:193:12
-       return {
-         type: 'past_peak_hours',
-         severity: 'info',
-         message: `Ați depășit orele de vârf (${peakStart}:00–${peakStart + 2}:00). Totuși antrenează-te — orice sesiune contează.`,
-       };
+       return {};

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:196:62
-         message: `Ați depășit orele de vârf (${peakStart}:00–${peakStart + 2}:00). Totuși antrenează-te — orice sesiune contează.`,
+         message: `Ați depășit orele de vârf (${peakStart}:00–${peakStart - 2}:00). Totuși antrenează-te — orice sesiune contează.`,

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:212:76
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => v !== undefined && true).map(Number);

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:212:76
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v === null).map(Number);

[NoCoverage] MethodExpression
src/engine/proactiveEngine.js:214:21
-     const firstHalf = values.slice(Math.floor(values.length / 2));
+     const firstHalf = values;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:214:45
-     const firstHalf = values.slice(Math.floor(values.length / 2));
+     const firstHalf = values.slice(Math.floor(values.length * 2));

[NoCoverage] MethodExpression
src/engine/proactiveEngine.js:215:22
-     const secondHalf = values.slice(0, Math.floor(values.length / 2));
+     const secondHalf = values;
