[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:215:49
-     const secondHalf = values.slice(0, Math.floor(values.length / 2));
+     const secondHalf = values.slice(0, Math.floor(values.length * 2));

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:216:18
-     const avgOld = firstHalf.reduce((a, b) => a + b, 0) / firstHalf.length;
+     const avgOld = firstHalf.reduce((a, b) => a + b, 0) * firstHalf.length;

[NoCoverage] ArrowFunction
src/engine/proactiveEngine.js:216:35
-     const avgOld = firstHalf.reduce((a, b) => a + b, 0) / firstHalf.length;
+     const avgOld = firstHalf.reduce(() => undefined, 0) / firstHalf.length;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:216:45
-     const avgOld = firstHalf.reduce((a, b) => a + b, 0) / firstHalf.length;
+     const avgOld = firstHalf.reduce((a, b) => a - b, 0) / firstHalf.length;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:217:18
-     const avgNew = secondHalf.reduce((a, b) => a + b, 0) / secondHalf.length;
+     const avgNew = secondHalf.reduce((a, b) => a + b, 0) * secondHalf.length;

[NoCoverage] ArrowFunction
src/engine/proactiveEngine.js:217:36
-     const avgNew = secondHalf.reduce((a, b) => a + b, 0) / secondHalf.length;
+     const avgNew = secondHalf.reduce(() => undefined, 0) / secondHalf.length;

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:217:46
-     const avgNew = secondHalf.reduce((a, b) => a + b, 0) / secondHalf.length;
+     const avgNew = secondHalf.reduce((a, b) => a - b, 0) / secondHalf.length;

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:218:7
-     if (avgNew > avgOld + 0.3) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/proactiveEngine.js:218:7
-     if (avgNew > avgOld + 0.3) {
+     if (false) {

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:218:7
-     if (avgNew > avgOld + 0.3) {
+     if (avgNew >= avgOld + 0.3) {

[NoCoverage] EqualityOperator
src/engine/proactiveEngine.js:218:7
-     if (avgNew > avgOld + 0.3) {
+     if (avgNew <= avgOld + 0.3) {

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:218:16
-     if (avgNew > avgOld + 0.3) {
+     if (avgNew > avgOld - 0.3) {

[NoCoverage] BlockStatement
src/engine/proactiveEngine.js:218:30
-     if (avgNew > avgOld + 0.3) {
-       return {
-         type: 'weight_increasing_in_cut',
-         severity: 'warning',
-         message: `Greutatea a crescut cu ${(avgNew - avgOld).toFixed(1)}kg în CUT. Verifică caloriile.`,
-         trend: +(avgNew - avgOld).toFixed(2),
-       };
-     }
+     if (avgNew > avgOld + 0.3) {}

[NoCoverage] ObjectLiteral
src/engine/proactiveEngine.js:219:12
-       return {
-         type: 'weight_increasing_in_cut',
-         severity: 'warning',
-         message: `Greutatea a crescut cu ${(avgNew - avgOld).toFixed(1)}kg în CUT. Verifică caloriile.`,
-         trend: +(avgNew - avgOld).toFixed(2),
-       };
+       return {};

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:222:43
-         message: `Greutatea a crescut cu ${(avgNew - avgOld).toFixed(1)}kg în CUT. Verifică caloriile.`,
+         message: `Greutatea a crescut cu ${(avgNew + avgOld).toFixed(1)}kg în CUT. Verifică caloriile.`,

[NoCoverage] UnaryOperator
src/engine/proactiveEngine.js:223:14
-         trend: +(avgNew - avgOld).toFixed(2),
+         trend: -(avgNew - avgOld).toFixed(2),

[NoCoverage] ArithmeticOperator
src/engine/proactiveEngine.js:223:16
-         trend: +(avgNew - avgOld).toFixed(2),
+         trend: +(avgNew + avgOld).toFixed(2),

[Survived] ArithmeticOperator
src/engine/proactiveEngine.js:16:15
-       d.setDate(d.getDate() - i);
+       d.setDate(d.getDate() + i);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:19:18
-     const values = last3.map(d => prots[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => prots[d]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:19:55
-     const values = last3.map(d => prots[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => prots[d]).filter(v => true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:19:74
-     const values = last3.map(d => prots[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => prots[d]).filter(v => v !== undefined && true);
Tests ran:
    checkProteinDeficit returns alert when avg protein < 80% of target
    checkProteinDeficit returns null when protein is adequate
    runProactiveChecks sorts warnings before info before success

[Survived] LogicalOperator
src/engine/proactiveEngine.js:19:55
-     const values = last3.map(d => prots[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => prots[d]).filter(v => v !== undefined || v !== null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:19:55
-     const values = last3.map(d => prots[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => prots[d]).filter(v => true && v !== null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:20:7
-     if (values.length === 0) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:23:7
-     if (avgProt < target * 0.8) {
+     if (avgProt <= target * 0.8) {
Tests ran:
    checkProteinDeficit returns alert when avg protein < 80% of target
    checkProteinDeficit returns null when protein is adequate
    runProactiveChecks sorts warnings before info before success

[Survived] OptionalChaining
src/engine/proactiveEngine.js:49:38
-         return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+         return typeof r === 'object' ? r.score : (typeof r === 'number' ? r : null);
Tests ran:
    checkSleepDebt detects 3 consecutive days below 60
    checkSleepDebt returns null when readiness is adequate

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:49:14
-         return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+         return true ? r?.score : (typeof r === 'number' ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:49:50
-         return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+         return typeof r === 'object' ? r?.score : (true ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:49:50
-         return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+         return typeof r === 'object' ? r?.score : (false ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:49:50
-         return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+         return typeof r === 'object' ? r?.score : (typeof r !== 'number' ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:54:26
-     const consecutiveLow = values.slice(0, 3).every(v => v < READINESS_MED);
+     const consecutiveLow = values.slice(0, 3).some(v => v < READINESS_MED);
Tests ran:
    checkSleepDebt detects 3 consecutive days below 60
    checkSleepDebt returns null when readiness is adequate

[Survived] MethodExpression
src/engine/proactiveEngine.js:54:26
-     const consecutiveLow = values.slice(0, 3).every(v => v < READINESS_MED);
+     const consecutiveLow = values.every(v => v < READINESS_MED);
Tests ran:
    checkSleepDebt detects 3 consecutive days below 60
    checkSleepDebt returns null when readiness is adequate

[Survived] EqualityOperator
src/engine/proactiveEngine.js:54:56
-     const consecutiveLow = values.slice(0, 3).every(v => v < READINESS_MED);
+     const consecutiveLow = values.slice(0, 3).every(v => v <= READINESS_MED);
Tests ran:
    checkSleepDebt detects 3 consecutive days below 60
    checkSleepDebt returns null when readiness is adequate

[Survived] MethodExpression
src/engine/proactiveEngine.js:59:57
-         message: `Readiness sub ${READINESS_MED} pentru ${values.slice(0, 3).length} zile consecutive. Prioritizează somnul.`,
+         message: `Readiness sub ${READINESS_MED} pentru ${values.length} zile consecutive. Prioritizează somnul.`,
Tests ran:
    checkSleepDebt detects 3 consecutive days below 60

[Survived] MethodExpression
src/engine/proactiveEngine.js:60:15
-         values: values.slice(0, 3),
+         values: values,
Tests ran:
    checkSleepDebt detects 3 consecutive days below 60

[Survived] BooleanLiteral
src/engine/proactiveEngine.js:70:21
-     if (!readiness || !logs) return null;
+     if (!readiness || logs) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/proactiveEngine.js:69:53
-   export function checkPROpportunity(readiness, logs) {
-     if (!readiness || !logs) return null;
-     const today = tod();
-     const todayScore = (() => {
-       const r = readiness[today];
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
-     })();
-     if (!todayScore || todayScore < READINESS_PR) return null;
-   
-     // Check last PR
-     const twoWeeksAgo = Date.now() - 14 * 24 * 3600 * 1000;
-     const recentPR = logs.some(l => l.isPR && (l.ts ?? 0) > twoWeeksAgo);
-     if (!recentPR) {
-       return {
-         type: 'pr_opportunity',
-         severity: 'info',
-         message: `Readiness la ${todayScore} — zi bună pentru un PR. Nu ai mai setat niciun PR în 14 zile.`,
-         readinessScore: todayScore,
-       };
-     }
-     return null;
-   }
+   export function checkPROpportunity(readiness, logs) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:70:7
-     if (!readiness || !logs) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] BlockStatement
src/engine/proactiveEngine.js:72:29
-     const todayScore = (() => {
-       const r = readiness[today];
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
-     })();
+     const todayScore = (() => {})();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:74:12
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return true ? r?.score : (typeof r === 'number' ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:74:12
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return false ? r?.score : (typeof r === 'number' ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:74:12
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return typeof r !== 'object' ? r?.score : (typeof r === 'number' ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:74:48
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return typeof r === 'object' ? r?.score : (true ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:74:48
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return typeof r === 'object' ? r?.score : (false ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:74:48
-       return typeof r === 'object' ? r?.score : (typeof r === 'number' ? r : null);
+       return typeof r === 'object' ? r?.score : (typeof r !== 'number' ? r : null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:76:7
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:76:7
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:76:7
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (!todayScore && todayScore < READINESS_PR) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BooleanLiteral
src/engine/proactiveEngine.js:76:7
-     if (!todayScore || todayScore < READINESS_PR) return null;
+     if (todayScore || todayScore < READINESS_PR) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:105:9
-       if (relevant.length === 0) {
+       if (false) {
Tests ran:
    H14g — checkRecoveryGroups from logs returns undertrained alert when muscle has no logs in 6 days
    H14g — checkRecoveryGroups from logs returns null when all muscles trained within 5 days
    H14g — checkRecoveryGroups from logs ignores baseline logs for daysSinceLast computation

[Survived] MethodExpression
src/engine/proactiveEngine.js:108:22
-         const lastTs = Math.max(...relevant.map(l => l.ts || new Date(l.date).getTime()));
+         const lastTs = Math.min(...relevant.map(l => l.ts || new Date(l.date).getTime()));
Tests ran:
    H14g — checkRecoveryGroups from logs returns undertrained alert when muscle has no logs in 6 days
    H14g — checkRecoveryGroups from logs returns null when all muscles trained within 5 days
    H14g — checkRecoveryGroups from logs ignores baseline logs for daysSinceLast computation

[Survived] EqualityOperator
src/engine/proactiveEngine.js:114:27
-       .filter(([, days]) => days > 5)
+       .filter(([, days]) => days >= 5)
Tests ran:
    H14g — checkRecoveryGroups from logs returns undertrained alert when muscle has no logs in 6 days
    H14g — checkRecoveryGroups from logs returns null when all muscles trained within 5 days
    H14g — checkRecoveryGroups from logs ignores baseline logs for daysSinceLast computation

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:132:16
-     if (!logs || logs.length === 0) return null;
+     if (!logs || false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:134:5
-       logs.map(l => {
-         const ts = l.ts ?? (l.date ? new Date(l.date).getTime() : null);
-         return ts ? todTs(ts) : null;
-       }).filter(Boolean)
+       logs.map(l => {
+     const ts = l.ts ?? (l.date ? new Date(l.date).getTime() : null);
+     return ts ? todTs(ts) : null;
+   })
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:139:18
-     const sorted = [...days].sort().reverse();
+     const sorted = [...days].sort();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:139:18
-     const sorted = [...days].sort().reverse();
+     const sorted = [...days].reverse();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ArrayDeclaration
src/engine/proactiveEngine.js:139:18
-     const sorted = [...days].sort().reverse();
+     const sorted = [].sort().reverse();
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:148:7
-     if (streak >= 5) {
+     if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:148:7
-     if (streak >= 5) {
+     if (streak > 5) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 3 more tests!

[Survived] ArithmeticOperator
src/engine/proactiveEngine.js:167:15
-       d.setDate(d.getDate() - i);
+       d.setDate(d.getDate() + i);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:170:18
-     const values = last3.map(d => kcals[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => kcals[d]);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:170:55
-     const values = last3.map(d => kcals[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => kcals[d]).filter(v => true);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:170:74
-     const values = last3.map(d => kcals[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => kcals[d]).filter(v => v !== undefined && true);
Tests ran:
    checkKcalDeficit alerts when avg kcal < 1800
    checkKcalDeficit returns null when kcals adequate

[Survived] LogicalOperator
src/engine/proactiveEngine.js:170:55
-     const values = last3.map(d => kcals[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => kcals[d]).filter(v => v !== undefined || v !== null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:170:55
-     const values = last3.map(d => kcals[d]).filter(v => v !== undefined && v !== null);
+     const values = last3.map(d => kcals[d]).filter(v => true && v !== null);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:171:7
-     if (values.length === 0) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:173:7
-     if (avgKcal < KCAL_TARGET) {
+     if (avgKcal <= KCAL_TARGET) {
Tests ran:
    checkKcalDeficit alerts when avg kcal < 1800
    checkKcalDeficit returns null when kcals adequate

[Survived] BlockStatement
src/engine/proactiveEngine.js:187:43
-   export function checkPeakHours(peakHours) {
-     if (!peakHours || Object.keys(peakHours).length === 0) return null;
-     const hour = new Date().getHours();
-     const today = new Date().getDay(); // 0-6
-     const peakStart = peakHours[today];
-     if (peakStart !== undefined && hour > peakStart + 2) {
-       return {
-         type: 'past_peak_hours',
-         severity: 'info',
-         message: `Ați depășit orele de vârf (${peakStart}:00–${peakStart + 2}:00). Totuși antrenează-te — orice sesiune contează.`,
-       };
-     }
-     return null;
-   }
+   export function checkPeakHours(peakHours) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:188:7
-     if (!peakHours || Object.keys(peakHours).length === 0) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!
