[Survived] BlockStatement
src/engine/proactiveEngine.js:205:52
-   export function checkWeightTrend(weights, isInCut) {
-     if (!isInCut || !weights) return null;
-     const last7 = Array.from({ length: 7 }, (_, i) => {
-       const d = new Date();
-       d.setDate(d.getDate() - i);
-       return todDate(d);
-     });
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
-     if (values.length < 4) return null;
-     const firstHalf = values.slice(Math.floor(values.length / 2));
-     const secondHalf = values.slice(0, Math.floor(values.length / 2));
-     const avgOld = firstHalf.reduce((a, b) => a + b, 0) / firstHalf.length;
-     const avgNew = secondHalf.reduce((a, b) => a + b, 0) / secondHalf.length;
-     if (avgNew > avgOld + 0.3) {
-       return {
-         type: 'weight_increasing_in_cut',
-         severity: 'warning',
-         message: `Greutatea a crescut cu ${(avgNew - avgOld).toFixed(1)}kg în CUT. Verifică caloriile.`,
-         trend: +(avgNew - avgOld).toFixed(2),
-       };
-     }
-     return null;
-   }
+   export function checkWeightTrend(weights, isInCut) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:206:7
-     if (!isInCut || !weights) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] BooleanLiteral
src/engine/proactiveEngine.js:206:19
-     if (!isInCut || !weights) return null;
+     if (!isInCut || weights) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ObjectLiteral
src/engine/proactiveEngine.js:207:28
-     const last7 = Array.from({ length: 7 }, (_, i) => {
+     const last7 = Array.from({}, (_, i) => {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/proactiveEngine.js:207:53
-     const last7 = Array.from({ length: 7 }, (_, i) => {
-       const d = new Date();
-       d.setDate(d.getDate() - i);
-       return todDate(d);
-     });
+     const last7 = Array.from({ length: 7 }, (_, i) => {});
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:206:7
-     if (!isInCut || !weights) return null;
+     if (!isInCut && !weights) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] BooleanLiteral
src/engine/proactiveEngine.js:206:7
-     if (!isInCut || !weights) return null;
+     if (isInCut || !weights) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:209:5
-       d.setDate(d.getDate() - i);
+       d.setTime(d.getDate() - i);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArithmeticOperator
src/engine/proactiveEngine.js:209:15
-       d.setDate(d.getDate() - i);
+       d.setDate(d.getDate() + i);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:212:18
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrowFunction
src/engine/proactiveEngine.js:212:28
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(() => undefined).filter(v => v !== undefined && v !== null).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrowFunction
src/engine/proactiveEngine.js:212:52
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(() => undefined).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:212:57
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => true).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:212:57
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => false).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:212:57
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => v !== undefined || v !== null).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:212:57
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => true && v !== null).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:212:57
-     const values = last7.map(d => weights[d]).filter(v => v !== undefined && v !== null).map(Number);
+     const values = last7.map(d => weights[d]).filter(v => v === undefined && v !== null).map(Number);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:213:7
-     if (values.length < 4) return null;
+     if (true) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:213:7
-     if (values.length < 4) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:213:7
-     if (values.length < 4) return null;
+     if (values.length <= 4) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:213:7
-     if (values.length < 4) return null;
+     if (values.length >= 4) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:234:18
-     const lastTs = Math.max(...logs.map(l => l.ts ?? 0).filter(Boolean));
+     const lastTs = Math.min(...logs.map(l => l.ts ?? 0).filter(Boolean));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 4 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:234:30
-     const lastTs = Math.max(...logs.map(l => l.ts ?? 0).filter(Boolean));
+     const lastTs = Math.max(...logs.map(l => l.ts ?? 0));
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:235:7
-     if (!lastTs) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 4 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:237:7
-     if (daysSinceLast >= 4) {
+     if (daysSinceLast > 4) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:255:35
-     if (todayWater !== undefined && todayWater !== null && Number(todayWater) < 2000) {
+     if (todayWater !== undefined && true && Number(todayWater) < 2000) {
Tests ran:
    checkHydration alerts when today water < 2000ml
    checkHydration returns null when water adequate

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:255:7
-     if (todayWater !== undefined && todayWater !== null && Number(todayWater) < 2000) {
+     if (true && Number(todayWater) < 2000) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:255:7
-     if (todayWater !== undefined && todayWater !== null && Number(todayWater) < 2000) {
+     if (todayWater !== undefined || todayWater !== null && Number(todayWater) < 2000) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/proactiveEngine.js:255:7
-     if (todayWater !== undefined && todayWater !== null && Number(todayWater) < 2000) {
+     if (true && todayWater !== null && Number(todayWater) < 2000) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] EqualityOperator
src/engine/proactiveEngine.js:255:58
-     if (todayWater !== undefined && todayWater !== null && Number(todayWater) < 2000) {
+     if (todayWater !== undefined && todayWater !== null && Number(todayWater) <= 2000) {
Tests ran:
    checkHydration alerts when today water < 2000ml
    checkHydration returns null when water adequate

[Survived] LogicalOperator
src/engine/proactiveEngine.js:276:7
-     } = ctx ?? {};
+     } = ctx && {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:278:24
-     const bodyweightKg = user?.weight ?? weights?.[tod()] ?? null;
+     const bodyweightKg = (user?.weight ?? weights?.[tod()]) && null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:278:24
-     const bodyweightKg = user?.weight ?? weights?.[tod()] ?? null;
+     const bodyweightKg = user?.weight && weights?.[tod()] ?? null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:279:29
-     const currentKcalTarget = user?.kcalTarget ?? null;
+     const currentKcalTarget = user?.kcalTarget && null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ArrayDeclaration
src/engine/proactiveEngine.js:281:18
-     const checks = [
-       checkProteinDeficit(prots, bodyweightKg),
-       checkSleepDebt(readiness),
-       checkPROpportunity(readiness, logs),
-       checkRecoveryGroups(logs, muscleState),
-       checkTrainingStreak(logs),
-       checkKcalDeficit(kcals, currentKcalTarget),
-       checkPeakHours(peakHours),
-       checkWeightTrend(weights, isInCut),
-       checkInactivity(logs),
-       checkHydration(waters),
-     ];
+     const checks = [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ArithmeticOperator
src/engine/proactiveEngine.js:297:21
-       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) - (SEVERITY_ORDER[b.severity] ?? 9));
+       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) + (SEVERITY_ORDER[b.severity] ?? 9));
Tests ran:
    runProactiveChecks sorts warnings before info before success

[Survived] ObjectLiteral
src/engine/proactiveEngine.js:294:26
-     const SEVERITY_ORDER = { warning: 0, info: 1, success: 2 };
+     const SEVERITY_ORDER = {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] MethodExpression
src/engine/proactiveEngine.js:295:10
-     return checks
-       .filter(Boolean)
-       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) - (SEVERITY_ORDER[b.severity] ?? 9));
+     return checks.filter(Boolean);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ArrowFunction
src/engine/proactiveEngine.js:297:11
-       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) - (SEVERITY_ORDER[b.severity] ?? 9));
+       .sort(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] LogicalOperator
src/engine/proactiveEngine.js:297:22
-       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) - (SEVERITY_ORDER[b.severity] ?? 9));
+       .sort((a, b) => (SEVERITY_ORDER[a.severity] && 9) - (SEVERITY_ORDER[b.severity] ?? 9));
Tests ran:
    runProactiveChecks sorts warnings before info before success

[Survived] LogicalOperator
src/engine/proactiveEngine.js:297:58
-       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) - (SEVERITY_ORDER[b.severity] ?? 9));
+       .sort((a, b) => (SEVERITY_ORDER[a.severity] ?? 9) - (SEVERITY_ORDER[b.severity] && 9));
Tests ran:
    runProactiveChecks sorts warnings before info before success

[NoCoverage] BlockStatement
src/engine/profileTyping.js:20:30
-   function _isoWeekLocal(date) {
-     const d = typeof date === 'string' ? new Date(date) : new Date(date);
-     const thursday = new Date(d);
-     thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
-     const jan4 = new Date(thursday.getFullYear(), 0, 4);
-     const startOfWeek1 = new Date(jan4);
-     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
-     const week = Math.floor((thursday - startOfWeek1) / (7 * 86400000)) + 1;
-     return `${thursday.getFullYear()}-W${String(week).padStart(2, '0')}`;
-   }
+   function _isoWeekLocal(date) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:21:13
-     const d = typeof date === 'string' ? new Date(date) : new Date(date);
+     const d = true ? new Date(date) : new Date(date);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:21:13
-     const d = typeof date === 'string' ? new Date(date) : new Date(date);
+     const d = false ? new Date(date) : new Date(date);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:21:13
-     const d = typeof date === 'string' ? new Date(date) : new Date(date);
+     const d = typeof date !== 'string' ? new Date(date) : new Date(date);

[NoCoverage] MethodExpression
src/engine/profileTyping.js:23:3
-     thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+     thursday.setTime(d.getDate() - (d.getDay() + 6) % 7 + 3);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:23:20
-     thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+     thursday.setDate(d.getDate() - (d.getDay() + 6) % 7 - 3);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:23:20
-     thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+     thursday.setDate(d.getDate() + (d.getDay() + 6) % 7 + 3);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:23:35
-     thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+     thursday.setDate(d.getDate() - ((d.getDay() + 6) * 7) + 3);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:23:36
-     thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+     thursday.setDate(d.getDate() - ((d.getDay() - 6) % 7) + 3);

[NoCoverage] MethodExpression
src/engine/profileTyping.js:26:3
-     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+     startOfWeek1.setTime(jan4.getDate() - (jan4.getDay() + 6) % 7);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:26:24
-     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+     startOfWeek1.setDate(jan4.getDate() + (jan4.getDay() + 6) % 7);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:26:42
-     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() + 6) * 7));

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:26:43
-     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+     startOfWeek1.setDate(jan4.getDate() - ((jan4.getDay() - 6) % 7));

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:27:16
-     const week = Math.floor((thursday - startOfWeek1) / (7 * 86400000)) + 1;
+     const week = Math.floor((thursday - startOfWeek1) / (7 * 86400000)) - 1;

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:27:27
-     const week = Math.floor((thursday - startOfWeek1) / (7 * 86400000)) + 1;
+     const week = Math.floor((thursday - startOfWeek1) * (7 * 86400000)) + 1;

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:27:28
-     const week = Math.floor((thursday - startOfWeek1) / (7 * 86400000)) + 1;
+     const week = Math.floor((thursday + startOfWeek1) / (7 * 86400000)) + 1;

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:27:56
-     const week = Math.floor((thursday - startOfWeek1) / (7 * 86400000)) + 1;
+     const week = Math.floor((thursday - startOfWeek1) / (7 / 86400000)) + 1;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:39:70
-   export function _computeConfidence(signatureMarkers, counterMarkers) {
-     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);
-     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length ?? 0);
-     if (ctr >= 2) return 'low';
-     if (sig >= 3 && ctr === 0) return 'high';
-     if (sig >= 2 && ctr <= 1) return 'medium';
-     return 'low';
-   }
+   export function _computeConfidence(signatureMarkers, counterMarkers) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:40:15
-     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);
+     const sig = true ? signatureMarkers : (signatureMarkers?.length ?? 0);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:40:15
-     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);
+     const sig = false ? signatureMarkers : (signatureMarkers?.length ?? 0);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:40:15
-     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);
+     const sig = typeof signatureMarkers !== 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:40:74
-     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);
+     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length && 0);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:40:74
-     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers?.length ?? 0);
+     const sig = typeof signatureMarkers === 'number' ? signatureMarkers : (signatureMarkers.length ?? 0);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:41:15
-     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length ?? 0);
+     const ctr = true ? counterMarkers : (counterMarkers?.length ?? 0);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:41:15
-     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length ?? 0);
+     const ctr = false ? counterMarkers : (counterMarkers?.length ?? 0);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:41:15
-     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length ?? 0);
+     const ctr = typeof counterMarkers !== 'number' ? counterMarkers : (counterMarkers?.length ?? 0);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:41:70
-     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length ?? 0);
+     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length && 0);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:41:70
-     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers?.length ?? 0);
+     const ctr = typeof counterMarkers === 'number' ? counterMarkers : (counterMarkers.length ?? 0);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:43:7
-     if (ctr >= 2) return 'low';
+     if (true) return 'low';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:43:7
-     if (ctr >= 2) return 'low';
+     if (false) return 'low';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:43:7
-     if (ctr >= 2) return 'low';
+     if (ctr > 2) return 'low';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:43:7
-     if (ctr >= 2) return 'low';
+     if (ctr < 2) return 'low';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:44:7
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (true) return 'high';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:44:7
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (false) return 'high';

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:44:7
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (sig >= 3 || ctr === 0) return 'high';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:44:7
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (true && ctr === 0) return 'high';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:44:7
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (sig > 3 && ctr === 0) return 'high';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:44:7
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (sig < 3 && ctr === 0) return 'high';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:44:19
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (sig >= 3 && true) return 'high';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:44:19
-     if (sig >= 3 && ctr === 0) return 'high';
+     if (sig >= 3 && ctr !== 0) return 'high';
