[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:45:7
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (true) return 'medium';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:45:7
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (false) return 'medium';

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:45:7
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (sig >= 2 || ctr <= 1) return 'medium';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:45:7
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (true && ctr <= 1) return 'medium';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:45:7
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (sig > 2 && ctr <= 1) return 'medium';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:45:7
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (sig < 2 && ctr <= 1) return 'medium';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:45:19
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (sig >= 2 && true) return 'medium';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:45:19
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (sig >= 2 && ctr < 1) return 'medium';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:45:19
-     if (sig >= 2 && ctr <= 1) return 'medium';
+     if (sig >= 2 && ctr > 1) return 'medium';

[NoCoverage] BlockStatement
src/engine/profileTyping.js:54:50
-   export function _hasInsufficientData(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const sessionCount = entries.filter(
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
-     ).length;
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
-     return { insufficient: false, stale: false, sessionCount };
-   }
+   export function _hasInsufficientData(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:55:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:55:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:56:24
-     const sessionCount = entries.filter(
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
-     ).length;
+     const sessionCount = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:57:5
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       () => undefined

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:57:10
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:57:10
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:57:10
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome?.executed === true && e.outcome?.executed === 'partial'

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:57:10
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => false || e.outcome?.executed === 'partial'

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:57:10
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome?.executed !== true || e.outcome?.executed === 'partial'

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:57:10
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome.executed === true || e.outcome?.executed === 'partial'

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:57:34
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome?.executed === false || e.outcome?.executed === 'partial'

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:57:42
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome?.executed === true || false

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:57:42
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome?.executed === true || e.outcome?.executed !== 'partial'

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:57:42
-       e => e.outcome?.executed === true || e.outcome?.executed === 'partial'
+       e => e.outcome?.executed === true || e.outcome.executed === 'partial'

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:60:7
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
+     if (true) return { insufficient: true, stale: true, sessionCount: 0 };

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:60:7
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
+     if (false) return { insufficient: true, stale: true, sessionCount: 0 };

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:60:7
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
+     if (sessionCount !== 0) return { insufficient: true, stale: true, sessionCount: 0 };

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:60:34
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
+     if (sessionCount === 0) return {};

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:60:50
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
+     if (sessionCount === 0) return { insufficient: false, stale: true, sessionCount: 0 };

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:60:63
-     if (sessionCount === 0) return { insufficient: true, stale: true, sessionCount: 0 };
+     if (sessionCount === 0) return { insufficient: true, stale: false, sessionCount: 0 };

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:61:7
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (true) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:61:7
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (false) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:61:7
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (sessionCount <= 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:61:7
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (sessionCount >= 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:61:33
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (sessionCount < 12) return {};  // <12 sessions threshold (ADR 013)

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:61:49
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (sessionCount < 12) return { insufficient: false, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:61:62
-     if (sessionCount < 12) return { insufficient: true, stale: false, sessionCount };  // <12 sessions threshold (ADR 013)
+     if (sessionCount < 12) return { insufficient: true, stale: true, sessionCount };  // <12 sessions threshold (ADR 013)

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:62:10
-     return { insufficient: false, stale: false, sessionCount };
+     return {};

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:62:26
-     return { insufficient: false, stale: false, sessionCount };
+     return { insufficient: true, stale: false, sessionCount };

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:62:40
-     return { insufficient: false, stale: false, sessionCount };
+     return { insufficient: false, stale: true, sessionCount };

[NoCoverage] BlockStatement
src/engine/profileTyping.js:67:39
-   function _volumeCreepEntries(entries) {
-     return entries.filter(
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
-     );
-   }
+   function _volumeCreepEntries(entries) {}

[NoCoverage] MethodExpression
src/engine/profileTyping.js:68:10
-     return entries.filter(
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
-     );
+     return entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:69:5
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+       () => undefined

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:69:10
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+       e => true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:69:10
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+       e => false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:69:10
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') && e.outcome?.deviation === true || (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:69:10
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
+       e => true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:69:10
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-            e.outcome?.deviation === true &&
+       e => e.outcome?.executed === true || e.outcome?.executed === 'partial' || e.outcome?.deviation === true &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:69:11
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (true) &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:69:11
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome?.executed === true && e.outcome?.executed === 'partial') &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:69:11
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (false || e.outcome?.executed === 'partial') &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:69:11
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome?.executed !== true || e.outcome?.executed === 'partial') &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:69:11
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome.executed === true || e.outcome?.executed === 'partial') &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:69:35
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome?.executed === false || e.outcome?.executed === 'partial') &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:69:43
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome?.executed === true || false) &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:69:43
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome?.executed === true || e.outcome?.executed !== 'partial') &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:69:43
-       e => (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+       e => (e.outcome?.executed === true || e.outcome.executed === 'partial') &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:70:10
-            e.outcome?.deviation === true &&
+            true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:70:10
-            e.outcome?.deviation === true &&
+            e.outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:70:10
-            e.outcome?.deviation === true &&
+            e.outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:70:35
-            e.outcome?.deviation === true &&
+            e.outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:71:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            true

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:71:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            (e.outcome?.actualSets ?? 0) >= (e.outcome?.proposedSets ?? 0)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:71:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            (e.outcome?.actualSets ?? 0) <= (e.outcome?.proposedSets ?? 0)

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:71:11
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            (e.outcome?.actualSets && 0) > (e.outcome?.proposedSets ?? 0)

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:71:11
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            (e.outcome.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:71:42
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets && 0)

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:71:42
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0)
+            (e.outcome?.actualSets ?? 0) > (e.outcome.proposedSets ?? 0)

[NoCoverage] BlockStatement
src/engine/profileTyping.js:75:43
-   function _hasFrustrationPattern(workouts) {
-     for (let i = 0; i < workouts.length; i++) {
-       const rating = workouts[i].outcome?.rating;
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
-       const windowEnd = new Date(workouts[i].date);
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day frustration window (ADR 013 signal #3)
-       for (let j = i; j < workouts.length; j++) {
-         if (new Date(workouts[j].date) > windowEnd) break;
-         if (workouts[j].outcome?.deviation === true &&
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
-           return true;
-         }
-       }
-     }
-     return false;
-   }
+   function _hasFrustrationPattern(workouts) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:76:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:76:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i <= workouts.length; i++) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:76:19
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i >= workouts.length; i++) {

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:76:40
-     for (let i = 0; i < workouts.length; i++) {
+     for (let i = 0; i < workouts.length; i--) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:76:45
-     for (let i = 0; i < workouts.length; i++) {
-       const rating = workouts[i].outcome?.rating;
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
-       const windowEnd = new Date(workouts[i].date);
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day frustration window (ADR 013 signal #3)
-       for (let j = i; j < workouts.length; j++) {
-         if (new Date(workouts[j].date) > windowEnd) break;
-         if (workouts[j].outcome?.deviation === true &&
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
-           return true;
-         }
-       }
-     }
+     for (let i = 0; i < workouts.length; i++) {}

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:77:20
-       const rating = workouts[i].outcome?.rating;
+       const rating = workouts[i].outcome.rating;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:78:9
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (typeof rating === 'number' && rating <= 2) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:78:9
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:78:9
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (false) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:78:11
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(true)) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:78:11
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(false)) continue;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:78:11
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(typeof rating === 'number' || rating <= 2)) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:78:11
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(true && rating <= 2)) continue;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:78:11
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(typeof rating !== 'number' && rating <= 2)) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:78:41
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(typeof rating === 'number' && true)) continue;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:78:41
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(typeof rating === 'number' && rating < 2)) continue;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:78:41
-       if (!(typeof rating === 'number' && rating <= 2)) continue;
+       if (!(typeof rating === 'number' && rating > 2)) continue;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:80:5
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day frustration window (ADR 013 signal #3)
+       windowEnd.setTime(windowEnd.getDate() + 14);  // 14-day frustration window (ADR 013 signal #3)

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:80:23
-       windowEnd.setDate(windowEnd.getDate() + 14);  // 14-day frustration window (ADR 013 signal #3)
+       windowEnd.setDate(windowEnd.getDate() - 14);  // 14-day frustration window (ADR 013 signal #3)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:81:21
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; false; j++) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:81:21
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; j <= workouts.length; j++) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:81:21
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; j >= workouts.length; j++) {

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:81:42
-       for (let j = i; j < workouts.length; j++) {
+       for (let j = i; j < workouts.length; j--) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:81:47
-       for (let j = i; j < workouts.length; j++) {
-         if (new Date(workouts[j].date) > windowEnd) break;
-         if (workouts[j].outcome?.deviation === true &&
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
-           return true;
-         }
-       }
+       for (let j = i; j < workouts.length; j++) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:82:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (true) break;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:82:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (false) break;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:82:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (new Date(workouts[j].date) >= windowEnd) break;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:82:11
-         if (new Date(workouts[j].date) > windowEnd) break;
+         if (new Date(workouts[j].date) <= windowEnd) break;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:83:11
-         if (workouts[j].outcome?.deviation === true &&
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:83:11
-         if (workouts[j].outcome?.deviation === true &&
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+         if (false) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:83:11
-         if (workouts[j].outcome?.deviation === true &&
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+         if (workouts[j].outcome?.deviation === true || (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:83:11
-         if (workouts[j].outcome?.deviation === true &&
+         if (true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:83:11
-         if (workouts[j].outcome?.deviation === true &&
+         if (workouts[j].outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:83:11
-         if (workouts[j].outcome?.deviation === true &&
+         if (workouts[j].outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:83:46
-         if (workouts[j].outcome?.deviation === true &&
+         if (workouts[j].outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:84:11
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             true) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:84:11
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             (workouts[j].outcome?.actualSets ?? 0) >= (workouts[j].outcome?.proposedSets ?? 0)) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:84:11
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             (workouts[j].outcome?.actualSets ?? 0) <= (workouts[j].outcome?.proposedSets ?? 0)) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:84:12
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             (workouts[j].outcome?.actualSets && 0) > (workouts[j].outcome?.proposedSets ?? 0)) {

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:84:12
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             (workouts[j].outcome.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:84:53
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets && 0)) {

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:84:53
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
+             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome.proposedSets ?? 0)) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:84:94
-             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {
-           return true;
-         }
+             (workouts[j].outcome?.actualSets ?? 0) > (workouts[j].outcome?.proposedSets ?? 0)) {}

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:85:16
-           return true;
+           return false;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:89:10
-     return false;
+     return true;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:92:36
-   function _hasRecoveryDebt(entries) {
-     const byWeek = {};
-     for (const entry of entries) {
-       if (!entry.date) continue;
-       const week = _isoWeekLocal(entry.date);
-       if (!byWeek[week]) byWeek[week] = 0;
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
-     }
-     const sortedWeeks = Object.keys(byWeek).sort();
-     let streak = 0;
-     for (const week of sortedWeeks) {
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
-         streak++;
-         if (streak >= 3) return true;
-       } else {
-         streak = 0;
-       }
-     }
-     return false;
-   }
+   function _hasRecoveryDebt(entries) {}

[NoCoverage] BlockStatement
src/engine/profileTyping.js:94:32
-     for (const entry of entries) {
-       if (!entry.date) continue;
-       const week = _isoWeekLocal(entry.date);
-       if (!byWeek[week]) byWeek[week] = 0;
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
-     }
+     for (const entry of entries) {}

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:95:9
-       if (!entry.date) continue;
+       if (entry.date) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:95:9
-       if (!entry.date) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:95:9
-       if (!entry.date) continue;
+       if (false) continue;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:97:9
-       if (!byWeek[week]) byWeek[week] = 0;
+       if (byWeek[week]) byWeek[week] = 0;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:97:9
-       if (!byWeek[week]) byWeek[week] = 0;
+       if (true) byWeek[week] = 0;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:97:9
-       if (!byWeek[week]) byWeek[week] = 0;
+       if (false) byWeek[week] = 0;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:98:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (true) byWeek[week]++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:98:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (false) byWeek[week]++;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:98:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === false || entry.outcome?.rest_marked === true) byWeek[week]++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:98:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (true && entry.outcome?.rest_marked === true) byWeek[week]++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:98:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed !== false && entry.outcome?.rest_marked === true) byWeek[week]++;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:98:9
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:98:37
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === true && entry.outcome?.rest_marked === true) byWeek[week]++;
