[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:98:46
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === false && true) byWeek[week]++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:98:46
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === false && entry.outcome?.rest_marked !== true) byWeek[week]++;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:98:46
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === false && entry.outcome.rest_marked === true) byWeek[week]++;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:98:77
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === false) byWeek[week]++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:98:83
-       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]++;
+       if (entry.outcome?.executed === false && entry.outcome?.rest_marked === true) byWeek[week]--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:100:23
-     const sortedWeeks = Object.keys(byWeek).sort();
+     const sortedWeeks = Object.keys(byWeek);

[NoCoverage] BlockStatement
src/engine/profileTyping.js:102:35
-     for (const week of sortedWeeks) {
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
-         streak++;
-         if (streak >= 3) return true;
-       } else {
-         streak = 0;
-       }
-     }
+     for (const week of sortedWeeks) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:103:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
+       if (true) {  // <2 rest days threshold (ADR 013 §5)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:103:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
+       if (false) {  // <2 rest days threshold (ADR 013 §5)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:103:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
+       if (byWeek[week] <= 2) {  // <2 rest days threshold (ADR 013 §5)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:103:9
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
+       if (byWeek[week] >= 2) {  // <2 rest days threshold (ADR 013 §5)

[NoCoverage] BlockStatement
src/engine/profileTyping.js:103:27
-       if (byWeek[week] < 2) {  // <2 rest days threshold (ADR 013 §5)
-         streak++;
-         if (streak >= 3) return true;
-       } else {
+       if (byWeek[week] < 2) {} else {

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:104:7
-         streak++;
+         streak--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:105:11
-         if (streak >= 3) return true;
+         if (true) return true;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:105:11
-         if (streak >= 3) return true;
+         if (false) return true;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:105:11
-         if (streak >= 3) return true;
+         if (streak > 3) return true;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:105:11
-         if (streak >= 3) return true;
+         if (streak < 3) return true;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:105:31
-         if (streak >= 3) return true;
+         if (streak >= 3) return false;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:106:12
-       } else {
-         streak = 0;
-       }
+       } else {}

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:110:10
-     return false;
+     return true;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:113:43
-   function _hasCalorieAcceleration(entries) {
-     const withKcal = entries
-       .filter(e => typeof e.context?.kcal_target === 'number')
-       .sort((a, b) => a.date.localeCompare(b.date));
-     for (let i = 0; i < withKcal.length; i++) {
-       const anchor = new Date(withKcal[i].date);
-       const cutoff = new Date(anchor);
-       cutoff.setDate(anchor.getDate() + 7);  // 7-day rolling window (ADR 013 signal #2)
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
-       if (win.length < 2) continue;
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
-     }
-     return false;
-   }
+   function _hasCalorieAcceleration(entries) {}

[NoCoverage] MethodExpression
src/engine/profileTyping.js:114:20
-     const withKcal = entries
-       .filter(e => typeof e.context?.kcal_target === 'number')
-       .sort((a, b) => a.date.localeCompare(b.date));
+     const withKcal = entries.filter(e => typeof e.context?.kcal_target === 'number');

[NoCoverage] MethodExpression
src/engine/profileTyping.js:114:20
-     const withKcal = entries
-       .filter(e => typeof e.context?.kcal_target === 'number')
+     const withKcal = entries

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:115:13
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:115:18
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => true)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:115:18
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => false)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:115:18
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => typeof e.context?.kcal_target !== 'number')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:115:25
-       .filter(e => typeof e.context?.kcal_target === 'number')
+       .filter(e => typeof e.context.kcal_target === 'number')

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:116:11
-       .sort((a, b) => a.date.localeCompare(b.date));
+       .sort(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:117:19
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:117:19
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; i <= withKcal.length; i++) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:117:19
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; i >= withKcal.length; i++) {

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:117:40
-     for (let i = 0; i < withKcal.length; i++) {
+     for (let i = 0; i < withKcal.length; i--) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:117:45
-     for (let i = 0; i < withKcal.length; i++) {
-       const anchor = new Date(withKcal[i].date);
-       const cutoff = new Date(anchor);
-       cutoff.setDate(anchor.getDate() + 7);  // 7-day rolling window (ADR 013 signal #2)
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
-       if (win.length < 2) continue;
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
-     }
+     for (let i = 0; i < withKcal.length; i++) {}

[NoCoverage] MethodExpression
src/engine/profileTyping.js:120:5
-       cutoff.setDate(anchor.getDate() + 7);  // 7-day rolling window (ADR 013 signal #2)
+       cutoff.setTime(anchor.getDate() + 7);  // 7-day rolling window (ADR 013 signal #2)

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:120:20
-       cutoff.setDate(anchor.getDate() + 7);  // 7-day rolling window (ADR 013 signal #2)
+       cutoff.setDate(anchor.getDate() - 7);  // 7-day rolling window (ADR 013 signal #2)

[NoCoverage] MethodExpression
src/engine/profileTyping.js:121:17
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:121:38
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => {});

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:121:75
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return true; });

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:121:75
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return false; });

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:121:75
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor || d <= cutoff; });

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:121:75
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return true && d <= cutoff; });

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:121:75
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return d > anchor && d <= cutoff; });

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:121:75
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return d < anchor && d <= cutoff; });

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:121:90
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && true; });

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:121:90
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d < cutoff; });

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:121:90
-       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d <= cutoff; });
+       const win = withKcal.filter(e => { const d = new Date(e.date); return d >= anchor && d > cutoff; });

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:122:9
-       if (win.length < 2) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:122:9
-       if (win.length < 2) continue;
+       if (false) continue;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:122:9
-       if (win.length < 2) continue;
+       if (win.length <= 2) continue;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:122:9
-       if (win.length < 2) continue;
+       if (win.length >= 2) continue;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:123:9
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+       if (true) return true;  // >300 kcal threshold

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:123:9
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+       if (false) return true;  // >300 kcal threshold

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:123:9
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+       if (Math.max(...win.map(e => e.context.kcal_target)) - Math.min(...win.map(e => e.context.kcal_target)) >= 300) return true;  // >300 kcal threshold

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:123:9
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+       if (Math.max(...win.map(e => e.context.kcal_target)) - Math.min(...win.map(e => e.context.kcal_target)) <= 300) return true;  // >300 kcal threshold

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:123:9
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+       if (Math.max(...win.map(e => e.context.kcal_target)) + Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold

[NoCoverage] MethodExpression
src/engine/profileTyping.js:123:9
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
+       if (Math.min(...win.map(e => e.context.kcal_target)) -

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:123:29
-       if (Math.max(...win.map(e => e.context.kcal_target)) -
+       if (Math.max(...win.map(() => undefined)) -

[NoCoverage] MethodExpression
src/engine/profileTyping.js:124:9
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+           Math.max(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:124:29
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+           Math.min(...win.map(() => undefined)) > 300) return true;  // >300 kcal threshold

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:124:72
-           Math.min(...win.map(e => e.context.kcal_target)) > 300) return true;  // >300 kcal threshold
+           Math.min(...win.map(e => e.context.kcal_target)) > 300) return false;  // >300 kcal threshold

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:126:10
-     return false;
+     return true;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:136:69
-   export function _matchSprinterSignature(cdlEntries, hyperfocusData) {
-     const entries = cdlEntries ?? [];
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
-     let count = 0;
-     // Marker 1: volume creep ≥2 instances (starting threshold: 2 sessions sever, ADR 013 table)
-     if (_volumeCreepEntries(entries).length >= 2) count++;
-     // Marker 2: frustration markers present (low rating → volume push)
-     if (_hasFrustrationPattern(workouts)) count++;
-     // Marker 3: hyperfocus ≥4 days/week (ADR 013 amplifier threshold)
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
-     // Marker 4: recovery debt (3+ consecutive ISO weeks <2 rest_marked)
-     if (_hasRecoveryDebt(entries)) count++;
-     // Marker 5: calorie acceleration (>300 kcal drop in 7-day window)
-     if (_hasCalorieAcceleration(entries)) count++;
-     return count;
-   }
+   export function _matchSprinterSignature(cdlEntries, hyperfocusData) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:137:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:137:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:138:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
-       .sort((a, b) => a.date.localeCompare(b.date));
+     const workouts = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] MethodExpression
src/engine/profileTyping.js:138:20
-     const workouts = entries
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+     const workouts = entries

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:139:13
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:139:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => true)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:139:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false)

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:139:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:139:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => false || e.outcome?.executed === 'partial')

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:139:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:139:18
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial')

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:139:42
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:139:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || false)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:139:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:139:50
-       .filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial')
+       .filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial')

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:140:11
-       .sort((a, b) => a.date.localeCompare(b.date));
+       .sort(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:145:7
-     if (_volumeCreepEntries(entries).length >= 2) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:145:7
-     if (_volumeCreepEntries(entries).length >= 2) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:145:7
-     if (_volumeCreepEntries(entries).length >= 2) count++;
+     if (_volumeCreepEntries(entries).length > 2) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:145:7
-     if (_volumeCreepEntries(entries).length >= 2) count++;
+     if (_volumeCreepEntries(entries).length < 2) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:145:49
-     if (_volumeCreepEntries(entries).length >= 2) count++;
+     if (_volumeCreepEntries(entries).length >= 2) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:148:7
-     if (_hasFrustrationPattern(workouts)) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:148:7
-     if (_hasFrustrationPattern(workouts)) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:148:41
-     if (_hasFrustrationPattern(workouts)) count++;
+     if (_hasFrustrationPattern(workouts)) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:151:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:151:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:151:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) > 4) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:151:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) < 4) count++;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:151:8
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus && 0) >= 4) count++;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:151:8
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData.daysWithHyperfocus ?? 0) >= 4) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:151:55
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:154:7
-     if (_hasRecoveryDebt(entries)) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:154:7
-     if (_hasRecoveryDebt(entries)) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:154:34
-     if (_hasRecoveryDebt(entries)) count++;
+     if (_hasRecoveryDebt(entries)) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:157:7
-     if (_hasCalorieAcceleration(entries)) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:157:7
-     if (_hasCalorieAcceleration(entries)) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:157:41
-     if (_hasCalorieAcceleration(entries)) count++;
+     if (_hasCalorieAcceleration(entries)) count--;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:167:53
-   export function _matchMarathonSignature(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
-     if (executed.length === 0) return 0;
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
-     let count = 0;
-     // Marker 1: consistency ≥80% (executed / non-rest entries — starting threshold 80%, ADR 013)
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
-     // Marker 2: volume creep ≤1 (rare/zero)
-     if (_volumeCreepEntries(entries).length <= 1) count++;
-     // Marker 3: rest days planned (≥2 rest_marked=true — low recovery debt indicator)
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
-     if (restDays >= 2) count++;
-     // Marker 4: rating stable (no frustration spikes ≤2)
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
-     if (!hasLowRating) count++;
-     return count;
-   }
+   export function _matchMarathonSignature(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:168:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:168:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:169:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:169:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:169:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:169:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:169:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:169:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:169:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:169:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:169:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:169:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:169:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:169:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:170:7
-     if (executed.length === 0) return 0;
+     if (true) return 0;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:170:7
-     if (executed.length === 0) return 0;
+     if (false) return 0;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:170:7
-     if (executed.length === 0) return 0;
+     if (executed.length !== 0) return 0;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:171:19
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:171:34
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:171:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:171:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:171:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => e.outcome?.rest_marked === true);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:171:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => e.outcome.rest_marked !== true);

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:171:66
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => e.outcome?.rest_marked !== false);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:176:7
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:176:7
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (false) count++;
