[NoCoverage] LogicalOperator
src/engine/profileTyping.js:176:7
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length > 0 || executed.length / nonRest.length >= 0.8) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:176:7
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (true && executed.length / nonRest.length >= 0.8) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:176:7
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length >= 0 && executed.length / nonRest.length >= 0.8) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:176:7
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length <= 0 && executed.length / nonRest.length >= 0.8) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:176:29
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length > 0 && true) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:176:29
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length > 0 && executed.length / nonRest.length > 0.8) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:176:29
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length > 0 && executed.length / nonRest.length < 0.8) count++;

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:176:29
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length > 0 && executed.length * nonRest.length >= 0.8) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:176:70
-     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count++;
+     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:179:7
-     if (_volumeCreepEntries(entries).length <= 1) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:179:7
-     if (_volumeCreepEntries(entries).length <= 1) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:179:7
-     if (_volumeCreepEntries(entries).length <= 1) count++;
+     if (_volumeCreepEntries(entries).length < 1) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:179:7
-     if (_volumeCreepEntries(entries).length <= 1) count++;
+     if (_volumeCreepEntries(entries).length > 1) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:179:49
-     if (_volumeCreepEntries(entries).length <= 1) count++;
+     if (_volumeCreepEntries(entries).length <= 1) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:182:20
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:182:35
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:182:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:182:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => false).length;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:182:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false || e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:182:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true && e.outcome?.rest_marked === true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:182:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed !== false && e.outcome?.rest_marked === true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:182:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome.executed === false && e.outcome?.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:182:64
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === true && e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:182:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:182:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked !== true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:182:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:182:100
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === false).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:183:7
-     if (restDays >= 2) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:183:7
-     if (restDays >= 2) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:183:7
-     if (restDays >= 2) count++;
+     if (restDays > 2) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:183:7
-     if (restDays >= 2) count++;
+     if (restDays < 2) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:183:22
-     if (restDays >= 2) count++;
+     if (restDays >= 2) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:186:24
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.every(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:186:38
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:186:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:186:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:186:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' || e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:186:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true && e.outcome.rating <= 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:186:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating !== 'number' && e.outcome.rating <= 2);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:186:50
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:186:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && true);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:186:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating < 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:186:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating > 2);

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:187:7
-     if (!hasLowRating) count++;
+     if (hasLowRating) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:187:7
-     if (!hasLowRating) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:187:7
-     if (!hasLowRating) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:187:22
-     if (!hasLowRating) count++;
+     if (!hasLowRating) count--;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:198:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:198:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:199:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:199:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:199:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:199:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:199:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:199:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:199:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:199:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:199:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:199:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:199:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:199:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:200:7
-     if (executed.length === 0) return 0;
+     if (true) return 0;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:200:7
-     if (executed.length === 0) return 0;
+     if (false) return 0;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:200:7
-     if (executed.length === 0) return 0;
+     if (executed.length !== 0) return 0;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:201:18
-     const sorted = [...entries].sort((a, b) => a.date.localeCompare(b.date));
+     const sorted = [...entries];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:201:18
-     const sorted = [...entries].sort((a, b) => a.date.localeCompare(b.date));
+     const sorted = [].sort((a, b) => a.date.localeCompare(b.date));

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:201:36
-     const sorted = [...entries].sort((a, b) => a.date.localeCompare(b.date));
+     const sorted = [...entries].sort(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:202:21
-     const firstDate = sorted.length > 0 ? new Date(sorted[0].date) : null;
+     const firstDate = true ? new Date(sorted[0].date) : null;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:202:21
-     const firstDate = sorted.length > 0 ? new Date(sorted[0].date) : null;
+     const firstDate = false ? new Date(sorted[0].date) : null;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:202:21
-     const firstDate = sorted.length > 0 ? new Date(sorted[0].date) : null;
+     const firstDate = sorted.length >= 0 ? new Date(sorted[0].date) : null;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:202:21
-     const firstDate = sorted.length > 0 ? new Date(sorted[0].date) : null;
+     const firstDate = sorted.length <= 0 ? new Date(sorted[0].date) : null;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:207:7
-     if (firstDate) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:207:7
-     if (firstDate) {
+     if (false) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:207:18
-     if (firstDate) {
-       const twoWeekCutoff = new Date(firstDate);
-       twoWeekCutoff.setDate(firstDate.getDate() + 14);
-       const earlyDeviations = sorted.filter(e => {
-         const d = new Date(e.date);
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
-       });
-       if (earlyDeviations.length >= 2) count++;
-     }
+     if (firstDate) {}

[NoCoverage] MethodExpression
src/engine/profileTyping.js:209:5
-       twoWeekCutoff.setDate(firstDate.getDate() + 14);
+       twoWeekCutoff.setTime(firstDate.getDate() + 14);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:209:27
-       twoWeekCutoff.setDate(firstDate.getDate() + 14);
+       twoWeekCutoff.setDate(firstDate.getDate() - 14);

[NoCoverage] MethodExpression
src/engine/profileTyping.js:210:29
-       const earlyDeviations = sorted.filter(e => {
-         const d = new Date(e.date);
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
-       });
+       const earlyDeviations = sorted;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:210:48
-       const earlyDeviations = sorted.filter(e => {
-         const d = new Date(e.date);
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
-       });
+       const earlyDeviations = sorted.filter(e => {});

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+         return true;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+         return false;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+         return d <= twoWeekCutoff && (e.outcome?.executed === true || e.outcome?.executed === 'partial') && e.outcome?.deviation === true || (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
+         return true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
-                e.outcome?.deviation === true &&
+         return d <= twoWeekCutoff && (e.outcome?.executed === true || e.outcome?.executed === 'partial') || e.outcome?.deviation === true &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+         return true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+         return d <= twoWeekCutoff || e.outcome?.executed === true || e.outcome?.executed === 'partial' &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
+         return true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
+         return d < twoWeekCutoff &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:212:14
-         return d <= twoWeekCutoff &&
+         return d > twoWeekCutoff &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:213:15
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (true) &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:213:15
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome?.executed === true && e.outcome?.executed === 'partial') &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:213:15
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (false || e.outcome?.executed === 'partial') &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:213:15
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome?.executed !== true || e.outcome?.executed === 'partial') &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:213:15
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome.executed === true || e.outcome?.executed === 'partial') &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:213:39
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome?.executed === false || e.outcome?.executed === 'partial') &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:213:47
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome?.executed === true || false) &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:213:47
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome?.executed === true || e.outcome?.executed !== 'partial') &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:213:47
-                (e.outcome?.executed === true || e.outcome?.executed === 'partial') &&
+                (e.outcome?.executed === true || e.outcome.executed === 'partial') &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:214:14
-                e.outcome?.deviation === true &&
+                true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:214:14
-                e.outcome?.deviation === true &&
+                e.outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:214:14
-                e.outcome?.deviation === true &&
+                e.outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:214:39
-                e.outcome?.deviation === true &&
+                e.outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:215:14
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                true;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:215:14
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                (e.outcome?.actualSets ?? 0) >= (e.outcome?.proposedSets ?? 0);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:215:14
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                (e.outcome?.actualSets ?? 0) <= (e.outcome?.proposedSets ?? 0);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:215:15
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                (e.outcome?.actualSets && 0) > (e.outcome?.proposedSets ?? 0);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:215:15
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                (e.outcome.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:215:46
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets && 0);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:215:46
-                (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0);
+                (e.outcome?.actualSets ?? 0) > (e.outcome.proposedSets ?? 0);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:217:9
-       if (earlyDeviations.length >= 2) count++;
+       if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:217:9
-       if (earlyDeviations.length >= 2) count++;
+       if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:217:9
-       if (earlyDeviations.length >= 2) count++;
+       if (earlyDeviations.length > 2) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:217:9
-       if (earlyDeviations.length >= 2) count++;
+       if (earlyDeviations.length < 2) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:217:38
-       if (earlyDeviations.length >= 2) count++;
+       if (earlyDeviations.length >= 2) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:221:7
-     if (_hasCalorieAcceleration(entries)) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:221:7
-     if (_hasCalorieAcceleration(entries)) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:221:41
-     if (_hasCalorieAcceleration(entries)) count++;
+     if (_hasCalorieAcceleration(entries)) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:224:20
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:224:35
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:224:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:224:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => false).length;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:224:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false || e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:224:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true && e.outcome?.rest_marked === true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:224:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed !== false && e.outcome?.rest_marked === true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:224:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome.executed === false && e.outcome?.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:224:64
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === true && e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:224:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:224:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked !== true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:224:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome.rest_marked === true).length;
