[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:224:100
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === false).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:225:7
-     if (restDays === 0) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:225:7
-     if (restDays === 0) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:225:7
-     if (restDays === 0) count++;
+     if (restDays !== 0) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:225:23
-     if (restDays === 0) count++;
+     if (restDays === 0) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:228:24
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.every(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:228:38
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:228:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:228:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:228:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' || e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:228:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true && e.outcome.rating <= 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:228:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating !== 'number' && e.outcome.rating <= 2);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:228:50
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:228:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && true);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:228:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating < 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:228:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating > 2);

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:229:7
-     if (!hasLowRating) count++;
+     if (hasLowRating) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:229:7
-     if (!hasLowRating) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:229:7
-     if (!hasLowRating) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:229:22
-     if (!hasLowRating) count++;
+     if (!hasLowRating) count--;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:232:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:232:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:232:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) > 4) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:232:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) < 4) count++;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:232:8
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus && 0) >= 4) count++;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:232:8
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData.daysWithHyperfocus ?? 0) >= 4) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:232:55
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count++;
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) count--;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:243:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:243:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:244:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:244:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:244:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:244:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:244:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:244:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:244:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:244:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:244:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:244:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:244:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:244:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:245:7
-     if (executed.length === 0) return 0;
+     if (true) return 0;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:245:7
-     if (executed.length === 0) return 0;
+     if (false) return 0;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:245:7
-     if (executed.length === 0) return 0;
+     if (executed.length !== 0) return 0;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:250:31
-     const consciousDeviations = executed.filter(
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
-            e.outcome?.deviationReason !== ''
-     );
+     const consciousDeviations = executed;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:251:5
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
-            e.outcome?.deviationReason !== ''
+       () => undefined

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
-            e.outcome?.deviationReason !== ''
+       e => true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
-            e.outcome?.deviationReason !== ''
+       e => false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
-            e.outcome?.deviationReason !== ''
+       e => e.outcome?.deviation === true && e.outcome?.deviationReason != null || e.outcome?.deviationReason !== ''

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
+       e => true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
-            e.outcome?.deviationReason != null &&
+       e => e.outcome?.deviation === true || e.outcome?.deviationReason != null &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
+       e => true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
+       e => e.outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:251:10
-       e => e.outcome?.deviation === true &&
+       e => e.outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:251:35
-       e => e.outcome?.deviation === true &&
+       e => e.outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:252:10
-            e.outcome?.deviationReason != null &&
+            true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:252:10
-            e.outcome?.deviationReason != null &&
+            e.outcome?.deviationReason == null &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:252:10
-            e.outcome?.deviationReason != null &&
+            e.outcome.deviationReason != null &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:253:10
-            e.outcome?.deviationReason !== ''
+            true

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:253:10
-            e.outcome?.deviationReason !== ''
+            e.outcome?.deviationReason === ''

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:253:10
-            e.outcome?.deviationReason !== ''
+            e.outcome.deviationReason !== ''

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:255:7
-     if (consciousDeviations.length >= 1) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:255:7
-     if (consciousDeviations.length >= 1) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:255:7
-     if (consciousDeviations.length >= 1) count++;
+     if (consciousDeviations.length > 1) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:255:7
-     if (consciousDeviations.length >= 1) count++;
+     if (consciousDeviations.length < 1) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:255:40
-     if (consciousDeviations.length >= 1) count++;
+     if (consciousDeviations.length >= 1) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:258:25
-     const reasonedStops = executed.filter(
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
-            e.outcome?.earlyStopReason !== ''
-     );
+     const reasonedStops = executed;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:259:5
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
-            e.outcome?.earlyStopReason !== ''
+       () => undefined

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
-            e.outcome?.earlyStopReason !== ''
+       e => true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
-            e.outcome?.earlyStopReason !== ''
+       e => false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
-            e.outcome?.earlyStopReason !== ''
+       e => e.outcome?.earlyStop === true && e.outcome?.earlyStopReason != null || e.outcome?.earlyStopReason !== ''

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
+       e => true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
-            e.outcome?.earlyStopReason != null &&
+       e => e.outcome?.earlyStop === true || e.outcome?.earlyStopReason != null &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
+       e => true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
+       e => e.outcome?.earlyStop !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:259:10
-       e => e.outcome?.earlyStop === true &&
+       e => e.outcome.earlyStop === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:259:35
-       e => e.outcome?.earlyStop === true &&
+       e => e.outcome?.earlyStop === false &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:260:10
-            e.outcome?.earlyStopReason != null &&
+            true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:260:10
-            e.outcome?.earlyStopReason != null &&
+            e.outcome?.earlyStopReason == null &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:260:10
-            e.outcome?.earlyStopReason != null &&
+            e.outcome.earlyStopReason != null &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:261:10
-            e.outcome?.earlyStopReason !== ''
+            true

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:261:10
-            e.outcome?.earlyStopReason !== ''
+            e.outcome?.earlyStopReason === ''

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:261:10
-            e.outcome?.earlyStopReason !== ''
+            e.outcome.earlyStopReason !== ''

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:263:7
-     if (reasonedStops.length >= 1) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:263:7
-     if (reasonedStops.length >= 1) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:263:7
-     if (reasonedStops.length >= 1) count++;
+     if (reasonedStops.length > 1) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:263:7
-     if (reasonedStops.length >= 1) count++;
+     if (reasonedStops.length < 1) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:263:34
-     if (reasonedStops.length >= 1) count++;
+     if (reasonedStops.length >= 1) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:266:26
-     const impulsiveCreep = executed.filter(
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
-     );
+     const impulsiveCreep = executed;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:267:5
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       () => undefined

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       e => true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       e => false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       e => e.outcome?.deviation === true && (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) || e.outcome?.deviationReason == null || e.outcome?.deviationReason === ''

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+       e => true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+       e => e.outcome?.deviation === true || (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
+       e => true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
+       e => e.outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:267:10
-       e => e.outcome?.deviation === true &&
+       e => e.outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:267:35
-       e => e.outcome?.deviation === true &&
+       e => e.outcome?.deviation === false &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:268:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:268:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) >= (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:268:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) <= (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:268:11
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets && 0) > (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:268:11
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:268:42
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets && 0) &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:268:42
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) > (e.outcome.proposedSets ?? 0) &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:269:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (true)

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:269:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null && e.outcome?.deviationReason === '')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:269:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (false || e.outcome?.deviationReason === '')

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:269:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason != null || e.outcome?.deviationReason === '')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:269:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome.deviationReason == null || e.outcome?.deviationReason === '')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:269:49
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null || false)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:269:49
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null || e.outcome?.deviationReason !== '')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:269:49
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null || e.outcome.deviationReason === '')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:271:7
-     if (impulsiveCreep.length <= 1) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:271:7
-     if (impulsiveCreep.length <= 1) count++;
+     if (false) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:271:7
-     if (impulsiveCreep.length <= 1) count++;
+     if (impulsiveCreep.length < 1) count++;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:271:7
-     if (impulsiveCreep.length <= 1) count++;
+     if (impulsiveCreep.length > 1) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:271:35
-     if (impulsiveCreep.length <= 1) count++;
+     if (impulsiveCreep.length <= 1) count--;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:274:24
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.every(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:274:38
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:274:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:274:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:274:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' || e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:274:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true && e.outcome.rating <= 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:274:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating !== 'number' && e.outcome.rating <= 2);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:274:50
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:274:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && true);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:274:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating < 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:274:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating > 2);

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:275:7
-     if (!hasLowRating) count++;
+     if (hasLowRating) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:275:7
-     if (!hasLowRating) count++;
+     if (true) count++;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:275:7
-     if (!hasLowRating) count++;
+     if (false) count++;

[NoCoverage] UpdateOperator
src/engine/profileTyping.js:275:22
-     if (!hasLowRating) count++;
+     if (!hasLowRating) count--;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:286:53
-   export function _counterMarkersSprinter(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
-     const markers = [];
-     if (nonRest.length > 0 &&
-         executed.length / nonRest.length >= 0.8 &&
-         restDays >= 2) {
-       markers.push('high_consistency_with_planned_rest');
-     }
-     return markers;
-   }
+   export function _counterMarkersSprinter(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:287:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:287:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:288:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:288:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:288:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);
