[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:288:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:288:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:288:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:288:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:288:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:288:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:288:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:288:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:288:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] MethodExpression
src/engine/profileTyping.js:289:19
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:289:34
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:289:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:289:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:289:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => e.outcome?.rest_marked === true);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:289:39
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => e.outcome.rest_marked !== true);

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:289:66
-     const nonRest = entries.filter(e => e.outcome?.rest_marked !== true);
+     const nonRest = entries.filter(e => e.outcome?.rest_marked !== false);

[NoCoverage] MethodExpression
src/engine/profileTyping.js:290:20
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:290:35
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:290:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:290:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => false).length;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:290:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false || e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:290:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true && e.outcome?.rest_marked === true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:290:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed !== false && e.outcome?.rest_marked === true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:290:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome.executed === false && e.outcome?.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:290:64
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === true && e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:290:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:290:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked !== true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:290:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:290:100
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === false).length;

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:292:19
-     const markers = [];
+     const markers = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
-         executed.length / nonRest.length >= 0.8 &&
-         restDays >= 2) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
-         executed.length / nonRest.length >= 0.8 &&
-         restDays >= 2) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
-         executed.length / nonRest.length >= 0.8 &&
-         restDays >= 2) {
+     if (nonRest.length > 0 && executed.length / nonRest.length >= 0.8 || restDays >= 2) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
-         executed.length / nonRest.length >= 0.8 &&
+     if (true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
-         executed.length / nonRest.length >= 0.8 &&
+     if (nonRest.length > 0 || executed.length / nonRest.length >= 0.8 &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
+     if (true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
+     if (nonRest.length >= 0 &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:293:7
-     if (nonRest.length > 0 &&
+     if (nonRest.length <= 0 &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:294:7
-         executed.length / nonRest.length >= 0.8 &&
+         true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:294:7
-         executed.length / nonRest.length >= 0.8 &&
+         executed.length / nonRest.length > 0.8 &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:294:7
-         executed.length / nonRest.length >= 0.8 &&
+         executed.length / nonRest.length < 0.8 &&

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:294:7
-         executed.length / nonRest.length >= 0.8 &&
+         executed.length * nonRest.length >= 0.8 &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:295:7
-         restDays >= 2) {
+         true) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:295:7
-         restDays >= 2) {
+         restDays > 2) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:295:7
-         restDays >= 2) {
+         restDays < 2) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:295:22
-         restDays >= 2) {
-       markers.push('high_consistency_with_planned_rest');
-     }
+         restDays >= 2) {}

[NoCoverage] BlockStatement
src/engine/profileTyping.js:305:53
-   export function _counterMarkersMarathon(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const markers = [];
-     if (_volumeCreepEntries(entries).length >= 2) {  // ≥2 = "frequent" threshold
-       markers.push('volume_creep_frequent');
-     }
-     return markers;
-   }
+   export function _counterMarkersMarathon(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:306:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:306:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:307:19
-     const markers = [];
+     const markers = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:309:7
-     if (_volumeCreepEntries(entries).length >= 2) {  // ≥2 = "frequent" threshold
+     if (true) {  // ≥2 = "frequent" threshold

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:309:7
-     if (_volumeCreepEntries(entries).length >= 2) {  // ≥2 = "frequent" threshold
+     if (false) {  // ≥2 = "frequent" threshold

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:309:7
-     if (_volumeCreepEntries(entries).length >= 2) {  // ≥2 = "frequent" threshold
+     if (_volumeCreepEntries(entries).length > 2) {  // ≥2 = "frequent" threshold

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:309:7
-     if (_volumeCreepEntries(entries).length >= 2) {  // ≥2 = "frequent" threshold
+     if (_volumeCreepEntries(entries).length < 2) {  // ≥2 = "frequent" threshold

[NoCoverage] BlockStatement
src/engine/profileTyping.js:309:49
-     if (_volumeCreepEntries(entries).length >= 2) {  // ≥2 = "frequent" threshold
-       markers.push('volume_creep_frequent');
-     }
+     if (_volumeCreepEntries(entries).length >= 2) {}

[NoCoverage] BlockStatement
src/engine/profileTyping.js:319:49
-   export function _counterMarkersYoyo(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
-     const markers = [];
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
-       markers.push('sustained_intensity_with_rhythm');
-     }
-     return markers;
-   }
+   export function _counterMarkersYoyo(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:320:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:320:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:321:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:321:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:321:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:321:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:321:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:321:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:321:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:321:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:321:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:321:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:321:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:321:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] MethodExpression
src/engine/profileTyping.js:322:20
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:322:35
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:322:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:322:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => false).length;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:322:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false || e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:322:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true && e.outcome?.rest_marked === true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:322:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed !== false && e.outcome?.rest_marked === true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:322:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome.executed === false && e.outcome?.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:322:64
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === true && e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:322:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:322:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked !== true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:322:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:322:100
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === false).length;

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:324:19
-     const markers = [];
+     const markers = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:325:7
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (true) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:325:7
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (false) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:325:7
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (restDays >= 2 || executed.length >= 6) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:325:7
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (true && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:325:7
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (restDays > 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:325:7
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (restDays < 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:325:24
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (restDays >= 2 && true) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:325:24
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (restDays >= 2 && executed.length > 6) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:325:24
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
+     if (restDays >= 2 && executed.length < 6) {  // sustained rhythm = rest present + enough sessions

[NoCoverage] BlockStatement
src/engine/profileTyping.js:325:46
-     if (restDays >= 2 && executed.length >= 6) {  // sustained rhythm = rest present + enough sessions
-       markers.push('sustained_intensity_with_rhythm');
-     }
+     if (restDays >= 2 && executed.length >= 6) {}

[NoCoverage] BlockStatement
src/engine/profileTyping.js:335:54
-   export function _counterMarkersStrategic(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
-     const impulsiveCreep = executed.filter(
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
-     );
-     const markers = [];
-     if (impulsiveCreep.length >= 2) {  // ≥2 unreasoned creeps = impulsive pattern
-       markers.push('impulsive_volume_creep_no_reason');
-     }
-     return markers;
-   }
+   export function _counterMarkersStrategic(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:336:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:336:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:337:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:337:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:337:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:337:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:337:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:337:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:337:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:337:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:337:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:337:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:337:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:337:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] MethodExpression
src/engine/profileTyping.js:339:26
-     const impulsiveCreep = executed.filter(
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
-     );
+     const impulsiveCreep = executed;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:340:5
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       () => undefined

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       e => true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       e => false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+       e => e.outcome?.deviation === true && (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) || e.outcome?.deviationReason == null || e.outcome?.deviationReason === ''

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+       e => true &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+       e => e.outcome?.deviation === true || (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
+       e => true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
+       e => e.outcome?.deviation !== true &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:340:10
-       e => e.outcome?.deviation === true &&
+       e => e.outcome.deviation === true &&

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:340:35
-       e => e.outcome?.deviation === true &&
+       e => e.outcome?.deviation === false &&
