[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:341:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            true &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:341:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) >= (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:341:10
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) <= (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:341:11
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets && 0) > (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:341:11
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:341:42
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets && 0) &&

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:341:42
-            (e.outcome?.actualSets ?? 0) > (e.outcome?.proposedSets ?? 0) &&
+            (e.outcome?.actualSets ?? 0) > (e.outcome.proposedSets ?? 0) &&

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:342:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (true)

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:342:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null && e.outcome?.deviationReason === '')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:342:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (false || e.outcome?.deviationReason === '')

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:342:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason != null || e.outcome?.deviationReason === '')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:342:11
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome.deviationReason == null || e.outcome?.deviationReason === '')

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:342:49
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null || false)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:342:49
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null || e.outcome?.deviationReason !== '')

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:342:49
-            (e.outcome?.deviationReason == null || e.outcome?.deviationReason === '')
+            (e.outcome?.deviationReason == null || e.outcome.deviationReason === '')

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:345:19
-     const markers = [];
+     const markers = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:346:7
-     if (impulsiveCreep.length >= 2) {  // ≥2 unreasoned creeps = impulsive pattern
+     if (true) {  // ≥2 unreasoned creeps = impulsive pattern

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:346:7
-     if (impulsiveCreep.length >= 2) {  // ≥2 unreasoned creeps = impulsive pattern
+     if (false) {  // ≥2 unreasoned creeps = impulsive pattern

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:346:7
-     if (impulsiveCreep.length >= 2) {  // ≥2 unreasoned creeps = impulsive pattern
+     if (impulsiveCreep.length > 2) {  // ≥2 unreasoned creeps = impulsive pattern

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:346:7
-     if (impulsiveCreep.length >= 2) {  // ≥2 unreasoned creeps = impulsive pattern
+     if (impulsiveCreep.length < 2) {  // ≥2 unreasoned creeps = impulsive pattern

[NoCoverage] BlockStatement
src/engine/profileTyping.js:346:35
-     if (impulsiveCreep.length >= 2) {  // ≥2 unreasoned creeps = impulsive pattern
-       markers.push('impulsive_volume_creep_no_reason');
-     }
+     if (impulsiveCreep.length >= 2) {}

[NoCoverage] BlockStatement
src/engine/profileTyping.js:362:60
-   export function computeCounterMarkers(profile, cdlEntries) {
-     switch (profile) {
-       case 'Sprinter':  return _counterMarkersSprinter(cdlEntries);
-       case 'Marathon':  return _counterMarkersMarathon(cdlEntries);
-       case 'Yo-yo':     return _counterMarkersYoyo(cdlEntries);
-       case 'Strategic': return _counterMarkersStrategic(cdlEntries);
-       default:          return [];
-     }
-   }
+   export function computeCounterMarkers(profile, cdlEntries) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:364:5
-       case 'Sprinter':  return _counterMarkersSprinter(cdlEntries);
+       case 'Sprinter':

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:365:5
-       case 'Marathon':  return _counterMarkersMarathon(cdlEntries);
+       case 'Marathon':

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:366:5
-       case 'Yo-yo':     return _counterMarkersYoyo(cdlEntries);
+       case 'Yo-yo':

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:367:5
-       case 'Strategic': return _counterMarkersStrategic(cdlEntries);
+       case 'Strategic':

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:368:5
-       default:          return [];
+       default:

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:368:30
-       default:          return [];
+       default:          return ["Stryker was here"];

[NoCoverage] BlockStatement
src/engine/profileTyping.js:379:44
-   export function detectYoyoRisk(cdlEntries) {
-     const entries = cdlEntries ?? [];
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
-     // Condition 1: zero rest_marked=true days (all-in, no recovery acknowledgment)
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
-     if (restDays > 0) return false;
-     // Condition 2: volume aggressive (≥2 deviation entries with actual > proposed)
-     if (_volumeCreepEntries(entries).length < 2) return false;
-     // Condition 3: zero frustration (no low ratings ≤2 — high-commitment phase still present)
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
-     if (hasLowRating) return false;
-     // Condition 4: spans ≥3 ISO weeks (sustained all-in, not a one-week spike)
-     const byWeek = {};
-     for (const e of executed) {
-       if (e.date) byWeek[_isoWeekLocal(e.date)] = true;
-     }
-     if (Object.keys(byWeek).length < 3) return false;  // minimum 3 weeks of activity (ADR 013)
-     return true;
-   }
+   export function detectYoyoRisk(cdlEntries) {}

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:380:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:380:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] MethodExpression
src/engine/profileTyping.js:381:20
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:381:35
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:381:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:381:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:381:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true && e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:381:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => false || e.outcome?.executed === 'partial');

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:381:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed !== true || e.outcome?.executed === 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:381:40
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome.executed === true || e.outcome?.executed === 'partial');

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:381:64
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === false || e.outcome?.executed === 'partial');

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:381:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || false);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:381:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed !== 'partial');

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:381:72
-     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome?.executed === 'partial');
+     const executed = entries.filter(e => e.outcome?.executed === true || e.outcome.executed === 'partial');

[NoCoverage] MethodExpression
src/engine/profileTyping.js:384:20
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:384:35
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:384:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:384:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => false).length;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:384:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false || e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:384:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => true && e.outcome?.rest_marked === true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:384:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed !== false && e.outcome?.rest_marked === true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:384:40
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome.executed === false && e.outcome?.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:384:64
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === true && e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:384:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:384:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked !== true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:384:73
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:384:100
-     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restDays = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === false).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:385:7
-     if (restDays > 0) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:385:7
-     if (restDays > 0) return false;
+     if (false) return false;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:385:7
-     if (restDays > 0) return false;
+     if (restDays >= 0) return false;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:385:7
-     if (restDays > 0) return false;
+     if (restDays <= 0) return false;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:385:28
-     if (restDays > 0) return false;
+     if (restDays > 0) return true;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:388:7
-     if (_volumeCreepEntries(entries).length < 2) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:388:7
-     if (_volumeCreepEntries(entries).length < 2) return false;
+     if (false) return false;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:388:7
-     if (_volumeCreepEntries(entries).length < 2) return false;
+     if (_volumeCreepEntries(entries).length <= 2) return false;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:388:7
-     if (_volumeCreepEntries(entries).length < 2) return false;
+     if (_volumeCreepEntries(entries).length >= 2) return false;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:388:55
-     if (_volumeCreepEntries(entries).length < 2) return false;
+     if (_volumeCreepEntries(entries).length < 2) return true;

[NoCoverage] MethodExpression
src/engine/profileTyping.js:391:24
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.every(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:391:38
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:391:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:391:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => false);

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:391:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' || e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:391:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => true && e.outcome.rating <= 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:391:43
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating !== 'number' && e.outcome.rating <= 2);

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:391:50
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome.rating === 'number' && e.outcome.rating <= 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:391:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && true);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:391:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating < 2);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:391:84
-     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating <= 2);
+     const hasLowRating = executed.some(e => typeof e.outcome?.rating === 'number' && e.outcome.rating > 2);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:392:7
-     if (hasLowRating) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:392:7
-     if (hasLowRating) return false;
+     if (false) return false;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:392:28
-     if (hasLowRating) return false;
+     if (hasLowRating) return true;

[NoCoverage] BlockStatement
src/engine/profileTyping.js:396:29
-     for (const e of executed) {
-       if (e.date) byWeek[_isoWeekLocal(e.date)] = true;
-     }
+     for (const e of executed) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:397:9
-       if (e.date) byWeek[_isoWeekLocal(e.date)] = true;
+       if (true) byWeek[_isoWeekLocal(e.date)] = true;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:397:9
-       if (e.date) byWeek[_isoWeekLocal(e.date)] = true;
+       if (false) byWeek[_isoWeekLocal(e.date)] = true;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:397:49
-       if (e.date) byWeek[_isoWeekLocal(e.date)] = true;
+       if (e.date) byWeek[_isoWeekLocal(e.date)] = false;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:399:7
-     if (Object.keys(byWeek).length < 3) return false;  // minimum 3 weeks of activity (ADR 013)
+     if (true) return false;  // minimum 3 weeks of activity (ADR 013)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:399:7
-     if (Object.keys(byWeek).length < 3) return false;  // minimum 3 weeks of activity (ADR 013)
+     if (false) return false;  // minimum 3 weeks of activity (ADR 013)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:399:7
-     if (Object.keys(byWeek).length < 3) return false;  // minimum 3 weeks of activity (ADR 013)
+     if (Object.keys(byWeek).length <= 3) return false;  // minimum 3 weeks of activity (ADR 013)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:399:7
-     if (Object.keys(byWeek).length < 3) return false;  // minimum 3 weeks of activity (ADR 013)
+     if (Object.keys(byWeek).length >= 3) return false;  // minimum 3 weeks of activity (ADR 013)

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:399:46
-     if (Object.keys(byWeek).length < 3) return false;  // minimum 3 weeks of activity (ADR 013)
+     if (Object.keys(byWeek).length < 3) return true;  // minimum 3 weeks of activity (ADR 013)

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:401:10
-     return true;
+     return false;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:413:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:413:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:421:21
-     const signature = {
-       Sprinter:  sprinterCount,
-       Marathon:  marathonCount,
-       Yoyo:      yoyoCount,
-       Strategic: strategicCount,
-     };
+     const signature = {};

[NoCoverage] MethodExpression
src/engine/profileTyping.js:428:18
-     const ranked = [
-       { profile: 'Sprinter',  score: sprinterCount },
-       { profile: 'Marathon',  score: marathonCount },
-       { profile: 'Yo-yo',     score: yoyoCount },
-       { profile: 'Strategic', score: strategicCount },
-     ].sort((a, b) => b.score - a.score);
+     const ranked = [{
+     profile: 'Sprinter',
+     score: sprinterCount
+   }, {
+     profile: 'Marathon',
+     score: marathonCount
+   }, {
+     profile: 'Yo-yo',
+     score: yoyoCount
+   }, {
+     profile: 'Strategic',
+     score: strategicCount
+   }];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:428:18
-     const ranked = [
-       { profile: 'Sprinter',  score: sprinterCount },
-       { profile: 'Marathon',  score: marathonCount },
-       { profile: 'Yo-yo',     score: yoyoCount },
-       { profile: 'Strategic', score: strategicCount },
-     ].sort((a, b) => b.score - a.score);
+     const ranked = [].sort((a, b) => b.score - a.score);

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:429:5
-       { profile: 'Sprinter',  score: sprinterCount },
+       {},

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:430:5
-       { profile: 'Marathon',  score: marathonCount },
+       {},

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:431:5
-       { profile: 'Yo-yo',     score: yoyoCount },
+       {},

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:432:5
-       { profile: 'Strategic', score: strategicCount },
+       {},

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:433:10
-     ].sort((a, b) => b.score - a.score);
+     ].sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/engine/profileTyping.js:433:20
-     ].sort((a, b) => b.score - a.score);
+     ].sort((a, b) => b.score + a.score);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:436:19
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:436:19
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = false

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:436:19
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = ranked[0].score > 0 || ranked[0].score > ranked[1].score

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:436:19
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = true && ranked[0].score > ranked[1].score

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:436:19
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = ranked[0].score >= 0 && ranked[0].score > ranked[1].score

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:436:19
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = ranked[0].score <= 0 && ranked[0].score > ranked[1].score

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:436:42
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = ranked[0].score > 0 && true

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:436:42
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = ranked[0].score > 0 && ranked[0].score >= ranked[1].score

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:436:42
-     const primary = ranked[0].score > 0 && ranked[0].score > ranked[1].score
+     const primary = ranked[0].score > 0 && ranked[0].score <= ranked[1].score

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:438:8
-       : (ranked[0].score > 0 ? ranked[0].profile : null);
+       : (true ? ranked[0].profile : null);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:438:8
-       : (ranked[0].score > 0 ? ranked[0].profile : null);
+       : (false ? ranked[0].profile : null);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:438:8
-       : (ranked[0].score > 0 ? ranked[0].profile : null);
+       : (ranked[0].score >= 0 ? ranked[0].profile : null);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:438:8
-       : (ranked[0].score > 0 ? ranked[0].profile : null);
+       : (ranked[0].score <= 0 ? ranked[0].profile : null);

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:440:78
-     const counterMarkers = primary ? computeCounterMarkers(primary, entries) : [];
+     const counterMarkers = primary ? computeCounterMarkers(primary, entries) : ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:445:22
-     const dataPoints = [];
+     const dataPoints = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:447:7
-     if (creepCount > 0) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);
+     if (true) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:447:7
-     if (creepCount > 0) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);
+     if (false) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:447:7
-     if (creepCount > 0) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);
+     if (creepCount >= 0) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:447:7
-     if (creepCount > 0) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);
+     if (creepCount <= 0) dataPoints.push(`Volume creep: ${creepCount} sesiuni`);

[NoCoverage] MethodExpression
src/engine/profileTyping.js:448:21
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.length;

[NoCoverage] ArrowFunction
src/engine/profileTyping.js:448:36
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:448:41
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:448:41
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => false).length;

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:448:41
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed === false || e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:448:41
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => true && e.outcome?.rest_marked === true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:448:41
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed !== false && e.outcome?.rest_marked === true).length;
