[NoCoverage] OptionalChaining
src/engine/profileTyping.js:448:41
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome.executed === false && e.outcome?.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:448:65
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed === true && e.outcome?.rest_marked === true).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:448:74
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed === false && true).length;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:448:74
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked !== true).length;

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:448:74
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome.rest_marked === true).length;

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:448:101
-     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === true).length;
+     const restCount = entries.filter(e => e.outcome?.executed === false && e.outcome?.rest_marked === false).length;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:449:7
-     if (restCount > 0) dataPoints.push(`Rest days: ${restCount}`);
+     if (true) dataPoints.push(`Rest days: ${restCount}`);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:449:7
-     if (restCount > 0) dataPoints.push(`Rest days: ${restCount}`);
+     if (false) dataPoints.push(`Rest days: ${restCount}`);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:449:7
-     if (restCount > 0) dataPoints.push(`Rest days: ${restCount}`);
+     if (restCount >= 0) dataPoints.push(`Rest days: ${restCount}`);

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:449:7
-     if (restCount > 0) dataPoints.push(`Rest days: ${restCount}`);
+     if (restCount <= 0) dataPoints.push(`Rest days: ${restCount}`);

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:450:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:450:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
+     if (false) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:450:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) > 4) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:450:7
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) < 4) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:450:8
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
+     if ((hyperfocusData?.daysWithHyperfocus && 0) >= 4) {

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:450:8
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
+     if ((hyperfocusData.daysWithHyperfocus ?? 0) >= 4) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:450:55
-     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {
-       dataPoints.push(`Hyperfocus: ${hyperfocusData.daysWithHyperfocus} zile/săpt`);
-     }
+     if ((hyperfocusData?.daysWithHyperfocus ?? 0) >= 4) {}

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:454:10
-     return { primary, confidence, signature, dataPoints, sessionCount };
+     return {};

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:465:88
-   export function reconciliationAction(selfReport, behavioral, previousReconciliations = []) {
+   export function reconciliationAction(selfReport, behavioral, previousReconciliations = ["Stryker was here"]) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:465:92
-   export function reconciliationAction(selfReport, behavioral, previousReconciliations = []) {
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
-     if (behavioral.sessionCount < 12) return 'insufficient';  // <12 sessions threshold (ADR 013)
-     if (!selfReport) return 'insufficient';
-     const isMatch = selfReport.primary === behavioral.primary;
-     const behConf = behavioral.confidence;
-     if (isMatch) {
-       // First-ever reconciliation with HIGH confidence → prompt to close loop (ADR 013 §Reconciliation)
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
-       return 'match_silent';
-     }
-     if (behConf === 'high') return 'mismatch_high';
-     return 'mismatch_lowmed';
-   }
+   export function reconciliationAction(selfReport, behavioral, previousReconciliations = []) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:466:7
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
+     if (true) return 'stale';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:466:7
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
+     if (false) return 'stale';

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:466:7
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
+     if (!behavioral && behavioral.sessionCount === 0) return 'stale';

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:466:7
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
+     if (behavioral || behavioral.sessionCount === 0) return 'stale';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:466:22
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
+     if (!behavioral || false) return 'stale';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:466:22
-     if (!behavioral || behavioral.sessionCount === 0) return 'stale';
+     if (!behavioral || behavioral.sessionCount !== 0) return 'stale';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:467:7
-     if (behavioral.sessionCount < 12) return 'insufficient';  // <12 sessions threshold (ADR 013)
+     if (true) return 'insufficient';  // <12 sessions threshold (ADR 013)

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:467:7
-     if (behavioral.sessionCount < 12) return 'insufficient';  // <12 sessions threshold (ADR 013)
+     if (false) return 'insufficient';  // <12 sessions threshold (ADR 013)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:467:7
-     if (behavioral.sessionCount < 12) return 'insufficient';  // <12 sessions threshold (ADR 013)
+     if (behavioral.sessionCount <= 12) return 'insufficient';  // <12 sessions threshold (ADR 013)

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:467:7
-     if (behavioral.sessionCount < 12) return 'insufficient';  // <12 sessions threshold (ADR 013)
+     if (behavioral.sessionCount >= 12) return 'insufficient';  // <12 sessions threshold (ADR 013)

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:468:7
-     if (!selfReport) return 'insufficient';
+     if (selfReport) return 'insufficient';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:468:7
-     if (!selfReport) return 'insufficient';
+     if (true) return 'insufficient';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:468:7
-     if (!selfReport) return 'insufficient';
+     if (false) return 'insufficient';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:470:19
-     const isMatch = selfReport.primary === behavioral.primary;
+     const isMatch = true;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:470:19
-     const isMatch = selfReport.primary === behavioral.primary;
+     const isMatch = false;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:470:19
-     const isMatch = selfReport.primary === behavioral.primary;
+     const isMatch = selfReport.primary !== behavioral.primary;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:473:7
-     if (isMatch) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:473:7
-     if (isMatch) {
+     if (false) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:473:16
-     if (isMatch) {
-       // First-ever reconciliation with HIGH confidence → prompt to close loop (ADR 013 §Reconciliation)
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
-       return 'match_silent';
-     }
+     if (isMatch) {}

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:475:9
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (true) return 'match_first_prompt';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:475:9
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (false) return 'match_first_prompt';

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:475:9
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (behConf === 'high' || previousReconciliations.length === 0) return 'match_first_prompt';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:475:9
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (true && previousReconciliations.length === 0) return 'match_first_prompt';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:475:9
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (behConf !== 'high' && previousReconciliations.length === 0) return 'match_first_prompt';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:475:31
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (behConf === 'high' && true) return 'match_first_prompt';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:475:31
-       if (behConf === 'high' && previousReconciliations.length === 0) return 'match_first_prompt';
+       if (behConf === 'high' && previousReconciliations.length !== 0) return 'match_first_prompt';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:479:7
-     if (behConf === 'high') return 'mismatch_high';
+     if (true) return 'mismatch_high';

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:479:7
-     if (behConf === 'high') return 'mismatch_high';
+     if (false) return 'mismatch_high';

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:479:7
-     if (behConf === 'high') return 'mismatch_high';
+     if (behConf !== 'high') return 'mismatch_high';

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:493:100
-   export function analyzeProfile({ selfReport, cdlEntries, hyperfocusData, previousReconciliations = [] }) {
+   export function analyzeProfile({ selfReport, cdlEntries, hyperfocusData, previousReconciliations = ["Stryker was here"] }) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:494:19
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries && [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:494:33
-     const entries = cdlEntries ?? [];
+     const entries = cdlEntries ?? ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:496:22
-     const behavioral = entries.length > 0
+     const behavioral = true

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:496:22
-     const behavioral = entries.length > 0
+     const behavioral = false

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:496:22
-     const behavioral = entries.length > 0
+     const behavioral = entries.length >= 0

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:496:22
-     const behavioral = entries.length > 0
+     const behavioral = entries.length <= 0

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:500:47
-     const riskFlags = detectYoyoRisk(entries) ? ['YO-YO_RISK'] : [];
+     const riskFlags = detectYoyoRisk(entries) ? [] : [];

[NoCoverage] ArrayDeclaration
src/engine/profileTyping.js:500:64
-     const riskFlags = detectYoyoRisk(entries) ? ['YO-YO_RISK'] : [];
+     const riskFlags = detectYoyoRisk(entries) ? ['YO-YO_RISK'] : ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:503:7
-     if (!selfReport && !behavioral?.primary) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:503:7
-     if (!selfReport && !behavioral?.primary) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:503:7
-     if (!selfReport && !behavioral?.primary) {
+     if (!selfReport || !behavioral?.primary) {

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:503:7
-     if (!selfReport && !behavioral?.primary) {
+     if (selfReport && !behavioral?.primary) {

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:503:22
-     if (!selfReport && !behavioral?.primary) {
+     if (!selfReport && behavioral?.primary) {

[NoCoverage] OptionalChaining
src/engine/profileTyping.js:503:23
-     if (!selfReport && !behavioral?.primary) {
+     if (!selfReport && !behavioral.primary) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:503:44
-     if (!selfReport && !behavioral?.primary) {
-       return {
-         primary: null,
-         secondary: null,
-         confidence: 'low',
-         source: 'self-report',
-         selfReport: null,
-         behavioral: behavioral ?? null,
-         reconciliation: null,
-         riskFlags,
-         reasoning: 'No data available for profile inference.',
-       };
-     }
+     if (!selfReport && !behavioral?.primary) {}

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:504:12
-       return {
-         primary: null,
-         secondary: null,
-         confidence: 'low',
-         source: 'self-report',
-         selfReport: null,
-         behavioral: behavioral ?? null,
-         reconciliation: null,
-         riskFlags,
-         reasoning: 'No data available for profile inference.',
-       };
+       return {};

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:510:19
-         behavioral: behavioral ?? null,
+         behavioral: behavioral && null,

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:518:7
-     if (!selfReport) {
+     if (selfReport) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:518:7
-     if (!selfReport) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:518:7
-     if (!selfReport) {
+     if (false) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:518:20
-     if (!selfReport) {
-       return {
-         primary: behavioral.primary,
-         secondary: null,
-         confidence: behavioral.confidence,
-         source: 'behavioral',
-         selfReport: null,
-         behavioral,
-         reconciliation: null,
-         riskFlags,
-         reasoning: `Behavioral inference: ${behavioral.primary} (confidence: ${behavioral.confidence}).`,
-       };
-     }
+     if (!selfReport) {}

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:519:12
-       return {
-         primary: behavioral.primary,
-         secondary: null,
-         confidence: behavioral.confidence,
-         source: 'behavioral',
-         selfReport: null,
-         behavioral,
-         reconciliation: null,
-         riskFlags,
-         reasoning: `Behavioral inference: ${behavioral.primary} (confidence: ${behavioral.confidence}).`,
-       };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:533:7
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:533:7
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:533:7
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if ((!behavioral || !behavioral.primary) && behavioral.sessionCount < 12) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:533:7
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (false || behavioral.sessionCount < 12) {

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:533:7
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (!behavioral && !behavioral.primary || behavioral.sessionCount < 12) {

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:533:7
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (behavioral || !behavioral.primary || behavioral.sessionCount < 12) {

[NoCoverage] BooleanLiteral
src/engine/profileTyping.js:533:22
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (!behavioral || behavioral.primary || behavioral.sessionCount < 12) {

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:533:45
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (!behavioral || !behavioral.primary || false) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:533:45
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (!behavioral || !behavioral.primary || behavioral.sessionCount <= 12) {

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:533:45
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
+     if (!behavioral || !behavioral.primary || behavioral.sessionCount >= 12) {

[NoCoverage] BlockStatement
src/engine/profileTyping.js:533:75
-     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {
-       return {
-         primary: selfReport.primary,
-         secondary: selfReport.secondary ?? null,
-         confidence: selfReport.confidence ?? 'low',
-         source: 'self-report',
-         selfReport,
-         behavioral: behavioral ?? null,
-         reconciliation: null,
-         riskFlags,
-         reasoning: 'Behavioral data insufficient — using self-report.',
-       };
-     }
+     if (!behavioral || !behavioral.primary || behavioral.sessionCount < 12) {}

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:534:12
-       return {
-         primary: selfReport.primary,
-         secondary: selfReport.secondary ?? null,
-         confidence: selfReport.confidence ?? 'low',
-         source: 'self-report',
-         selfReport,
-         behavioral: behavioral ?? null,
-         reconciliation: null,
-         riskFlags,
-         reasoning: 'Behavioral data insufficient — using self-report.',
-       };
+       return {};

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:536:18
-         secondary: selfReport.secondary ?? null,
+         secondary: selfReport.secondary && null,

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:537:19
-         confidence: selfReport.confidence ?? 'low',
+         confidence: selfReport.confidence && 'low',

[NoCoverage] LogicalOperator
src/engine/profileTyping.js:540:19
-         behavioral: behavioral ?? null,
+         behavioral: behavioral && null,

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:548:19
-     const isMatch = selfReport.primary === behavioral.primary;
+     const isMatch = true;

[NoCoverage] ConditionalExpression
src/engine/profileTyping.js:548:19
-     const isMatch = selfReport.primary === behavioral.primary;
+     const isMatch = false;

[NoCoverage] EqualityOperator
src/engine/profileTyping.js:548:19
-     const isMatch = selfReport.primary === behavioral.primary;
+     const isMatch = selfReport.primary !== behavioral.primary;

[NoCoverage] ObjectLiteral
src/engine/profileTyping.js:550:10
-     return {
-       primary: isMatch ? selfReport.primary : behavioral.primary,
-       secondary: isMatch ? null : selfReport.primary,
-       confidence: behavioral.confidence,
-       source: 'reconciled',
-       selfReport,
-       behavioral,
-       reconciliation: isMatch ? 'match' : 'mismatch',
-       riskFlags,
-       reasoning: isMatch
-         ? `Pattern observat se aliniază cu ${selfReport.primary} (self-report confirmat). Confidence: ${behavioral.confidence}.`
-         : `Pattern observat te apropie de ${behavioral.primary} (confidence: ${behavioral.confidence}). Self-report: ${selfReport.primary}. Mismatch — reconciliation prompt recommended.`,
-     };
+     return {};

[NoCoverage] ConditionalExpression
src/engine/progressionMatrix.js:53:5
-       default:                              return 1;
+       // every 4-6 sessions
+   default:

[Survived] ConditionalExpression
src/engine/progressionMatrix.js:34:30
-     if (!Number.isFinite(n) || n < 0) return PROGRESSION_TIERS.BEGINNER;
+     if (!Number.isFinite(n) || false) return PROGRESSION_TIERS.BEGINNER;
Tests ran:
    progressionMatrix — getProgressionTier (F-NEW-2 bands) returns BEGINNER for 0 sessions
    progressionMatrix — getProgressionTier (F-NEW-2 bands) returns BEGINNER for 10 sessions (upper bound inclusive)
    progressionMatrix — getProgressionTier (F-NEW-2 bands) returns INTERMEDIATE for 11 sessions (lower bound)
  and 7 more tests!

[Survived] EqualityOperator
src/engine/progressionMatrix.js:34:30
-     if (!Number.isFinite(n) || n < 0) return PROGRESSION_TIERS.BEGINNER;
+     if (!Number.isFinite(n) || n <= 0) return PROGRESSION_TIERS.BEGINNER;
Tests ran:
    progressionMatrix — getProgressionTier (F-NEW-2 bands) returns BEGINNER for 0 sessions
    progressionMatrix — getProgressionTier (F-NEW-2 bands) returns BEGINNER for 10 sessions (upper bound inclusive)
    progressionMatrix — getProgressionTier (F-NEW-2 bands) returns INTERMEDIATE for 11 sessions (lower bound)
  and 7 more tests!

[NoCoverage] BlockStatement
src/engine/readiness.js:17:105
-   export function getReadinessScore(readinessInput, kcalYesterday, protYesterday, targetKcal, targetProt) {
-     if (readinessInput == null) return null;
-     const readinessPoints = { 5: 40, 4: 35, 3: 25, 2: 15, 1: 0 };
-     let score = 60 + (readinessPoints[readinessInput] ?? 0);
-   
-     if (kcalYesterday != null && targetKcal) {
-       const ratio = kcalYesterday / targetKcal;
-       if (ratio < 0.70) score -= 20;
-       else if (ratio < 0.85) score -= 10;
-       else if (ratio < 0.95) score -= 5;
-     }
-     if (protYesterday != null && targetProt) {
-       const ratio = protYesterday / targetProt;
-       if (ratio < 0.70) score -= 10;
-       else if (ratio < 0.85) score -= 5;
-     }
-     return Math.max(10, Math.min(100, Math.round(score)));
-   }
+   export function getReadinessScore(readinessInput, kcalYesterday, protYesterday, targetKcal, targetProt) {}

[NoCoverage] ConditionalExpression
src/engine/readiness.js:18:7
-     if (readinessInput == null) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:18:7
-     if (readinessInput == null) return null;
+     if (false) return null;

[NoCoverage] EqualityOperator
src/engine/readiness.js:18:7
-     if (readinessInput == null) return null;
+     if (readinessInput != null) return null;

[NoCoverage] ObjectLiteral
src/engine/readiness.js:19:27
-     const readinessPoints = { 5: 40, 4: 35, 3: 25, 2: 15, 1: 0 };
+     const readinessPoints = {};

[NoCoverage] ArithmeticOperator
src/engine/readiness.js:20:15
-     let score = 60 + (readinessPoints[readinessInput] ?? 0);
+     let score = 60 - (readinessPoints[readinessInput] ?? 0);

[NoCoverage] LogicalOperator
src/engine/readiness.js:20:21
-     let score = 60 + (readinessPoints[readinessInput] ?? 0);
+     let score = 60 + (readinessPoints[readinessInput] && 0);

[NoCoverage] ConditionalExpression
src/engine/readiness.js:22:7
-     if (kcalYesterday != null && targetKcal) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/readiness.js:22:7
-     if (kcalYesterday != null && targetKcal) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/readiness.js:22:7
-     if (kcalYesterday != null && targetKcal) {
+     if (kcalYesterday != null || targetKcal) {

[NoCoverage] ConditionalExpression
src/engine/readiness.js:22:7
-     if (kcalYesterday != null && targetKcal) {
+     if (true && targetKcal) {

[NoCoverage] EqualityOperator
src/engine/readiness.js:22:7
-     if (kcalYesterday != null && targetKcal) {
+     if (kcalYesterday == null && targetKcal) {

[NoCoverage] BlockStatement
src/engine/readiness.js:22:44
-     if (kcalYesterday != null && targetKcal) {
-       const ratio = kcalYesterday / targetKcal;
-       if (ratio < 0.70) score -= 20;
-       else if (ratio < 0.85) score -= 10;
-       else if (ratio < 0.95) score -= 5;
-     }
+     if (kcalYesterday != null && targetKcal) {}

[NoCoverage] ArithmeticOperator
src/engine/readiness.js:23:19
-       const ratio = kcalYesterday / targetKcal;
+       const ratio = kcalYesterday * targetKcal;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:24:9
-       if (ratio < 0.70) score -= 20;
+       if (true) score -= 20;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:24:9
-       if (ratio < 0.70) score -= 20;
+       if (false) score -= 20;

[NoCoverage] EqualityOperator
src/engine/readiness.js:24:9
-       if (ratio < 0.70) score -= 20;
+       if (ratio <= 0.70) score -= 20;

[NoCoverage] EqualityOperator
src/engine/readiness.js:24:9
-       if (ratio < 0.70) score -= 20;
+       if (ratio >= 0.70) score -= 20;

[NoCoverage] AssignmentOperator
src/engine/readiness.js:24:23
-       if (ratio < 0.70) score -= 20;
+       if (ratio < 0.70) score += 20;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:25:14
-       else if (ratio < 0.85) score -= 10;
+       else if (true) score -= 10;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:25:14
-       else if (ratio < 0.85) score -= 10;
+       else if (false) score -= 10;

[NoCoverage] EqualityOperator
src/engine/readiness.js:25:14
-       else if (ratio < 0.85) score -= 10;
+       else if (ratio <= 0.85) score -= 10;

[NoCoverage] EqualityOperator
src/engine/readiness.js:25:14
-       else if (ratio < 0.85) score -= 10;
+       else if (ratio >= 0.85) score -= 10;

[NoCoverage] AssignmentOperator
src/engine/readiness.js:25:28
-       else if (ratio < 0.85) score -= 10;
+       else if (ratio < 0.85) score += 10;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:26:14
-       else if (ratio < 0.95) score -= 5;
+       else if (true) score -= 5;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:26:14
-       else if (ratio < 0.95) score -= 5;
+       else if (false) score -= 5;

[NoCoverage] EqualityOperator
src/engine/readiness.js:26:14
-       else if (ratio < 0.95) score -= 5;
+       else if (ratio <= 0.95) score -= 5;

[NoCoverage] EqualityOperator
src/engine/readiness.js:26:14
-       else if (ratio < 0.95) score -= 5;
+       else if (ratio >= 0.95) score -= 5;

[NoCoverage] AssignmentOperator
src/engine/readiness.js:26:28
-       else if (ratio < 0.95) score -= 5;
+       else if (ratio < 0.95) score += 5;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:28:7
-     if (protYesterday != null && targetProt) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/readiness.js:28:7
-     if (protYesterday != null && targetProt) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/readiness.js:28:7
-     if (protYesterday != null && targetProt) {
+     if (protYesterday != null || targetProt) {

[NoCoverage] ConditionalExpression
src/engine/readiness.js:28:7
-     if (protYesterday != null && targetProt) {
+     if (true && targetProt) {

[NoCoverage] EqualityOperator
src/engine/readiness.js:28:7
-     if (protYesterday != null && targetProt) {
+     if (protYesterday == null && targetProt) {

[NoCoverage] BlockStatement
src/engine/readiness.js:28:44
-     if (protYesterday != null && targetProt) {
-       const ratio = protYesterday / targetProt;
-       if (ratio < 0.70) score -= 10;
-       else if (ratio < 0.85) score -= 5;
-     }
+     if (protYesterday != null && targetProt) {}

[NoCoverage] ArithmeticOperator
src/engine/readiness.js:29:19
-       const ratio = protYesterday / targetProt;
+       const ratio = protYesterday * targetProt;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:30:9
-       if (ratio < 0.70) score -= 10;
+       if (true) score -= 10;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:30:9
-       if (ratio < 0.70) score -= 10;
+       if (false) score -= 10;

[NoCoverage] EqualityOperator
src/engine/readiness.js:30:9
-       if (ratio < 0.70) score -= 10;
+       if (ratio <= 0.70) score -= 10;

[NoCoverage] EqualityOperator
src/engine/readiness.js:30:9
-       if (ratio < 0.70) score -= 10;
+       if (ratio >= 0.70) score -= 10;

[NoCoverage] AssignmentOperator
src/engine/readiness.js:30:23
-       if (ratio < 0.70) score -= 10;
+       if (ratio < 0.70) score += 10;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:31:14
-       else if (ratio < 0.85) score -= 5;
+       else if (true) score -= 5;
