[NoCoverage] ConditionalExpression
src/engine/readiness.js:31:14
-       else if (ratio < 0.85) score -= 5;
+       else if (false) score -= 5;

[NoCoverage] EqualityOperator
src/engine/readiness.js:31:14
-       else if (ratio < 0.85) score -= 5;
+       else if (ratio <= 0.85) score -= 5;

[NoCoverage] EqualityOperator
src/engine/readiness.js:31:14
-       else if (ratio < 0.85) score -= 5;
+       else if (ratio >= 0.85) score -= 5;

[NoCoverage] AssignmentOperator
src/engine/readiness.js:31:28
-       else if (ratio < 0.85) score -= 5;
+       else if (ratio < 0.85) score += 5;

[NoCoverage] MethodExpression
src/engine/readiness.js:33:10
-     return Math.max(10, Math.min(100, Math.round(score)));
+     return Math.min(10, Math.min(100, Math.round(score)));

[NoCoverage] MethodExpression
src/engine/readiness.js:33:23
-     return Math.max(10, Math.min(100, Math.round(score)));
+     return Math.max(10, Math.max(100, Math.round(score)));

[NoCoverage] ObjectLiteral
src/engine/readiness.js:41:41
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (score >= READINESS_HIGH) return {};

[NoCoverage] BooleanLiteral
src/engine/readiness.js:41:128
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: true };

[NoCoverage] ObjectLiteral
src/engine/readiness.js:42:41
-       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
+       if (score >= READINESS_MED)  return {};

[NoCoverage] BooleanLiteral
src/engine/readiness.js:42:128
-       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
+       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: true };

[NoCoverage] ObjectLiteral
src/engine/readiness.js:43:41
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (score >= READINESS_LOW)  return {};

[NoCoverage] BooleanLiteral
src/engine/readiness.js:43:128
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: true };

[NoCoverage] ObjectLiteral
src/engine/readiness.js:48:41
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (score >= READINESS_HIGH) return {};

[NoCoverage] BooleanLiteral
src/engine/readiness.js:48:128
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: true };

[NoCoverage] ObjectLiteral
src/engine/readiness.js:50:41
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (score >= READINESS_LOW)  return {};

[NoCoverage] BooleanLiteral
src/engine/readiness.js:50:128
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: true };

[NoCoverage] BlockStatement
src/engine/readiness.js:55:38
-   export function saveReadiness(value) {
-     const all = DB.get('readiness') || {};
-     all[tod()] = Number(value);
-     DB.set('readiness', all);
-   }
+   export function saveReadiness(value) {}

[NoCoverage] ConditionalExpression
src/engine/readiness.js:56:15
-     const all = DB.get('readiness') || {};
+     const all = true;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:56:15
-     const all = DB.get('readiness') || {};
+     const all = false;

[NoCoverage] LogicalOperator
src/engine/readiness.js:56:15
-     const all = DB.get('readiness') || {};
+     const all = DB.get('readiness') && {};

[NoCoverage] BlockStatement
src/engine/readiness.js:61:37
-   export function getTodayReadiness() {
-     const all = DB.get('readiness') || {};
-     return all[tod()] ?? null;
-   }
+   export function getTodayReadiness() {}

[NoCoverage] ConditionalExpression
src/engine/readiness.js:62:15
-     const all = DB.get('readiness') || {};
+     const all = true;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:62:15
-     const all = DB.get('readiness') || {};
+     const all = false;

[NoCoverage] LogicalOperator
src/engine/readiness.js:62:15
-     const all = DB.get('readiness') || {};
+     const all = DB.get('readiness') && {};

[NoCoverage] LogicalOperator
src/engine/readiness.js:63:10
-     return all[tod()] ?? null;
+     return all[tod()] && null;

[NoCoverage] BlockStatement
src/engine/readiness.js:66:45
-   export function getComputedReadinessScore() {
-     const r = getTodayReadiness();
-     if (r == null) return null;
-     const yesterday = new Date(); yesterday.setDate(yesterday.getDate()-1);
-     const yDate = todDate(yesterday);
-     const kcals = DB.get('kcals') || {};
-     const prots = DB.get('prots') || {};
-     // KCAL_TARGET and PROT_TARGET imported directly from constants.js
-     return getReadinessScore(r, kcals[yDate], prots[yDate], KCAL_TARGET, PROT_TARGET);
-   }
+   export function getComputedReadinessScore() {}

[NoCoverage] ConditionalExpression
src/engine/readiness.js:68:7
-     if (r == null) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:68:7
-     if (r == null) return null;
+     if (false) return null;

[NoCoverage] EqualityOperator
src/engine/readiness.js:68:7
-     if (r == null) return null;
+     if (r != null) return null;

[NoCoverage] MethodExpression
src/engine/readiness.js:69:33
-     const yesterday = new Date(); yesterday.setDate(yesterday.getDate()-1);
+     const yesterday = new Date(); yesterday.setTime(yesterday.getDate() - 1);

[NoCoverage] ArithmeticOperator
src/engine/readiness.js:69:51
-     const yesterday = new Date(); yesterday.setDate(yesterday.getDate()-1);
+     const yesterday = new Date(); yesterday.setDate(yesterday.getDate() + 1);

[NoCoverage] ConditionalExpression
src/engine/readiness.js:71:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:71:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/engine/readiness.js:71:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/engine/readiness.js:72:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/engine/readiness.js:72:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/engine/readiness.js:72:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[Survived] BooleanLiteral
src/engine/readiness.js:36:56
-   export function getReadinessVerdict(score, { isInCut = false } = {}) {
+   export function getReadinessVerdict(score, { isInCut = true } = {}) {
Tests ran:
    readiness — getReadinessVerdict score=null → label=null, volumeMultiplier=1.0

[Survived] BooleanLiteral
src/engine/readiness.js:37:97
-     if (score == null) return { label: null, color: 'var(--text3)', volumeMultiplier: 1.0, canPR: false };
+     if (score == null) return { label: null, color: 'var(--text3)', volumeMultiplier: 1.0, canPR: true };
Tests ran:
    readiness — getReadinessVerdict score=null → label=null, volumeMultiplier=1.0

[Survived] ConditionalExpression
src/engine/readiness.js:41:9
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (false) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] EqualityOperator
src/engine/readiness.js:41:9
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (score > READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] ConditionalExpression
src/engine/readiness.js:42:9
-       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
+       if (false)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] EqualityOperator
src/engine/readiness.js:42:9
-       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
+       if (score > READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] ConditionalExpression
src/engine/readiness.js:43:9
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (false)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] EqualityOperator
src/engine/readiness.js:43:9
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (score > READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] BooleanLiteral
src/engine/readiness.js:44:100
-       return { label: 'Odihnă',             color: 'var(--red)',      volumeMultiplier: 0,    canPR: false };
+       return { label: 'Odihnă',             color: 'var(--red)',      volumeMultiplier: 0,    canPR: true };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] ConditionalExpression
src/engine/readiness.js:48:9
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (false) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0
    readiness — getReadinessVerdict READINESS_MED boundary (55) → Sesiune moderată, volumeMultiplier=0.85

[Survived] EqualityOperator
src/engine/readiness.js:48:9
-       if (score >= READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
+       if (score > READINESS_HIGH) return { label: 'Sesiune normală',   color: 'var(--accent)',   volumeMultiplier: 1.0,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0
    readiness — getReadinessVerdict READINESS_MED boundary (55) → Sesiune moderată, volumeMultiplier=0.85

[Survived] BooleanLiteral
src/engine/readiness.js:49:128
-       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: false };
+       if (score >= READINESS_MED)  return { label: 'Sesiune moderată',  color: 'var(--accent2)',  volumeMultiplier: 0.85, canPR: true };
Tests ran:
    readiness — getReadinessVerdict READINESS_MED boundary (55) → Sesiune moderată, volumeMultiplier=0.85

[Survived] ConditionalExpression
src/engine/readiness.js:50:9
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (false)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] EqualityOperator
src/engine/readiness.js:50:9
-       if (score >= READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
+       if (score > READINESS_LOW)  return { label: 'Sesiune ușoară',    color: 'var(--accent3)',  volumeMultiplier: 0.7,  canPR: false };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] BooleanLiteral
src/engine/readiness.js:51:100
-       return { label: 'Odihnește-te',       color: 'var(--red)',      volumeMultiplier: 0,    canPR: false };
+       return { label: 'Odihnește-te',       color: 'var(--red)',      volumeMultiplier: 0,    canPR: true };
Tests ran:
    readiness — getReadinessVerdict score=30 → rest verdict, volumeMultiplier=0

[Survived] ObjectLiteral
src/engine/readiness.js:10:6
-     1: { emoji: '😴', label: 'Epuizat', sub: 'Somn prost, energie zero' },
+     1: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/readiness.js:9:33
-   export const READINESS_LABELS = {
-     1: { emoji: '😴', label: 'Epuizat', sub: 'Somn prost, energie zero' },
-     2: { emoji: '😕', label: 'Obosit',  sub: 'Sub formă normală' },
-     3: { emoji: '😐', label: 'Normal',  sub: 'Ok, standard' },
-     4: { emoji: '😊', label: 'Bine',    sub: 'Somn bun, energie bună' },
-     5: { emoji: '🔥', label: 'Excelent', sub: 'Ready to crush it' },
-   };
+   export const READINESS_LABELS = {};
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/readiness.js:11:6
-     2: { emoji: '😕', label: 'Obosit',  sub: 'Sub formă normală' },
+     2: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/readiness.js:12:6
-     3: { emoji: '😐', label: 'Normal',  sub: 'Ok, standard' },
+     3: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/readiness.js:13:6
-     4: { emoji: '😊', label: 'Bine',    sub: 'Somn bun, energie bună' },
+     4: {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/engine/readiness.js:14:6
-     5: { emoji: '🔥', label: 'Excelent', sub: 'Ready to crush it' },
+     5: {},
Ran all tests for this mutant.

[NoCoverage] BlockStatement
src/engine/reality.js:27:55
-   export function getEquipmentForExercise(exerciseName) {
-     return EXERCISE_TO_EQUIPMENT[exerciseName] || null;
-   }
+   export function getEquipmentForExercise(exerciseName) {}

[NoCoverage] ConditionalExpression
src/engine/reality.js:28:10
-     return EXERCISE_TO_EQUIPMENT[exerciseName] || null;
+     return true;

[NoCoverage] ConditionalExpression
src/engine/reality.js:28:10
-     return EXERCISE_TO_EQUIPMENT[exerciseName] || null;
+     return false;

[NoCoverage] LogicalOperator
src/engine/reality.js:28:10
-     return EXERCISE_TO_EQUIPMENT[exerciseName] || null;
+     return EXERCISE_TO_EQUIPMENT[exerciseName] && null;

[NoCoverage] BlockStatement
src/engine/reality.js:46:73
-           if (lastLog && exercise.recommendation.weight > lastLog.weight) {
-             exercise.recommendation.weight = lastLog.weight;
-             exercise.recommendation.heldDueToReadiness = true;
-           }
+           if (lastLog && exercise.recommendation.weight > lastLog.weight) {}

[NoCoverage] BooleanLiteral
src/engine/reality.js:48:56
-             exercise.recommendation.heldDueToReadiness = true;
+             exercise.recommendation.heldDueToReadiness = false;

[NoCoverage] ConditionalExpression
src/engine/reality.js:73:7
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:73:7
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/reality.js:73:7
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (today < TARGET_DATE.toISOString().slice(0, 10) || !phaseOverride) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:73:7
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (true && !phaseOverride) {

[NoCoverage] EqualityOperator
src/engine/reality.js:73:7
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (today <= TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {

[NoCoverage] EqualityOperator
src/engine/reality.js:73:7
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (today >= TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {

[NoCoverage] MethodExpression
src/engine/reality.js:73:15
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (today < TARGET_DATE.toISOString() && !phaseOverride) {

[NoCoverage] BooleanLiteral
src/engine/reality.js:73:57
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
+     if (today < TARGET_DATE.toISOString().slice(0, 10) && phaseOverride) {

[NoCoverage] BlockStatement
src/engine/reality.js:73:73
-     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {
-       return {
-         type: 'fixed',
-         icon: '✅',
-         color: 'var(--green)',
-         message: `Menținem ${KCAL_TARGET} kcal fix până la 20 iulie`
-       };
-     }
+     if (today < TARGET_DATE.toISOString().slice(0, 10) && !phaseOverride) {}

[NoCoverage] ObjectLiteral
src/engine/reality.js:74:12
-       return {
-         type: 'fixed',
-         icon: '✅',
-         color: 'var(--green)',
-         message: `Menținem ${KCAL_TARGET} kcal fix până la 20 iulie`
-       };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/reality.js:82:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/engine/reality.js:82:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/engine/reality.js:82:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/engine/reality.js:83:17
-     const dates = Object.keys(ws).sort().slice(-8);
+     const dates = Object.keys(ws).sort();

[NoCoverage] MethodExpression
src/engine/reality.js:83:17
-     const dates = Object.keys(ws).sort().slice(-8);
+     const dates = Object.keys(ws).slice(-8);

[NoCoverage] UnaryOperator
src/engine/reality.js:83:46
-     const dates = Object.keys(ws).sort().slice(-8);
+     const dates = Object.keys(ws).sort().slice(+8);

[NoCoverage] ConditionalExpression
src/engine/reality.js:84:7
-     if (dates.length < 4) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/engine/reality.js:84:7
-     if (dates.length < 4) return null;
+     if (false) return null;

[NoCoverage] EqualityOperator
src/engine/reality.js:84:7
-     if (dates.length < 4) return null;
+     if (dates.length <= 4) return null;

[NoCoverage] EqualityOperator
src/engine/reality.js:84:7
-     if (dates.length < 4) return null;
+     if (dates.length >= 4) return null;

[NoCoverage] ArrowFunction
src/engine/reality.js:86:26
-     const vals = dates.map(d => ws[d]);
+     const vals = dates.map(() => undefined);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:88:16
-     const sumX = n * (n - 1) / 2;
+     const sumX = n * (n - 1) * 2;

[NoCoverage] ArithmeticOperator
src/engine/reality.js:88:16
-     const sumX = n * (n - 1) / 2;
+     const sumX = n / (n - 1) / 2;

[NoCoverage] ArithmeticOperator
src/engine/reality.js:88:21
-     const sumX = n * (n - 1) / 2;
+     const sumX = n * (n + 1) / 2;

[NoCoverage] ArrowFunction
src/engine/reality.js:89:28
-     const sumY = vals.reduce((a, b) => a + b, 0);
+     const sumY = vals.reduce(() => undefined, 0);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:89:38
-     const sumY = vals.reduce((a, b) => a + b, 0);
+     const sumY = vals.reduce((a, b) => a - b, 0);

[NoCoverage] ArrowFunction
src/engine/reality.js:90:29
-     const sumXY = vals.reduce((s, v, i) => s + i * v, 0);
+     const sumXY = vals.reduce(() => undefined, 0);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:90:42
-     const sumXY = vals.reduce((s, v, i) => s + i * v, 0);
+     const sumXY = vals.reduce((s, v, i) => s - i * v, 0);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:90:46
-     const sumXY = vals.reduce((s, v, i) => s + i * v, 0);
+     const sumXY = vals.reduce((s, v, i) => s + i / v, 0);

[NoCoverage] ArrowFunction
src/engine/reality.js:91:29
-     const sumX2 = vals.reduce((s, _, i) => s + i * i, 0);
+     const sumX2 = vals.reduce(() => undefined, 0);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:91:42
-     const sumX2 = vals.reduce((s, _, i) => s + i * i, 0);
+     const sumX2 = vals.reduce((s, _, i) => s - i * i, 0);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:91:46
-     const sumX2 = vals.reduce((s, _, i) => s + i * i, 0);
+     const sumX2 = vals.reduce((s, _, i) => s + i / i, 0);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:17
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n * sumXY - sumX * sumY) * (n * sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:18
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n * sumXY + sumX * sumY) / (n * sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:18
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n / sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:30
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n * sumXY - sumX / sumY) / (n * sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:46
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 + sumX * sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:46
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n * sumXY - sumX * sumY) / (n / sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:92:58
-     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX * sumX);
+     const slope = (n * sumXY - sumX * sumY) / (n * sumX2 - sumX / sumX);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:93:17
-     const trend = Math.round(slope * 7 * 100) / 100; // kg per week
+     const trend = Math.round(slope * 7 * 100) * 100; // kg per week

[NoCoverage] ArithmeticOperator
src/engine/reality.js:93:28
-     const trend = Math.round(slope * 7 * 100) / 100; // kg per week
+     const trend = Math.round(slope * 7 / 100) / 100; // kg per week

[NoCoverage] ArithmeticOperator
src/engine/reality.js:93:28
-     const trend = Math.round(slope * 7 * 100) / 100; // kg per week
+     const trend = Math.round(slope / 7 * 100) / 100; // kg per week

[NoCoverage] ConditionalExpression
src/engine/reality.js:100:7
-     if (dates.length >= 4) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:100:7
-     if (dates.length >= 4) {
+     if (false) {

[NoCoverage] EqualityOperator
src/engine/reality.js:100:7
-     if (dates.length >= 4) {
+     if (dates.length > 4) {

[NoCoverage] EqualityOperator
src/engine/reality.js:100:7
-     if (dates.length >= 4) {
+     if (dates.length < 4) {

[NoCoverage] BlockStatement
src/engine/reality.js:100:26
-     if (dates.length >= 4) {
-       const spanDays = Math.round(
-         (new Date(dates[dates.length - 1]) - new Date(dates[0])) / 86400000
-       );
-       if (spanDays >= 7) {
-         const firstVal = vals[0];
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
-         if (allNonDecreasing) {
-           return {
-             type: 'plateau',
-             icon: '🔴',
-             color: 'var(--red)',
-             message: 'Greutatea nu a scăzut în ultimele 7 zile. Hai să vedem ce putem ajusta în strategie.'
-           };
-         }
-       }
-     }
+     if (dates.length >= 4) {}

[NoCoverage] ArithmeticOperator
src/engine/reality.js:102:7
-         (new Date(dates[dates.length - 1]) - new Date(dates[0])) / 86400000
+         (new Date(dates[dates.length - 1]) - new Date(dates[0])) * 86400000

[NoCoverage] ArithmeticOperator
src/engine/reality.js:102:8
-         (new Date(dates[dates.length - 1]) - new Date(dates[0])) / 86400000
+         (new Date(dates[dates.length - 1]) + new Date(dates[0])) / 86400000

[NoCoverage] ArithmeticOperator
src/engine/reality.js:102:23
-         (new Date(dates[dates.length - 1]) - new Date(dates[0])) / 86400000
+         (new Date(dates[dates.length + 1]) - new Date(dates[0])) / 86400000

[NoCoverage] ConditionalExpression
src/engine/reality.js:104:9
-       if (spanDays >= 7) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:104:9
-       if (spanDays >= 7) {
+       if (false) {

[NoCoverage] EqualityOperator
src/engine/reality.js:104:9
-       if (spanDays >= 7) {
+       if (spanDays > 7) {

[NoCoverage] EqualityOperator
src/engine/reality.js:104:9
-       if (spanDays >= 7) {
+       if (spanDays < 7) {

[NoCoverage] BlockStatement
src/engine/reality.js:104:24
-       if (spanDays >= 7) {
-         const firstVal = vals[0];
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
-         if (allNonDecreasing) {
-           return {
-             type: 'plateau',
-             icon: '🔴',
-             color: 'var(--red)',
-             message: 'Greutatea nu a scăzut în ultimele 7 zile. Hai să vedem ce putem ajusta în strategie.'
-           };
-         }
-       }
+       if (spanDays >= 7) {}

[NoCoverage] MethodExpression
src/engine/reality.js:106:32
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.some(v => v >= firstVal - 0.05);

[NoCoverage] ArrowFunction
src/engine/reality.js:106:43
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.every(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/reality.js:106:48
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.every(v => true);

[NoCoverage] ConditionalExpression
src/engine/reality.js:106:48
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.every(v => false);

[NoCoverage] EqualityOperator
src/engine/reality.js:106:48
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.every(v => v > firstVal - 0.05);

[NoCoverage] EqualityOperator
src/engine/reality.js:106:48
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.every(v => v < firstVal - 0.05);

[NoCoverage] ArithmeticOperator
src/engine/reality.js:106:53
-         const allNonDecreasing = vals.every(v => v >= firstVal - 0.05);
+         const allNonDecreasing = vals.every(v => v >= firstVal + 0.05);

[NoCoverage] ConditionalExpression
src/engine/reality.js:107:11
-         if (allNonDecreasing) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:107:11
-         if (allNonDecreasing) {
+         if (false) {

[NoCoverage] BlockStatement
src/engine/reality.js:107:29
-         if (allNonDecreasing) {
-           return {
-             type: 'plateau',
-             icon: '🔴',
-             color: 'var(--red)',
-             message: 'Greutatea nu a scăzut în ultimele 7 zile. Hai să vedem ce putem ajusta în strategie.'
-           };
-         }
+         if (allNonDecreasing) {}

[NoCoverage] ObjectLiteral
src/engine/reality.js:108:16
-           return {
-             type: 'plateau',
-             icon: '🔴',
-             color: 'var(--red)',
-             message: 'Greutatea nu a scăzut în ultimele 7 zile. Hai să vedem ce putem ajusta în strategie.'
-           };
+           return {};

[NoCoverage] ConditionalExpression
src/engine/reality.js:119:7
-     if (trend < -1) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:119:7
-     if (trend < -1) {
+     if (false) {

[NoCoverage] EqualityOperator
src/engine/reality.js:119:7
-     if (trend < -1) {
+     if (trend <= -1) {

[NoCoverage] EqualityOperator
src/engine/reality.js:119:7
-     if (trend < -1) {
+     if (trend >= -1) {
