[NoCoverage] UnaryOperator
src/engine/reality.js:119:15
-     if (trend < -1) {
+     if (trend < +1) {

[NoCoverage] BlockStatement
src/engine/reality.js:119:19
-     if (trend < -1) {
-       const suggestedKcal = SYS.getKcalTarget() + 100;
-       return {
-         type: 'warning',
-         icon: '⚡',
-         color: 'var(--accent2)',
-         message: `Slăbim un pic prea repede și riscăm să pierdem din masa musculară. Hai să creștem temporar aportul la ${suggestedKcal} kcal pentru a ne proteja progresul.`
-       };
-     }
+     if (trend < -1) {}

[NoCoverage] ArithmeticOperator
src/engine/reality.js:120:27
-       const suggestedKcal = SYS.getKcalTarget() + 100;
+       const suggestedKcal = SYS.getKcalTarget() - 100;

[NoCoverage] ObjectLiteral
src/engine/reality.js:121:12
-       return {
-         type: 'warning',
-         icon: '⚡',
-         color: 'var(--accent2)',
-         message: `Slăbim un pic prea repede și riscăm să pierdem din masa musculară. Hai să creștem temporar aportul la ${suggestedKcal} kcal pentru a ne proteja progresul.`
-       };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/reality.js:130:7
-     if (trend > -0.3 && dates.length >= 7) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:130:7
-     if (trend > -0.3 && dates.length >= 7) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/reality.js:130:7
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend > -0.3 || dates.length >= 7) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:130:7
-     if (trend > -0.3 && dates.length >= 7) {
+     if (true && dates.length >= 7) {

[NoCoverage] EqualityOperator
src/engine/reality.js:130:7
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend >= -0.3 && dates.length >= 7) {

[NoCoverage] EqualityOperator
src/engine/reality.js:130:7
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend <= -0.3 && dates.length >= 7) {

[NoCoverage] UnaryOperator
src/engine/reality.js:130:15
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend > +0.3 && dates.length >= 7) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:130:23
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend > -0.3 && true) {

[NoCoverage] EqualityOperator
src/engine/reality.js:130:23
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend > -0.3 && dates.length > 7) {

[NoCoverage] EqualityOperator
src/engine/reality.js:130:23
-     if (trend > -0.3 && dates.length >= 7) {
+     if (trend > -0.3 && dates.length < 7) {

[NoCoverage] BlockStatement
src/engine/reality.js:130:42
-     if (trend > -0.3 && dates.length >= 7) {
-       return {
-         type: 'slow',
-         icon: '🐢',
-         color: 'var(--accent)',
-         message: 'Progres mai lent decât țintit · Verificăm aportul sau activitatea'
-       };
-     }
+     if (trend > -0.3 && dates.length >= 7) {}

[NoCoverage] ObjectLiteral
src/engine/reality.js:131:12
-       return {
-         type: 'slow',
-         icon: '🐢',
-         color: 'var(--accent)',
-         message: 'Progres mai lent decât țintit · Verificăm aportul sau activitatea'
-       };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/reality.js:140:7
-     if (trend <= -0.3 && trend >= -1) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:140:7
-     if (trend <= -0.3 && trend >= -1) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/reality.js:140:7
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend <= -0.3 || trend >= -1) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:140:7
-     if (trend <= -0.3 && trend >= -1) {
+     if (true && trend >= -1) {

[NoCoverage] EqualityOperator
src/engine/reality.js:140:7
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend < -0.3 && trend >= -1) {

[NoCoverage] EqualityOperator
src/engine/reality.js:140:7
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend > -0.3 && trend >= -1) {

[NoCoverage] UnaryOperator
src/engine/reality.js:140:16
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend <= +0.3 && trend >= -1) {

[NoCoverage] ConditionalExpression
src/engine/reality.js:140:24
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend <= -0.3 && true) {

[NoCoverage] EqualityOperator
src/engine/reality.js:140:24
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend <= -0.3 && trend > -1) {

[NoCoverage] EqualityOperator
src/engine/reality.js:140:24
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend <= -0.3 && trend < -1) {

[NoCoverage] UnaryOperator
src/engine/reality.js:140:33
-     if (trend <= -0.3 && trend >= -1) {
+     if (trend <= -0.3 && trend >= +1) {

[NoCoverage] BlockStatement
src/engine/reality.js:140:37
-     if (trend <= -0.3 && trend >= -1) {
-       return {
-         type: 'ok',
-         icon: '✅',
-         color: 'var(--green)',
-         message: 'Suntem în ritmul țintit · Menținem direcția'
-       };
-     }
+     if (trend <= -0.3 && trend >= -1) {}

[NoCoverage] ObjectLiteral
src/engine/reality.js:141:12
-       return {
-         type: 'ok',
-         icon: '✅',
-         color: 'var(--green)',
-         message: 'Suntem în ritmul țintit · Menținem direcția'
-       };
+       return {};

[Survived] ConditionalExpression
src/engine/reality.js:15:7
-     if (!equipKey || !EQUIPMENT_WEIGHTS[equipKey]) return weight;
+     if (false) return weight;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — Equipment validation roundToEquipment returns valid dumbbell weights
  and 27 more tests!

[Survived] LogicalOperator
src/engine/reality.js:15:7
-     if (!equipKey || !EQUIPMENT_WEIGHTS[equipKey]) return weight;
+     if (!equipKey && !EQUIPMENT_WEIGHTS[equipKey]) return weight;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — Equipment validation roundToEquipment returns valid dumbbell weights
  and 27 more tests!

[Survived] EqualityOperator
src/engine/reality.js:23:5
-       Math.abs(curr - weight) < Math.abs(prev - weight) ? curr : prev
+       Math.abs(curr - weight) <= Math.abs(prev - weight) ? curr : prev
Tests ran:
    CoachDirector — Equipment validation roundToEquipment returns valid dumbbell weights
    CoachDirector — Equipment validation roundToEquipment returns valid Pec Deck weights
    CoachDirector — Equipment validation roundToEquipment returns valid cable weights

[Survived] ConditionalExpression
src/engine/reality.js:33:9
-       if (!session || !session.exercises) return session;
+       if (false) return session;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/reality.js:33:9
-       if (!session || !session.exercises) return session;
+       if (!session && !session.exercises) return session;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:35:11
-         if (!exercise.recommendation) continue;
+         if (false) continue;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:39:11
-         if (originalWeight !== exercise.recommendation.weight) {
+         if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:39:11
-         if (originalWeight !== exercise.recommendation.weight) {
+         if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/reality.js:39:11
-         if (originalWeight !== exercise.recommendation.weight) {
+         if (originalWeight === exercise.recommendation.weight) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/reality.js:39:62
-         if (originalWeight !== exercise.recommendation.weight) {
-           exercise.recommendation.realityAdjusted = true;
-           exercise.recommendation.originalWeight = originalWeight;
-         }
+         if (originalWeight !== exercise.recommendation.weight) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BooleanLiteral
src/engine/reality.js:40:51
-           exercise.recommendation.realityAdjusted = true;
+           exercise.recommendation.realityAdjusted = false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:44:11
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:44:11
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/reality.js:44:11
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (ctx.readiness.score !== null || ctx.readiness.score < 60) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:44:11
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (true && ctx.readiness.score < 60) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/reality.js:44:11
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (ctx.readiness.score === null && ctx.readiness.score < 60) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:44:43
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (ctx.readiness.score !== null && true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/reality.js:44:43
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (ctx.readiness.score !== null && ctx.readiness.score <= 60) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/engine/reality.js:44:43
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
+         if (ctx.readiness.score !== null && ctx.readiness.score >= 60) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/reality.js:44:69
-         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {
-           const lastLog = findLastLogForExercise(exercise.name, ctx.recentLogs);
-           if (lastLog && exercise.recommendation.weight > lastLog.weight) {
-             exercise.recommendation.weight = lastLog.weight;
-             exercise.recommendation.heldDueToReadiness = true;
-           }
-         }
+         if (ctx.readiness.score !== null && ctx.readiness.score < 60) {}
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/reality.js:46:13
-           if (lastLog && exercise.recommendation.weight > lastLog.weight) {
+           if (false) {
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/reality.js:46:24
-           if (lastLog && exercise.recommendation.weight > lastLog.weight) {
+           if (lastLog && true) {
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/reality.js:46:24
-           if (lastLog && exercise.recommendation.weight > lastLog.weight) {
+           if (lastLog && exercise.recommendation.weight >= lastLog.weight) {
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/reality.js:46:24
-           if (lastLog && exercise.recommendation.weight > lastLog.weight) {
+           if (lastLog && exercise.recommendation.weight <= lastLog.weight) {
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/reality.js:53:9
-       if (ctx.user.phase === 'AUTO' && ctx.isBeforeJuly20_2026) {
+       if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/engine/reality.js:53:9
-       if (ctx.user.phase === 'AUTO' && ctx.isBeforeJuly20_2026) {
+       if (ctx.user.phase === 'AUTO' || ctx.isBeforeJuly20_2026) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/engine/reality.js:53:9
-       if (ctx.user.phase === 'AUTO' && ctx.isBeforeJuly20_2026) {
+       if (true && ctx.isBeforeJuly20_2026) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/engine/reality.js:61:59
-   function findLastLogForExercise(exerciseName, recentLogs) {
-     for (const session of recentLogs) {
-       // Suportă format test (exercise/weight) și format real (ex/w)
-       const log = session.logs.find(l => l.ex === exerciseName);
-       if (log) return { weight: log.w, ...log };
-     }
-     return null;
-   }
+   function findLastLogForExercise(exerciseName, recentLogs) {}
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] BlockStatement
src/engine/reality.js:62:37
-     for (const session of recentLogs) {
-       // Suportă format test (exercise/weight) și format real (ex/w)
-       const log = session.logs.find(l => l.ex === exerciseName);
-       if (log) return { weight: log.w, ...log };
-     }
+     for (const session of recentLogs) {}
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ArrowFunction
src/engine/reality.js:64:35
-       const log = session.logs.find(l => l.ex === exerciseName);
+       const log = session.logs.find(() => undefined);
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/reality.js:64:40
-       const log = session.logs.find(l => l.ex === exerciseName);
+       const log = session.logs.find(l => true);
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/reality.js:64:40
-       const log = session.logs.find(l => l.ex === exerciseName);
+       const log = session.logs.find(l => false);
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] EqualityOperator
src/engine/reality.js:64:40
-       const log = session.logs.find(l => l.ex === exerciseName);
+       const log = session.logs.find(l => l.ex !== exerciseName);
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ObjectLiteral
src/engine/reality.js:65:21
-       if (log) return { weight: log.w, ...log };
+       if (log) return {};
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[Survived] ConditionalExpression
src/engine/reality.js:65:9
-       if (log) return { weight: log.w, ...log };
+       if (false) return { weight: log.w, ...log };
Tests ran:
    CoachDirector — Readiness behavior should hold weight when readiness < 60

[NoCoverage] ArrayDeclaration
src/engine/recompileEngine.js:27:51
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft <= 0 || totalSetsLeft <= 0) return ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/engine/recompileEngine.js:76:40
-   export function recompileWeek({ logs = [], readinessScore = 70, targetSetsPerWeek = 45, now = new Date() } = {}) {
+   export function recompileWeek({ logs = ["Stryker was here"], readinessScore = 70, targetSetsPerWeek = 45, now = new Date() } = {}) {

[NoCoverage] BlockStatement
src/engine/recompileEngine.js:81:22
-     if (deficit === 0) {
-       return {
-         recommendation: 'Săptămâna pe track. Nicio restructurare necesară.',
-         distributedSets: [],
-         daysLeft,
-         deficit: 0,
-         completedSets,
-       };
-     }
+     if (deficit === 0) {}

[NoCoverage] ObjectLiteral
src/engine/recompileEngine.js:82:12
-       return {
-         recommendation: 'Săptămâna pe track. Nicio restructurare necesară.',
-         distributedSets: [],
-         daysLeft,
-         deficit: 0,
-         completedSets,
-       };
+       return {};

[NoCoverage] ArrayDeclaration
src/engine/recompileEngine.js:84:24
-         distributedSets: [],
+         distributedSets: ["Stryker was here"],

[Survived] ArrayDeclaration
src/engine/recompileEngine.js:13:21
-     const remaining = [];
+     const remaining = ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ArithmeticOperator
src/engine/recompileEngine.js:14:16
-     for (let d = dow + 1; d <= 6; d++) remaining.push(d);
+     for (let d = dow - 1; d <= 6; d++) remaining.push(d);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:14:25
-     for (let d = dow + 1; d <= 6; d++) remaining.push(d);
+     for (let d = dow + 1; false; d++) remaining.push(d);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:14:25
-     for (let d = dow + 1; d <= 6; d++) remaining.push(d);
+     for (let d = dow + 1; d > 6; d++) remaining.push(d);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:14:25
-     for (let d = dow + 1; d <= 6; d++) remaining.push(d);
+     for (let d = dow + 1; d < 6; d++) remaining.push(d);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:15:7
-     if (dow !== 0) remaining.push(0); // Include Sunday if today isn't Sunday
+     if (true) remaining.push(0); // Include Sunday if today isn't Sunday
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:15:7
-     if (dow !== 0) remaining.push(0); // Include Sunday if today isn't Sunday
+     if (dow === 0) remaining.push(0); // Include Sunday if today isn't Sunday
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:15:7
-     if (dow !== 0) remaining.push(0); // Include Sunday if today isn't Sunday
+     if (false) remaining.push(0); // Include Sunday if today isn't Sunday
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:27:7
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (true) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:27:7
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (false) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] LogicalOperator
src/engine/recompileEngine.js:27:7
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft <= 0 && totalSetsLeft <= 0) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:27:7
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (false || totalSetsLeft <= 0) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:27:7
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft < 0 || totalSetsLeft <= 0) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:27:7
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft > 0 || totalSetsLeft <= 0) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/engine/recompileEngine.js:27:24
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft <= 0 || false) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:27:24
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft <= 0 || totalSetsLeft < 0) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] EqualityOperator
src/engine/recompileEngine.js:27:24
-     if (daysLeft <= 0 || totalSetsLeft <= 0) return [];
+     if (daysLeft <= 0 || totalSetsLeft > 0) return [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!
