[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:48:35
-     if (sessions.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (sessions.length < 4) return {};

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:48:85
-     if (sessions.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (sessions.length < 4) return { score: 0.5, label: 'insuficient', insufficient: false };

[NoCoverage] MethodExpression
src/engine/responseProfile.js:50:18
-     const lowVol = sessions.filter(s => setsInSession(s) <= 15);
+     const lowVol = sessions;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:50:34
-     const lowVol = sessions.filter(s => setsInSession(s) <= 15);
+     const lowVol = sessions.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:50:39
-     const lowVol = sessions.filter(s => setsInSession(s) <= 15);
+     const lowVol = sessions.filter(s => true);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:50:39
-     const lowVol = sessions.filter(s => setsInSession(s) <= 15);
+     const lowVol = sessions.filter(s => false);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:50:39
-     const lowVol = sessions.filter(s => setsInSession(s) <= 15);
+     const lowVol = sessions.filter(s => setsInSession(s) < 15);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:50:39
-     const lowVol = sessions.filter(s => setsInSession(s) <= 15);
+     const lowVol = sessions.filter(s => setsInSession(s) > 15);

[NoCoverage] MethodExpression
src/engine/responseProfile.js:51:19
-     const highVol = sessions.filter(s => setsInSession(s) > 20);
+     const highVol = sessions;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:51:35
-     const highVol = sessions.filter(s => setsInSession(s) > 20);
+     const highVol = sessions.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:51:40
-     const highVol = sessions.filter(s => setsInSession(s) > 20);
+     const highVol = sessions.filter(s => true);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:51:40
-     const highVol = sessions.filter(s => setsInSession(s) > 20);
+     const highVol = sessions.filter(s => false);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:51:40
-     const highVol = sessions.filter(s => setsInSession(s) > 20);
+     const highVol = sessions.filter(s => setsInSession(s) >= 20);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:51:40
-     const highVol = sessions.filter(s => setsInSession(s) > 20);
+     const highVol = sessions.filter(s => setsInSession(s) <= 20);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:53:7
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (true) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:53:7
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:53:7
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length < 2 && highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:53:7
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:53:7
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length <= 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:53:7
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length >= 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:53:28
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length < 2 || false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:53:28
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length < 2 || highVol.length <= 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:53:28
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length < 2 || highVol.length >= 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:53:55
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length < 2 || highVol.length < 2) return {};

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:53:105
-     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowVol.length < 2 || highVol.length < 2) return { score: 0.5, label: 'insuficient', insufficient: false };

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:55:18
-     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / lowVol.length;
+     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) * lowVol.length;

[NoCoverage] MethodExpression
src/engine/responseProfile.js:55:18
-     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / lowVol.length;
+     const avgLow = lowVol.map(avg1RMForSession).reduce((a, b) => a + b, 0) / lowVol.length;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:55:70
-     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / lowVol.length;
+     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce(() => undefined, 0) / lowVol.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:55:80
-     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / lowVol.length;
+     const avgLow = lowVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a - b, 0) / lowVol.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:56:19
-     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / highVol.length;
+     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) * highVol.length;

[NoCoverage] MethodExpression
src/engine/responseProfile.js:56:19
-     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / highVol.length;
+     const avgHigh = highVol.map(avg1RMForSession).reduce((a, b) => a + b, 0) / highVol.length;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:56:72
-     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / highVol.length;
+     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce(() => undefined, 0) / highVol.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:56:82
-     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a + b, 0) / highVol.length;
+     const avgHigh = highVol.map(avg1RMForSession).filter(Boolean).reduce((a, b) => a - b, 0) / highVol.length;

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:58:7
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (true) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:58:7
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:58:7
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (!avgLow && !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:58:7
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:58:18
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (!avgLow || avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:58:35
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (!avgLow || !avgHigh) return {};

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:58:85
-     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (!avgLow || !avgHigh) return { score: 0.5, label: 'insuficient', insufficient: false };

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:60:17
-     const ratio = avgHigh / avgLow;
+     const ratio = avgHigh * avgLow;

[NoCoverage] MethodExpression
src/engine/responseProfile.js:62:17
-     const score = Math.max(0, Math.min(1, 1 - ratio));
+     const score = Math.min(0, Math.min(1, 1 - ratio));

[NoCoverage] MethodExpression
src/engine/responseProfile.js:62:29
-     const score = Math.max(0, Math.min(1, 1 - ratio));
+     const score = Math.max(0, Math.max(1, 1 - ratio));

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:62:41
-     const score = Math.max(0, Math.min(1, 1 - ratio));
+     const score = Math.max(0, Math.min(1, 1 + ratio));

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:63:10
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.3 ? 'high' : 'low' };
+     return {};

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:63:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.3 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: true ? 'high' : 'low' };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:63:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.3 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: false ? 'high' : 'low' };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:63:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.3 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: score >= 0.3 ? 'high' : 'low' };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:63:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.3 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: score <= 0.3 ? 'high' : 'low' };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:71:7
-     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (true) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:71:7
-     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:71:7
-     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (logs.length <= 10) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:71:7
-     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (logs.length >= 10) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:71:32
-     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (logs.length < 10) return {};

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:71:82
-     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (logs.length < 10) return { score: 0.5, label: 'insuficient', insufficient: false };

[NoCoverage] BlockStatement
src/engine/responseProfile.js:75:27
-     for (const log of logs) {
-       const ts = log.ts ?? (log.date ? new Date(log.date).getTime() : null);
-       if (!ts) continue;
-       const d = new Date(ts);
-       // ISO 8601: week belongs to the year of its Thursday
-       const thursday = new Date(d);
-       thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
-       const jan4 = new Date(thursday.getFullYear(), 0, 4);
-       const w1start = new Date(jan4);
-       w1start.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
-       const weekNum = Math.floor((thursday - w1start) / (7 * 86400000)) + 1;
-       const week = `${thursday.getFullYear()}-W${String(weekNum).padStart(2, '0')}`;
-       if (!byWeek.has(week)) byWeek.set(week, []);
-       byWeek.get(week).push(log);
-     }
+     for (const log of logs) {}

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:76:16
-       const ts = log.ts ?? (log.date ? new Date(log.date).getTime() : null);
+       const ts = log.ts && (log.date ? new Date(log.date).getTime() : null);

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:77:9
-       if (!ts) continue;
+       if (ts) continue;

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:77:9
-       if (!ts) continue;
+       if (true) continue;

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:77:9
-       if (!ts) continue;
+       if (false) continue;

[NoCoverage] MethodExpression
src/engine/responseProfile.js:81:5
-       thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+       thursday.setTime(d.getDate() - (d.getDay() + 6) % 7 + 3);

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:81:22
-       thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+       thursday.setDate(d.getDate() - (d.getDay() + 6) % 7 - 3);

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:81:22
-       thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+       thursday.setDate(d.getDate() + (d.getDay() + 6) % 7 + 3);

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:81:37
-       thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+       thursday.setDate(d.getDate() - ((d.getDay() + 6) * 7) + 3);

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:81:38
-       thursday.setDate(d.getDate() - ((d.getDay() + 6) % 7) + 3);
+       thursday.setDate(d.getDate() - ((d.getDay() - 6) % 7) + 3);

[NoCoverage] MethodExpression
src/engine/responseProfile.js:84:5
-       w1start.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+       w1start.setTime(jan4.getDate() - (jan4.getDay() + 6) % 7);

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:84:21
-       w1start.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+       w1start.setDate(jan4.getDate() + (jan4.getDay() + 6) % 7);

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:84:39
-       w1start.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+       w1start.setDate(jan4.getDate() - ((jan4.getDay() + 6) * 7));

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:84:40
-       w1start.setDate(jan4.getDate() - ((jan4.getDay() + 6) % 7));
+       w1start.setDate(jan4.getDate() - ((jan4.getDay() - 6) % 7));

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:85:21
-       const weekNum = Math.floor((thursday - w1start) / (7 * 86400000)) + 1;
+       const weekNum = Math.floor((thursday - w1start) / (7 * 86400000)) - 1;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:85:32
-       const weekNum = Math.floor((thursday - w1start) / (7 * 86400000)) + 1;
+       const weekNum = Math.floor((thursday - w1start) * (7 * 86400000)) + 1;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:85:33
-       const weekNum = Math.floor((thursday - w1start) / (7 * 86400000)) + 1;
+       const weekNum = Math.floor((thursday + w1start) / (7 * 86400000)) + 1;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:85:56
-       const weekNum = Math.floor((thursday - w1start) / (7 * 86400000)) + 1;
+       const weekNum = Math.floor((thursday - w1start) / (7 / 86400000)) + 1;

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:87:9
-       if (!byWeek.has(week)) byWeek.set(week, []);
+       if (byWeek.has(week)) byWeek.set(week, []);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:87:9
-       if (!byWeek.has(week)) byWeek.set(week, []);
+       if (true) byWeek.set(week, []);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:87:9
-       if (!byWeek.has(week)) byWeek.set(week, []);
+       if (false) byWeek.set(week, []);

[NoCoverage] ArrayDeclaration
src/engine/responseProfile.js:87:45
-       if (!byWeek.has(week)) byWeek.set(week, []);
+       if (!byWeek.has(week)) byWeek.set(week, ["Stryker was here"]);

[NoCoverage] MethodExpression
src/engine/responseProfile.js:91:20
-     const weekData = [...byWeek.values()].map(wLogs => ({
-       sessions: new Set(wLogs.map(l => l.session ? String(l.session) : todTs(l.ts))).size,
-       avg1RM: avg1RMForSession(wLogs),
-     })).filter(w => w.avg1RM !== null);
+     const weekData = [...byWeek.values()].map(wLogs => ({
+     sessions: new Set(wLogs.map(l => l.session ? String(l.session) : todTs(l.ts))).size,
+     avg1RM: avg1RMForSession(wLogs)
+   }));

[NoCoverage] ArrayDeclaration
src/engine/responseProfile.js:91:20
-     const weekData = [...byWeek.values()].map(wLogs => ({
+     const weekData = [].map(wLogs => ({

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:91:45
-     const weekData = [...byWeek.values()].map(wLogs => ({
-       sessions: new Set(wLogs.map(l => l.session ? String(l.session) : todTs(l.ts))).size,
-       avg1RM: avg1RMForSession(wLogs),
-     })).filter(w => w.avg1RM !== null);
+     const weekData = [...byWeek.values()].map(() => undefined).filter(w => w.avg1RM !== null);

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:91:55
-     const weekData = [...byWeek.values()].map(wLogs => ({
-       sessions: new Set(wLogs.map(l => l.session ? String(l.session) : todTs(l.ts))).size,
-       avg1RM: avg1RMForSession(wLogs),
-     })).filter(w => w.avg1RM !== null);
+     const weekData = [...byWeek.values()].map(wLogs => ({})).filter(w => w.avg1RM !== null);

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:92:33
-       sessions: new Set(wLogs.map(l => l.session ? String(l.session) : todTs(l.ts))).size,
+       sessions: new Set(wLogs.map(() => undefined)).size,

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:94:14
-     })).filter(w => w.avg1RM !== null);
+     })).filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:94:19
-     })).filter(w => w.avg1RM !== null);
+     })).filter(w => true);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:94:19
-     })).filter(w => w.avg1RM !== null);
+     })).filter(w => false);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:94:19
-     })).filter(w => w.avg1RM !== null);
+     })).filter(w => w.avg1RM === null);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:96:7
-     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (true) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:96:7
-     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:96:7
-     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (weekData.length <= 4) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:96:7
-     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (weekData.length >= 4) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:96:35
-     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (weekData.length < 4) return {};

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:96:85
-     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (weekData.length < 4) return { score: 0.5, label: 'insuficient', insufficient: false };

[NoCoverage] MethodExpression
src/engine/responseProfile.js:98:19
-     const lowFreq = weekData.filter(w => w.sessions <= 2);
+     const lowFreq = weekData;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:98:35
-     const lowFreq = weekData.filter(w => w.sessions <= 2);
+     const lowFreq = weekData.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:98:40
-     const lowFreq = weekData.filter(w => w.sessions <= 2);
+     const lowFreq = weekData.filter(w => true);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:98:40
-     const lowFreq = weekData.filter(w => w.sessions <= 2);
+     const lowFreq = weekData.filter(w => false);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:98:40
-     const lowFreq = weekData.filter(w => w.sessions <= 2);
+     const lowFreq = weekData.filter(w => w.sessions < 2);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:98:40
-     const lowFreq = weekData.filter(w => w.sessions <= 2);
+     const lowFreq = weekData.filter(w => w.sessions > 2);

[NoCoverage] MethodExpression
src/engine/responseProfile.js:99:20
-     const highFreq = weekData.filter(w => w.sessions >= 3);
+     const highFreq = weekData;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:99:36
-     const highFreq = weekData.filter(w => w.sessions >= 3);
+     const highFreq = weekData.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:99:41
-     const highFreq = weekData.filter(w => w.sessions >= 3);
+     const highFreq = weekData.filter(w => true);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:99:41
-     const highFreq = weekData.filter(w => w.sessions >= 3);
+     const highFreq = weekData.filter(w => false);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:99:41
-     const highFreq = weekData.filter(w => w.sessions >= 3);
+     const highFreq = weekData.filter(w => w.sessions > 3);

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:99:41
-     const highFreq = weekData.filter(w => w.sessions >= 3);
+     const highFreq = weekData.filter(w => w.sessions < 3);

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:101:7
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (true) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:101:7
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:101:7
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length < 2 && highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:101:7
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (false || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:101:7
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length <= 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:101:7
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length >= 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:101:29
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length < 2 || false) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:101:29
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length < 2 || highFreq.length <= 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:101:29
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length < 2 || highFreq.length >= 2) return { score: 0.5, label: 'insuficient', insufficient: true };

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:101:57
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length < 2 || highFreq.length < 2) return {};

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:101:107
-     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: true };
+     if (lowFreq.length < 2 || highFreq.length < 2) return { score: 0.5, label: 'insuficient', insufficient: false };

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:103:18
-     const avgLow = lowFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / lowFreq.length;
+     const avgLow = lowFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) * lowFreq.length;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:103:30
-     const avgLow = lowFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / lowFreq.length;
+     const avgLow = lowFreq.map(() => undefined).reduce((a, b) => a + b, 0) / lowFreq.length;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:103:52
-     const avgLow = lowFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / lowFreq.length;
+     const avgLow = lowFreq.map(w => w.avg1RM).reduce(() => undefined, 0) / lowFreq.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:103:62
-     const avgLow = lowFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / lowFreq.length;
+     const avgLow = lowFreq.map(w => w.avg1RM).reduce((a, b) => a - b, 0) / lowFreq.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:104:19
-     const avgHigh = highFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / highFreq.length;
+     const avgHigh = highFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) * highFreq.length;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:104:32
-     const avgHigh = highFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / highFreq.length;
+     const avgHigh = highFreq.map(() => undefined).reduce((a, b) => a + b, 0) / highFreq.length;

[NoCoverage] ArrowFunction
src/engine/responseProfile.js:104:54
-     const avgHigh = highFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / highFreq.length;
+     const avgHigh = highFreq.map(w => w.avg1RM).reduce(() => undefined, 0) / highFreq.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:104:64
-     const avgHigh = highFreq.map(w => w.avg1RM).reduce((a, b) => a + b, 0) / highFreq.length;
+     const avgHigh = highFreq.map(w => w.avg1RM).reduce((a, b) => a - b, 0) / highFreq.length;

[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:106:17
-     const ratio = avgHigh / avgLow;
+     const ratio = avgHigh * avgLow;

[NoCoverage] MethodExpression
src/engine/responseProfile.js:107:17
-     const score = Math.max(0, Math.min(1, ratio - 1));
+     const score = Math.min(0, Math.min(1, ratio - 1));

[NoCoverage] MethodExpression
src/engine/responseProfile.js:107:29
-     const score = Math.max(0, Math.min(1, ratio - 1));
+     const score = Math.max(0, Math.max(1, ratio - 1));
