[NoCoverage] ArithmeticOperator
src/engine/responseProfile.js:107:41
-     const score = Math.max(0, Math.min(1, ratio - 1));
+     const score = Math.max(0, Math.min(1, ratio + 1));

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:108:10
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.1 ? 'high' : 'low' };
+     return {};

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:108:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.1 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: true ? 'high' : 'low' };

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:108:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.1 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: false ? 'high' : 'low' };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:108:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.1 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: score >= 0.1 ? 'high' : 'low' };

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:108:56
-     return { score: parseFloat(score.toFixed(3)), label: score > 0.1 ? 'high' : 'low' };
+     return { score: parseFloat(score.toFixed(3)), label: score <= 0.1 ? 'high' : 'low' };

[NoCoverage] BlockStatement
src/engine/responseProfile.js:116:42
-   export function computeUserProfile(logs) {
-     if (!logs || logs.length === 0) {
-       return {
-         volume: { score: 0.5, label: 'insuficient', insufficient: true },
-         frequency: { score: 0.5, label: 'insuficient', insufficient: true },
-         overallProfile: 'insufficient_data',
-       };
-     }
-   
-     const sessions = groupBySessions(logs);
-     const volume = computeVolumeSensitivity(sessions);
-     const frequency = computeFrequencySensitivity(logs);
-   
-     let overallProfile = 'balanced';
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
-   
-     return { volume, frequency, overallProfile };
-   }
+   export function computeUserProfile(logs) {}

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:117:7
-     if (!logs || logs.length === 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:117:7
-     if (!logs || logs.length === 0) {
+     if (false) {

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:117:7
-     if (!logs || logs.length === 0) {
+     if (!logs && logs.length === 0) {

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:117:7
-     if (!logs || logs.length === 0) {
+     if (logs || logs.length === 0) {

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:117:16
-     if (!logs || logs.length === 0) {
+     if (!logs || false) {

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:117:16
-     if (!logs || logs.length === 0) {
+     if (!logs || logs.length !== 0) {

[NoCoverage] BlockStatement
src/engine/responseProfile.js:117:35
-     if (!logs || logs.length === 0) {
-       return {
-         volume: { score: 0.5, label: 'insuficient', insufficient: true },
-         frequency: { score: 0.5, label: 'insuficient', insufficient: true },
-         overallProfile: 'insufficient_data',
-       };
-     }
+     if (!logs || logs.length === 0) {}

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:118:12
-       return {
-         volume: { score: 0.5, label: 'insuficient', insufficient: true },
-         frequency: { score: 0.5, label: 'insuficient', insufficient: true },
-         overallProfile: 'insufficient_data',
-       };
+       return {};

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:119:15
-         volume: { score: 0.5, label: 'insuficient', insufficient: true },
+         volume: {},

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:119:65
-         volume: { score: 0.5, label: 'insuficient', insufficient: true },
+         volume: { score: 0.5, label: 'insuficient', insufficient: false },

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:120:18
-         frequency: { score: 0.5, label: 'insuficient', insufficient: true },
+         frequency: {},

[NoCoverage] BooleanLiteral
src/engine/responseProfile.js:120:68
-         frequency: { score: 0.5, label: 'insuficient', insufficient: true },
+         frequency: { score: 0.5, label: 'insuficient', insufficient: false },

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:130:7
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (true) overallProfile = 'quality_over_quantity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:130:7
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (false) overallProfile = 'quality_over_quantity';

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:130:7
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (volume.label === 'high' || frequency.label === 'high') overallProfile = 'quality_over_quantity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:130:7
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (true && frequency.label === 'high') overallProfile = 'quality_over_quantity';

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:130:7
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (volume.label !== 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:130:34
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (volume.label === 'high' && true) overallProfile = 'quality_over_quantity';

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:130:34
-     if (volume.label === 'high' && frequency.label === 'high') overallProfile = 'quality_over_quantity';
+     if (volume.label === 'high' && frequency.label !== 'high') overallProfile = 'quality_over_quantity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:131:12
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (true) overallProfile = 'high_frequency';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:131:12
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (false) overallProfile = 'high_frequency';

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:131:12
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (volume.label === 'low' || frequency.label === 'high') overallProfile = 'high_frequency';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:131:12
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (true && frequency.label === 'high') overallProfile = 'high_frequency';

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:131:12
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (volume.label !== 'low' && frequency.label === 'high') overallProfile = 'high_frequency';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:131:38
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (volume.label === 'low' && true) overallProfile = 'high_frequency';

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:131:38
-     else if (volume.label === 'low' && frequency.label === 'high') overallProfile = 'high_frequency';
+     else if (volume.label === 'low' && frequency.label !== 'high') overallProfile = 'high_frequency';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:132:12
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (true) overallProfile = 'low_frequency_high_intensity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:132:12
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (false) overallProfile = 'low_frequency_high_intensity';

[NoCoverage] LogicalOperator
src/engine/responseProfile.js:132:12
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (volume.label === 'high' || frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:132:12
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (true && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:132:12
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (volume.label !== 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';

[NoCoverage] ConditionalExpression
src/engine/responseProfile.js:132:39
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (volume.label === 'high' && true) overallProfile = 'low_frequency_high_intensity';

[NoCoverage] EqualityOperator
src/engine/responseProfile.js:132:39
-     else if (volume.label === 'high' && frequency.label === 'low') overallProfile = 'low_frequency_high_intensity';
+     else if (volume.label === 'high' && frequency.label !== 'low') overallProfile = 'low_frequency_high_intensity';

[NoCoverage] ObjectLiteral
src/engine/responseProfile.js:134:10
-     return { volume, frequency, overallProfile };
+     return {};

[NoCoverage] ConditionalExpression
src/engine/ruleEngine.js:94:103
-     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || p.type === 'session_short');
+     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || false);

[NoCoverage] EqualityOperator
src/engine/ruleEngine.js:94:103
-     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || p.type === 'session_short');
+     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || p.type !== 'session_short');

[Survived] ConditionalExpression
src/engine/ruleEngine.js:28:7
-     if (ctx.readiness?.score !== null && ctx.readiness?.score < READINESS_LOW) {
+     if (true && ctx.readiness?.score < READINESS_LOW) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 39 more tests!

[Survived] OptionalChaining
src/engine/ruleEngine.js:28:7
-     if (ctx.readiness?.score !== null && ctx.readiness?.score < READINESS_LOW) {
+     if (ctx.readiness.score !== null && ctx.readiness?.score < READINESS_LOW) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 39 more tests!

[Survived] EqualityOperator
src/engine/ruleEngine.js:28:40
-     if (ctx.readiness?.score !== null && ctx.readiness?.score < READINESS_LOW) {
+     if (ctx.readiness?.score !== null && ctx.readiness?.score <= READINESS_LOW) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 39 more tests!

[Survived] OptionalChaining
src/engine/ruleEngine.js:28:40
-     if (ctx.readiness?.score !== null && ctx.readiness?.score < READINESS_LOW) {
+     if (ctx.readiness?.score !== null && ctx.readiness.score < READINESS_LOW) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 39 more tests!

[Survived] EqualityOperator
src/engine/ruleEngine.js:37:7
-     if (fatigueIndex >= 0.85) {
+     if (fatigueIndex > 0.85) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 39 more tests!

[Survived] EqualityOperator
src/engine/ruleEngine.js:45:22
-     if (ctx.isInCut && (ctx.readiness?.score ?? 0) >= READINESS_PR) {
+     if (ctx.isInCut && (ctx.readiness?.score ?? 0) > READINESS_PR) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 27 more tests!

[Survived] OptionalChaining
src/engine/ruleEngine.js:45:23
-     if (ctx.isInCut && (ctx.readiness?.score ?? 0) >= READINESS_PR) {
+     if (ctx.isInCut && (ctx.readiness.score ?? 0) >= READINESS_PR) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 27 more tests!

[Survived] OptionalChaining
src/engine/ruleEngine.js:48:40
-         reason: `CUT phase + readiness=${ctx.readiness?.score} ≥ 85 — no PR attempts`,
+         reason: `CUT phase + readiness=${ctx.readiness.score} ≥ 85 — no PR attempts`,
Tests ran:
    CoachDirector — CDL write (ADR 011) CDL proposed.rationale reflects ruleEngine winner
    ruleEngine CUT_CONSERVATIVE fires when isInCut and readiness >= 85
    ruleEngine trace includes all fired rules

[Survived] MethodExpression
src/engine/ruleEngine.js:57:40
-         reason: `Weak groups detected: ${weakGroups.slice(0, 3).join(', ')}`,
+         reason: `Weak groups detected: ${weakGroups.join(', ')}`,
Tests ran:
    ruleEngine WEAK_GROUP_PRIORITY fires when weakGroups present
    ruleEngine trace includes all fired rules

[Survived] EqualityOperator
src/engine/ruleEngine.js:64:7
-     if (missedSessions >= 1 && missedSessions <= 2) {
+     if (missedSessions > 1 && missedSessions <= 2) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 39 more tests!

[Survived] ObjectLiteral
src/engine/ruleEngine.js:68:13
-         data: { missedSessions },
+         data: {},
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 25 more tests!

[Survived] ConditionalExpression
src/engine/ruleEngine.js:94:51
-     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || p.type === 'session_short');
+     const earlyEndPattern = ctx.patterns?.find(p => true);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ruleEngine PATTERN_EARLY_END fires when patterns include early_end

[Survived] ConditionalExpression
src/engine/ruleEngine.js:94:51
-     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || p.type === 'session_short');
+     const earlyEndPattern = ctx.patterns?.find(p => false || p.type === 'early_end' || p.type === 'session_short');
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ruleEngine PATTERN_EARLY_END fires when patterns include early_end

[Survived] EqualityOperator
src/engine/ruleEngine.js:94:51
-     const earlyEndPattern = ctx.patterns?.find(p => p.type === 'EARLY_END' || p.type === 'early_end' || p.type === 'session_short');
+     const earlyEndPattern = ctx.patterns?.find(p => p.type !== 'EARLY_END' || p.type === 'early_end' || p.type === 'session_short');
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ruleEngine PATTERN_EARLY_END fires when patterns include early_end

[Survived] ObjectLiteral
src/engine/ruleEngine.js:99:13
-         data: { pattern: earlyEndPattern },
+         data: {},
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    ruleEngine PATTERN_EARLY_END fires when patterns include early_end

[Survived] ArrayDeclaration
src/engine/ruleEngine.js:104:69
-       return { action: 'normal', trace: [], winner: null, overridden: [] };
+       return { action: 'normal', trace: [], winner: null, overridden: ["Stryker was here"] };
Tests ran:
    ruleEngine returns normal action when no rules fire
    ruleEngine CUT_CONSERVATIVE does NOT fire if readiness < 85
    ruleEngine evaluateAction returns action string directly
  and 1 more test!

[Survived] MethodExpression
src/engine/ruleEngine.js:108:3
-     fired.sort((a, b) => b.priority - a.priority);
+     fired;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ArrowFunction
src/engine/ruleEngine.js:108:14
-     fired.sort((a, b) => b.priority - a.priority);
+     fired.sort(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 36 more tests!

[Survived] ArithmeticOperator
src/engine/ruleEngine.js:108:24
-     fired.sort((a, b) => b.priority - a.priority);
+     fired.sort((a, b) => b.priority + a.priority);
Tests ran:
    CoachDirector — Readiness behavior should return rest day when readiness < 40
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
  and 3 more tests!

[NoCoverage] ConditionalExpression
src/engine/sessionBuilder.js:57:34
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (contextSelectionEnabled && true) {

[NoCoverage] EqualityOperator
src/engine/sessionBuilder.js:57:34
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (contextSelectionEnabled && ctx?.weakGroups?.length >= 0) {

[NoCoverage] EqualityOperator
src/engine/sessionBuilder.js:57:34
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (contextSelectionEnabled && ctx?.weakGroups?.length <= 0) {

[NoCoverage] OptionalChaining
src/engine/sessionBuilder.js:57:34
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (contextSelectionEnabled && ctx?.weakGroups.length > 0) {

[NoCoverage] OptionalChaining
src/engine/sessionBuilder.js:57:34
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (contextSelectionEnabled && ctx.weakGroups?.length > 0) {

[NoCoverage] BlockStatement
src/engine/sessionBuilder.js:57:63
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
-       exercises = prioritizeWeakGroups(exercises, ctx.weakGroups);
-     }
+     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {}

[NoCoverage] ArrayDeclaration
src/engine/sessionBuilder.js:70:58
-       weakGroups.flatMap(g => MUSCLE_GROUP_EXERCISES[g] ?? [])
+       weakGroups.flatMap(g => MUSCLE_GROUP_EXERCISES[g] ?? ["Stryker was here"])

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:53:50
-     const available = ctx?.equipment?.available ?? [];
+     const available = ctx?.equipment?.available ?? ["Stryker was here"];
Tests ran:
    buildSession — pure function handles missing ctx.equipment gracefully

[Survived] OptionalChaining
src/engine/sessionBuilder.js:53:21
-     const available = ctx?.equipment?.available ?? [];
+     const available = ctx.equipment?.available ?? [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 30 more tests!

[Survived] ConditionalExpression
src/engine/sessionBuilder.js:57:7
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 30 more tests!

[Survived] LogicalOperator
src/engine/sessionBuilder.js:57:7
-     if (contextSelectionEnabled && ctx?.weakGroups?.length > 0) {
+     if (contextSelectionEnabled || ctx?.weakGroups?.length > 0) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 30 more tests!

[Survived] MethodExpression
src/engine/sessionBuilder.js:77:14
-     return [...weak.slice(0, 2), ...rest, ...weak.slice(2)];
+     return [...weak, ...rest, ...weak.slice(2)];
Tests ran:
    prioritizeWeakGroups — weakness ordering delt_rear weak → Face Pulls moves to first 2 positions
    prioritizeWeakGroups — weakness ordering does NOT add exercises not in the original list
    prioritizeWeakGroups — weakness ordering preserves original ordering when weakGroup exercises not in session
  and 1 more test!

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:9:18
-     'UMERI_BRATE': ['DB Shoulder Press', 'Lateral Raises', 'Rear Delt Fly', 'Bayesian Curl', 'Pushdown'],
+     'UMERI_BRATE': [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:10:21
-     'UPPER_PICIOARE': ['Lat Pulldown', 'Incline DB Press', 'Leg Press', 'Leg Extension', 'Leg Curl'],
+     'UPPER_PICIOARE': [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:28:16
-     delt_mid:    ['Lateral Raises', 'Lateral Raises (cable)'],
+     delt_mid:    [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:29:16
-     delt_front:  ['DB Shoulder Press', 'Incline DB Press'],
+     delt_front:  [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:30:16
-     lat:         ['Lat Pulldown', 'Cable Row'],
+     lat:         [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:31:16
-     bi_long:     ['Bayesian Curl', 'Incline DB Curl', 'Cable Curl', 'Hammer Curl'],
+     bi_long:     [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:32:16
-     tri_long:    ['Overhead Triceps'],
+     tri_long:    [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:33:16
-     chest_upper: ['Incline DB Press'],
+     chest_upper: [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:34:16
-     chest_mid:   ['Pec Deck', 'Flat DB Press', 'Cable Fly'],
+     chest_mid:   [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:35:16
-     quad:        ['Leg Press', 'Leg Extension'],
+     quad:        [],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/engine/sessionBuilder.js:36:16
-     hamstring:   ['Leg Curl', 'Romanian Deadlift'],
+     hamstring:   [],
Ran all tests for this mutant.

[Survived] MethodExpression
src/engine/stagnationDetector.js:12:16
-     const orms = logs
-       .map(l => brzycki1RM(l.w, parseInt(l.reps, 10) || l.reps))
-       .filter(Boolean);
+     const orms = logs.map(l => brzycki1RM(l.w, parseInt(l.reps, 10) || l.reps));
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:13:31
-       .map(l => brzycki1RM(l.w, parseInt(l.reps, 10) || l.reps))
+       .map(l => brzycki1RM(l.w, true))
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] LogicalOperator
src/engine/stagnationDetector.js:13:31
-       .map(l => brzycki1RM(l.w, parseInt(l.reps, 10) || l.reps))
+       .map(l => brzycki1RM(l.w, parseInt(l.reps, 10) && l.reps))
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:15:7
-     if (orms.length === 0) return null;
+     if (false) return null;
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] ArithmeticOperator
src/engine/stagnationDetector.js:16:10
-     return orms.reduce((a, b) => a + b, 0) / orms.length;
+     return orms.reduce((a, b) => a + b, 0) * orms.length;
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:33:9
-       if (!byWeek.has(week)) byWeek.set(week, []);
+       if (true) byWeek.set(week, []);
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] ArrayDeclaration
src/engine/stagnationDetector.js:33:45
-       if (!byWeek.has(week)) byWeek.set(week, []);
+       if (!byWeek.has(week)) byWeek.set(week, ["Stryker was here"]);
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] MethodExpression
src/engine/stagnationDetector.js:37:10
-     return [...byWeek.entries()]
-       .sort((a, b) => a[0].localeCompare(b[0]))
-       .map(([week, wLogs]) => ({ week, avg1RM: avg1RM(wLogs) }))
-       .filter(w => w.avg1RM !== null);
+     return [...byWeek.entries()].sort((a, b) => a[0].localeCompare(b[0])).map(([week, wLogs]) => ({
+     week,
+     avg1RM: avg1RM(wLogs)
+   }));
Tests ran:
    weeklyProgression returns empty for no matching logs
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
  and 6 more tests!
