[Survived] MethodExpression
src/engine/stagnationDetector.js:37:10
-     return [...byWeek.entries()]
-       .sort((a, b) => a[0].localeCompare(b[0]))
+     return [...byWeek.entries()]
Tests ran:
    weeklyProgression returns empty for no matching logs
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
  and 6 more tests!

[Survived] ArrowFunction
src/engine/stagnationDetector.js:38:11
-       .sort((a, b) => a[0].localeCompare(b[0]))
+       .sort(() => undefined)
Tests ran:
    weeklyProgression returns empty for no matching logs
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
  and 6 more tests!

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:40:18
-       .filter(w => w.avg1RM !== null);
+       .filter(w => true);
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:52:7
-     if (progression.length < 2) return { stagnationWeeks: 0, progression };
+     if (false) return { stagnationWeeks: 0, progression };
Tests ran:
    detectStagnation returns 0 stagnation weeks for insufficient data
    detectStagnation detects 0 stagnation when clearly progressing
    detectStagnation detects stagnation when 1RM stays flat
  and 2 more tests!

[Survived] EqualityOperator
src/engine/stagnationDetector.js:52:7
-     if (progression.length < 2) return { stagnationWeeks: 0, progression };
+     if (progression.length <= 2) return { stagnationWeeks: 0, progression };
Tests ran:
    detectStagnation returns 0 stagnation weeks for insufficient data
    detectStagnation detects 0 stagnation when clearly progressing
    detectStagnation detects stagnation when 1RM stays flat
  and 2 more tests!

[Survived] EqualityOperator
src/engine/stagnationDetector.js:56:40
-     for (let i = progression.length - 1; i >= 1; i--) {
+     for (let i = progression.length - 1; i > 1; i--) {
Tests ran:
    detectStagnation detects 0 stagnation when clearly progressing
    detectStagnation detects stagnation when 1RM stays flat
    detectStagnation returns progression array with week labels
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/stagnationDetector.js:57:20
-       const change = (progression[i].avg1RM - progression[i - 1].avg1RM) / progression[i - 1].avg1RM;
+       const change = (progression[i].avg1RM - progression[i - 1].avg1RM) * progression[i - 1].avg1RM;
Tests ran:
    detectStagnation detects 0 stagnation when clearly progressing
    detectStagnation detects stagnation when 1RM stays flat
    detectStagnation returns progression array with week labels
  and 1 more test!

[Survived] EqualityOperator
src/engine/stagnationDetector.js:58:9
-       if (change < 0.01) {
+       if (change <= 0.01) {
Tests ran:
    detectStagnation detects 0 stagnation when clearly progressing
    detectStagnation detects stagnation when 1RM stays flat
    detectStagnation returns progression array with week labels
  and 1 more test!

[Survived] BlockStatement
src/engine/stagnationDetector.js:60:12
-       } else {
-         break;
-       }
+       } else {}
Tests ran:
    detectStagnation detects 0 stagnation when clearly progressing
    detectStagnation returns progression array with week labels
    detectGlobalStagnation finds max stagnation across all exercises

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:74:7
-     if (!logs || logs.length === 0) return { maxStagnationWeeks: 0, byExercise: {} };
+     if (false) return { maxStagnationWeeks: 0, byExercise: {} };
Tests ran:
    detectGlobalStagnation returns 0 for empty logs
    detectGlobalStagnation finds max stagnation across all exercises

[Survived] LogicalOperator
src/engine/stagnationDetector.js:74:7
-     if (!logs || logs.length === 0) return { maxStagnationWeeks: 0, byExercise: {} };
+     if (!logs && logs.length === 0) return { maxStagnationWeeks: 0, byExercise: {} };
Tests ran:
    detectGlobalStagnation returns 0 for empty logs
    detectGlobalStagnation finds max stagnation across all exercises

[Survived] ConditionalExpression
src/engine/stagnationDetector.js:74:16
-     if (!logs || logs.length === 0) return { maxStagnationWeeks: 0, byExercise: {} };
+     if (!logs || false) return { maxStagnationWeeks: 0, byExercise: {} };
Tests ran:
    detectGlobalStagnation returns 0 for empty logs
    detectGlobalStagnation finds max stagnation across all exercises

[Survived] MethodExpression
src/engine/stagnationDetector.js:76:33
-     const exercises = [...new Set(logs.map(l => l.ex).filter(Boolean))];
+     const exercises = [...new Set(logs.map(l => l.ex))];
Tests ran:
    detectGlobalStagnation finds max stagnation across all exercises

[Survived] EqualityOperator
src/engine/stagnationDetector.js:83:9
-       if (stagnationWeeks > maxStagnationWeeks) maxStagnationWeeks = stagnationWeeks;
+       if (stagnationWeeks >= maxStagnationWeeks) maxStagnationWeeks = stagnationWeeks;
Tests ran:
    detectGlobalStagnation finds max stagnation across all exercises

[NoCoverage] MethodExpression
src/engine/sys.js:49:20
-         else dates = dates.slice(-14);
+         else dates = dates;

[NoCoverage] UnaryOperator
src/engine/sys.js:49:32
-         else dates = dates.slice(-14);
+         else dates = dates.slice(+14);

[NoCoverage] ConditionalExpression
src/engine/sys.js:95:9
-       if (bf > 12) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:95:9
-       if (bf > 12) {
+       if (false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:95:9
-       if (bf > 12) {
+       if (bf >= 12) {

[NoCoverage] EqualityOperator
src/engine/sys.js:95:9
-       if (bf > 12) {
+       if (bf <= 12) {

[NoCoverage] BlockStatement
src/engine/sys.js:95:18
-       if (bf > 12) {
-         if (isSummer) return 'MAINTENANCE';
-         return 'CUT';
-       }
+       if (bf > 12) {}

[NoCoverage] ConditionalExpression
src/engine/sys.js:96:11
-         if (isSummer) return 'MAINTENANCE';
+         if (true) return 'MAINTENANCE';

[NoCoverage] ConditionalExpression
src/engine/sys.js:96:11
-         if (isSummer) return 'MAINTENANCE';
+         if (false) return 'MAINTENANCE';

[NoCoverage] ConditionalExpression
src/engine/sys.js:100:9
-       if (bf > 10) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:100:9
-       if (bf > 10) {
+       if (false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:100:9
-       if (bf > 10) {
+       if (bf >= 10) {

[NoCoverage] EqualityOperator
src/engine/sys.js:100:9
-       if (bf > 10) {
+       if (bf <= 10) {

[NoCoverage] BlockStatement
src/engine/sys.js:100:18
-       if (bf > 10) {
-         if (isSummer) return 'MAINTENANCE';
-         if (isWinter) return 'BULK';
-         return 'CUT';
-       }
+       if (bf > 10) {}

[NoCoverage] ConditionalExpression
src/engine/sys.js:101:11
-         if (isSummer) return 'MAINTENANCE';
+         if (true) return 'MAINTENANCE';

[NoCoverage] ConditionalExpression
src/engine/sys.js:101:11
-         if (isSummer) return 'MAINTENANCE';
+         if (false) return 'MAINTENANCE';

[NoCoverage] ConditionalExpression
src/engine/sys.js:102:11
-         if (isWinter) return 'BULK';
+         if (true) return 'BULK';

[NoCoverage] ConditionalExpression
src/engine/sys.js:102:11
-         if (isWinter) return 'BULK';
+         if (false) return 'BULK';

[NoCoverage] ConditionalExpression
src/engine/sys.js:106:9
-       if (isSummer) return 'MAINTENANCE';
+       if (true) return 'MAINTENANCE';

[NoCoverage] ConditionalExpression
src/engine/sys.js:106:9
-       if (isSummer) return 'MAINTENANCE';
+       if (false) return 'MAINTENANCE';

[NoCoverage] ConditionalExpression
src/engine/sys.js:107:9
-       if (isWinter) return 'BULK';
+       if (true) return 'BULK';

[NoCoverage] ConditionalExpression
src/engine/sys.js:107:9
-       if (isWinter) return 'BULK';
+       if (false) return 'BULK';

[NoCoverage] ConditionalExpression
src/engine/sys.js:126:25
-       const pilotActive = new Date() >= TARGET_DATE;
+       const pilotActive = true;

[NoCoverage] ConditionalExpression
src/engine/sys.js:126:25
-       const pilotActive = new Date() >= TARGET_DATE;
+       const pilotActive = false;

[NoCoverage] EqualityOperator
src/engine/sys.js:126:25
-       const pilotActive = new Date() >= TARGET_DATE;
+       const pilotActive = new Date() > TARGET_DATE;

[NoCoverage] EqualityOperator
src/engine/sys.js:126:25
-       const pilotActive = new Date() >= TARGET_DATE;
+       const pilotActive = new Date() < TARGET_DATE;

[NoCoverage] BooleanLiteral
src/engine/sys.js:127:9
-       if (!pilotActive) return KCAL_TARGET;
+       if (pilotActive) return KCAL_TARGET;

[NoCoverage] ConditionalExpression
src/engine/sys.js:127:9
-       if (!pilotActive) return KCAL_TARGET;
+       if (true) return KCAL_TARGET;

[NoCoverage] ConditionalExpression
src/engine/sys.js:127:9
-       if (!pilotActive) return KCAL_TARGET;
+       if (false) return KCAL_TARGET;

[NoCoverage] ConditionalExpression
src/engine/sys.js:131:7
-         case 'CUT':         return Math.round(tdee * 0.82);
+         case 'CUT':

[NoCoverage] ArithmeticOperator
src/engine/sys.js:131:45
-         case 'CUT':         return Math.round(tdee * 0.82);
+         case 'CUT':         return Math.round(tdee / 0.82);

[NoCoverage] ConditionalExpression
src/engine/sys.js:132:7
-         case 'BULK':        return Math.round(tdee * 1.08);
+         case 'BULK':

[NoCoverage] ArithmeticOperator
src/engine/sys.js:132:45
-         case 'BULK':        return Math.round(tdee * 1.08);
+         case 'BULK':        return Math.round(tdee / 1.08);

[NoCoverage] ConditionalExpression
src/engine/sys.js:133:7
-         case 'MAINTENANCE': return tdee;
+         case 'MAINTENANCE':

[NoCoverage] ConditionalExpression
src/engine/sys.js:134:7
-         case 'STRENGTH':    return Math.round(tdee * 1.05);
+         case 'STRENGTH':

[NoCoverage] ArithmeticOperator
src/engine/sys.js:134:45
-         case 'STRENGTH':    return Math.round(tdee * 1.05);
+         case 'STRENGTH':    return Math.round(tdee / 1.05);

[NoCoverage] ConditionalExpression
src/engine/sys.js:135:7
-         default:            return KCAL_TARGET;
+         default:

[NoCoverage] BlockStatement
src/engine/sys.js:152:25
-     addWeeks(date, weeks) {
-       const d = new Date(date);
-       d.setDate(d.getDate() + weeks * 7);
-       return d;
-     },
+     addWeeks(date, weeks) {},

[NoCoverage] MethodExpression
src/engine/sys.js:154:5
-       d.setDate(d.getDate() + weeks * 7);
+       d.setTime(d.getDate() + weeks * 7);

[NoCoverage] ArithmeticOperator
src/engine/sys.js:154:15
-       d.setDate(d.getDate() + weeks * 7);
+       d.setDate(d.getDate() - weeks * 7);

[NoCoverage] ArithmeticOperator
src/engine/sys.js:154:29
-       d.setDate(d.getDate() + weeks * 7);
+       d.setDate(d.getDate() + weeks / 7);

[NoCoverage] BlockStatement
src/engine/sys.js:158:17
-     fmtDate(date) {
-       return date.toLocaleDateString('ro-RO', {day:'numeric', month:'short', year:'numeric'});
-     },
+     fmtDate(date) {},

[NoCoverage] ObjectLiteral
src/engine/sys.js:159:45
-       return date.toLocaleDateString('ro-RO', {day:'numeric', month:'short', year:'numeric'});
+       return date.toLocaleDateString('ro-RO', {});

[NoCoverage] ArrayDeclaration
src/engine/sys.js:165:25
-       const checkpoints = [];
+       const checkpoints = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/engine/sys.js:168:9
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:168:9
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/sys.js:168:9
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (phase === 'CUT' && phase === 'MAINTENANCE') {

[NoCoverage] ConditionalExpression
src/engine/sys.js:168:9
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (false || phase === 'MAINTENANCE') {

[NoCoverage] EqualityOperator
src/engine/sys.js:168:9
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (phase !== 'CUT' || phase === 'MAINTENANCE') {

[NoCoverage] ConditionalExpression
src/engine/sys.js:168:28
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (phase === 'CUT' || false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:168:28
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
+       if (phase === 'CUT' || phase !== 'MAINTENANCE') {

[NoCoverage] BlockStatement
src/engine/sys.js:168:53
-       if (phase === 'CUT' || phase === 'MAINTENANCE') {
-         const bfTargets = [20, 17, 15, 12, 10];
-         bfTargets.forEach(t => {
-           if (bf > t + 0.5) {
-             const targetKg = this.kgAtBF(t);
-             const weeks = this.weeksToKg(targetKg);
-             const date = this.addWeeks(now, weeks);
-             checkpoints.push({
-               type: 'bf', label: `${t}% BF`,
-               sub: `~${targetKg} kg`,
-               weeks, date,
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
-             });
-           }
-         });
-       }
+       if (phase === 'CUT' || phase === 'MAINTENANCE') {}

[NoCoverage] ArrayDeclaration
src/engine/sys.js:169:25
-         const bfTargets = [20, 17, 15, 12, 10];
+         const bfTargets = [];

[NoCoverage] BlockStatement
src/engine/sys.js:170:30
-         bfTargets.forEach(t => {
-           if (bf > t + 0.5) {
-             const targetKg = this.kgAtBF(t);
-             const weeks = this.weeksToKg(targetKg);
-             const date = this.addWeeks(now, weeks);
-             checkpoints.push({
-               type: 'bf', label: `${t}% BF`,
-               sub: `~${targetKg} kg`,
-               weeks, date,
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
-             });
-           }
-         });
+         bfTargets.forEach(t => {});

[NoCoverage] ConditionalExpression
src/engine/sys.js:171:13
-           if (bf > t + 0.5) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:171:13
-           if (bf > t + 0.5) {
+           if (false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:171:13
-           if (bf > t + 0.5) {
+           if (bf >= t + 0.5) {

[NoCoverage] EqualityOperator
src/engine/sys.js:171:13
-           if (bf > t + 0.5) {
+           if (bf <= t + 0.5) {

[NoCoverage] ArithmeticOperator
src/engine/sys.js:171:18
-           if (bf > t + 0.5) {
+           if (bf > t - 0.5) {

[NoCoverage] BlockStatement
src/engine/sys.js:171:27
-           if (bf > t + 0.5) {
-             const targetKg = this.kgAtBF(t);
-             const weeks = this.weeksToKg(targetKg);
-             const date = this.addWeeks(now, weeks);
-             checkpoints.push({
-               type: 'bf', label: `${t}% BF`,
-               sub: `~${targetKg} kg`,
-               weeks, date,
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
-             });
-           }
+           if (bf > t + 0.5) {}

[NoCoverage] ObjectLiteral
src/engine/sys.js:175:28
-             checkpoints.push({
-               type: 'bf', label: `${t}% BF`,
-               sub: `~${targetKg} kg`,
-               weeks, date,
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
-             });
+             checkpoints.push({});

[NoCoverage] ConditionalExpression
src/engine/sys.js:179:20
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
+               color: true ? 'var(--green)' : 'var(--accent)'

[NoCoverage] ConditionalExpression
src/engine/sys.js:179:20
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
+               color: false ? 'var(--green)' : 'var(--accent)'

[NoCoverage] EqualityOperator
src/engine/sys.js:179:20
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
+               color: t < 12 ? 'var(--green)' : 'var(--accent)'

[NoCoverage] EqualityOperator
src/engine/sys.js:179:20
-               color: t <= 12 ? 'var(--green)' : 'var(--accent)'
+               color: t > 12 ? 'var(--green)' : 'var(--accent)'

[NoCoverage] ConditionalExpression
src/engine/sys.js:185:9
-       if (phase === 'BULK') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:185:9
-       if (phase === 'BULK') {
+       if (false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:185:9
-       if (phase === 'BULK') {
+       if (phase !== 'BULK') {

[NoCoverage] BlockStatement
src/engine/sys.js:185:27
-       if (phase === 'BULK') {
-         const bulkEndBF = 17;
-         const targetKg = this.kgAtBF(bulkEndBF);
-         const kgToGain = targetKg - this.getCurrentKg();
-         if (kgToGain > 0) {
-           const weeks = Math.ceil(kgToGain / 0.25); // 0.25 kg/week bulk
-           checkpoints.push({
-             type: 'bulk',
-             label: `Oprire creștere la ${bulkEndBF}% BF`,
-             sub: `~${targetKg} kg — începe definirea`,
-             weeks, date: this.addWeeks(now, weeks),
-             color: 'var(--accent3)'
-           });
-         }
-       }
+       if (phase === 'BULK') {}

[NoCoverage] ArithmeticOperator
src/engine/sys.js:188:24
-         const kgToGain = targetKg - this.getCurrentKg();
+         const kgToGain = targetKg + this.getCurrentKg();

[NoCoverage] ConditionalExpression
src/engine/sys.js:189:11
-         if (kgToGain > 0) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:189:11
-         if (kgToGain > 0) {
+         if (false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:189:11
-         if (kgToGain > 0) {
+         if (kgToGain >= 0) {

[NoCoverage] EqualityOperator
src/engine/sys.js:189:11
-         if (kgToGain > 0) {
+         if (kgToGain <= 0) {

[NoCoverage] BlockStatement
src/engine/sys.js:189:25
-         if (kgToGain > 0) {
-           const weeks = Math.ceil(kgToGain / 0.25); // 0.25 kg/week bulk
-           checkpoints.push({
-             type: 'bulk',
-             label: `Oprire creștere la ${bulkEndBF}% BF`,
-             sub: `~${targetKg} kg — începe definirea`,
-             weeks, date: this.addWeeks(now, weeks),
-             color: 'var(--accent3)'
-           });
-         }
+         if (kgToGain > 0) {}

[NoCoverage] ArithmeticOperator
src/engine/sys.js:190:33
-           const weeks = Math.ceil(kgToGain / 0.25); // 0.25 kg/week bulk
+           const weeks = Math.ceil(kgToGain * 0.25); // 0.25 kg/week bulk

[NoCoverage] ObjectLiteral
src/engine/sys.js:191:26
-           checkpoints.push({
-             type: 'bulk',
-             label: `Oprire creștere la ${bulkEndBF}% BF`,
-             sub: `~${targetKg} kg — începe definirea`,
-             weeks, date: this.addWeeks(now, weeks),
-             color: 'var(--accent3)'
-           });
+           checkpoints.push({});

[NoCoverage] ConditionalExpression
src/engine/sys.js:203:9
-       if (now < summerPeak) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:203:9
-       if (now < summerPeak) {
+       if (false) {

[NoCoverage] EqualityOperator
src/engine/sys.js:203:9
-       if (now < summerPeak) {
+       if (now <= summerPeak) {

[NoCoverage] EqualityOperator
src/engine/sys.js:203:9
-       if (now < summerPeak) {
+       if (now >= summerPeak) {

[NoCoverage] BlockStatement
src/engine/sys.js:203:27
-       if (now < summerPeak) {
-         const weeksToSummer = Math.round((summerPeak - now) / (7*86400000));
-         const projectedBF = Math.max(5, bf - weeksToSummer * 0.25);
-         checkpoints.push({
-           type: 'season',
-           label: 'VARĂ PEAK',
-           sub: `BF estimat: ~${projectedBF.toFixed(1)}%`,
-           weeks: weeksToSummer,
-           date: summerPeak,
-           color: 'var(--accent2)'
-         });
-       }
+       if (now < summerPeak) {}

[NoCoverage] ArithmeticOperator
src/engine/sys.js:204:40
-         const weeksToSummer = Math.round((summerPeak - now) / (7*86400000));
+         const weeksToSummer = Math.round((summerPeak - now) * (7 * 86400000));

[NoCoverage] ArithmeticOperator
src/engine/sys.js:204:41
-         const weeksToSummer = Math.round((summerPeak - now) / (7*86400000));
+         const weeksToSummer = Math.round((summerPeak + now) / (7*86400000));

[NoCoverage] ArithmeticOperator
src/engine/sys.js:204:62
-         const weeksToSummer = Math.round((summerPeak - now) / (7*86400000));
+         const weeksToSummer = Math.round((summerPeak - now) / (7 / 86400000));

[NoCoverage] MethodExpression
src/engine/sys.js:205:27
-         const projectedBF = Math.max(5, bf - weeksToSummer * 0.25);
+         const projectedBF = Math.min(5, bf - weeksToSummer * 0.25);

[NoCoverage] ArithmeticOperator
src/engine/sys.js:205:39
-         const projectedBF = Math.max(5, bf - weeksToSummer * 0.25);
+         const projectedBF = Math.max(5, bf + weeksToSummer * 0.25);

[NoCoverage] ArithmeticOperator
src/engine/sys.js:205:44
-         const projectedBF = Math.max(5, bf - weeksToSummer * 0.25);
+         const projectedBF = Math.max(5, bf - weeksToSummer / 0.25);

[NoCoverage] ObjectLiteral
src/engine/sys.js:206:24
-         checkpoints.push({
-           type: 'season',
-           label: 'VARĂ PEAK',
-           sub: `BF estimat: ~${projectedBF.toFixed(1)}%`,
-           weeks: weeksToSummer,
-           date: summerPeak,
-           color: 'var(--accent2)'
-         });
+         checkpoints.push({});

[NoCoverage] MethodExpression
src/engine/sys.js:216:12
-       return checkpoints.sort((a,b) => a.weeks - b.weeks).slice(0,5);
+       return checkpoints.sort((a, b) => a.weeks - b.weeks);

[NoCoverage] MethodExpression
src/engine/sys.js:216:12
-       return checkpoints.sort((a,b) => a.weeks - b.weeks).slice(0,5);
+       return checkpoints.slice(0,5);

[NoCoverage] ArrowFunction
src/engine/sys.js:216:29
-       return checkpoints.sort((a,b) => a.weeks - b.weeks).slice(0,5);
+       return checkpoints.sort(() => undefined).slice(0,5);

[NoCoverage] ArithmeticOperator
src/engine/sys.js:216:38
-       return checkpoints.sort((a,b) => a.weeks - b.weeks).slice(0,5);
+       return checkpoints.sort((a,b) => a.weeks + b.weeks).slice(0,5);

[NoCoverage] BlockStatement
src/engine/sys.js:239:31
-       if (phase === 'STRENGTH') {
-         return isCompound ? {tempo:'2-0-X-0', rir:2, note:'Ridicăm exploziv, coborâm controlat'} : {tempo:'2-1-2-0', rir:2, note:'Mișcare controlată, fără elan'};
-       }
+       if (phase === 'STRENGTH') {}

[NoCoverage] ObjectLiteral
src/engine/sys.js:240:27
-         return isCompound ? {tempo:'2-0-X-0', rir:2, note:'Ridicăm exploziv, coborâm controlat'} : {tempo:'2-1-2-0', rir:2, note:'Mișcare controlată, fără elan'};
+         return isCompound ? {} : {tempo:'2-1-2-0', rir:2, note:'Mișcare controlată, fără elan'};

[NoCoverage] ObjectLiteral
src/engine/sys.js:240:98
-         return isCompound ? {tempo:'2-0-X-0', rir:2, note:'Ridicăm exploziv, coborâm controlat'} : {tempo:'2-1-2-0', rir:2, note:'Mișcare controlată, fără elan'};
+         return isCompound ? {tempo:'2-0-X-0', rir:2, note:'Ridicăm exploziv, coborâm controlat'} : {};

[NoCoverage] BlockStatement
src/engine/sys.js:242:27
-       if (phase === 'BULK') {
-         return isCompound ? {tempo:'3-1-2-0', rir:2, note:'Coborâre lentă, tensiune prelungită'} : {tempo:'3-1-2-1', rir:2, note:'Strângere maximă în vârf'};
-       }
+       if (phase === 'BULK') {}

[NoCoverage] ObjectLiteral
src/engine/sys.js:243:27
-         return isCompound ? {tempo:'3-1-2-0', rir:2, note:'Coborâre lentă, tensiune prelungită'} : {tempo:'3-1-2-1', rir:2, note:'Strângere maximă în vârf'};
+         return isCompound ? {} : {tempo:'3-1-2-1', rir:2, note:'Strângere maximă în vârf'};

[NoCoverage] ObjectLiteral
src/engine/sys.js:243:98
-         return isCompound ? {tempo:'3-1-2-0', rir:2, note:'Coborâre lentă, tensiune prelungită'} : {tempo:'3-1-2-1', rir:2, note:'Strângere maximă în vârf'};
+         return isCompound ? {tempo:'3-1-2-0', rir:2, note:'Coborâre lentă, tensiune prelungită'} : {};

[NoCoverage] BlockStatement
src/engine/sys.js:250:47
-     getTechniques(exName, setNumber, totalSets) {
-       const phase = this.getPhase();
-       const techniques = [];
-       const isIsolation = ['Lateral Raises','Rear Delt Fly','Cable Curl','Preacher Curl','Overhead Triceps','Pushdown','Leg Extension','Leg Curl','Calf Raises','Face Pulls'].includes(exName);
-   
-       // Drop sets — NOT în CUT (deficit); recomandat în BULK/STRENGTH
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
-         techniques.push({icon:'🔻', label:'DROP SET', desc:'−30% greutate pe ultimul set · Mergem până nu mai putem'});
-       }
-       // Partial reps — on last set of isolation
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
-         techniques.push({icon:'⚡', label:'PARȚIALE', desc:'10 reps parțiale după ultimul set complet'});
-       }
-       // Pause reps — compounds in strength phase
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
-         techniques.push({icon:'⏸', label:'PAUZĂ 1 SEC', desc:'Pauză 1 sec în poziția de jos'});
-       }
-       return techniques;
-     },
+     getTechniques(exName, setNumber, totalSets) {},

[NoCoverage] ArrayDeclaration
src/engine/sys.js:252:24
-       const techniques = [];
+       const techniques = ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/engine/sys.js:253:25
-       const isIsolation = ['Lateral Raises','Rear Delt Fly','Cable Curl','Preacher Curl','Overhead Triceps','Pushdown','Leg Extension','Leg Curl','Calf Raises','Face Pulls'].includes(exName);
+       const isIsolation = [].includes(exName);

[NoCoverage] ConditionalExpression
src/engine/sys.js:256:30
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = true;

[NoCoverage] ConditionalExpression
src/engine/sys.js:256:30
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = false;

[NoCoverage] LogicalOperator
src/engine/sys.js:256:30
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' && phase === 'AUTO' && new Date() < TARGET_DATE;

[NoCoverage] ConditionalExpression
src/engine/sys.js:256:30
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = false || (phase === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/sys.js:256:30
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase !== 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/sys.js:256:50
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (false);

[NoCoverage] LogicalOperator
src/engine/sys.js:256:50
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' || new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/sys.js:256:50
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (true && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/sys.js:256:50
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (phase !== 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/sys.js:256:70
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && true);

[NoCoverage] EqualityOperator
src/engine/sys.js:256:70
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() <= TARGET_DATE);

[NoCoverage] EqualityOperator
src/engine/sys.js:256:70
-       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+       const isEffectivelyCut = phase === 'CUT' || (phase === 'AUTO' && new Date() >= TARGET_DATE);

[NoCoverage] ConditionalExpression
src/engine/sys.js:257:9
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:257:9
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/sys.js:257:9
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (isIsolation && setNumber === totalSets || !isEffectivelyCut) {
