[NoCoverage] ConditionalExpression
src/engine/sys.js:257:9
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (true && !isEffectivelyCut) {

[NoCoverage] LogicalOperator
src/engine/sys.js:257:9
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (isIsolation || setNumber === totalSets && !isEffectivelyCut) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:257:24
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (isIsolation && true && !isEffectivelyCut) {

[NoCoverage] EqualityOperator
src/engine/sys.js:257:24
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (isIsolation && setNumber !== totalSets && !isEffectivelyCut) {

[NoCoverage] BooleanLiteral
src/engine/sys.js:257:51
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
+       if (isIsolation && setNumber === totalSets && isEffectivelyCut) {

[NoCoverage] BlockStatement
src/engine/sys.js:257:70
-       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {
-         techniques.push({icon:'🔻', label:'DROP SET', desc:'−30% greutate pe ultimul set · Mergem până nu mai putem'});
-       }
+       if (isIsolation && setNumber === totalSets && !isEffectivelyCut) {}

[NoCoverage] ObjectLiteral
src/engine/sys.js:258:23
-         techniques.push({icon:'🔻', label:'DROP SET', desc:'−30% greutate pe ultimul set · Mergem până nu mai putem'});
+         techniques.push({});

[NoCoverage] ConditionalExpression
src/engine/sys.js:261:9
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:261:9
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/sys.js:261:9
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (isIsolation && setNumber === totalSets || ['Lateral Raises', 'Calf Raises'].includes(exName)) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:261:9
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (true && ['Lateral Raises','Calf Raises'].includes(exName)) {

[NoCoverage] LogicalOperator
src/engine/sys.js:261:9
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (isIsolation || setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:261:24
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (isIsolation && true && ['Lateral Raises','Calf Raises'].includes(exName)) {

[NoCoverage] EqualityOperator
src/engine/sys.js:261:24
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (isIsolation && setNumber !== totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {

[NoCoverage] ArrayDeclaration
src/engine/sys.js:261:51
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
+       if (isIsolation && setNumber === totalSets && [].includes(exName)) {

[NoCoverage] BlockStatement
src/engine/sys.js:261:102
-       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {
-         techniques.push({icon:'⚡', label:'PARȚIALE', desc:'10 reps parțiale după ultimul set complet'});
-       }
+       if (isIsolation && setNumber === totalSets && ['Lateral Raises','Calf Raises'].includes(exName)) {}

[NoCoverage] ObjectLiteral
src/engine/sys.js:262:23
-         techniques.push({icon:'⚡', label:'PARȚIALE', desc:'10 reps parțiale după ultimul set complet'});
+         techniques.push({});

[NoCoverage] ConditionalExpression
src/engine/sys.js:265:9
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:265:9
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (false) {

[NoCoverage] LogicalOperator
src/engine/sys.js:265:9
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation && phase === 'STRENGTH' || setNumber <= 2) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:265:9
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (true && setNumber <= 2) {

[NoCoverage] LogicalOperator
src/engine/sys.js:265:9
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation || phase === 'STRENGTH' && setNumber <= 2) {

[NoCoverage] BooleanLiteral
src/engine/sys.js:265:9
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (isIsolation && phase === 'STRENGTH' && setNumber <= 2) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:265:25
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation && true && setNumber <= 2) {

[NoCoverage] EqualityOperator
src/engine/sys.js:265:25
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation && phase !== 'STRENGTH' && setNumber <= 2) {

[NoCoverage] ConditionalExpression
src/engine/sys.js:265:49
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation && phase === 'STRENGTH' && true) {

[NoCoverage] EqualityOperator
src/engine/sys.js:265:49
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation && phase === 'STRENGTH' && setNumber < 2) {

[NoCoverage] EqualityOperator
src/engine/sys.js:265:49
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
+       if (!isIsolation && phase === 'STRENGTH' && setNumber > 2) {

[NoCoverage] BlockStatement
src/engine/sys.js:265:65
-       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {
-         techniques.push({icon:'⏸', label:'PAUZĂ 1 SEC', desc:'Pauză 1 sec în poziția de jos'});
-       }
+       if (!isIsolation && phase === 'STRENGTH' && setNumber <= 2) {}

[NoCoverage] ObjectLiteral
src/engine/sys.js:266:23
-         techniques.push({icon:'⏸', label:'PAUZĂ 1 SEC', desc:'Pauză 1 sec în poziția de jos'});
+         techniques.push({});

[NoCoverage] BlockStatement
src/engine/sys.js:272:20
-     getOffDayQuest() {
-       const streaks = DB.get('step-streaks') || {count:0, lastDate:'', totalDays:0};
-       const stepsToday = DB.get('steps-today') || 0;
-       const target = 8000;
-       const pct = Math.min(100, Math.round(stepsToday/target*100));
-   
-       return {
-         stepsToday, target, pct,
-         streak: streaks.count,
-         totalDays: streaks.totalDays,
-         done: stepsToday >= target
-       };
-     }
+     getOffDayQuest() {}

[NoCoverage] ConditionalExpression
src/engine/sys.js:273:21
-       const streaks = DB.get('step-streaks') || {count:0, lastDate:'', totalDays:0};
+       const streaks = true;

[NoCoverage] ConditionalExpression
src/engine/sys.js:273:21
-       const streaks = DB.get('step-streaks') || {count:0, lastDate:'', totalDays:0};
+       const streaks = false;

[NoCoverage] LogicalOperator
src/engine/sys.js:273:21
-       const streaks = DB.get('step-streaks') || {count:0, lastDate:'', totalDays:0};
+       const streaks = DB.get('step-streaks') && {
+     count: 0,
+     lastDate: '',
+     totalDays: 0
+   };

[NoCoverage] ObjectLiteral
src/engine/sys.js:273:47
-       const streaks = DB.get('step-streaks') || {count:0, lastDate:'', totalDays:0};
+       const streaks = DB.get('step-streaks') || {};

[NoCoverage] ConditionalExpression
src/engine/sys.js:274:24
-       const stepsToday = DB.get('steps-today') || 0;
+       const stepsToday = true;

[NoCoverage] ConditionalExpression
src/engine/sys.js:274:24
-       const stepsToday = DB.get('steps-today') || 0;
+       const stepsToday = false;

[NoCoverage] LogicalOperator
src/engine/sys.js:274:24
-       const stepsToday = DB.get('steps-today') || 0;
+       const stepsToday = DB.get('steps-today') && 0;

[NoCoverage] MethodExpression
src/engine/sys.js:276:17
-       const pct = Math.min(100, Math.round(stepsToday/target*100));
+       const pct = Math.max(100, Math.round(stepsToday / target * 100));

[NoCoverage] ArithmeticOperator
src/engine/sys.js:276:42
-       const pct = Math.min(100, Math.round(stepsToday/target*100));
+       const pct = Math.min(100, Math.round(stepsToday / target / 100));

[NoCoverage] ArithmeticOperator
src/engine/sys.js:276:42
-       const pct = Math.min(100, Math.round(stepsToday/target*100));
+       const pct = Math.min(100, Math.round(stepsToday * target*100));

[NoCoverage] ObjectLiteral
src/engine/sys.js:278:12
-       return {
-         stepsToday, target, pct,
-         streak: streaks.count,
-         totalDays: streaks.totalDays,
-         done: stepsToday >= target
-       };
+       return {};

[NoCoverage] ConditionalExpression
src/engine/sys.js:282:13
-         done: stepsToday >= target
+         done: true

[NoCoverage] ConditionalExpression
src/engine/sys.js:282:13
-         done: stepsToday >= target
+         done: false

[NoCoverage] EqualityOperator
src/engine/sys.js:282:13
-         done: stepsToday >= target
+         done: stepsToday > target

[NoCoverage] EqualityOperator
src/engine/sys.js:282:13
-         done: stepsToday >= target
+         done: stepsToday < target

[Survived] MethodExpression
src/engine/sys.js:14:19
-       const dates = Object.keys(ws).sort((a,b) => a.localeCompare(b));
+       const dates = Object.keys(ws);
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
  and 5 more tests!

[Survived] ArrowFunction
src/engine/sys.js:14:40
-       const dates = Object.keys(ws).sort((a,b) => a.localeCompare(b));
+       const dates = Object.keys(ws).sort(() => undefined);
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/sys.js:15:9
-       if (!dates.length) return this.START_KG;
+       if (false) return this.START_KG;
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/sys.js:21:30
-       if (override !== null && override !== undefined) return parseFloat(override);
+       if (override !== null && true) return parseFloat(override);
Tests ran:
    SYS — getBF() T1: bf-override wins everything — returns raw parseFloat, skips all calculations
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]

[Survived] ArithmeticOperator
src/engine/sys.js:26:21
-       const fatLost = kgLost * 0.75;
+       const fatLost = kgLost / 0.75;
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
  and 2 more tests!

[Survived] ArithmeticOperator
src/engine/sys.js:27:24
-       const startFatKg = this.START_KG * (this.START_BF / 100);
+       const startFatKg = this.START_KG / (this.START_BF / 100);
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
  and 2 more tests!

[Survived] ArithmeticOperator
src/engine/sys.js:28:38
-       const currentFatKg = Math.max(3, startFatKg - fatLost);
+       const currentFatKg = Math.max(3, startFatKg + fatLost);
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
  and 2 more tests!

[Survived] ArithmeticOperator
src/engine/sys.js:27:41
-       const startFatKg = this.START_KG * (this.START_BF / 100);
+       const startFatKg = this.START_KG * (this.START_BF * 100);
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
  and 2 more tests!

[Survived] ArithmeticOperator
src/engine/sys.js:29:27
-       const calculatedBF = (currentFatKg / kg) * 100;
+       const calculatedBF = (currentFatKg * kg) * 100;
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
  and 2 more tests!

[Survived] MethodExpression
src/engine/sys.js:30:35
-       return Math.round(Math.max(5, Math.min(45, calculatedBF)) * 10) / 10;
+       return Math.round(Math.max(5, Math.max(45, calculatedBF)) * 10) / 10;
Tests ran:
    SYS — getBF() T2: override returned raw (unclamped); auto-path clamps calculatedBF to [5, 45]
    SYS — getBF() T3: BF independent de logs (calibration din start, nu din lifting history)
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
  and 2 more tests!

[Survived] MethodExpression
src/engine/sys.js:41:17
-       let dates = Object.keys(ws).sort((a, b) => a.localeCompare(b));
+       let dates = Object.keys(ws);
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] ArrowFunction
src/engine/sys.js:41:38
-       let dates = Object.keys(ws).sort((a, b) => a.localeCompare(b));
+       let dates = Object.keys(ws).sort(() => undefined);
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/sys.js:45:9
-       if (phaseChangeDate) {
+       if (true) {
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/sys.js:47:11
-         if (filtered.length >= 4) dates = filtered;
+         if (true) dates = filtered;
Tests ran:
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist

[Survived] BlockStatement
src/engine/sys.js:50:12
-       } else {
-         dates = dates.slice(-14);
-       }
+       } else {}
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] UnaryOperator
src/engine/sys.js:51:27
-         dates = dates.slice(-14);
+         dates = dates.slice(+14);
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] MethodExpression
src/engine/sys.js:51:15
-         dates = dates.slice(-14);
+         dates = dates;
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] EqualityOperator
src/engine/sys.js:54:9
-       if (dates.length < 4) {
+       if (dates.length <= 4) {
Tests ran:
    SYS — estimateTDEE() T4: uses Mifflin-St Jeor fallback when fewer than 4 weight entries
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/sys.js:63:25
-       const currentKcal = DB.get('current-kcal') || KCAL_TARGET;
+       const currentKcal = true;
Tests ran:
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist

[Survived] ConditionalExpression
src/engine/sys.js:63:25
-       const currentKcal = DB.get('current-kcal') || KCAL_TARGET;
+       const currentKcal = false;
Tests ran:
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist

[Survived] LogicalOperator
src/engine/sys.js:63:25
-       const currentKcal = DB.get('current-kcal') || KCAL_TARGET;
+       const currentKcal = DB.get('current-kcal') && KCAL_TARGET;
Tests ran:
    SYS — estimateTDEE() T5: clamps result to [KCAL_TARGET, 3500] when weight data implies extreme deficit
    SYS — estimateTDEE() T6: filters to phase-change-date window when ≥4 post-phase entries exist

[Survived] ConditionalExpression
src/engine/sys.js:77:25
-       const pilotActive = now >= PILOT_DATE;
+       const pilotActive = false;
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) tempo notes per phase + isCompound

[Survived] EqualityOperator
src/engine/sys.js:77:25
-       const pilotActive = now >= PILOT_DATE;
+       const pilotActive = now > PILOT_DATE;
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) tempo notes per phase + isCompound

[Survived] ConditionalExpression
src/engine/sys.js:84:22
-       const isSummer = now <= summerEnd;
+       const isSummer = true;
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:84:22
-       const isSummer = now <= summerEnd;
+       const isSummer = false;
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:80:9
-       if (!pilotActive) return 'CUT';
+       if (true) return 'CUT';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) tempo notes per phase + isCompound

[Survived] EqualityOperator
src/engine/sys.js:84:22
-       const isSummer = now <= summerEnd;
+       const isSummer = now < summerEnd;
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:84:22
-       const isSummer = now <= summerEnd;
+       const isSummer = now > summerEnd;
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:85:22
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = true; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:85:22
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = false; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] LogicalOperator
src/engine/sys.js:85:22
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = now.getMonth() >= 9 && now.getMonth() <= 1; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:85:22
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = false || now.getMonth() <= 1; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:85:22
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = now.getMonth() > 9 || now.getMonth() <= 1; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:85:22
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = now.getMonth() < 9 || now.getMonth() <= 1; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:85:45
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = now.getMonth() >= 9 || false; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:85:45
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = now.getMonth() >= 9 || now.getMonth() < 1; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:85:45
-       const isWinter = now.getMonth() >= 9 || now.getMonth() <= 1; // Oct-Feb
+       const isWinter = now.getMonth() >= 9 || now.getMonth() > 1; // Oct-Feb
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:88:9
-       if (bf > 18) return 'CUT';
+       if (true) return 'CUT';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:88:9
-       if (bf > 18) return 'CUT';
+       if (false) return 'CUT';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:88:9
-       if (bf > 18) return 'CUT';
+       if (bf >= 18) return 'CUT';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:88:9
-       if (bf > 18) return 'CUT';
+       if (bf <= 18) return 'CUT';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:89:9
-       if (bf > 15) {
+       if (true) {
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:89:9
-       if (bf > 15) {
+       if (false) {
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:89:9
-       if (bf > 15) {
+       if (bf >= 15) {
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] EqualityOperator
src/engine/sys.js:89:9
-       if (bf > 15) {
+       if (bf <= 15) {
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] BlockStatement
src/engine/sys.js:89:18
-       if (bf > 15) {
-         // Vară cu BF 15-18%: mentenanță sau cut ușor
-         if (isSummer) return 'MAINTENANCE';
-         return 'CUT';
-       }
+       if (bf > 15) {}
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:91:11
-         if (isSummer) return 'MAINTENANCE';
+         if (true) return 'MAINTENANCE';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:91:11
-         if (isSummer) return 'MAINTENANCE';
+         if (false) return 'MAINTENANCE';
Tests ran:
    SYS — getPhase() T8: pilot boundary — CUT before TARGET_DATE, pilot logic fires after (vi.setSystemTime)

[Survived] ConditionalExpression
src/engine/sys.js:116:9
-       if (phaseOverride && phaseOverride !== 'AUTO') {
+       if (true) {
Tests ran:
    SYS — getKcalTarget() T9: applies correct TDEE multipliers per phase (CUT<MAINT<STRENGTH<BULK)
    SYS — getKcalTarget() property-based T11: valid kcal output [1000, 4500] across BF [10,35] × all phase combinations

[Survived] LogicalOperator
src/engine/sys.js:116:9
-       if (phaseOverride && phaseOverride !== 'AUTO') {
+       if (phaseOverride || phaseOverride !== 'AUTO') {
Tests ran:
    SYS — getKcalTarget() T9: applies correct TDEE multipliers per phase (CUT<MAINT<STRENGTH<BULK)
    SYS — getKcalTarget() property-based T11: valid kcal output [1000, 4500] across BF [10,35] × all phase combinations

[Survived] ConditionalExpression
src/engine/sys.js:116:26
-       if (phaseOverride && phaseOverride !== 'AUTO') {
+       if (phaseOverride && true) {
Tests ran:
    SYS — getKcalTarget() T9: applies correct TDEE multipliers per phase (CUT<MAINT<STRENGTH<BULK)
    SYS — getKcalTarget() property-based T11: valid kcal output [1000, 4500] across BF [10,35] × all phase combinations

[Survived] ArithmeticOperator
src/engine/sys.js:141:24
-       return Math.round((lbm / (1 - targetBF/100)) * 10) / 10;
+       return Math.round((lbm * (1 - targetBF / 100)) * 10) / 10;
Tests ran:
    SYS — kgAtBF() + weeksToKg() T10: kgAtBF produces targetKg < currentKg; weeksToKg returns positive finite weeks

[Survived] ArithmeticOperator
src/engine/sys.js:141:31
-       return Math.round((lbm / (1 - targetBF/100)) * 10) / 10;
+       return Math.round((lbm / (1 + targetBF / 100)) * 10) / 10;
Tests ran:
    SYS — kgAtBF() + weeksToKg() T10: kgAtBF produces targetKg < currentKg; weeksToKg returns positive finite weeks

[Survived] ArithmeticOperator
src/engine/sys.js:146:18
-       const diff = current - targetKg;
+       const diff = current + targetKg;
Tests ran:
    SYS — kgAtBF() + weeksToKg() T10: kgAtBF produces targetKg < currentKg; weeksToKg returns positive finite weeks

[Survived] ConditionalExpression
src/engine/sys.js:147:9
-       if (diff <= 0) return 0;
+       if (false) return 0;
Tests ran:
    SYS — kgAtBF() + weeksToKg() T10: kgAtBF produces targetKg < currentKg; weeksToKg returns positive finite weeks

[Survived] EqualityOperator
src/engine/sys.js:147:9
-       if (diff <= 0) return 0;
+       if (diff < 0) return 0;
Tests ran:
    SYS — kgAtBF() + weeksToKg() T10: kgAtBF produces targetKg < currentKg; weeksToKg returns positive finite weeks

[Survived] ArithmeticOperator
src/engine/sys.js:149:22
-       return Math.ceil(diff / 0.5);
+       return Math.ceil(diff * 0.5);
Tests ran:
    SYS — kgAtBF() + weeksToKg() T10: kgAtBF produces targetKg < currentKg; weeksToKg returns positive finite weeks
