[Survived] ArrayDeclaration
src/engine/sys.js:222:12
-       return [
-         { label: 'Definire până la vară', date: new Date(year,0,1), endDate: new Date(year,5,1), type: 'cut' },
-         { label: 'Vară peak (menținere)', date: new Date(year,5,1), endDate: new Date(year,7,31), type: 'summer' },
-         { label: 'Creștere (toamnă-iarnă)', date: new Date(year,8,1), endDate: new Date(year+1,1,28), type: 'bulk' },
-         { label: 'Definire pre-vară', date: new Date(year+1,2,1), endDate: new Date(year+1,5,1), type: 'cut' },
-         { label: 'Vară peak 2027', date: new Date(year+1,5,1), endDate: new Date(year+1,7,31), type: 'summer' },
-       ].map(item => ({
+       return [].map(item => ({
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ArithmeticOperator
src/engine/sys.js:225:87
-         { label: 'Creștere (toamnă-iarnă)', date: new Date(year,8,1), endDate: new Date(year+1,1,28), type: 'bulk' },
+         { label: 'Creștere (toamnă-iarnă)', date: new Date(year,8,1), endDate: new Date(year - 1,1,28), type: 'bulk' },
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ArithmeticOperator
src/engine/sys.js:226:52
-         { label: 'Definire pre-vară', date: new Date(year+1,2,1), endDate: new Date(year+1,5,1), type: 'cut' },
+         { label: 'Definire pre-vară', date: new Date(year - 1,2,1), endDate: new Date(year+1,5,1), type: 'cut' },
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ArithmeticOperator
src/engine/sys.js:226:83
-         { label: 'Definire pre-vară', date: new Date(year+1,2,1), endDate: new Date(year+1,5,1), type: 'cut' },
+         { label: 'Definire pre-vară', date: new Date(year+1,2,1), endDate: new Date(year - 1,5,1), type: 'cut' },
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ArithmeticOperator
src/engine/sys.js:227:49
-         { label: 'Vară peak 2027', date: new Date(year+1,5,1), endDate: new Date(year+1,7,31), type: 'summer' },
+         { label: 'Vară peak 2027', date: new Date(year - 1,5,1), endDate: new Date(year+1,7,31), type: 'summer' },
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ArithmeticOperator
src/engine/sys.js:227:80
-         { label: 'Vară peak 2027', date: new Date(year+1,5,1), endDate: new Date(year+1,7,31), type: 'summer' },
+         { label: 'Vară peak 2027', date: new Date(year+1,5,1), endDate: new Date(year - 1,7,31), type: 'summer' },
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:230:15
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: true ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:230:15
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: false ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] EqualityOperator
src/engine/sys.js:230:15
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now <= item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] EqualityOperator
src/engine/sys.js:230:15
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now >= item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:230:44
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : false ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:230:44
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : true ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] LogicalOperator
src/engine/sys.js:230:44
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : now >= item.date || now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:230:44
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : true && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] EqualityOperator
src/engine/sys.js:230:44
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : now > item.date && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] EqualityOperator
src/engine/sys.js:230:44
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : now < item.date && now < item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:230:64
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : now >= item.date && true ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] EqualityOperator
src/engine/sys.js:230:64
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : now >= item.date && now <= item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] EqualityOperator
src/engine/sys.js:230:64
-         status: now < item.date ? 'future' : now >= item.date && now < item.endDate ? 'current' : 'past'
+         status: now < item.date ? 'future' : now >= item.date && now >= item.endDate ? 'current' : 'past'
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) phase timeline labels RO native

[Survived] ConditionalExpression
src/engine/sys.js:239:9
-       if (phase === 'STRENGTH') {
+       if (false) {
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) tempo notes per phase + isCompound

[Survived] ConditionalExpression
src/engine/sys.js:242:9
-       if (phase === 'BULK') {
+       if (false) {
Tests ran:
    Golden Master — sys.js timeline + tempo (§36.58 LOCKED V1) tempo notes per phase + isCompound

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:23:7
-     if (/quad|hamstring|glute|calf/.test(head)) return 'legs';
+     if (true) return 'legs';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:23:7
-     if (/quad|hamstring|glute|calf/.test(head)) return 'legs';
+     if (false) return 'legs';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:24:7
-     if (/lower_back|core/.test(head)) return 'core';
+     if (true) return 'core';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:24:7
-     if (/lower_back|core/.test(head)) return 'core';
+     if (false) return 'core';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:56:7
-     if (/bench|chest|pec|fly/i.test(lower)) return 'chest';
+     if (true) return 'chest';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:56:7
-     if (/bench|chest|pec|fly/i.test(lower)) return 'chest';
+     if (false) return 'chest';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:57:7
-     if (/row|pull|lat|cable/i.test(lower)) return 'back';
+     if (true) return 'back';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:57:7
-     if (/row|pull|lat|cable/i.test(lower)) return 'back';
+     if (false) return 'back';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:58:7
-     if (/shoulder|press.*overhead|ohp|lateral|delt/i.test(lower)) return 'shoulders';
+     if (true) return 'shoulders';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:58:7
-     if (/shoulder|press.*overhead|ohp|lateral|delt/i.test(lower)) return 'shoulders';
+     if (false) return 'shoulders';

[NoCoverage] Regex
src/engine/weaknessDetector.js:58:7
-     if (/shoulder|press.*overhead|ohp|lateral|delt/i.test(lower)) return 'shoulders';
+     if (/shoulder|press.overhead|ohp|lateral|delt/i.test(lower)) return 'shoulders';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:59:7
-     if (/curl|bicep/i.test(lower)) return 'biceps';
+     if (true) return 'biceps';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:59:7
-     if (/curl|bicep/i.test(lower)) return 'biceps';
+     if (false) return 'biceps';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:60:7
-     if (/tricep|pushdown|extension|dip/i.test(lower)) return 'triceps';
+     if (true) return 'triceps';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:60:7
-     if (/tricep|pushdown|extension|dip/i.test(lower)) return 'triceps';
+     if (false) return 'triceps';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:61:7
-     if (/squat|leg|lunge|rdl|deadlift|glute/i.test(lower)) return 'legs';
+     if (true) return 'legs';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:61:7
-     if (/squat|leg|lunge|rdl|deadlift|glute/i.test(lower)) return 'legs';
+     if (false) return 'legs';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:62:7
-     if (/plank|crunch|ab|core/i.test(lower)) return 'core';
+     if (true) return 'core';

[NoCoverage] ConditionalExpression
src/engine/weaknessDetector.js:62:7
-     if (/plank|crunch|ab|core/i.test(lower)) return 'core';
+     if (false) return 'core';

[NoCoverage] ArithmeticOperator
src/engine/weaknessDetector.js:118:29
-     weakGroups.sort((a, b) => ratio[a] - ratio[b]);
+     weakGroups.sort((a, b) => ratio[a] + ratio[b]);

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:12:27
-     if (!weight || !reps || reps < 1 || reps > 12) return null;
+     if (!weight || !reps || false || reps > 12) return null;
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 13 more tests!

[Survived] EqualityOperator
src/engine/weaknessDetector.js:12:39
-     if (!weight || !reps || reps < 1 || reps > 12) return null;
+     if (!weight || !reps || reps < 1 || reps >= 12) return null;
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 13 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:17:7
-     if (!head) return null;
+     if (false) return null;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:19:7
-     if (/delt/.test(head)) return 'shoulders';
+     if (true) return 'shoulders';
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:20:7
-     if (/tri/.test(head)) return 'triceps';
+     if (true) return 'triceps';
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:19:7
-     if (/delt/.test(head)) return 'shoulders';
+     if (false) return 'shoulders';
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:20:7
-     if (/tri/.test(head)) return 'triceps';
+     if (false) return 'triceps';
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:21:7
-     if (/bi_/.test(head)) return 'biceps';
+     if (true) return 'biceps';
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:22:7
-     if (/lat|trap|rear_delt/.test(head)) return 'back';
+     if (true) return 'back';
Tests ran:
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:36:9
-       if (!ex) continue;
+       if (false) continue;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:37:9
-       if (!byEx.has(ex)) byEx.set(ex, log);
+       if (true) byEx.set(ex, log);
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:47:7
-     if (!exerciseName) return null;
+     if (false) return null;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:51:43
-       if (lower === exName.toLowerCase() && muscles.primary?.length > 0) {
+       if (lower === exName.toLowerCase() && true) {
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] EqualityOperator
src/engine/weaknessDetector.js:51:43
-       if (lower === exName.toLowerCase() && muscles.primary?.length > 0) {
+       if (lower === exName.toLowerCase() && muscles.primary?.length >= 0) {
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] OptionalChaining
src/engine/weaknessDetector.js:51:43
-       if (lower === exName.toLowerCase() && muscles.primary?.length > 0) {
+       if (lower === exName.toLowerCase() && muscles.primary.length > 0) {
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:77:9
-       if (!group) continue;
+       if (false) continue;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:79:15
-       const r = parseInt(log.reps, 10) || log.reps;
+       const r = true;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] LogicalOperator
src/engine/weaknessDetector.js:79:15
-       const r = parseInt(log.reps, 10) || log.reps;
+       const r = parseInt(log.reps, 10) && log.reps;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:81:9
-       if (!orm) continue;
+       if (false) continue;
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:82:9
-       if (!byGroup.has(group)) byGroup.set(group, []);
+       if (true) byGroup.set(group, []);
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ArithmeticOperator
src/engine/weaknessDetector.js:88:23
-       result.set(group, orms.reduce((a, b) => a + b, 0) / orms.length);
+       result.set(group, orms.reduce((a, b) => a + b, 0) * orms.length);
Tests ran:
    compute1RMByGroup maps chest exercises to chest group
    compute1RMByGroup averages multiple 1RMs for same group
    detectWeakGroups detects weak group when 1RM significantly lower
  and 3 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:99:7
-     if (!logs || logs.length === 0) return { weakGroups: [], byGroup: {}, ratio: {} };
+     if (false) return { weakGroups: [], byGroup: {}, ratio: {} };
Tests ran:
    detectWeakGroups returns empty for empty logs
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
  and 2 more tests!

[Survived] LogicalOperator
src/engine/weaknessDetector.js:99:7
-     if (!logs || logs.length === 0) return { weakGroups: [], byGroup: {}, ratio: {} };
+     if (!logs && logs.length === 0) return { weakGroups: [], byGroup: {}, ratio: {} };
Tests ran:
    detectWeakGroups returns empty for empty logs
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:99:16
-     if (!logs || logs.length === 0) return { weakGroups: [], byGroup: {}, ratio: {} };
+     if (!logs || false) return { weakGroups: [], byGroup: {}, ratio: {} };
Tests ran:
    detectWeakGroups returns empty for empty logs
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
  and 2 more tests!

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:102:7
-     if (orm1RMByGroup.size < 2) return { weakGroups: [], byGroup: Object.fromEntries(orm1RMByGroup), ratio: {} };
+     if (false) return { weakGroups: [], byGroup: Object.fromEntries(orm1RMByGroup), ratio: {} };
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups handles single exercise (no weak groups possible)
  and 1 more test!

[Survived] ArithmeticOperator
src/engine/weaknessDetector.js:105:15
-     const avg = values.reduce((a, b) => a + b, 0) / values.length;
+     const avg = values.reduce((a, b) => a + b, 0) * values.length;
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:111:15
-       const r = avg > 0 ? orm / avg : 1;
+       const r = true ? orm / avg : 1;
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] EqualityOperator
src/engine/weaknessDetector.js:111:15
-       const r = avg > 0 ? orm / avg : 1;
+       const r = avg >= 0 ? orm / avg : 1;
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ConditionalExpression
src/engine/weaknessDetector.js:114:9
-       if (rounded < 0.8) weakGroups.push(group); // use rounded to avoid float precision mismatches
+       if (true) weakGroups.push(group); // use rounded to avoid float precision mismatches
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] EqualityOperator
src/engine/weaknessDetector.js:114:9
-       if (rounded < 0.8) weakGroups.push(group); // use rounded to avoid float precision mismatches
+       if (rounded <= 0.8) weakGroups.push(group); // use rounded to avoid float precision mismatches
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] EqualityOperator
src/engine/weaknessDetector.js:114:9
-       if (rounded < 0.8) weakGroups.push(group); // use rounded to avoid float precision mismatches
+       if (rounded >= 0.8) weakGroups.push(group); // use rounded to avoid float precision mismatches
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] MethodExpression
src/engine/weaknessDetector.js:118:3
-     weakGroups.sort((a, b) => ratio[a] - ratio[b]);
+     weakGroups;
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] ArrowFunction
src/engine/weaknessDetector.js:118:19
-     weakGroups.sort((a, b) => ratio[a] - ratio[b]);
+     weakGroups.sort(() => undefined);
Tests ran:
    detectWeakGroups detects weak group when 1RM significantly lower
    detectWeakGroups returns ratio for each group
    detectWeakGroups sorts weakest group first

[Survived] OptionalChaining
src/engine/whyEngine.js:41:17
-     const score = ctx?.readiness?.score;
+     const score = ctx?.readiness.score;
Tests ran:
    selectVerdict — priority ladder recovery overrides everything when readiness < MED (55)
    selectVerdict — priority ladder recovery overrides INCREASE status
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
  and 19 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:41:17
-     const score = ctx?.readiness?.score;
+     const score = ctx.readiness?.score;
Tests ran:
    selectVerdict — priority ladder recovery overrides everything when readiness < MED (55)
    selectVerdict — priority ladder recovery overrides INCREASE status
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
  and 19 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:42:7
-     if (typeof score === 'number' && score < READINESS_MED) {
+     if (true && score < READINESS_MED) {
Tests ran:
    selectVerdict — priority ladder recovery overrides everything when readiness < MED (55)
    selectVerdict — priority ladder recovery overrides INCREASE status
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
  and 19 more tests!

[Survived] EqualityOperator
src/engine/whyEngine.js:42:36
-     if (typeof score === 'number' && score < READINESS_MED) {
+     if (typeof score === 'number' && score <= READINESS_MED) {
Tests ran:
    selectVerdict — priority ladder recovery overrides everything when readiness < MED (55)
    selectVerdict — priority ladder recovery overrides INCREASE status
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
  and 19 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:46:30
-     const kg = _toFiniteNumber(rec?.kg ?? rec?.weight);
+     const kg = _toFiniteNumber(rec.kg ?? rec?.weight);
Tests ran:
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
    selectVerdict — priority ladder progression_down când rec.kg < lastWeight
    selectVerdict — priority ladder hold când rec.kg === lastWeight
  and 16 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:46:41
-     const kg = _toFiniteNumber(rec?.kg ?? rec?.weight);
+     const kg = _toFiniteNumber(rec?.kg ?? rec.weight);
Tests ran:
    selectVerdict — priority ladder progression_up via status INCREASE când no lastWeight
    selectVerdict — priority ladder progression_down via status SCALE_BACK când no lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
  and 2 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:47:38
-     const lastWeight = _toFiniteNumber(rec?.lastWeight ?? rec?.previousKg);
+     const lastWeight = _toFiniteNumber(rec.lastWeight ?? rec?.previousKg);
Tests ran:
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
    selectVerdict — priority ladder progression_down când rec.kg < lastWeight
    selectVerdict — priority ladder hold când rec.kg === lastWeight
  and 16 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:47:57
-     const lastWeight = _toFiniteNumber(rec?.lastWeight ?? rec?.previousKg);
+     const lastWeight = _toFiniteNumber(rec?.lastWeight ?? rec.previousKg);
Tests ran:
    selectVerdict — priority ladder progression_up via status INCREASE când no lastWeight
    selectVerdict — priority ladder progression_down via status SCALE_BACK când no lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:49:7
-     if (kg != null && lastWeight != null) {
+     if (true) {
Tests ran:
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
    selectVerdict — priority ladder progression_down când rec.kg < lastWeight
    selectVerdict — priority ladder hold când rec.kg === lastWeight
  and 16 more tests!

[Survived] LogicalOperator
src/engine/whyEngine.js:49:7
-     if (kg != null && lastWeight != null) {
+     if (kg != null || lastWeight != null) {
Tests ran:
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
    selectVerdict — priority ladder progression_down când rec.kg < lastWeight
    selectVerdict — priority ladder hold când rec.kg === lastWeight
  and 16 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:49:7
-     if (kg != null && lastWeight != null) {
+     if (true && lastWeight != null) {
Tests ran:
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
    selectVerdict — priority ladder progression_down când rec.kg < lastWeight
    selectVerdict — priority ladder hold când rec.kg === lastWeight
  and 16 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:49:21
-     if (kg != null && lastWeight != null) {
+     if (kg != null && true) {
Tests ran:
    selectVerdict — priority ladder progression_up când rec.kg > lastWeight
    selectVerdict — priority ladder progression_down când rec.kg < lastWeight
    selectVerdict — priority ladder hold când rec.kg === lastWeight
  and 11 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:55:7
-     if (rec?.status === 'INCREASE') return 'progression_up';
+     if (rec.status === 'INCREASE') return 'progression_up';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder progression_up via status INCREASE când no lastWeight
    selectVerdict — priority ladder progression_down via status SCALE_BACK când no lastWeight
  and 7 more tests!
