[Survived] OptionalChaining
src/engine/whyEngine.js:56:7
-     if (rec?.status === 'SCALE_BACK') return 'progression_down';
+     if (rec.status === 'SCALE_BACK') return 'progression_down';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder progression_down via status SCALE_BACK când no lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
  and 6 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:57:7
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (true) return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
    selectVerdict — priority ladder hold default fallback când nimic nu match
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:57:7
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (false) return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
    selectVerdict — priority ladder hold default fallback când nimic nu match
  and 5 more tests!

[Survived] LogicalOperator
src/engine/whyEngine.js:57:7
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (rec?.isInitial && rec?.status === 'INIT') return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
    selectVerdict — priority ladder hold default fallback când nimic nu match
  and 5 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:57:7
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (rec.isInitial || rec?.status === 'INIT') return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold pentru initial recommendation (isInitial)
    selectVerdict — priority ladder hold default fallback când nimic nu match
  and 5 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:57:25
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (rec?.isInitial || false) return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold default fallback când nimic nu match
    explainRecommendation returns { summary, verdict, reasons } shape
  and 4 more tests!

[Survived] EqualityOperator
src/engine/whyEngine.js:57:25
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (rec?.isInitial || rec?.status !== 'INIT') return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold default fallback când nimic nu match
    explainRecommendation returns { summary, verdict, reasons } shape
  and 4 more tests!

[Survived] OptionalChaining
src/engine/whyEngine.js:57:25
-     if (rec?.isInitial || rec?.status === 'INIT') return 'hold';
+     if (rec?.isInitial || rec.status === 'INIT') return 'hold';
Tests ran:
    selectVerdict — priority ladder hold când rec.kg === lastWeight
    selectVerdict — priority ladder hold default fallback când nimic nu match
    explainRecommendation returns { summary, verdict, reasons } shape
  and 4 more tests!

[Survived] ConditionalExpression
src/engine/whyEngine.js:71:35
-     const name = exercise?.name ?? (typeof exercise === 'string' ? exercise : '');
+     const name = exercise?.name ?? (true ? exercise : '');
Tests ran:
    explainRecommendation handles missing exercise gracefully

[Survived] ConditionalExpression
src/engine/whyEngine.js:71:35
-     const name = exercise?.name ?? (typeof exercise === 'string' ? exercise : '');
+     const name = exercise?.name ?? (false ? exercise : '');
Tests ran:
    explainRecommendation handles missing exercise gracefully

[Survived] EqualityOperator
src/engine/whyEngine.js:71:35
-     const name = exercise?.name ?? (typeof exercise === 'string' ? exercise : '');
+     const name = exercise?.name ?? (typeof exercise !== 'string' ? exercise : '');
Tests ran:
    explainRecommendation handles missing exercise gracefully

[Survived] ConditionalExpression
src/i18n/index.js:45:34
-     if (typeof key !== 'string' || key.length === 0) return '';
+     if (typeof key !== 'string' || false) return '';
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 24 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:55:9
-       if (typeof process !== 'undefined' && process?.env?.NODE_ENV !== 'production') {
+       if (true) {
Tests ran:
    t() fallback chain returns key string when key missing în both bundles
    t() fallback chain logs dev warn on missing key (non-prod env)

[Survived] LogicalOperator
src/i18n/index.js:55:9
-       if (typeof process !== 'undefined' && process?.env?.NODE_ENV !== 'production') {
+       if (typeof process !== 'undefined' || process?.env?.NODE_ENV !== 'production') {
Tests ran:
    t() fallback chain returns key string when key missing în both bundles
    t() fallback chain logs dev warn on missing key (non-prod env)

[Survived] ConditionalExpression
src/i18n/index.js:55:9
-       if (typeof process !== 'undefined' && process?.env?.NODE_ENV !== 'production') {
+       if (true && process?.env?.NODE_ENV !== 'production') {
Tests ran:
    t() fallback chain returns key string when key missing în both bundles
    t() fallback chain logs dev warn on missing key (non-prod env)

[Survived] ConditionalExpression
src/i18n/index.js:55:43
-       if (typeof process !== 'undefined' && process?.env?.NODE_ENV !== 'production') {
+       if (typeof process !== 'undefined' && true) {
Tests ran:
    t() fallback chain returns key string when key missing în both bundles
    t() fallback chain logs dev warn on missing key (non-prod env)

[Survived] OptionalChaining
src/i18n/index.js:55:43
-       if (typeof process !== 'undefined' && process?.env?.NODE_ENV !== 'production') {
+       if (typeof process !== 'undefined' && process?.env.NODE_ENV !== 'production') {
Tests ran:
    t() fallback chain returns key string when key missing în both bundles
    t() fallback chain logs dev warn on missing key (non-prod env)

[Survived] OptionalChaining
src/i18n/index.js:55:43
-       if (typeof process !== 'undefined' && process?.env?.NODE_ENV !== 'production') {
+       if (typeof process !== 'undefined' && process.env?.NODE_ENV !== 'production') {
Tests ran:
    t() fallback chain returns key string when key missing în both bundles
    t() fallback chain logs dev warn on missing key (non-prod env)

[Survived] BlockStatement
src/i18n/index.js:76:7
-     try {
-       const stored = typeof localStorage !== 'undefined' ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
-       if (stored && BUNDLES[stored]) {
-         _cachedLocale = stored;
-         return stored;
-       }
-     } catch { /* private mode etc — ignore */ }
+     try {} catch { /* private mode etc — ignore */ }
Tests ran:
    getCurrentLocale returns localStorage override when set
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:77:20
-       const stored = typeof localStorage !== 'undefined' ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
+       const stored = true ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
Tests ran:
    getCurrentLocale returns localStorage override when set
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:77:20
-       const stored = typeof localStorage !== 'undefined' ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
+       const stored = false ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
Tests ran:
    getCurrentLocale returns localStorage override when set
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] EqualityOperator
src/i18n/index.js:77:20
-       const stored = typeof localStorage !== 'undefined' ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
+       const stored = typeof localStorage === 'undefined' ? localStorage.getItem(LOCALE_STORAGE_KEY) : null;
Tests ran:
    getCurrentLocale returns localStorage override when set
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:73:7
-     if (_cachedLocale) return _cachedLocale;
+     if (false) return _cachedLocale;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 28 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:78:9
-       if (stored && BUNDLES[stored]) {
+       if (false) {
Tests ran:
    getCurrentLocale returns localStorage override when set
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] BlockStatement
src/i18n/index.js:78:36
-       if (stored && BUNDLES[stored]) {
-         _cachedLocale = stored;
-         return stored;
-       }
+       if (stored && BUNDLES[stored]) {}
Tests ran:
    getCurrentLocale returns localStorage override when set

[Survived] ConditionalExpression
src/i18n/index.js:86:17
-       const nav = typeof navigator !== 'undefined' ? navigator.language : null;
+       const nav = false ? navigator.language : null;
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] BlockStatement
src/i18n/index.js:85:7
-     try {
-       const nav = typeof navigator !== 'undefined' ? navigator.language : null;
-       if (nav) {
-         const prefix = String(nav).slice(0, 2).toLowerCase();
-         if (BUNDLES[prefix]) {
-           _cachedLocale = prefix;
-           return prefix;
-         }
-       }
-     } catch { /* ignore */ }
+     try {} catch { /* ignore */ }
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:86:17
-       const nav = typeof navigator !== 'undefined' ? navigator.language : null;
+       const nav = true ? navigator.language : null;
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] EqualityOperator
src/i18n/index.js:86:17
-       const nav = typeof navigator !== 'undefined' ? navigator.language : null;
+       const nav = typeof navigator === 'undefined' ? navigator.language : null;
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:87:9
-       if (nav) {
+       if (true) {
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:87:9
-       if (nav) {
+       if (false) {
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] BlockStatement
src/i18n/index.js:87:14
-       if (nav) {
-         const prefix = String(nav).slice(0, 2).toLowerCase();
-         if (BUNDLES[prefix]) {
-           _cachedLocale = prefix;
-           return prefix;
-         }
-       }
+       if (nav) {}
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] MethodExpression
src/i18n/index.js:88:22
-         const prefix = String(nav).slice(0, 2).toLowerCase();
+         const prefix = String(nav).toLowerCase();
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] MethodExpression
src/i18n/index.js:88:22
-         const prefix = String(nav).slice(0, 2).toLowerCase();
+         const prefix = String(nav).slice(0, 2).toUpperCase();
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:89:11
-         if (BUNDLES[prefix]) {
+         if (true) {
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:89:11
-         if (BUNDLES[prefix]) {
+         if (false) {
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] BlockStatement
src/i18n/index.js:89:28
-         if (BUNDLES[prefix]) {
-           _cachedLocale = prefix;
-           return prefix;
-         }
+         if (BUNDLES[prefix]) {}
Tests ran:
    getCurrentLocale returns "ro" default when no override + jsdom navigator unspecific
    getCurrentLocale invalid localStorage value falls through to navigator/default

[Survived] ConditionalExpression
src/i18n/index.js:112:9
-       if (typeof localStorage !== 'undefined') {
+       if (true) {
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 35 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:140:7
-     if (!obj || typeof obj !== 'object' || typeof path !== 'string') return null;
+     if (false) return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] LogicalOperator
src/i18n/index.js:140:7
-     if (!obj || typeof obj !== 'object' || typeof path !== 'string') return null;
+     if ((!obj || typeof obj !== 'object') && typeof path !== 'string') return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:140:7
-     if (!obj || typeof obj !== 'object' || typeof path !== 'string') return null;
+     if (false || typeof path !== 'string') return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] LogicalOperator
src/i18n/index.js:140:7
-     if (!obj || typeof obj !== 'object' || typeof path !== 'string') return null;
+     if (!obj && typeof obj !== 'object' || typeof path !== 'string') return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:140:15
-     if (!obj || typeof obj !== 'object' || typeof path !== 'string') return null;
+     if (!obj || false || typeof path !== 'string') return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:140:42
-     if (!obj || typeof obj !== 'object' || typeof path !== 'string') return null;
+     if (!obj || typeof obj !== 'object' || false) return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] LogicalOperator
src/i18n/index.js:144:9
-       if (cur == null || typeof cur !== 'object') return null;
+       if (cur == null && typeof cur !== 'object') return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:144:9
-       if (cur == null || typeof cur !== 'object') return null;
+       if (false || typeof cur !== 'object') return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:144:24
-       if (cur == null || typeof cur !== 'object') return null;
+       if (cur == null || false) return null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 23 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:147:10
-     return typeof cur === 'string' ? cur : null;
+     return true ? cur : null;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 21 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:153:7
-     if (!vars || typeof vars !== 'object') return str;
+     if (false) return str;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 21 more tests!

[Survived] LogicalOperator
src/i18n/index.js:153:7
-     if (!vars || typeof vars !== 'object') return str;
+     if (!vars && typeof vars !== 'object') return str;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 21 more tests!

[Survived] ConditionalExpression
src/i18n/index.js:153:16
-     if (!vars || typeof vars !== 'object') return str;
+     if (!vars || false) return str;
Tests ran:
    t() happy path returns RO string for known key (default locale)
    t() happy path returns nested key value via dotted path
    t() happy path returns EN string when locale=en (TODO_EN prefix preserved)
  and 21 more tests!

[NoCoverage] BooleanLiteral
src/migrations/2026-05-02-auth-path-migration.js:26:18
-     if (!s) return false;
+     if (!s) return true;

[NoCoverage] BlockStatement
src/migrations/2026-05-02-auth-path-migration.js:33:11
-     } catch {
-       return false;
-     }
+     } catch {}

[NoCoverage] BooleanLiteral
src/migrations/2026-05-02-auth-path-migration.js:34:12
-       return false;
+       return true;

[NoCoverage] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:65:34
-     const fetcher = opts.fetch || (typeof fetch !== 'undefined' ? fetch : null);
+     const fetcher = opts.fetch || (true ? fetch : null);

[NoCoverage] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:65:34
-     const fetcher = opts.fetch || (typeof fetch !== 'undefined' ? fetch : null);
+     const fetcher = opts.fetch || (false ? fetch : null);

[NoCoverage] EqualityOperator
src/migrations/2026-05-02-auth-path-migration.js:65:34
-     const fetcher = opts.fetch || (typeof fetch !== 'undefined' ? fetch : null);
+     const fetcher = opts.fetch || (typeof fetch === 'undefined' ? fetch : null);

[NoCoverage] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:67:24
-     if (!fetcher) return { status: 'failed', error: 'no_fetch' };
+     if (!fetcher) return {};

[NoCoverage] BlockStatement
src/migrations/2026-05-02-auth-path-migration.js:118:25
-       if (!verifyResp.ok) {
-         return { status: 'failed', uid: auth.uid, error: `verify_http_${verifyResp.status}` };
-       }
+       if (!verifyResp.ok) {}

[NoCoverage] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:119:14
-         return { status: 'failed', uid: auth.uid, error: `verify_http_${verifyResp.status}` };
+         return {};

[NoCoverage] BlockStatement
src/migrations/2026-05-02-auth-path-migration.js:136:17
-     } catch (err) {
-       return { status: 'failed', uid: auth.uid, error: err?.message || 'unknown' };
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:137:12
-       return { status: 'failed', uid: auth.uid, error: err?.message || 'unknown' };
+       return {};

[NoCoverage] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:137:54
-       return { status: 'failed', uid: auth.uid, error: err?.message || 'unknown' };
+       return { status: 'failed', uid: auth.uid, error: true };

[NoCoverage] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:137:54
-       return { status: 'failed', uid: auth.uid, error: err?.message || 'unknown' };
+       return { status: 'failed', uid: auth.uid, error: false };

[NoCoverage] LogicalOperator
src/migrations/2026-05-02-auth-path-migration.js:137:54
-       return { status: 'failed', uid: auth.uid, error: err?.message || 'unknown' };
+       return { status: 'failed', uid: auth.uid, error: err?.message && 'unknown' };

[NoCoverage] OptionalChaining
src/migrations/2026-05-02-auth-path-migration.js:137:54
-       return { status: 'failed', uid: auth.uid, error: err?.message || 'unknown' };
+       return { status: 'failed', uid: auth.uid, error: err.message || 'unknown' };

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:25:25
-     const s = storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const s = storage || (true ? localStorage : null);
Tests ran:
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — edge cases returns already-populated when dest has data
  and 3 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:26:7
-     if (!s) return false;
+     if (false) return false;
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 8 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:29:9
-       if (!raw) return false;
+       if (false) return false;
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 8 more tests!

[Survived] OptionalChaining
src/migrations/2026-05-02-auth-path-migration.js:32:12
-       return auth?.uid && parsed?.uid === auth.uid;
+       return auth.uid && parsed?.uid === auth.uid;
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 4 more tests!

[Survived] OptionalChaining
src/migrations/2026-05-02-auth-path-migration.js:32:25
-       return auth?.uid && parsed?.uid === auth.uid;
+       return auth?.uid && parsed.uid === auth.uid;
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:46:25
-     const s = storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const s = storage || (true ? localStorage : null);
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — edge cases resetMigrationFlag forces re-run

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:47:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 5 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:52:14
-         stats: stats || {},
+         stats: true,
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 5 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:52:14
-         stats: stats || {},
+         stats: false,
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 5 more tests!

[Survived] LogicalOperator
src/migrations/2026-05-02-auth-path-migration.js:52:14
-         stats: stats || {},
+         stats: stats && {},
Tests ran:
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — gating runs again when uid changes
    auth-path-migration — happy path migrates source → dest when dest empty
  and 5 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:66:19
-     const storage = opts.storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const storage = false;
Tests ran:
    auth-path-migration — gating returns no-auth when nothing set
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — happy path migrates source → dest when dest empty
  and 7 more tests!

[Survived] LogicalOperator
src/migrations/2026-05-02-auth-path-migration.js:66:19
-     const storage = opts.storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const storage = opts.storage && (typeof localStorage !== 'undefined' ? localStorage : null);
Tests ran:
    auth-path-migration — gating returns no-auth when nothing set
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — happy path migrates source → dest when dest empty
  and 7 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:66:36
-     const storage = opts.storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const storage = opts.storage || (true ? localStorage : null);
Tests ran:
    auth-path-migration — gating returns no-auth when nothing set
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — happy path migrates source → dest when dest empty
  and 7 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:66:36
-     const storage = opts.storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const storage = opts.storage || (false ? localStorage : null);
Tests ran:
    auth-path-migration — gating returns no-auth when nothing set
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — happy path migrates source → dest when dest empty
  and 7 more tests!
