[Survived] EqualityOperator
src/migrations/2026-05-02-auth-path-migration.js:66:36
-     const storage = opts.storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const storage = opts.storage || (typeof localStorage === 'undefined' ? localStorage : null);
Tests ran:
    auth-path-migration — gating returns no-auth when nothing set
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — happy path migrates source → dest when dest empty
  and 7 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:67:7
-     if (!fetcher) return { status: 'failed', error: 'no_fetch' };
+     if (false) return { status: 'failed', error: 'no_fetch' };
Tests ran:
    auth-path-migration — gating returns no-auth when nothing set
    auth-path-migration — gating returns skipped when already migrated for current uid
    auth-path-migration — happy path migrates source → dest when dest empty
  and 7 more tests!

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:80:45
-       const destResp = await fetcher(destUrl, { cache: 'no-store' });
+       const destResp = await fetcher(destUrl, {});
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns already-populated when dest has data
  and 5 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:81:9
-       if (destResp.ok) {
+       if (true) {
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns already-populated when dest has data
  and 5 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:83:23
-         if (destData && typeof destData === 'object' && Object.keys(destData).length > 0) {
+         if (destData && true && Object.keys(destData).length > 0) {
Tests ran:
    auth-path-migration — edge cases returns already-populated when dest has data

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:83:55
-         if (destData && typeof destData === 'object' && Object.keys(destData).length > 0) {
+         if (destData && typeof destData === 'object' && true) {
Tests ran:
    auth-path-migration — edge cases returns already-populated when dest has data

[Survived] EqualityOperator
src/migrations/2026-05-02-auth-path-migration.js:83:55
-         if (destData && typeof destData === 'object' && Object.keys(destData).length > 0) {
+         if (destData && typeof destData === 'object' && Object.keys(destData).length >= 0) {
Tests ran:
    auth-path-migration — edge cases returns already-populated when dest has data

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:84:32
-           markMigrated(auth.uid, { reason: 'dest-populated' }, storage);
+           markMigrated(auth.uid, {}, storage);
Tests ran:
    auth-path-migration — edge cases returns already-populated when dest has data

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:93:49
-       const sourceResp = await fetcher(sourceUrl, { cache: 'no-store' });
+       const sourceResp = await fetcher(sourceUrl, {});
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns no-source when legacy path empty
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:98:24
-       if (!sourceData || typeof sourceData !== 'object' || Object.keys(sourceData).length === 0) {
+       if (!sourceData || false || Object.keys(sourceData).length === 0) {
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on write error
  and 2 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:98:58
-       if (!sourceData || typeof sourceData !== 'object' || Object.keys(sourceData).length === 0) {
+       if (!sourceData || typeof sourceData !== 'object' || false) {
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on write error
  and 2 more tests!

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:100:30
-         markMigrated(auth.uid, { reason: 'no-source' }, storage);
+         markMigrated(auth.uid, {}, storage);
Tests ran:
    auth-path-migration — edge cases returns no-source when legacy path empty

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:108:16
-         headers: { 'Content-Type': 'application/json' },
+         headers: {},
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on write error
  and 2 more tests!

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:117:48
-       const verifyResp = await fetcher(writeUrl, { cache: 'no-store' });
+       const verifyResp = await fetcher(writeUrl, {});
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on verify mismatch
  and 1 more test!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:118:9
-       if (!verifyResp.ok) {
+       if (false) {
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on verify mismatch
  and 1 more test!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:123:28
-       const verifyKeyCount = verifyData && typeof verifyData === 'object'
+       const verifyKeyCount = true
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on verify mismatch
  and 1 more test!

[Survived] LogicalOperator
src/migrations/2026-05-02-auth-path-migration.js:123:28
-       const verifyKeyCount = verifyData && typeof verifyData === 'object'
+       const verifyKeyCount = verifyData || typeof verifyData === 'object'
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on verify mismatch
  and 1 more test!

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:123:42
-       const verifyKeyCount = verifyData && typeof verifyData === 'object'
+       const verifyKeyCount = verifyData && true
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns failed on verify mismatch
  and 1 more test!

[Survived] ObjectLiteral
src/migrations/2026-05-02-auth-path-migration.js:134:28
-       markMigrated(auth.uid, { reason: 'migrated', sourceKeyCount }, storage);
+       markMigrated(auth.uid, {}, storage);
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases preserves data — verify deep equal source vs dest

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:147:25
-     const s = storage || (typeof localStorage !== 'undefined' ? localStorage : null);
+     const s = storage || (true ? localStorage : null);
Tests ran:
    auth-path-migration — edge cases resetMigrationFlag forces re-run

[Survived] ConditionalExpression
src/migrations/2026-05-02-auth-path-migration.js:148:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    auth-path-migration — edge cases resetMigrationFlag forces re-run

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:28:7
-     if (typeof oldId !== 'number' || !Number.isFinite(oldId)) return oldId;
+     if (false) return oldId;
Tests ran:
    migration 5→6 tiers — remapTierId leaves COLD_START (id 0) unchanged
    migration 5→6 tiers — remapTierId leaves INITIAL (id 1) unchanged
    migration 5→6 tiers — remapTierId maps old PERSONALIZING (2) → new PERSONALIZING (3)
  and 10 more tests!

[Survived] LogicalOperator
src/migrations/2026-05-02-tier-5-to-6.js:28:7
-     if (typeof oldId !== 'number' || !Number.isFinite(oldId)) return oldId;
+     if (typeof oldId !== 'number' && !Number.isFinite(oldId)) return oldId;
Tests ran:
    migration 5→6 tiers — remapTierId leaves COLD_START (id 0) unchanged
    migration 5→6 tiers — remapTierId leaves INITIAL (id 1) unchanged
    migration 5→6 tiers — remapTierId maps old PERSONALIZING (2) → new PERSONALIZING (3)
  and 10 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:28:7
-     if (typeof oldId !== 'number' || !Number.isFinite(oldId)) return oldId;
+     if (false || !Number.isFinite(oldId)) return oldId;
Tests ran:
    migration 5→6 tiers — remapTierId leaves COLD_START (id 0) unchanged
    migration 5→6 tiers — remapTierId leaves INITIAL (id 1) unchanged
    migration 5→6 tiers — remapTierId maps old PERSONALIZING (2) → new PERSONALIZING (3)
  and 10 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:29:7
-     if (oldId <= 1) return oldId;          // COLD_START, INITIAL unchanged
+     if (false) return oldId;          // COLD_START, INITIAL unchanged
Tests ran:
    migration 5→6 tiers — remapTierId leaves COLD_START (id 0) unchanged
    migration 5→6 tiers — remapTierId leaves INITIAL (id 1) unchanged
    migration 5→6 tiers — remapTierId maps old PERSONALIZING (2) → new PERSONALIZING (3)
  and 9 more tests!

[Survived] EqualityOperator
src/migrations/2026-05-02-tier-5-to-6.js:29:7
-     if (oldId <= 1) return oldId;          // COLD_START, INITIAL unchanged
+     if (oldId < 1) return oldId;          // COLD_START, INITIAL unchanged
Tests ran:
    migration 5→6 tiers — remapTierId leaves COLD_START (id 0) unchanged
    migration 5→6 tiers — remapTierId leaves INITIAL (id 1) unchanged
    migration 5→6 tiers — remapTierId maps old PERSONALIZING (2) → new PERSONALIZING (3)
  and 9 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:30:7
-     if (oldId >= 2 && oldId <= 4) return oldId + 1; // PERSONALIZING/PERSONALIZED/OPTIMIZED bump
+     if (true && oldId <= 4) return oldId + 1; // PERSONALIZING/PERSONALIZED/OPTIMIZED bump
Tests ran:
    migration 5→6 tiers — remapTierId maps old PERSONALIZING (2) → new PERSONALIZING (3)
    migration 5→6 tiers — remapTierId maps old PERSONALIZED (3) → new PERSONALIZED (4)
    migration 5→6 tiers — remapTierId maps old OPTIMIZED (4) → new OPTIMIZED (5)
  and 7 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:43:7
-     if (!entry || typeof entry !== 'object') return entry;
+     if (false) return entry;
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op for entries without context
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
  and 6 more tests!

[Survived] LogicalOperator
src/migrations/2026-05-02-tier-5-to-6.js:43:7
-     if (!entry || typeof entry !== 'object') return entry;
+     if (!entry && typeof entry !== 'object') return entry;
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op for entries without context
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
  and 6 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:43:17
-     if (!entry || typeof entry !== 'object') return entry;
+     if (!entry || false) return entry;
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op for entries without context
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
  and 6 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:48:23
-     if (next.context && typeof next.context === 'object') {
+     if (next.context && true) {
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
  and 4 more tests!

[Survived] LogicalOperator
src/migrations/2026-05-02-tier-5-to-6.js:48:7
-     if (next.context && typeof next.context === 'object') {
+     if (next.context || typeof next.context === 'object') {
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op for entries without context
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
  and 6 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:52:7
-     if ('calibrationLevel' in next && typeof next.calibrationLevel === 'object') {
+     if (true) {
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op for entries without context
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
  and 6 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:52:37
-     if ('calibrationLevel' in next && typeof next.calibrationLevel === 'object') {
+     if ('calibrationLevel' in next && true) {
Tests ran:
    migration 5→6 tiers — migrate(entry) handles legacy entry-root calibrationLevel shape

[Survived] LogicalOperator
src/migrations/2026-05-02-tier-5-to-6.js:52:7
-     if ('calibrationLevel' in next && typeof next.calibrationLevel === 'object') {
+     if ('calibrationLevel' in next || typeof next.calibrationLevel === 'object') {
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op for entries without context
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
  and 6 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:60:7
-     if (lvl == null) return ctx;
+     if (false) return ctx;
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is null
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:61:7
-     if (typeof lvl === 'string') return ctx;       // name-only: names didn't change
+     if (false) return ctx;       // name-only: names didn't change
Tests ran:
    migration 5→6 tiers — migrate(entry) is a no-op when calibrationLevel is a string (names unchanged)
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
    migration 5→6 tiers — migrate(entry) remaps OPTIMIZED 4→5
  and 3 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:62:7
-     if (typeof lvl !== 'object') return ctx;
+     if (false) return ctx;
Tests ran:
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
    migration 5→6 tiers — migrate(entry) remaps OPTIMIZED 4→5
    migration 5→6 tiers — migrate(entry) does not mutate the original entry (immutability)
  and 2 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:67:7
-     if (!lvl || typeof lvl !== 'object') return lvl;
+     if (false) return lvl;
Tests ran:
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
    migration 5→6 tiers — migrate(entry) remaps OPTIMIZED 4→5
    migration 5→6 tiers — migrate(entry) does not mutate the original entry (immutability)
  and 3 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:67:15
-     if (!lvl || typeof lvl !== 'object') return lvl;
+     if (!lvl || false) return lvl;
Tests ran:
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
    migration 5→6 tiers — migrate(entry) remaps OPTIMIZED 4→5
    migration 5→6 tiers — migrate(entry) does not mutate the original entry (immutability)
  and 3 more tests!

[Survived] LogicalOperator
src/migrations/2026-05-02-tier-5-to-6.js:67:7
-     if (!lvl || typeof lvl !== 'object') return lvl;
+     if (!lvl && typeof lvl !== 'object') return lvl;
Tests ran:
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
    migration 5→6 tiers — migrate(entry) remaps OPTIMIZED 4→5
    migration 5→6 tiers — migrate(entry) does not mutate the original entry (immutability)
  and 3 more tests!

[Survived] ConditionalExpression
src/migrations/2026-05-02-tier-5-to-6.js:68:7
-     if (typeof lvl.id !== 'number') return lvl;
+     if (false) return lvl;
Tests ran:
    migration 5→6 tiers — migrate(entry) remaps numeric id on context.calibrationLevel object
    migration 5→6 tiers — migrate(entry) remaps OPTIMIZED 4→5
    migration 5→6 tiers — migrate(entry) does not mutate the original entry (immutability)
  and 3 more tests!

[NoCoverage] ObjectLiteral
src/migrations/migrationRunner.js:50:33
-     const sentry = opts.sentry ?? { captureException: sentryCaptureException };
+     const sentry = opts.sentry ?? {};

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:53:37
-     if (!Array.isArray(migrations) || migrations.length === 0) {
+     if (!Array.isArray(migrations) || false) {
Tests ran:
    migrationRunner — empty / no-op cases returns zero-state result when migrations array is empty
    migrationRunner — empty / no-op cases skips storage keys with null entries (no app data yet)
    migrationRunner — empty / no-op cases logs warning + skips non-array values at storage key
  and 18 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:75:9
-           logger.warn?.(`[Migrations] Failed to read storage key '${key}':`, err);
+           logger.warn(`[Migrations] Failed to read storage key '${key}':`, err);
Tests ran:
    migrationRunner — failsafe on migrate() throws captures DB.get failure + skips key

[Survived] ObjectLiteral
src/migrations/migrationRunner.js:77:21
-           errors.push({ ...ctx, reason: _stringifyError(err) });
+           errors.push({});
Tests ran:
    migrationRunner — failsafe on migrate() throws captures DB.get failure + skips key

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:80:11
-         if (entries == null) continue;
+         if (false) continue;
Tests ran:
    migrationRunner — empty / no-op cases skips storage keys with null entries (no app data yet)
    migrationRunner — empty / no-op cases logs warning + skips non-array values at storage key
    migrationRunner — single migration migrates v1 entries to v2 and persists with schemaVersion bumped
  and 16 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:82:9
-           logger.warn?.(`[Migrations] Storage key '${key}' is not an array (got ${typeof entries}) — skipping`);
+           logger.warn(`[Migrations] Storage key '${key}' is not an array (got ${typeof entries}) — skipping`);
Tests ran:
    migrationRunner — empty / no-op cases logs warning + skips non-array values at storage key

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:103:28
-             if (!migrated || typeof migrated !== 'object' || Array.isArray(migrated)) {
+             if (!migrated || false || Array.isArray(migrated)) {
Tests ran:
    migrationRunner — single migration migrates v1 entries to v2 and persists with schemaVersion bumped
    migrationRunner — single migration skips entries already at or above toVersion (idempotent)
    migrationRunner — single migration re-running runMigrations after a successful pass is a no-op
  and 10 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:114:22
-               entryId: entry?.id ?? null,
+               entryId: entry.id ?? null,
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 2 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:117:11
-             logger.error?.(`[Migrations] CRITICAL: migrate() threw on '${key}':`, err, ctx);
+             logger.error(`[Migrations] CRITICAL: migrate() threw on '${key}':`, err, ctx);
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 2 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:129:9
-           logger.error?.(`[Migrations] CRITICAL: persist failed for '${key}':`, err);
+           logger.error(`[Migrations] CRITICAL: persist failed for '${key}':`, err);
Tests ran:
    migrationRunner — failsafe on migrate() throws captures + reports DB.set failure as critical

[Survived] OptionalChaining
src/migrations/migrationRunner.js:138:5
-       logger.log?.(
-         `[Migrations] ${description} (v${fromVersion}→v${toVersion}): ${migratedThisMigration} entries migrated across [${storageKeys.join(', ')}]`
-       );
+       logger.log(`[Migrations] ${description} (v${fromVersion}→v${toVersion}): ${migratedThisMigration} entries migrated across [${storageKeys.join(', ')}]`);
Tests ran:
    migrationRunner — empty / no-op cases skips storage keys with null entries (no app data yet)
    migrationRunner — empty / no-op cases logs warning + skips non-array values at storage key
    migrationRunner — single migration migrates v1 entries to v2 and persists with schemaVersion bumped
  and 17 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:143:7
-         logger.warn?.(
-           `[Migrations] Large migration: ${migratedThisMigration} entries (> ${LARGE_MIGRATION_THRESHOLD}) for '${description}'`
-         );
+         logger.warn(`[Migrations] Large migration: ${migratedThisMigration} entries (> ${LARGE_MIGRATION_THRESHOLD}) for '${description}'`);
Tests ran:
    migrationRunner — fix-loud large migrations (DP-5) fires Sentry warning when count exceeds LARGE_MIGRATION_THRESHOLD

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:164:7
-     if (!sentry?.captureException) return;
+     if (false) return;
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 5 more tests!

[Survived] OptionalChaining
src/migrations/migrationRunner.js:164:8
-     if (!sentry?.captureException) return;
+     if (!sentry.captureException) return;
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 5 more tests!

[Survived] BlockStatement
src/migrations/migrationRunner.js:169:31
-   function _stringifyError(err) {
-     if (!err) return 'unknown';
-     if (err instanceof Error) return err.message || err.toString();
-     return String(err);
-   }
+   function _stringifyError(err) {}
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] BooleanLiteral
src/migrations/migrationRunner.js:170:7
-     if (!err) return 'unknown';
+     if (err) return 'unknown';
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:170:7
-     if (!err) return 'unknown';
+     if (true) return 'unknown';
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:170:7
-     if (!err) return 'unknown';
+     if (false) return 'unknown';
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:171:7
-     if (err instanceof Error) return err.message || err.toString();
+     if (true) return err.message || err.toString();
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:171:7
-     if (err instanceof Error) return err.message || err.toString();
+     if (false) return err.message || err.toString();
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:171:36
-     if (err instanceof Error) return err.message || err.toString();
+     if (err instanceof Error) return true;
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[Survived] ConditionalExpression
src/migrations/migrationRunner.js:171:36
-     if (err instanceof Error) return err.message || err.toString();
+     if (err instanceof Error) return false;
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!
