[Survived] LogicalOperator
src/migrations/migrationRunner.js:171:36
-     if (err instanceof Error) return err.message || err.toString();
+     if (err instanceof Error) return err.message && err.toString();
Tests ran:
    migrationRunner — chained migrations M2 skips v1 entries when M1 partial-failed (chain integrity, audit HIGH-1)
    migrationRunner — failsafe on migrate() throws persists already-migrated entries + leaves rest at original version
    migrationRunner — failsafe on migrate() throws does not throw — app continues în graceful degradation
  and 4 more tests!

[NoCoverage] BlockStatement
src/pages/coach/aaFrictionModal.js:29:11
-     } catch {
-       return false;
-     }
+     } catch {}

[NoCoverage] BooleanLiteral
src/pages/coach/aaFrictionModal.js:30:12
-       return false;
+       return true;

[NoCoverage] BlockStatement
src/pages/coach/aaFrictionModal.js:58:11
-     } catch {
-       return false;
-     }
+     } catch {}

[NoCoverage] BooleanLiteral
src/pages/coach/aaFrictionModal.js:59:12
-       return false;
+       return true;

[NoCoverage] BlockStatement
src/pages/coach/aaFrictionModal.js:79:11
-     } catch {
-       return null;
-     }
+     } catch {}

[NoCoverage] ArrayDeclaration
src/pages/coach/aaFrictionModal.js:87:40
-     const reduced = session.exercises ?? [];
+     const reduced = session.exercises ?? ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/aaFrictionModal.js:109:18
-       if (state && state.sessionDate !== today) {
+       if (state && true) {

[NoCoverage] EqualityOperator
src/pages/coach/aaFrictionModal.js:109:18
-       if (state && state.sessionDate !== today) {
+       if (state && state.sessionDate === today) {

[NoCoverage] BlockStatement
src/pages/coach/aaFrictionModal.js:109:47
-       if (state && state.sessionDate !== today) {
-         clearPendingState();
-         state = null;
-       }
+       if (state && state.sessionDate !== today) {}

[Survived] BlockStatement
src/pages/coach/aaFrictionModal.js:64:7
-     try {
-       localStorage.setItem(FRICTION_PENDING_KEY, JSON.stringify(state));
-     } catch { /* degraded — storage full */ }
+     try {} catch { /* degraded — storage full */ }
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BlockStatement
src/pages/coach/aaFrictionModal.js:63:35
-   function writePendingState(state) {
-     try {
-       localStorage.setItem(FRICTION_PENDING_KEY, JSON.stringify(state));
-     } catch { /* degraded — storage full */ }
-   }
+   function writePendingState(state) {}
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BlockStatement
src/pages/coach/aaFrictionModal.js:75:29
-   function readPendingState() {
-     try {
-       const raw = localStorage.getItem(FRICTION_PENDING_KEY);
-       return raw ? JSON.parse(raw) : null;
-     } catch {
-       return null;
-     }
-   }
+   function readPendingState() {}
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BlockStatement
src/pages/coach/aaFrictionModal.js:76:7
-     try {
-       const raw = localStorage.getItem(FRICTION_PENDING_KEY);
-       return raw ? JSON.parse(raw) : null;
-     } catch {
+     try {} catch {
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:91:12
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${(e.name ?? e.ex) && '?'} ${e.sets}×${e.reps || 8}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:91:12
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name && e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:91:47
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${true}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:91:47
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${false}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:91:47
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps && 8}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:94:12
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${(e.name ?? e.ex) && '?'} ${e.sets}×${e.reps || 8}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:94:12
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name && e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:94:47
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${true}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:94:47
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${false}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:94:47
-       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps || 8}</li>`
+       `<li>${e.name ?? e.ex ?? '?'} ${e.sets}×${e.reps && 8}</li>`
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:109:9
-       if (state && state.sessionDate !== today) {
+       if (true) {
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:109:9
-       if (state && state.sessionDate !== today) {
+       if (false) {
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BooleanLiteral
src/pages/coach/aaFrictionModal.js:113:9
-       if (!state) {
+       if (state) {
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:113:9
-       if (!state) {
+       if (true) {
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:113:9
-       if (!state) {
+       if (false) {
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BlockStatement
src/pages/coach/aaFrictionModal.js:113:17
-       if (!state) {
-         state = { sessionDate: today };
-         writePendingState(state);
-       }
+       if (!state) {}
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ObjectLiteral
src/pages/coach/aaFrictionModal.js:114:15
-         state = { sessionDate: today };
+         state = {};
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:167:11
-         if (resolved) return;
+         if (false) return;
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BooleanLiteral
src/pages/coach/aaFrictionModal.js:168:18
-         resolved = true;
+         resolved = false;
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:172:13
-           if (backdrop.parentNode) backdrop.parentNode.removeChild(backdrop);
+           if (true) backdrop.parentNode.removeChild(backdrop);
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:172:13
-           if (backdrop.parentNode) backdrop.parentNode.removeChild(backdrop);
+           if (false) backdrop.parentNode.removeChild(backdrop);
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BlockStatement
src/pages/coach/aaFrictionModal.js:200:50
-       handle.addEventListener('touchstart', (e) => {
-         touchStartY = e.touches[0].clientY;
-         swipeCancelled = false;
-       }, { passive: true });
+       handle.addEventListener('touchstart', (e) => {}, { passive: true });
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] BooleanLiteral
src/pages/coach/aaFrictionModal.js:198:26
-       let swipeCancelled = false;
+       let swipeCancelled = true;
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ObjectLiteral
src/pages/coach/aaFrictionModal.js:203:8
-       }, { passive: true });
+       }, {});
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BooleanLiteral
src/pages/coach/aaFrictionModal.js:203:19
-       }, { passive: true });
+       }, { passive: false });
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:206:11
-         if (swipeCancelled || resolved) return;
+         if (false) return;
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] LogicalOperator
src/pages/coach/aaFrictionModal.js:206:11
-         if (swipeCancelled || resolved) return;
+         if (swipeCancelled && resolved) return;
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] ArithmeticOperator
src/pages/coach/aaFrictionModal.js:207:21
-         const delta = e.touches[0].clientY - touchStartY;
+         const delta = e.touches[0].clientY + touchStartY;
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] ConditionalExpression
src/pages/coach/aaFrictionModal.js:208:11
-         if (delta > 100) {
+         if (true) {
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] EqualityOperator
src/pages/coach/aaFrictionModal.js:208:11
-         if (delta > 100) {
+         if (delta >= 100) {
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] BooleanLiteral
src/pages/coach/aaFrictionModal.js:209:26
-           swipeCancelled = true;
+           swipeCancelled = false;
Tests ran:
    showAAFrictionModal — actions + sources swipe-down >100px resolves {source:"swipe"} + marks dismissed today

[Survived] ObjectLiteral
src/pages/coach/aaFrictionModal.js:213:8
-       }, { passive: true });
+       }, {});
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[Survived] BooleanLiteral
src/pages/coach/aaFrictionModal.js:213:19
-       }, { passive: true });
+       }, { passive: false });
Tests ran:
    showAAFrictionModal — DOM structure (anti-RE) mounts with neutral title — no "signals", no count
    showAAFrictionModal — DOM structure (anti-RE) shows comparison list (original strikethrough vs reduced) — visual UX preserved
    showAAFrictionModal — DOM structure (anti-RE) does NOT render signal list or typing input or escalation warning
  and 5 more tests!

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:13:7
-     if (!state.currentEx) return;
+     if (state.currentEx) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:13:7
-     if (!state.currentEx) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:13:7
-     if (!state.currentEx) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:15:21
-     const totalSets = EX_SETS[state.currentEx] || 3;
+     const totalSets = true;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:15:21
-     const totalSets = EX_SETS[state.currentEx] || 3;
+     const totalSets = false;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:15:21
-     const totalSets = EX_SETS[state.currentEx] || 3;
+     const totalSets = EX_SETS[state.currentEx] && 3;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:20:41
-     const glEl = $('ex-group-label'); if (glEl) glEl.textContent = grp;
+     const glEl = $('ex-group-label'); if (true) glEl.textContent = grp;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:20:41
-     const glEl = $('ex-group-label'); if (glEl) glEl.textContent = grp;
+     const glEl = $('ex-group-label'); if (false) glEl.textContent = grp;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:21:42
-     const ndEl = $('ex-name-display'); if (ndEl) ndEl.textContent = state.currentEx;
+     const ndEl = $('ex-name-display'); if (true) ndEl.textContent = state.currentEx;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:21:42
-     const ndEl = $('ex-name-display'); if (ndEl) ndEl.textContent = state.currentEx;
+     const ndEl = $('ex-name-display'); if (false) ndEl.textContent = state.currentEx;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:24:7
-     if (pb) { pb.textContent = rec.statusLabel; pb.style.background = rec.statusColor + '22'; pb.style.color = rec.statusColor; pb.style.border = `1px solid ${rec.statusColor}44`; }
+     if (true) { pb.textContent = rec.statusLabel; pb.style.background = rec.statusColor + '22'; pb.style.color = rec.statusColor; pb.style.border = `1px solid ${rec.statusColor}44`; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:24:7
-     if (pb) { pb.textContent = rec.statusLabel; pb.style.background = rec.statusColor + '22'; pb.style.color = rec.statusColor; pb.style.border = `1px solid ${rec.statusColor}44`; }
+     if (false) { pb.textContent = rec.statusLabel; pb.style.background = rec.statusColor + '22'; pb.style.color = rec.statusColor; pb.style.border = `1px solid ${rec.statusColor}44`; }

[NoCoverage] BlockStatement
src/pages/coach/logging.js:24:11
-     if (pb) { pb.textContent = rec.statusLabel; pb.style.background = rec.statusColor + '22'; pb.style.color = rec.statusColor; pb.style.border = `1px solid ${rec.statusColor}44`; }
+     if (pb) {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:27:7
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (true) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:27:7
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (false) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] BlockStatement
src/pages/coach/logging.js:27:13
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:27:61
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = true ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:27:61
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = false ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:27:61
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status !== 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:27:105
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : true ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:27:105
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : false ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:27:105
-     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status === 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }
+     if (kbEl) { kbEl.textContent = rec.kg; kbEl.style.color = rec.status === 'TOO HEAVY' ? 'var(--red)' : rec.status !== 'INCREASE' ? 'var(--green)' : 'var(--accent)'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:28:39
-     const rbEl = $('rec-reps-big'); if (rbEl) rbEl.textContent = rec.repsTarget;
+     const rbEl = $('rec-reps-big'); if (true) rbEl.textContent = rec.repsTarget;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:28:39
-     const rbEl = $('rec-reps-big'); if (rbEl) rbEl.textContent = rec.repsTarget;
+     const rbEl = $('rec-reps-big'); if (false) rbEl.textContent = rec.repsTarget;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:30:7
-     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);
+     if (true) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:30:7
-     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);
+     if (false) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:30:55
-     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);
+     if (rirEl) rirEl.textContent = DP.getIntensityLabel((tempo?.rir ?? rec.rir) && 2);

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:30:55
-     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);
+     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo?.rir && rec.rir ?? 2);

[NoCoverage] OptionalChaining
src/pages/coach/logging.js:30:55
-     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo?.rir ?? rec.rir ?? 2);
+     if (rirEl) rirEl.textContent = DP.getIntensityLabel(tempo.rir ?? rec.rir ?? 2);

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:31:38
-     const sbEl = $('rec-set-big'); if (sbEl) sbEl.textContent = state.currentSet;
+     const sbEl = $('rec-set-big'); if (true) sbEl.textContent = state.currentSet;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:31:38
-     const sbEl = $('rec-set-big'); if (sbEl) sbEl.textContent = state.currentSet;
+     const sbEl = $('rec-set-big'); if (false) sbEl.textContent = state.currentSet;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:32:40
-     const stEl = $('rec-set-total'); if (stEl) stEl.textContent = `din ${totalSets}`;
+     const stEl = $('rec-set-total'); if (true) stEl.textContent = `din ${totalSets}`;
