[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:32:40
-     const stEl = $('rec-set-total'); if (stEl) stEl.textContent = `din ${totalSets}`;
+     const stEl = $('rec-set-total'); if (false) stEl.textContent = `din ${totalSets}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:36:7
-     if (lastPerfEl) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:36:7
-     if (lastPerfEl) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:36:19
-     if (lastPerfEl) {
-       lastPerfEl.style.display = 'block';
-       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${lastLog.reps || '?'} reps` : 'Prima sesiune la acest exercițiu';
-     }
+     if (lastPerfEl) {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:38:69
-       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${lastLog.reps || '?'} reps` : 'Prima sesiune la acest exercițiu';
+       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${true} reps` : 'Prima sesiune la acest exercițiu';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:38:69
-       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${lastLog.reps || '?'} reps` : 'Prima sesiune la acest exercițiu';
+       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${false} reps` : 'Prima sesiune la acest exercițiu';

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:38:69
-       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${lastLog.reps || '?'} reps` : 'Prima sesiune la acest exercițiu';
+       lastPerfEl.textContent = lastLog ? `Ultima: ${lastLog.w} kg × ${lastLog.reps && '?'} reps` : 'Prima sesiune la acest exercițiu';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:42:7
-     if (techniques.length) tempoTxt += ` · ${techniques[0].icon} ${techniques[0].label}`;
+     if (true) tempoTxt += ` · ${techniques[0].icon} ${techniques[0].label}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:42:7
-     if (techniques.length) tempoTxt += ` · ${techniques[0].icon} ${techniques[0].label}`;
+     if (false) tempoTxt += ` · ${techniques[0].icon} ${techniques[0].label}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:43:7
-     if (rec.technique) tempoTxt = `⚡ ${rec.technique} · ${tempoTxt}`;
+     if (true) tempoTxt = `⚡ ${rec.technique} · ${tempoTxt}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:43:7
-     if (rec.technique) tempoTxt = `⚡ ${rec.technique} · ${tempoTxt}`;
+     if (false) tempoTxt = `⚡ ${rec.technique} · ${tempoTxt}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:45:7
-     if (tempoRowEl) { tempoRowEl.textContent = tempoTxt; tempoRowEl.style.display = 'block'; }
+     if (true) { tempoRowEl.textContent = tempoTxt; tempoRowEl.style.display = 'block'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:45:7
-     if (tempoRowEl) { tempoRowEl.textContent = tempoTxt; tempoRowEl.style.display = 'block'; }
+     if (false) { tempoRowEl.textContent = tempoTxt; tempoRowEl.style.display = 'block'; }

[NoCoverage] BlockStatement
src/pages/coach/logging.js:45:19
-     if (tempoRowEl) { tempoRowEl.textContent = tempoTxt; tempoRowEl.style.display = 'block'; }
+     if (tempoRowEl) {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:48:7
-     if (msg) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:48:7
-     if (msg) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:48:12
-     if (msg) {
-       if (rec.autoAdjusted) {
-         msg.style.display = 'block';
-         msg.textContent = rec.autoAdjustMsg.includes('Trecem') ? `Greutatea ajustată automat · −${DP.getIncrement(state.currentEx)} kg` : `Greutatea ajustată automat · +${DP.getIncrement(state.currentEx)} kg`;
-         msg.style.background = rec.autoAdjustColor + '15';
-         msg.style.color = rec.autoAdjustColor;
-         msg.style.border = `2px solid ${rec.autoAdjustColor}44`;
-       } else if (rec.progressionStage >= 2) {
-         msg.style.display = 'block';
-         msg.textContent = rec.progressionNote;
-         msg.style.background = rec.statusColor + '15';
-         msg.style.color = rec.statusColor;
-         msg.style.border = `2px solid ${rec.statusColor}44`;
-       } else {
-         msg.style.display = 'none';
-       }
-     }
+     if (msg) {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:49:9
-       if (rec.autoAdjusted) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:49:9
-       if (rec.autoAdjusted) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:49:27
-       if (rec.autoAdjusted) {
-         msg.style.display = 'block';
-         msg.textContent = rec.autoAdjustMsg.includes('Trecem') ? `Greutatea ajustată automat · −${DP.getIncrement(state.currentEx)} kg` : `Greutatea ajustată automat · +${DP.getIncrement(state.currentEx)} kg`;
-         msg.style.background = rec.autoAdjustColor + '15';
-         msg.style.color = rec.autoAdjustColor;
-         msg.style.border = `2px solid ${rec.autoAdjustColor}44`;
-       } else if (rec.progressionStage >= 2) {
+       if (rec.autoAdjusted) {} else if (rec.progressionStage >= 2) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:55:16
-       } else if (rec.progressionStage >= 2) {
+       } else if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:55:16
-       } else if (rec.progressionStage >= 2) {
+       } else if (false) {

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:55:16
-       } else if (rec.progressionStage >= 2) {
+       } else if (rec.progressionStage > 2) {

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:55:16
-       } else if (rec.progressionStage >= 2) {
+       } else if (rec.progressionStage < 2) {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:55:43
-       } else if (rec.progressionStage >= 2) {
-         msg.style.display = 'block';
-         msg.textContent = rec.progressionNote;
-         msg.style.background = rec.statusColor + '15';
-         msg.style.color = rec.statusColor;
-         msg.style.border = `2px solid ${rec.statusColor}44`;
-       } else {
+       } else if (rec.progressionStage >= 2) {} else {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:61:12
-       } else {
-         msg.style.display = 'none';
-       }
+       } else {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:67:7
-     if (sdEl) sdEl.innerHTML = Array.from({ length: totalSets }, (_, i) => `
+     if (true) sdEl.innerHTML = Array.from({ length: totalSets }, (_, i) => `

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:67:7
-     if (sdEl) sdEl.innerHTML = Array.from({ length: totalSets }, (_, i) => `
+     if (false) sdEl.innerHTML = Array.from({ length: totalSets }, (_, i) => `

[NoCoverage] ObjectLiteral
src/pages/coach/logging.js:67:41
-     if (sdEl) sdEl.innerHTML = Array.from({ length: totalSets }, (_, i) => `
+     if (sdEl) sdEl.innerHTML = Array.from({}, (_, i) => `

[NoCoverage] ArrowFunction
src/pages/coach/logging.js:67:64
-     if (sdEl) sdEl.innerHTML = Array.from({ length: totalSets }, (_, i) => `
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
-     `).join('');
+     if (sdEl) sdEl.innerHTML = Array.from({ length: totalSets }, () => undefined).join('');

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:68:66
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${true ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:68:66
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${false ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:68:66
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i <= state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:68:66
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i >= state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:68:70
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet + 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:68:111
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : true ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:68:111
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : false ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:68:111
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i !== state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:68:117
-       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet - 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>
+       <div style="flex:1;height:6px;border-radius:3px;background:${i < state.currentSet - 1 ? 'var(--accent)' : i === state.currentSet + 1 ? 'rgba(200,255,0,0.4)' : 'var(--bg3)'};transition:background .3s"></div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:72:39
-     const srEl = $('session-reps'); if (srEl) srEl.textContent = state.sessRepsInput;
+     const srEl = $('session-reps'); if (true) srEl.textContent = state.sessRepsInput;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:72:39
-     const srEl = $('session-reps'); if (srEl) srEl.textContent = state.sessRepsInput;
+     const srEl = $('session-reps'); if (false) srEl.textContent = state.sessRepsInput;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:74:38
-     const saEl = $('set-actions'); if (saEl) saEl.style.display = 'flex';
+     const saEl = $('set-actions'); if (true) saEl.style.display = 'flex';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:74:38
-     const saEl = $('set-actions'); if (saEl) saEl.style.display = 'flex';
+     const saEl = $('set-actions'); if (false) saEl.style.display = 'flex';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:75:37
-     const riEl = $('rpe-inline'); if (riEl) riEl.style.display = 'none';
+     const riEl = $('rpe-inline'); if (true) riEl.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:75:37
-     const riEl = $('rpe-inline'); if (riEl) riEl.style.display = 'none';
+     const riEl = $('rpe-inline'); if (false) riEl.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:76:37
-     const rsEl = $('rpe-screen'); if (rsEl) rsEl.style.display = 'none';
+     const rsEl = $('rpe-screen'); if (true) rsEl.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:76:37
-     const rsEl = $('rpe-screen'); if (rsEl) rsEl.style.display = 'none';
+     const rsEl = $('rpe-screen'); if (false) rsEl.style.display = 'none';

[NoCoverage] BlockStatement
src/pages/coach/logging.js:81:27
-   export function setDone() {
-     if (!state.currentEx) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }
-     beepDone();
-     const sa = $('set-actions'); if (sa) sa.style.display = 'none';
-     const ri = $('rpe-inline'); if (ri) ri.style.display = 'block';
-   }
+   export function setDone() {}

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:82:7
-     if (!state.currentEx) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }
+     if (state.currentEx) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:82:7
-     if (!state.currentEx) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }
+     if (true) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:82:7
-     if (!state.currentEx) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }
+     if (false) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }

[NoCoverage] BlockStatement
src/pages/coach/logging.js:82:25
-     if (!state.currentEx) { toast('⚠ Selectează exercițiu', 'var(--accent2)'); return; }
+     if (!state.currentEx) {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:84:36
-     const sa = $('set-actions'); if (sa) sa.style.display = 'none';
+     const sa = $('set-actions'); if (true) sa.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:84:36
-     const sa = $('set-actions'); if (sa) sa.style.display = 'none';
+     const sa = $('set-actions'); if (false) sa.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:85:35
-     const ri = $('rpe-inline'); if (ri) ri.style.display = 'block';
+     const ri = $('rpe-inline'); if (true) ri.style.display = 'block';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:85:35
-     const ri = $('rpe-inline'); if (ri) ri.style.display = 'block';
+     const ri = $('rpe-inline'); if (false) ri.style.display = 'block';

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:88:39
-   export function confirmReps(skipped = false) {
+   export function confirmReps(skipped = true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:90:35
-     const ri = $('rpe-inline'); if (ri) ri.style.display = 'none';
+     const ri = $('rpe-inline'); if (true) ri.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:90:35
-     const ri = $('rpe-inline'); if (ri) ri.style.display = 'none';
+     const ri = $('rpe-inline'); if (false) ri.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:93:21
-     const totalSets = EX_SETS[state.currentEx] || 3;
+     const totalSets = true;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:93:21
-     const totalSets = EX_SETS[state.currentEx] || 3;
+     const totalSets = false;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:93:21
-     const totalSets = EX_SETS[state.currentEx] || 3;
+     const totalSets = EX_SETS[state.currentEx] && 3;

[NoCoverage] ArrayDeclaration
src/pages/coach/logging.js:98:3
-     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {
+     [].forEach(label => {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:98:56
-     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {
-       const btn = $(`rpe-btn-${label}`);
-       if (btn) btn.classList.remove('sel');
-     });
+     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {});

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:100:9
-       if (btn) btn.classList.remove('sel');
+       if (true) btn.classList.remove('sel');

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:100:9
-       if (btn) btn.classList.remove('sel');
+       if (false) btn.classList.remove('sel');

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:103:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:103:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:103:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/logging.js:103:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/pages/coach/logging.js:104:19
-     const noteArr = [...state.activeNotes]; resetNotes();
+     const noteArr = []; resetNotes();

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:105:17
-     const logKg = state.sessionKgOverride !== null ? state.sessionKgOverride : rec.kg;
+     const logKg = true ? state.sessionKgOverride : rec.kg;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:105:17
-     const logKg = state.sessionKgOverride !== null ? state.sessionKgOverride : rec.kg;
+     const logKg = false ? state.sessionKgOverride : rec.kg;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:105:17
-     const logKg = state.sessionKgOverride !== null ? state.sessionKgOverride : rec.kg;
+     const logKg = state.sessionKgOverride === null ? state.sessionKgOverride : rec.kg;

[NoCoverage] ObjectLiteral
src/pages/coach/logging.js:107:20
-     const logEntry = { date: tod(), ex: state.currentEx, w: logKg, kg: logKg, set: state.currentSet, sets: 1, reps: String(state.sessRepsInput), notes: noteArr, ts: Date.now(), session: state.sessStart };
+     const logEntry = {};

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:108:7
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (true) logEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:108:7
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (false) logEntry.rpe = rpe;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:108:7
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (rpe !== undefined || rpe !== null) logEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:108:7
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (true && rpe !== null) logEntry.rpe = rpe;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:108:7
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (rpe === undefined && rpe !== null) logEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:108:28
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (rpe !== undefined && true) logEntry.rpe = rpe;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:108:28
-     if (rpe !== undefined && rpe !== null) logEntry.rpe = rpe;
+     if (rpe !== undefined && rpe === null) logEntry.rpe = rpe;

[NoCoverage] MethodExpression
src/pages/coach/logging.js:110:18
-     DB.set('logs', logs.slice(0, 5000));
+     DB.set('logs', logs);

[NoCoverage] ObjectLiteral
src/pages/coach/logging.js:111:21
-     const sessEntry = { ex: state.currentEx, w: logKg, set: state.currentSet, reps: String(state.sessRepsInput) };
+     const sessEntry = {};

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:112:7
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (true) sessEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:112:7
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (false) sessEntry.rpe = rpe;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:112:7
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (rpe !== undefined || rpe !== null) sessEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:112:7
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (true && rpe !== null) sessEntry.rpe = rpe;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:112:7
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (rpe === undefined && rpe !== null) sessEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:112:28
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (rpe !== undefined && true) sessEntry.rpe = rpe;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:112:28
-     if (rpe !== undefined && rpe !== null) sessEntry.rpe = rpe;
+     if (rpe !== undefined && rpe === null) sessEntry.rpe = rpe;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:114:43
-     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;
+     const ssc = $('sess-progress-txt'); if (true) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:114:43
-     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;
+     const ssc = $('sess-progress-txt'); if (false) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:114:102
-     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;
+     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${true}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:114:102
-     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;
+     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${false}`;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:114:102
-     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises || getTodayExercises().length}`;
+     const ssc = $('sess-progress-txt'); if (ssc) ssc.textContent = `${state.completedExercises.size}/${state.sessionTotalExercises && getTodayExercises().length}`;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:118:7
-     if (state.currentSet >= totalSets) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:118:7
-     if (state.currentSet >= totalSets) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:118:7
-     if (state.currentSet >= totalSets) {
+     if (state.currentSet > totalSets) {

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:118:7
-     if (state.currentSet >= totalSets) {
+     if (state.currentSet < totalSets) {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:118:38
-     if (state.currentSet >= totalSets) {
-       state.completedExercises.add(state.currentEx);
-       updateSessionProgress();
-       const todayExs = getTodayExercises();
-       const idx = todayExs.indexOf(state.currentEx);
-       if (idx < todayExs.length - 1) {
-         const nextEx = todayExs[idx + 1];
-         const pauseSec = getSmartPause(state.currentEx);
-         state.currentEx = nextEx; state.currentSet = 1;
-         startPause(pauseSec, nextEx);
-       } else {
-         speak('Antrenament complet! Excelent!');
-         toast('✅ Toate exercițiile completate!', 'var(--green)');
-         endSession();
-       }
-     } else {
+     if (state.currentSet >= totalSets) {} else {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:123:9
-       if (idx < todayExs.length - 1) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:123:9
-       if (idx < todayExs.length - 1) {
+       if (false) {

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:123:9
-       if (idx < todayExs.length - 1) {
+       if (idx <= todayExs.length - 1) {

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:123:9
-       if (idx < todayExs.length - 1) {
+       if (idx >= todayExs.length - 1) {

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:123:15
-       if (idx < todayExs.length - 1) {
+       if (idx < todayExs.length + 1) {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:123:36
-       if (idx < todayExs.length - 1) {
-         const nextEx = todayExs[idx + 1];
-         const pauseSec = getSmartPause(state.currentEx);
-         state.currentEx = nextEx; state.currentSet = 1;
-         startPause(pauseSec, nextEx);
-       } else {
+       if (idx < todayExs.length - 1) {} else {

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:124:31
-         const nextEx = todayExs[idx + 1];
+         const nextEx = todayExs[idx - 1];

[NoCoverage] BlockStatement
src/pages/coach/logging.js:128:12
-       } else {
-         speak('Antrenament complet! Excelent!');
-         toast('✅ Toate exercițiile completate!', 'var(--green)');
-         endSession();
-       }
+       } else {}

[NoCoverage] BlockStatement
src/pages/coach/logging.js:133:10
-     } else {
-       state.currentSet++;
-       startPause(getSmartPause(state.currentEx), state.currentEx);
-     }
+     } else {}

[NoCoverage] UpdateOperator
src/pages/coach/logging.js:134:5
-       state.currentSet++;
+       state.currentSet--;

[NoCoverage] BlockStatement
src/pages/coach/logging.js:140:32
-   export function selectRPE(rpe) {
-     state.lastSetRPE = rpe;
-     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {
-       const btn = $(`rpe-btn-${label}`);
-       if (btn) btn.classList.remove('sel');
-     });
-     const labelMap = { 6.5: 'easy', 8: 'ok', 9: 'hard', 10: 'very-hard' };
-     const selBtn = $(`rpe-btn-${labelMap[rpe]}`);
-     if (selBtn) selBtn.classList.add('sel');
-   }
+   export function selectRPE(rpe) {}

[NoCoverage] ArrayDeclaration
src/pages/coach/logging.js:142:3
-     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {
+     [].forEach(label => {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:142:56
-     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {
-       const btn = $(`rpe-btn-${label}`);
-       if (btn) btn.classList.remove('sel');
-     });
+     ['easy', 'ok', 'hard', 'very-hard'].forEach(label => {});

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:144:9
-       if (btn) btn.classList.remove('sel');
+       if (true) btn.classList.remove('sel');

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:144:9
-       if (btn) btn.classList.remove('sel');
+       if (false) btn.classList.remove('sel');

[NoCoverage] ObjectLiteral
src/pages/coach/logging.js:146:20
-     const labelMap = { 6.5: 'easy', 8: 'ok', 9: 'hard', 10: 'very-hard' };
+     const labelMap = {};

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:148:7
-     if (selBtn) selBtn.classList.add('sel');
+     if (true) selBtn.classList.add('sel');

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:148:7
-     if (selBtn) selBtn.classList.add('sel');
+     if (false) selBtn.classList.add('sel');

[NoCoverage] BlockStatement
src/pages/coach/logging.js:153:35
-   export function adjSessionReps(d) {
-     state.sessRepsInput = Math.max(1, Math.min(30, state.sessRepsInput + d));
-     $('session-reps').textContent = state.sessRepsInput;
-   }
+   export function adjSessionReps(d) {}
