[NoCoverage] MethodExpression
src/pages/coach/logging.js:154:25
-     state.sessRepsInput = Math.max(1, Math.min(30, state.sessRepsInput + d));
+     state.sessRepsInput = Math.min(1, Math.min(30, state.sessRepsInput + d));

[NoCoverage] MethodExpression
src/pages/coach/logging.js:154:37
-     state.sessRepsInput = Math.max(1, Math.min(30, state.sessRepsInput + d));
+     state.sessRepsInput = Math.max(1, Math.max(30, state.sessRepsInput + d));

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:154:50
-     state.sessRepsInput = Math.max(1, Math.min(30, state.sessRepsInput + d));
+     state.sessRepsInput = Math.max(1, Math.min(30, state.sessRepsInput - d));

[NoCoverage] BlockStatement
src/pages/coach/logging.js:158:33
-   export function renderSessLog() {
-     const sl = $('sess-log');
-     if (!sl) return;
-     if (!state.sessLog.length) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }
-     sl.innerHTML = [...state.sessLog].reverse().map(s => {
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
-       return `<div style="padding:10px 14px;border-bottom:1px solid var(--border);display:flex;justify-content:space-between;align-items:center">
-         <div>
-           <div style="font-size:12px;font-weight:500">${s.ex}</div>
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
-         </div>
-         <div style="display:flex;align-items:center;gap:8px">
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
-           <span style="font-size:9px;font-weight:700;padding:2px 6px;border-radius:4px;background:${nc}22;color:${nc}">${nx}</span>
-         </div>
-       </div>`;
-     }).join('');
-   }
+   export function renderSessLog() {}

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:160:7
-     if (!sl) return;
+     if (sl) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:160:7
-     if (!sl) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:160:7
-     if (!sl) return;
+     if (false) return;

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:161:7
-     if (!state.sessLog.length) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }
+     if (state.sessLog.length) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:161:7
-     if (!state.sessLog.length) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }
+     if (true) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:161:7
-     if (!state.sessLog.length) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }
+     if (false) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }

[NoCoverage] BlockStatement
src/pages/coach/logging.js:161:30
-     if (!state.sessLog.length) { sl.innerHTML = '<div style="padding:16px;text-align:center;color:var(--text3);font-size:12px">Niciun set</div>'; return; }
+     if (!state.sessLog.length) {}

[NoCoverage] MethodExpression
src/pages/coach/logging.js:162:18
-     sl.innerHTML = [...state.sessLog].reverse().map(s => {
+     sl.innerHTML = [...state.sessLog].map(s => {

[NoCoverage] ArrayDeclaration
src/pages/coach/logging.js:162:18
-     sl.innerHTML = [...state.sessLog].reverse().map(s => {
+     sl.innerHTML = [].reverse().map(s => {

[NoCoverage] BlockStatement
src/pages/coach/logging.js:162:56
-     sl.innerHTML = [...state.sessLog].reverse().map(s => {
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
-       return `<div style="padding:10px 14px;border-bottom:1px solid var(--border);display:flex;justify-content:space-between;align-items:center">
-         <div>
-           <div style="font-size:12px;font-weight:500">${s.ex}</div>
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
-         </div>
-         <div style="display:flex;align-items:center;gap:8px">
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
-           <span style="font-size:9px;font-weight:700;padding:2px 6px;border-radius:4px;background:${nc}22;color:${nc}">${nx}</span>
-         </div>
-       </div>`;
-     }).join('');
+     sl.innerHTML = [...state.sessLog].reverse().map(s => {}).join('');

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:163:16
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = true ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:163:16
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = false ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:163:16
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = s.rpe > 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:163:16
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = s.rpe < 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:163:44
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = s.rpe >= 9 ? 'var(--red)' : true ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:163:44
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = s.rpe >= 9 ? 'var(--red)' : false ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:163:44
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe < 6.5 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:163:44
-       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6.5 ? 'var(--accent3)' : 'var(--green)';
+       const nc = s.rpe >= 9 ? 'var(--red)' : s.rpe > 6.5 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:164:16
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = true ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:164:16
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = false ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:164:16
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = s.rpe > 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:164:16
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = s.rpe < 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:164:39
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = s.rpe >= 9 ? 'SCADE' : true ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:164:39
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = s.rpe >= 9 ? 'SCADE' : false ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:164:39
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe < 6.5 ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:164:39
-       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe <= 6.5 ? 'CREȘTE' : 'MENȚINE';
+       const nx = s.rpe >= 9 ? 'SCADE' : s.rpe > 6.5 ? 'CREȘTE' : 'MENȚINE';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:168:99
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
+           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${true} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:168:99
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
+           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${false} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:168:99
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
+           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps && '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:168:120
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
+           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${true ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:168:120
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
+           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${false ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:168:120
-           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes && s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>
+           <div style="font-size:10px;color:var(--text2);margin-top:1px">Set ${s.set} · ${s.w}kg · ${s.reps || '?'} reps${s.notes || s.notes.length ? ' · <span style="color:var(--accent2)">' + s.notes.join(', ') + '</span>' : ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:171:40
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${true ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:171:40
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${false ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:171:40
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe > 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:171:40
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe < 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:171:60
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : true ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:171:60
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : false ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:171:60
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe > 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:171:60
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe < 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:171:80
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : true ? '🟡' : '🟢'}</span>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:171:80
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : false ? '🟡' : '🟢'}</span>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:171:80
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe > 7 ? '🟡' : '🟢'}</span>

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:171:80
-           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe >= 7 ? '🟡' : '🟢'}</span>
+           <span style="font-size:22px">${s.rpe >= 9 ? '🔴' : s.rpe >= 8 ? '🟠' : s.rpe < 7 ? '🟡' : '🟢'}</span>

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:180:19
-     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg || 20);
+     const startKg = true ? state.sessionKgOverride : (rec.kg || 20);

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:180:19
-     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg || 20);
+     const startKg = false ? state.sessionKgOverride : (rec.kg || 20);

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:180:19
-     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg || 20);
+     const startKg = state.sessionKgOverride === null ? state.sessionKgOverride : (rec.kg || 20);

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:180:81
-     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg || 20);
+     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (true);

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:180:81
-     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg || 20);
+     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (false);

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:180:81
-     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg || 20);
+     const startKg = state.sessionKgOverride !== null ? state.sessionKgOverride : (rec.kg && 20);

[NoCoverage] OptionalChaining
src/pages/coach/logging.js:184:3
-     document.getElementById('kg-edit-overlay')?.remove();
+     document.getElementById('kg-edit-overlay').remove();

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:192:40
-         <button onclick="adjSessionKg(-${step * 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">−${step * 2}</button>
+         <button onclick="adjSessionKg(-${step / 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">−${step * 2}</button>

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:192:266
-         <button onclick="adjSessionKg(-${step * 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">−${step * 2}</button>
+         <button onclick="adjSessionKg(-${step * 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">−${step / 2}</button>

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:196:39
-         <button onclick="adjSessionKg(${step * 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">+${step * 2}</button>
+         <button onclick="adjSessionKg(${step / 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">+${step * 2}</button>

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:196:265
-         <button onclick="adjSessionKg(${step * 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">+${step * 2}</button>
+         <button onclick="adjSessionKg(${step * 2})" style="width:58px;height:58px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace">+${step / 2}</button>

[NoCoverage] BlockStatement
src/pages/coach/logging.js:205:37
-   export function adjSessionKg(delta) {
-     window._kgOvVal = Math.round((window._kgOvVal + delta) * 10) / 10;
-     const el = document.getElementById('kg-ov-val');
-     if (el) el.textContent = window._kgOvVal;
-   }
+   export function adjSessionKg(delta) {}

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:206:21
-     window._kgOvVal = Math.round((window._kgOvVal + delta) * 10) / 10;
+     window._kgOvVal = Math.round((window._kgOvVal + delta) * 10) * 10;

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:206:32
-     window._kgOvVal = Math.round((window._kgOvVal + delta) * 10) / 10;
+     window._kgOvVal = Math.round((window._kgOvVal + delta) / 10) / 10;

[NoCoverage] ArithmeticOperator
src/pages/coach/logging.js:206:33
-     window._kgOvVal = Math.round((window._kgOvVal + delta) * 10) / 10;
+     window._kgOvVal = Math.round((window._kgOvVal - delta) * 10) / 10;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:208:7
-     if (el) el.textContent = window._kgOvVal;
+     if (true) el.textContent = window._kgOvVal;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:208:7
-     if (el) el.textContent = window._kgOvVal;
+     if (false) el.textContent = window._kgOvVal;

[NoCoverage] BlockStatement
src/pages/coach/logging.js:211:36
-   export function confirmSessionKg() {
-     const kg = window._kgOvVal;
-     if (!kg || kg <= 0) return;
-     state.sessionKgOverride = DP.roundToStep(kg, state.currentEx);
-     const big = $('rec-kg-big');
-     if (big) { big.textContent = state.sessionKgOverride; big.style.color = 'var(--accent2)'; }
-     document.getElementById('kg-edit-overlay')?.remove();
-     toast(`${state.sessionKgOverride} kg ✓`, 'var(--accent)');
-   }
+   export function confirmSessionKg() {}

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:213:7
-     if (!kg || kg <= 0) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:213:7
-     if (!kg || kg <= 0) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/pages/coach/logging.js:213:7
-     if (!kg || kg <= 0) return;
+     if (!kg && kg <= 0) return;

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:213:7
-     if (!kg || kg <= 0) return;
+     if (kg || kg <= 0) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:213:14
-     if (!kg || kg <= 0) return;
+     if (!kg || false) return;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:213:14
-     if (!kg || kg <= 0) return;
+     if (!kg || kg < 0) return;

[NoCoverage] EqualityOperator
src/pages/coach/logging.js:213:14
-     if (!kg || kg <= 0) return;
+     if (!kg || kg > 0) return;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:216:7
-     if (big) { big.textContent = state.sessionKgOverride; big.style.color = 'var(--accent2)'; }
+     if (true) { big.textContent = state.sessionKgOverride; big.style.color = 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:216:7
-     if (big) { big.textContent = state.sessionKgOverride; big.style.color = 'var(--accent2)'; }
+     if (false) { big.textContent = state.sessionKgOverride; big.style.color = 'var(--accent2)'; }

[NoCoverage] BlockStatement
src/pages/coach/logging.js:216:12
-     if (big) { big.textContent = state.sessionKgOverride; big.style.color = 'var(--accent2)'; }
+     if (big) {}

[NoCoverage] OptionalChaining
src/pages/coach/logging.js:217:3
-     document.getElementById('kg-edit-overlay')?.remove();
+     document.getElementById('kg-edit-overlay').remove();

[NoCoverage] BlockStatement
src/pages/coach/logging.js:221:33
-   export function confirmEditKg() { confirmSessionKg(); }
+   export function confirmEditKg() {}

[NoCoverage] BlockStatement
src/pages/coach/logging.js:223:30
-   export function toggleMute() {
-     state.isMuted = !state.isMuted;
-     DB.set('muted', state.isMuted);
-     const btn = $('mute-btn');
-     if (btn) btn.textContent = state.isMuted ? '🔇' : '🔊';
-   }
+   export function toggleMute() {}

[NoCoverage] BooleanLiteral
src/pages/coach/logging.js:224:19
-     state.isMuted = !state.isMuted;
+     state.isMuted = state.isMuted;

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:227:7
-     if (btn) btn.textContent = state.isMuted ? '🔇' : '🔊';
+     if (true) btn.textContent = state.isMuted ? '🔇' : '🔊';

[NoCoverage] ConditionalExpression
src/pages/coach/logging.js:227:7
-     if (btn) btn.textContent = state.isMuted ? '🔇' : '🔊';
+     if (false) btn.textContent = state.isMuted ? '🔇' : '🔊';

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:12:7
-     if (document.getElementById('readiness-modal')) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:12:7
-     if (document.getElementById('readiness-modal')) return;
+     if (false) return;

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:22:11
-           ${[1,2,3,4,5].map(v => `
+           ${[].map(v => `

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:22:27
-           ${[1,2,3,4,5].map(v => `
-             <button onclick="selectReadiness(${v})" style="flex:1;background:var(--bg3);border:1px solid var(--border);border-radius:12px;padding:14px 4px;cursor:pointer;transition:all .15s">
-               <div style="font-size:28px">${READINESS_LABELS[v].emoji}</div>
-               <div style="font-size:9px;color:var(--text3);margin-top:6px;line-height:1.3">${READINESS_LABELS[v].label}</div>
-             </button>`).join('')}
+           ${[1,2,3,4,5].map(() => undefined).join('')}

[NoCoverage] BlockStatement
src/pages/coach/modals.js:33:40
-   export function selectReadiness(value) {
-     saveReadiness(value);
-     const modal = document.getElementById('readiness-modal');
-     if (modal) modal.remove();
-     sessionCache.invalidate();
-     renderCoachIdle();
-     toast(`${READINESS_LABELS[value].emoji} ${READINESS_LABELS[value].label}`, 'var(--accent)');
-   }
+   export function selectReadiness(value) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:36:7
-     if (modal) modal.remove();
+     if (true) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:36:7
-     if (modal) modal.remove();
+     if (false) modal.remove();

[NoCoverage] BlockStatement
src/pages/coach/modals.js:42:33
-   export function showSkipModal() {
-     const modal = document.createElement('div');
-     modal.id = 'skip-modal';
-     modal.style.cssText = 'position:fixed;inset:0;background:rgba(0,0,0,0.75);z-index:8000;display:flex;align-items:flex-end;justify-content:center';
-     const dayMap = [6,0,1,2,3,4,5];
-     const tp = PROG ? PROG[dayMap[new Date().getDay()]] : null;
-     modal.innerHTML = `<div style="background:var(--bg2);border:1px solid var(--border);border-radius:16px 16px 0 0;width:100%;max-width:500px;padding:24px 20px 36px">
-       <div style="font-size:15px;font-weight:700;margin-bottom:16px">De ce sari azi?</div>
-       ${['Obosit / recuperare insuficientă','Lipsă timp','Durere / accidentare','Alt motiv'].map((reason) =>
-       ).join('')}
-       <button onclick="document.getElementById('skip-modal').remove()" style="margin-top:8px;background:none;border:none;color:var(--text3);font-size:12px;cursor:pointer;width:100%;text-align:center;padding:8px">Anulează</button>
-     </div>`;
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
-     document.body.appendChild(modal);
-   }
+   export function showSkipModal() {}

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:46:18
-     const dayMap = [6,0,1,2,3,4,5];
+     const dayMap = [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:50:7
-       ${['Obosit / recuperare insuficientă','Lipsă timp','Durere / accidentare','Alt motiv'].map((reason) =>
+       ${[].map((reason) =>

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:50:96
-       ${['Obosit / recuperare insuficientă','Lipsă timp','Durere / accidentare','Alt motiv'].map((reason) =>
+       ${['Obosit / recuperare insuficientă','Lipsă timp','Durere / accidentare','Alt motiv'].map(() => undefined

[NoCoverage] BlockStatement
src/pages/coach/modals.js:55:40
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => {});

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:55:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (true) modal.remove(); });

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:55:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (false) modal.remove(); });

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:55:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (e.target !== modal) modal.remove(); });
