[NoCoverage] BlockStatement
src/pages/coach/modals.js:59:37
-   export function confirmSkip(reason) {
-     const modal = document.getElementById('skip-modal');
-     if (modal) modal.remove();
-     const days = ['Duminică','Luni','Marți','Miercuri','Joi','Vineri','Sâmbătă'];
-     const skips = DB.get('workout-skips') || [];
-     skips.push({ date: tod(), dayOfWeek: days[new Date().getDay()], reason, ts: Date.now() });
-     DB.set('workout-skips', skips.slice(-100));
-     toast('📌 Skip înregistrat', 'var(--text2)');
-     renderCoachIdle();
-     if (window.renderDash) window.renderDash();
-   }
+   export function confirmSkip(reason) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:61:7
-     if (modal) modal.remove();
+     if (true) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:61:7
-     if (modal) modal.remove();
+     if (false) modal.remove();

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:62:16
-     const days = ['Duminică','Luni','Marți','Miercuri','Joi','Vineri','Sâmbătă'];
+     const days = [];

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:63:17
-     const skips = DB.get('workout-skips') || [];
+     const skips = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:63:17
-     const skips = DB.get('workout-skips') || [];
+     const skips = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:63:17
-     const skips = DB.get('workout-skips') || [];
+     const skips = DB.get('workout-skips') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:63:44
-     const skips = DB.get('workout-skips') || [];
+     const skips = DB.get('workout-skips') || ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:64:14
-     skips.push({ date: tod(), dayOfWeek: days[new Date().getDay()], reason, ts: Date.now() });
+     skips.push({});

[NoCoverage] MethodExpression
src/pages/coach/modals.js:65:27
-     DB.set('workout-skips', skips.slice(-100));
+     DB.set('workout-skips', skips);

[NoCoverage] UnaryOperator
src/pages/coach/modals.js:65:39
-     DB.set('workout-skips', skips.slice(-100));
+     DB.set('workout-skips', skips.slice(+100));

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:68:7
-     if (window.renderDash) window.renderDash();
+     if (true) window.renderDash();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:68:7
-     if (window.renderDash) window.renderDash();
+     if (false) window.renderDash();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:73:7
-     if (existing) existing.remove();
+     if (true) existing.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:73:7
-     if (existing) existing.remove();
+     if (false) existing.remove();

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:75:24
-     const ALTERNATIVES = {
-       'Lat Pulldown': [
-         { name: 'Cable Row', reason: 'Similar lat activation, horizontal pull' },
-         { name: 'Chest-Supported Row', reason: 'Spate complet, fără cablu' },
-       ],
-       'Cable Row': [
-         { name: 'Chest-Supported Row', reason: 'Identic, pe bancă' },
-         { name: 'Lat Pulldown', reason: 'Vertical pull, lat dominant' },
-       ],
-       'Pec Deck / Cable Fly': [
-         { name: 'Incline DB Press', reason: 'Presă + stretch piept' },
-         { name: 'Cable Fly', reason: 'Aceeași mișcare pe cablu' },
-       ],
-       'Leg Press': [
-         { name: 'Romanian Deadlift', reason: 'Posterior chain, fără aparat' },
-       ],
-       'Overhead Triceps': [
-         { name: 'Pushdown', reason: 'Triceps lateral+medial, același cablu' },
-       ],
-       'Pushdown': [
-         { name: 'Overhead Triceps', reason: 'Triceps lung, aceeași stivă' },
-       ],
-       'Bayesian Curl': [
-         { name: 'Incline DB Curl', reason: 'Biceps lung, unghi similar' },
-         { name: 'Cable Curl', reason: 'Tensiune constantă, cablu' },
-       ],
-     };
+     const ALTERNATIVES = {};

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:76:21
-       'Lat Pulldown': [
-         { name: 'Cable Row', reason: 'Similar lat activation, horizontal pull' },
-         { name: 'Chest-Supported Row', reason: 'Spate complet, fără cablu' },
-       ],
+       'Lat Pulldown': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:77:7
-         { name: 'Cable Row', reason: 'Similar lat activation, horizontal pull' },
+         {},

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:78:7
-         { name: 'Chest-Supported Row', reason: 'Spate complet, fără cablu' },
+         {},

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:80:18
-       'Cable Row': [
-         { name: 'Chest-Supported Row', reason: 'Identic, pe bancă' },
-         { name: 'Lat Pulldown', reason: 'Vertical pull, lat dominant' },
-       ],
+       'Cable Row': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:81:7
-         { name: 'Chest-Supported Row', reason: 'Identic, pe bancă' },
+         {},

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:82:7
-         { name: 'Lat Pulldown', reason: 'Vertical pull, lat dominant' },
+         {},

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:84:29
-       'Pec Deck / Cable Fly': [
-         { name: 'Incline DB Press', reason: 'Presă + stretch piept' },
-         { name: 'Cable Fly', reason: 'Aceeași mișcare pe cablu' },
-       ],
+       'Pec Deck / Cable Fly': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:85:7
-         { name: 'Incline DB Press', reason: 'Presă + stretch piept' },
+         {},

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:86:7
-         { name: 'Cable Fly', reason: 'Aceeași mișcare pe cablu' },
+         {},

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:88:18
-       'Leg Press': [
-         { name: 'Romanian Deadlift', reason: 'Posterior chain, fără aparat' },
-       ],
+       'Leg Press': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:89:7
-         { name: 'Romanian Deadlift', reason: 'Posterior chain, fără aparat' },
+         {},

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:91:25
-       'Overhead Triceps': [
-         { name: 'Pushdown', reason: 'Triceps lateral+medial, același cablu' },
-       ],
+       'Overhead Triceps': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:92:7
-         { name: 'Pushdown', reason: 'Triceps lateral+medial, același cablu' },
+         {},

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:94:17
-       'Pushdown': [
-         { name: 'Overhead Triceps', reason: 'Triceps lung, aceeași stivă' },
-       ],
+       'Pushdown': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:95:7
-         { name: 'Overhead Triceps', reason: 'Triceps lung, aceeași stivă' },
+         {},

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:97:22
-       'Bayesian Curl': [
-         { name: 'Incline DB Curl', reason: 'Biceps lung, unghi similar' },
-         { name: 'Cable Curl', reason: 'Tensiune constantă, cablu' },
-       ],
+       'Bayesian Curl': [],

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:98:7
-         { name: 'Incline DB Curl', reason: 'Biceps lung, unghi similar' },
+         {},

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:99:7
-         { name: 'Cable Curl', reason: 'Tensiune constantă, cablu' },
+         {},

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:103:16
-     const alts = ALTERNATIVES[exerciseName] || [];
+     const alts = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:103:16
-     const alts = ALTERNATIVES[exerciseName] || [];
+     const alts = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:103:16
-     const alts = ALTERNATIVES[exerciseName] || [];
+     const alts = ALTERNATIVES[exerciseName] && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:103:46
-     const alts = ALTERNATIVES[exerciseName] || [];
+     const alts = ALTERNATIVES[exerciseName] || ["Stryker was here"];

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:110:30
-       ${alts.length ? alts.map(a => `
-         <button onclick="selectAlternative('${exerciseName}','${a.name}')" style="display:block;width:100%;text-align:left;background:var(--card);border:1px solid var(--border);border-radius:var(--rs);padding:13px 16px;margin-bottom:8px;cursor:pointer">
-           <div style="font-size:13px;font-weight:600;color:var(--text)">${a.name}</div>
-           <div style="font-size:11px;color:var(--text3);margin-top:2px">${a.reason}</div>
-         </button>`).join('') : '<div style="font-size:12px;color:var(--text3);padding:12px">Nicio alternativă disponibilă — continuă cu exercițiul următor</div>'}
+       ${alts.length ? alts.map(() => undefined).join('') : '<div style="font-size:12px;color:var(--text3);padding:12px">Nicio alternativă disponibilă — continuă cu exercițiul următor</div>'}

[NoCoverage] BlockStatement
src/pages/coach/modals.js:118:40
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => {});

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:118:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (true) modal.remove(); });

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:118:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (false) modal.remove(); });

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:118:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (e.target !== modal) modal.remove(); });

[NoCoverage] BlockStatement
src/pages/coach/modals.js:122:58
-   export function selectAlternative(original, alternative) {
-     const modal = document.getElementById('alt-modal');
-     if (modal) modal.remove();
-     const occ = DB.get('equipment-occupied-session') || [];
-     if (!occ.includes(original)) occ.push(original);
-     DB.set('equipment-occupied-session', occ);
-     state.currentEx = alternative;
-     updateExCard();
-     toast(`Schimbat → ${alternative}`, 'var(--accent2)');
-   }
+   export function selectAlternative(original, alternative) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:124:7
-     if (modal) modal.remove();
+     if (true) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:124:7
-     if (modal) modal.remove();
+     if (false) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:125:15
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:125:15
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:125:15
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = DB.get('equipment-occupied-session') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:125:55
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = DB.get('equipment-occupied-session') || ["Stryker was here"];

[NoCoverage] BooleanLiteral
src/pages/coach/modals.js:126:7
-     if (!occ.includes(original)) occ.push(original);
+     if (occ.includes(original)) occ.push(original);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:126:7
-     if (!occ.includes(original)) occ.push(original);
+     if (true) occ.push(original);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:126:7
-     if (!occ.includes(original)) occ.push(original);
+     if (false) occ.push(original);

[NoCoverage] BlockStatement
src/pages/coach/modals.js:133:56
-   export function markEquipmentUnavailable(exerciseName) {
-     const modal = document.getElementById('alt-modal');
-     if (modal) modal.remove();
-     const unavail = DB.get('unavailable-equipment') || [];
-     if (!unavail.includes(exerciseName)) unavail.push(exerciseName);
-     DB.set('unavailable-equipment', unavail);
-     toast(`🚫 ${exerciseName} eliminat permanent`, 'var(--red)');
-     renderCoachIdle();
-   }
+   export function markEquipmentUnavailable(exerciseName) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:135:7
-     if (modal) modal.remove();
+     if (true) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:135:7
-     if (modal) modal.remove();
+     if (false) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:136:19
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:136:19
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:136:19
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = DB.get('unavailable-equipment') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:136:54
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = DB.get('unavailable-equipment') || ["Stryker was here"];

[NoCoverage] BooleanLiteral
src/pages/coach/modals.js:137:7
-     if (!unavail.includes(exerciseName)) unavail.push(exerciseName);
+     if (unavail.includes(exerciseName)) unavail.push(exerciseName);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:137:7
-     if (!unavail.includes(exerciseName)) unavail.push(exerciseName);
+     if (true) unavail.push(exerciseName);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:137:7
-     if (!unavail.includes(exerciseName)) unavail.push(exerciseName);
+     if (false) unavail.push(exerciseName);

[NoCoverage] BlockStatement
src/pages/coach/modals.js:143:44
-   export function markOccupied(exerciseName) {
-     if (state.sessActive) {
-       showAlternativeModal(exerciseName);
-       return;
-     }
-     const occ = DB.get('equipment-occupied-session') || [];
-     if (!occ.includes(exerciseName)) {
-       occ.push(exerciseName);
-       DB.set('equipment-occupied-session', occ);
-     }
-     toast(`⚠️ ${exerciseName} marcat ocupat`, 'var(--accent2)');
-     renderCoachIdle();
-   }
+   export function markOccupied(exerciseName) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:144:7
-     if (state.sessActive) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:144:7
-     if (state.sessActive) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/coach/modals.js:144:25
-     if (state.sessActive) {
-       showAlternativeModal(exerciseName);
-       return;
-     }
+     if (state.sessActive) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:148:15
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:148:15
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:148:15
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = DB.get('equipment-occupied-session') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:148:55
-     const occ = DB.get('equipment-occupied-session') || [];
+     const occ = DB.get('equipment-occupied-session') || ["Stryker was here"];

[NoCoverage] BooleanLiteral
src/pages/coach/modals.js:149:7
-     if (!occ.includes(exerciseName)) {
+     if (occ.includes(exerciseName)) {

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:149:7
-     if (!occ.includes(exerciseName)) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:149:7
-     if (!occ.includes(exerciseName)) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/coach/modals.js:149:36
-     if (!occ.includes(exerciseName)) {
-       occ.push(exerciseName);
-       DB.set('equipment-occupied-session', occ);
-     }
+     if (!occ.includes(exerciseName)) {}

[NoCoverage] OptionalChaining
src/pages/coach/modals.js:162:22
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());

[NoCoverage] OptionalChaining
src/pages/coach/modals.js:162:22
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:162:47
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:162:52
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => true);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:162:52
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => false);

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:162:52
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() !== exerciseName.toLowerCase());

[NoCoverage] MethodExpression
src/pages/coach/modals.js:162:52
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => (e.name || '').toUpperCase() === exerciseName.toLowerCase());

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:162:53
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => (true).toLowerCase() === exerciseName.toLowerCase());

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:162:53
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => (false).toLowerCase() === exerciseName.toLowerCase());

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:162:53
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => (e.name && '').toLowerCase() === exerciseName.toLowerCase());

[NoCoverage] MethodExpression
src/pages/coach/modals.js:162:85
-       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toLowerCase());
+       const exercise = session?.exercises?.find(e => (e.name || '').toLowerCase() === exerciseName.toUpperCase());

[NoCoverage] BlockStatement
src/pages/coach/modals.js:163:31
-       const lastWeight = (() => {
-         try {
-           const logs = DB.get('logs') || [];
-           const exLogs = logs
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
-             .map(l => Number(l.w))
-             .filter(Number.isFinite);
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
-         } catch { return null; }
-       })();
+       const lastWeight = (() => {})();

[NoCoverage] BlockStatement
src/pages/coach/modals.js:164:11
-         try {
-           const logs = DB.get('logs') || [];
-           const exLogs = logs
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
-             .map(l => Number(l.w))
-             .filter(Number.isFinite);
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
-         } catch { return null; }
+         try {} catch { return null; }

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:165:22
-           const logs = DB.get('logs') || [];
+           const logs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:165:22
-           const logs = DB.get('logs') || [];
+           const logs = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:165:22
-           const logs = DB.get('logs') || [];
+           const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/modals.js:165:40
-           const logs = DB.get('logs') || [];
+           const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/modals.js:166:24
-           const exLogs = logs
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
-             .map(l => Number(l.w))
-             .filter(Number.isFinite);
+           const exLogs = logs.filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline).map(l => Number(l.w));

[NoCoverage] MethodExpression
src/pages/coach/modals.js:166:24
-           const exLogs = logs
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+           const exLogs = logs

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:167:19
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:167:24
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => true)

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:167:24
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => false)

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:167:24
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() || !l.baseline)

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:167:24
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => true && !l.baseline)

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:167:24
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (l.ex || '').toLowerCase() !== exerciseName.toLowerCase() && !l.baseline)

[NoCoverage] MethodExpression
src/pages/coach/modals.js:167:24
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (l.ex || '').toUpperCase() === exerciseName.toLowerCase() && !l.baseline)

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:167:25
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (true).toLowerCase() === exerciseName.toLowerCase() && !l.baseline)

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:167:25
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (false).toLowerCase() === exerciseName.toLowerCase() && !l.baseline)

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:167:25
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (l.ex && '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)

[NoCoverage] MethodExpression
src/pages/coach/modals.js:167:55
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toUpperCase() && !l.baseline)

[NoCoverage] BooleanLiteral
src/pages/coach/modals.js:167:85
-             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && !l.baseline)
+             .filter(l => (l.ex || '').toLowerCase() === exerciseName.toLowerCase() && l.baseline)

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:168:16
-             .map(l => Number(l.w))
+             .map(() => undefined)

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:170:16
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
+           return true ? exLogs[exLogs.length - 1] : null;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:170:16
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
+           return false ? exLogs[exLogs.length - 1] : null;

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:170:16
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
+           return exLogs.length >= 0 ? exLogs[exLogs.length - 1] : null;

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:170:16
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
+           return exLogs.length <= 0 ? exLogs[exLogs.length - 1] : null;

[NoCoverage] ArithmeticOperator
src/pages/coach/modals.js:170:43
-           return exLogs.length > 0 ? exLogs[exLogs.length - 1] : null;
+           return exLogs.length > 0 ? exLogs[exLogs.length + 1] : null;

[NoCoverage] BlockStatement
src/pages/coach/modals.js:171:15
-         } catch { return null; }
+         } catch {}

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:173:17
-       const ctx = {
-         readiness: { score: (() => {
-           try {
-             const today = tod();
-             const r = DB.get('readiness');
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
-           } catch { return null; }
-         })() },
-         isInCut: (() => {
-           const phase = DB.get('phase-override') || 'AUTO';
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
-         })(),
-         user: { phase: DB.get('phase-override') || 'AUTO' },
-       };
+       const ctx = {};

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:174:18
-         readiness: { score: (() => {
-           try {
-             const today = tod();
-             const r = DB.get('readiness');
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
-           } catch { return null; }
-         })() },
+         readiness: {},

[NoCoverage] BlockStatement
src/pages/coach/modals.js:174:34
-         readiness: { score: (() => {
-           try {
-             const today = tod();
-             const r = DB.get('readiness');
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
-           } catch { return null; }
-         })() },
+         readiness: { score: (() => {})() },

[NoCoverage] BlockStatement
src/pages/coach/modals.js:175:13
-           try {
-             const today = tod();
-             const r = DB.get('readiness');
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
-           } catch { return null; }
+           try {} catch { return null; }

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:178:18
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
+             return true ? (r[today]?.score ?? r[today] ?? null) : null;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:178:18
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
+             return false ? (r[today]?.score ?? r[today] ?? null) : null;

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:178:18
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
+             return typeof r !== 'object' ? (r[today]?.score ?? r[today] ?? null) : null;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:178:43
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
+             return typeof r === 'object' ? ((r[today]?.score ?? r[today]) && null) : null;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:178:43
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
+             return typeof r === 'object' ? (r[today]?.score && r[today] ?? null) : null;

[NoCoverage] OptionalChaining
src/pages/coach/modals.js:178:43
-             return typeof r === 'object' ? (r[today]?.score ?? r[today] ?? null) : null;
+             return typeof r === 'object' ? (r[today].score ?? r[today] ?? null) : null;

[NoCoverage] BlockStatement
src/pages/coach/modals.js:179:17
-           } catch { return null; }
+           } catch {}

[NoCoverage] BlockStatement
src/pages/coach/modals.js:181:23
-         isInCut: (() => {
-           const phase = DB.get('phase-override') || 'AUTO';
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
-         })(),
+         isInCut: (() => {})(),
