[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:182:23
-           const phase = DB.get('phase-override') || 'AUTO';
+           const phase = true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:182:23
-           const phase = DB.get('phase-override') || 'AUTO';
+           const phase = false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:182:23
-           const phase = DB.get('phase-override') || 'AUTO';
+           const phase = DB.get('phase-override') && 'AUTO';

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:183:16
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return true;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:183:16
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return false;

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:183:16
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' && phase === 'AUTO' && new Date() < TARGET_DATE;

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:183:16
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return false || (phase === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:183:16
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase !== 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:183:36
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (false);

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:183:36
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (phase === 'AUTO' || new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:183:36
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (true && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:183:36
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (phase !== 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:183:56
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (phase === 'AUTO' && true);

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:183:56
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (phase === 'AUTO' && new Date() <= TARGET_DATE);

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:183:56
-           return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+           return phase === 'CUT' || (phase === 'AUTO' && new Date() >= TARGET_DATE);

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:185:13
-         user: { phase: DB.get('phase-override') || 'AUTO' },
+         user: {},

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:185:22
-         user: { phase: DB.get('phase-override') || 'AUTO' },
+         user: { phase: true },

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:185:22
-         user: { phase: DB.get('phase-override') || 'AUTO' },
+         user: { phase: false },

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:185:22
-         user: { phase: DB.get('phase-override') || 'AUTO' },
+         user: { phase: DB.get('phase-override') && 'AUTO' },

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:188:9
-         ? { ...exercise, recommendation: { ...(exercise.recommendation || {}), lastWeight } }
+         ? {}

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:188:40
-         ? { ...exercise, recommendation: { ...(exercise.recommendation || {}), lastWeight } }
+         ? { ...exercise, recommendation: {} }

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:188:46
-         ? { ...exercise, recommendation: { ...(exercise.recommendation || {}), lastWeight } }
+         ? { ...exercise, recommendation: { ...(true), lastWeight } }

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:188:46
-         ? { ...exercise, recommendation: { ...(exercise.recommendation || {}), lastWeight } }
+         ? { ...exercise, recommendation: { ...(false), lastWeight } }

[NoCoverage] LogicalOperator
src/pages/coach/modals.js:188:46
-         ? { ...exercise, recommendation: { ...(exercise.recommendation || {}), lastWeight } }
+         ? { ...exercise, recommendation: { ...(exercise.recommendation && {}), lastWeight } }

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:189:9
-         : { name: exerciseName, recommendation: { lastWeight } };
+         : {};

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:189:47
-         : { name: exerciseName, recommendation: { lastWeight } };
+         : { name: exerciseName, recommendation: {} };

[NoCoverage] BlockStatement
src/pages/coach/modals.js:192:18
-     }).catch(() => {
-       _renderWhyModal(exerciseName, t('why.unavailable'));
-     });
+     }).catch(() => {});

[NoCoverage] BlockStatement
src/pages/coach/modals.js:197:49
-   function _renderWhyModal(exerciseName, summary) {
-     const existing = document.getElementById('why-modal');
-     if (existing) existing.remove();
-     const modal = document.createElement('div');
-     modal.id = 'why-modal';
-     modal.style.cssText = 'position:fixed;inset:0;background:rgba(0,0,0,0.75);z-index:8000;display:flex;align-items:flex-end;justify-content:center';
-     const safeName = String(exerciseName).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
-     const safeSummary = String(summary).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
-     modal.innerHTML = `<div style="background:var(--bg2);border:1px solid var(--border);border-radius:16px 16px 0 0;width:100%;max-width:500px;padding:24px 20px 32px">
-       <div style="font-size:15px;font-weight:700;margin-bottom:14px">${t('why.title', { exercise: safeName })}</div>
-       <div style="font-size:13px;color:var(--text);line-height:1.6;margin-bottom:20px">${safeSummary}</div>
-     </div>`;
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
-     document.body.appendChild(modal);
-   }
+   function _renderWhyModal(exerciseName, summary) {}

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:199:7
-     if (existing) existing.remove();
+     if (true) existing.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:199:7
-     if (existing) existing.remove();
+     if (false) existing.remove();

[NoCoverage] Regex
src/pages/coach/modals.js:203:49
-     const safeName = String(exerciseName).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
+     const safeName = String(exerciseName).replace(/[^<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:203:61
-     const safeName = String(exerciseName).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
+     const safeName = String(exerciseName).replace(/[<>&"']/g, () => undefined);

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:203:67
-     const safeName = String(exerciseName).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
+     const safeName = String(exerciseName).replace(/[<>&"']/g, c => ({}[c]));

[NoCoverage] Regex
src/pages/coach/modals.js:204:47
-     const safeSummary = String(summary).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
+     const safeSummary = String(summary).replace(/[^<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));

[NoCoverage] ArrowFunction
src/pages/coach/modals.js:204:59
-     const safeSummary = String(summary).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
+     const safeSummary = String(summary).replace(/[<>&"']/g, () => undefined);

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:204:65
-     const safeSummary = String(summary).replace(/[<>&"']/g, c => ({ '<': '&lt;', '>': '&gt;', '&': '&amp;', '"': '&quot;', "'": '&#39;' }[c]));
+     const safeSummary = String(summary).replace(/[<>&"']/g, c => ({}[c]));

[NoCoverage] ObjectLiteral
src/pages/coach/modals.js:206:85
-       <div style="font-size:15px;font-weight:700;margin-bottom:14px">${t('why.title', { exercise: safeName })}</div>
+       <div style="font-size:15px;font-weight:700;margin-bottom:14px">${t('why.title', {})}</div>

[NoCoverage] BlockStatement
src/pages/coach/modals.js:210:40
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => {});

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:210:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (true) modal.remove(); });

[NoCoverage] ConditionalExpression
src/pages/coach/modals.js:210:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (false) modal.remove(); });

[NoCoverage] EqualityOperator
src/pages/coach/modals.js:210:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (e.target !== modal) modal.remove(); });

[NoCoverage] BlockStatement
src/pages/coach/pr.js:7:37
-   export function extractAndSavePRs() {
-     const logs = DB.get('logs') || [];
-     const prMap = {};
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
-       const score = l.w * (parseInt(l.reps) || 1);
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
-         prMap[l.ex] = { ex: l.ex, kg: l.w, reps: l.reps, date: l.date, ts: l.ts, score };
-       }
-     });
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
-     DB.set('pr-records', prs);
-     return prs;
-   }
+   export function extractAndSavePRs() {}

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:8:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:8:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:8:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/pr.js:8:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/pr.js:10:3
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.forEach(l => {

[NoCoverage] ArrowFunction
src/pages/coach/pr.js:10:15
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(() => undefined).forEach(l => {

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:10:20
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(l => true).forEach(l => {

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:10:20
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(l => false).forEach(l => {

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:10:20
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(l => l.w && l.reps || !l.baseline).forEach(l => {

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:10:20
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(l => true && !l.baseline).forEach(l => {

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:10:20
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(l => l.w || l.reps && !l.baseline).forEach(l => {

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:10:37
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
+     logs.filter(l => l.w && l.reps && l.baseline).forEach(l => {

[NoCoverage] BlockStatement
src/pages/coach/pr.js:10:63
-     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {
-       const score = l.w * (parseInt(l.reps) || 1);
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
-         prMap[l.ex] = { ex: l.ex, kg: l.w, reps: l.reps, date: l.date, ts: l.ts, score };
-       }
-     });
+     logs.filter(l => l.w && l.reps && !l.baseline).forEach(l => {});

[NoCoverage] ArithmeticOperator
src/pages/coach/pr.js:11:19
-       const score = l.w * (parseInt(l.reps) || 1);
+       const score = l.w / (parseInt(l.reps) || 1);

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:11:26
-       const score = l.w * (parseInt(l.reps) || 1);
+       const score = l.w * (true);

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:11:26
-       const score = l.w * (parseInt(l.reps) || 1);
+       const score = l.w * (false);

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:11:26
-       const score = l.w * (parseInt(l.reps) || 1);
+       const score = l.w * (parseInt(l.reps) && 1);

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:12:9
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:12:9
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (false) {

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:12:9
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (!prMap[l.ex] && score > prMap[l.ex].score) {

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:12:9
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (prMap[l.ex] || score > prMap[l.ex].score) {

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:12:25
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (!prMap[l.ex] || false) {

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:12:25
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (!prMap[l.ex] || score >= prMap[l.ex].score) {

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:12:25
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
+       if (!prMap[l.ex] || score <= prMap[l.ex].score) {

[NoCoverage] BlockStatement
src/pages/coach/pr.js:12:52
-       if (!prMap[l.ex] || score > prMap[l.ex].score) {
-         prMap[l.ex] = { ex: l.ex, kg: l.w, reps: l.reps, date: l.date, ts: l.ts, score };
-       }
+       if (!prMap[l.ex] || score > prMap[l.ex].score) {}

[NoCoverage] ObjectLiteral
src/pages/coach/pr.js:13:21
-         prMap[l.ex] = { ex: l.ex, kg: l.w, reps: l.reps, date: l.date, ts: l.ts, score };
+         prMap[l.ex] = {};

[NoCoverage] MethodExpression
src/pages/coach/pr.js:16:15
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap);

[NoCoverage] ArrowFunction
src/pages/coach/pr.js:16:41
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/coach/pr.js:16:51
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) + (a.ts || 0));

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:16:52
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (true) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:16:52
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (false) - (a.ts || 0));

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:16:52
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (b.ts && 0) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:16:66
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (true));

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:16:66
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (false));

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:16:66
-     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts || 0));
+     const prs = Object.values(prMap).sort((a, b) => (b.ts || 0) - (a.ts && 0));

[NoCoverage] BlockStatement
src/pages/coach/pr.js:21:33
-   export function cleanFakeLogs() {
-     extractAndSavePRs();
-     const logs = DB.get('logs') || [];
-     const before = logs.length;
-     const result = filterValidLogs(logs);
-     if (result.length !== logs.length) DB.set('logs', result);
-     const removed = before - result.length;
-     toast(`✅ Curățat ${removed} loguri (${result.length} rămase)`, 'var(--green)');
-     renderCoachIdle();
-     if (window.renderDash) window.renderDash();
-   }
+   export function cleanFakeLogs() {}

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:23:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:23:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:23:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/pr.js:23:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:26:7
-     if (result.length !== logs.length) DB.set('logs', result);
+     if (true) DB.set('logs', result);

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:26:7
-     if (result.length !== logs.length) DB.set('logs', result);
+     if (false) DB.set('logs', result);

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:26:7
-     if (result.length !== logs.length) DB.set('logs', result);
+     if (result.length === logs.length) DB.set('logs', result);

[NoCoverage] ArithmeticOperator
src/pages/coach/pr.js:27:19
-     const removed = before - result.length;
+     const removed = before + result.length;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:30:7
-     if (window.renderDash) window.renderDash();
+     if (true) window.renderDash();

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:30:7
-     if (window.renderDash) window.renderDash();
+     if (false) window.renderDash();

[NoCoverage] BlockStatement
src/pages/coach/pr.js:33:32
-   export function togglePRWall() {
-     uiToggleFlags.prWallExpanded = !uiToggleFlags.prWallExpanded;
-     renderPRWall();
-   }
+   export function togglePRWall() {}

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:34:34
-     uiToggleFlags.prWallExpanded = !uiToggleFlags.prWallExpanded;
+     uiToggleFlags.prWallExpanded = uiToggleFlags.prWallExpanded;

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:40:7
-     if (!el) return;
+     if (el) return;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:40:7
-     if (!el) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:40:7
-     if (!el) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:42:15
-     const prs = DB.get('pr-records') || extractAndSavePRs();
+     const prs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:42:15
-     const prs = DB.get('pr-records') || extractAndSavePRs();
+     const prs = false;

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:42:15
-     const prs = DB.get('pr-records') || extractAndSavePRs();
+     const prs = DB.get('pr-records') && extractAndSavePRs();

[NoCoverage] MethodExpression
src/pages/coach/pr.js:43:19
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs;

[NoCoverage] ArrowFunction
src/pages/coach/pr.js:43:30
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:43:35
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs.filter(p => true);

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:43:35
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs.filter(p => false);

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:43:35
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs.filter(p => p.ex || p.ex !== '__early_stop__');

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:43:43
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs.filter(p => p.ex && true);

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:43:43
-     const entries = prs.filter(p => p.ex && p.ex !== '__early_stop__');
+     const entries = prs.filter(p => p.ex && p.ex === '__early_stop__');

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:44:7
-     if (!prs.length || !entries.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:44:7
-     if (!prs.length || !entries.length) {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:44:7
-     if (!prs.length || !entries.length) {
+     if (!prs.length && !entries.length) {

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:44:7
-     if (!prs.length || !entries.length) {
+     if (prs.length || !entries.length) {

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:44:22
-     if (!prs.length || !entries.length) {
+     if (!prs.length || entries.length) {

[NoCoverage] BlockStatement
src/pages/coach/pr.js:44:39
-     if (!prs.length || !entries.length) {
-       el.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:12px;padding:24px 20px;text-align:center;margin:4px 0">
-         <div style="font-size:32px;margin-bottom:10px">🎯</div>
-         <div style="font-size:14px;font-weight:700;color:var(--text);margin-bottom:6px">Niciun record personal încă</div>
-         <div style="font-size:12px;color:var(--text3);line-height:1.5">Completează primul antrenament pentru a-ți vedea recordurile personale</div>
-       </div>`;
-       return;
-     }
+     if (!prs.length || !entries.length) {}

[NoCoverage] MethodExpression
src/pages/coach/pr.js:53:60
-     const visible = uiToggleFlags.prWallExpanded ? entries : entries.slice(0, 3);
+     const visible = uiToggleFlags.prWallExpanded ? entries : entries;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:54:19
-     const hasMore = entries.length > 3;
+     const hasMore = true;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:54:19
-     const hasMore = entries.length > 3;
+     const hasMore = false;

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:54:19
-     const hasMore = entries.length > 3;
+     const hasMore = entries.length >= 3;

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:54:19
-     const hasMore = entries.length > 3;
+     const hasMore = entries.length <= 3;

[NoCoverage] ArithmeticOperator
src/pages/coach/pr.js:56:18
-     el.innerHTML = visible.map((e, i) => {
-       const d = new Date(e.date);
-       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString().slice(2)}`;
-       const isLast = i === visible.length - 1 && !hasMore;
-       return `<div style="display:flex;align-items:center;gap:12px;padding:10px 16px;${!isLast ? 'border-bottom:1px solid var(--border)' : ''}">
-         <div style="flex:1">
-           <div style="font-size:13px;font-weight:700">${e.ex}</div>
-           <div style="font-size:11px;color:var(--text3)">${dateStr}</div>
-         </div>
-         <div style="font-family:'JetBrains Mono',monospace;font-size:16px;font-weight:700;color:var(--accent)">${e.kg} kg</div>
-         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${e.reps || '—'}</div>
-       </div>`;
-     }).join('') + (hasMore ? `<div onclick="togglePRWall()" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">
-       ${uiToggleFlags.prWallExpanded ? '▴ Restrânge' : `▾ Vezi toate (${entries.length})`}
-     </div>` : '');
+     el.innerHTML = visible.map((e, i) => {
+     const d = new Date(e.date);
+     const dateStr = `${d.getDate()}/${d.getMonth() + 1}/${d.getFullYear().toString().slice(2)}`;
+     const isLast = i === visible.length - 1 && !hasMore;
+     return `<div style="display:flex;a

[NoCoverage] BlockStatement
src/pages/coach/pr.js:56:40
-     el.innerHTML = visible.map((e, i) => {
-       const d = new Date(e.date);
-       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString().slice(2)}`;
-       const isLast = i === visible.length - 1 && !hasMore;
-       return `<div style="display:flex;align-items:center;gap:12px;padding:10px 16px;${!isLast ? 'border-bottom:1px solid var(--border)' : ''}">
-         <div style="flex:1">
-           <div style="font-size:13px;font-weight:700">${e.ex}</div>
-           <div style="font-size:11px;color:var(--text3)">${dateStr}</div>
-         </div>
-         <div style="font-family:'JetBrains Mono',monospace;font-size:16px;font-weight:700;color:var(--accent)">${e.kg} kg</div>
-         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${e.reps || '—'}</div>
-       </div>`;
-     }).join('') + (hasMore ? `<div onclick="togglePRWall()" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">
+     el.innerHTML = visible.map((e, i) => {}).join('') + (hasMore ? `<div onclick="togglePRWall()" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">

[NoCoverage] ArithmeticOperator
src/pages/coach/pr.js:58:39
-       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString().slice(2)}`;
+       const dateStr = `${d.getDate()}/${d.getMonth() - 1}/${d.getFullYear().toString().slice(2)}`;

[NoCoverage] MethodExpression
src/pages/coach/pr.js:58:57
-       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString().slice(2)}`;
+       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString()}`;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:59:20
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = true;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:59:20
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = false;

[NoCoverage] LogicalOperator
src/pages/coach/pr.js:59:20
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = i === visible.length - 1 || !hasMore;

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:59:20
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = true && !hasMore;

[NoCoverage] EqualityOperator
src/pages/coach/pr.js:59:20
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = i !== visible.length - 1 && !hasMore;

[NoCoverage] ArithmeticOperator
src/pages/coach/pr.js:59:26
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = i === visible.length + 1 && !hasMore;

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:59:48
-       const isLast = i === visible.length - 1 && !hasMore;
+       const isLast = i === visible.length - 1 && hasMore;

[NoCoverage] BooleanLiteral
src/pages/coach/pr.js:60:86
-       return `<div style="display:flex;align-items:center;gap:12px;padding:10px 16px;${!isLast ? 'border-bottom:1px solid var(--border)' : ''}">
+       return `<div style="display:flex;align-items:center;gap:12px;padding:10px 16px;${isLast ? 'border-bottom:1px solid var(--border)' : ''}">

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:66:89
-         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${e.reps || '—'}</div>
+         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${true}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/pr.js:66:89
-         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${e.reps || '—'}</div>
+         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${false}</div>
