[NoCoverage] LogicalOperator
src/pages/coach/pr.js:66:89
-         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${e.reps || '—'}</div>
+         <div style="font-size:11px;color:var(--text3);min-width:40px;text-align:right">×${e.reps && '—'}</div>

[NoCoverage] OptionalChaining
src/pages/coach/rating.js:12:19
-     const prsHtml = summaryData.prs?.length
+     const prsHtml = summaryData.prs.length

[NoCoverage] ArrowFunction
src/pages/coach/rating.js:13:27
-       ? summaryData.prs.map(pr => `<div style="padding:7px 12px;background:rgba(200,255,0,0.06);border:1px solid rgba(200,255,0,0.2);border-radius:var(--rs);font-size:11px;color:var(--accent);margin-bottom:5px">🏆 ${pr.label}</div>`).join('')
+       ? summaryData.prs.map(() => undefined).join('')

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:59:7
-     if (window._ratingSessionInFlight) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:59:7
-     if (window._ratingSessionInFlight) return;
+     if (false) return;

[NoCoverage] BooleanLiteral
src/pages/coach/rating.js:60:35
-     window._ratingSessionInFlight = true;
+     window._ratingSessionInFlight = false;

[NoCoverage] ObjectLiteral
src/pages/coach/rating.js:63:19
-     const noteMap = { 'easy': ['strong'], 'normal': [], 'hard': ['fatigue'] };
+     const noteMap = {};

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:63:29
-     const noteMap = { 'easy': ['strong'], 'normal': [], 'hard': ['fatigue'] };
+     const noteMap = { 'easy': [], 'normal': [], 'hard': ['fatigue'] };

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:63:51
-     const noteMap = { 'easy': ['strong'], 'normal': [], 'hard': ['fatigue'] };
+     const noteMap = { 'easy': ['strong'], 'normal': ["Stryker was here"], 'hard': ['fatigue'] };

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:63:63
-     const noteMap = { 'easy': ['strong'], 'normal': [], 'hard': ['fatigue'] };
+     const noteMap = { 'easy': ['strong'], 'normal': [], 'hard': [] };

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:64:17
-     const notes = noteMap[rating] || [];
+     const notes = true;

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:64:17
-     const notes = noteMap[rating] || [];
+     const notes = false;

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:64:17
-     const notes = noteMap[rating] || [];
+     const notes = noteMap[rating] && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:64:36
-     const notes = noteMap[rating] || [];
+     const notes = noteMap[rating] || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:66:7
-     if (notes.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:66:7
-     if (notes.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/coach/rating.js:66:21
-     if (notes.length) {
-       const logs = DB.get('logs') || [];
-       let count = 0;
-       for (let i = 0; i < logs.length && count < 3; i++) {
-         if (logs[i].session === state.sessStart) {
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
-           count++;
-         }
-       }
-       DB.set('logs', logs);
-     }
+     if (notes.length) {}

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:67:18
-       const logs = DB.get('logs') || [];
+       const logs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:67:18
-       const logs = DB.get('logs') || [];
+       const logs = false;

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:67:18
-       const logs = DB.get('logs') || [];
+       const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:67:36
-       const logs = DB.get('logs') || [];
+       const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:69:21
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; false; i++) {

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:69:21
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i < logs.length || count < 3; i++) {

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:69:21
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; true && count < 3; i++) {

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:69:21
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i <= logs.length && count < 3; i++) {

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:69:21
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i >= logs.length && count < 3; i++) {

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:69:40
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i < logs.length && true; i++) {

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:69:40
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i < logs.length && count <= 3; i++) {

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:69:40
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i < logs.length && count >= 3; i++) {

[NoCoverage] UpdateOperator
src/pages/coach/rating.js:69:51
-       for (let i = 0; i < logs.length && count < 3; i++) {
+       for (let i = 0; i < logs.length && count < 3; i--) {

[NoCoverage] BlockStatement
src/pages/coach/rating.js:69:56
-       for (let i = 0; i < logs.length && count < 3; i++) {
-         if (logs[i].session === state.sessStart) {
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
-           count++;
-         }
-       }
+       for (let i = 0; i < logs.length && count < 3; i++) {}

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:70:11
-         if (logs[i].session === state.sessStart) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:70:11
-         if (logs[i].session === state.sessStart) {
+         if (false) {

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:70:11
-         if (logs[i].session === state.sessStart) {
+         if (logs[i].session !== state.sessStart) {

[NoCoverage] BlockStatement
src/pages/coach/rating.js:70:48
-         if (logs[i].session === state.sessStart) {
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
-           count++;
-         }
+         if (logs[i].session === state.sessStart) {}

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:71:25
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
+           logs[i].notes = [];

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:71:30
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
+           logs[i].notes = [...(true), ...notes];

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:71:30
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
+           logs[i].notes = [...(false), ...notes];

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:71:30
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
+           logs[i].notes = [...(logs[i].notes && []), ...notes];

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:71:47
-           logs[i].notes = [...(logs[i].notes || []), ...notes];
+           logs[i].notes = [...(logs[i].notes || ["Stryker was here"]), ...notes];

[NoCoverage] UpdateOperator
src/pages/coach/rating.js:72:9
-           count++;
+           count--;

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:78:20
-     const sRatings = DB.get('session-ratings') || [];
+     const sRatings = true;

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:78:20
-     const sRatings = DB.get('session-ratings') || [];
+     const sRatings = false;

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:78:20
-     const sRatings = DB.get('session-ratings') || [];
+     const sRatings = DB.get('session-ratings') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:78:49
-     const sRatings = DB.get('session-ratings') || [];
+     const sRatings = DB.get('session-ratings') || ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/pages/coach/rating.js:79:20
-     sRatings.unshift({ session: state.sessStart, rating, date: tod() });
+     sRatings.unshift({});

[NoCoverage] MethodExpression
src/pages/coach/rating.js:80:29
-     DB.set('session-ratings', sRatings.slice(0, 20));
+     DB.set('session-ratings', sRatings);

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:88:7
-     if (modal) modal.remove();
+     if (true) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:88:7
-     if (modal) modal.remove();
+     if (false) modal.remove();

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:90:21
-     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';
+     const moodLabel = true ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:90:21
-     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';
+     const moodLabel = false ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:90:21
-     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';
+     const moodLabel = rating !== 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:90:62
-     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';
+     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : true ? '💀 Sesiune grea' : '👍 Sesiune normală';

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:90:62
-     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';
+     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : false ? '💀 Sesiune grea' : '👍 Sesiune normală';

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:90:62
-     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating === 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';
+     const moodLabel = rating === 'easy' ? '⚡ Sesiune ușoară' : rating !== 'hard' ? '💀 Sesiune grea' : '👍 Sesiune normală';

[NoCoverage] ObjectLiteral
src/pages/coach/rating.js:91:22
-     showSessionSummary({ ...summaryData, moodLabel });
+     showSessionSummary({});

[NoCoverage] BlockStatement
src/pages/coach/rating.js:92:13
-     } finally {
-       window._ratingSessionInFlight = false;
-     }
+     } finally {}

[NoCoverage] BooleanLiteral
src/pages/coach/rating.js:93:37
-       window._ratingSessionInFlight = false;
+       window._ratingSessionInFlight = true;

[NoCoverage] OptionalChaining
src/pages/coach/rating.js:101:19
-     const prsHtml = data.prs?.length
+     const prsHtml = data.prs.length

[NoCoverage] ArrowFunction
src/pages/coach/rating.js:102:20
-       ? data.prs.map(pr => `<div style="padding:6px 10px;background:rgba(200,255,0,0.06);border:1px solid rgba(200,255,0,0.15);border-radius:var(--rs);font-size:11px;color:var(--accent);margin-bottom:4px">🏆 ${pr.label}</div>`).join('')
+       ? data.prs.map(() => undefined).join('')

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:106:54
-       <div style="font-size:15px;margin-bottom:16px">${data.moodLabel || ''}</div>
+       <div style="font-size:15px;margin-bottom:16px">${true}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:106:54
-       <div style="font-size:15px;margin-bottom:16px">${data.moodLabel || ''}</div>
+       <div style="font-size:15px;margin-bottom:16px">${false}</div>

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:106:54
-       <div style="font-size:15px;margin-bottom:16px">${data.moodLabel || ''}</div>
+       <div style="font-size:15px;margin-bottom:16px">${data.moodLabel && ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:108:169
-         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.mins || 0}</div><div style="font-size:9px;color:var(--text3)">MIN</div></div>
+         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${true}</div><div style="font-size:9px;color:var(--text3)">MIN</div></div>

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:108:169
-         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.mins || 0}</div><div style="font-size:9px;color:var(--text3)">MIN</div></div>
+         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${false}</div><div style="font-size:9px;color:var(--text3)">MIN</div></div>

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:108:169
-         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.mins || 0}</div><div style="font-size:9px;color:var(--text3)">MIN</div></div>
+         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.mins && 0}</div><div style="font-size:9px;color:var(--text3)">MIN</div></div>

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:110:169
-         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.kcal || 0}</div><div style="font-size:9px;color:var(--text3)">KCAL</div></div>
+         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${true}</div><div style="font-size:9px;color:var(--text3)">KCAL</div></div>

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:110:169
-         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.kcal || 0}</div><div style="font-size:9px;color:var(--text3)">KCAL</div></div>
+         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${false}</div><div style="font-size:9px;color:var(--text3)">KCAL</div></div>

[NoCoverage] LogicalOperator
src/pages/coach/rating.js:110:169
-         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.kcal || 0}</div><div style="font-size:9px;color:var(--text3)">KCAL</div></div>
+         <div style="background:var(--bg3);border-radius:var(--rs);padding:10px 4px"><div style="font-family:'Bebas Neue',sans-serif;font-size:22px;color:var(--accent)">${data.kcal && 0}</div><div style="font-size:9px;color:var(--text3)">KCAL</div></div>

[NoCoverage] ObjectLiteral
src/pages/coach/rating.js:128:29
-     const pieces = Array.from({ length: 80 }, () => ({
+     const pieces = Array.from({}, () => ({

[NoCoverage] ArrowFunction
src/pages/coach/rating.js:128:45
-     const pieces = Array.from({ length: 80 }, () => ({
-       x: Math.random() * canvas.width, y: -10,
-       w: Math.random() * 8 + 4, h: Math.random() * 12 + 6,
-       r: Math.random() * Math.PI * 2,
-       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 + 2,
-       vr: (Math.random() - 0.5) * 0.2,
-       color: ['#c8ff00', '#fff', '#ff9f0a', '#30d158', '#ff375f'][Math.floor(Math.random() * 5)]
-     }));
+     const pieces = Array.from({ length: 80 }, () => undefined);

[NoCoverage] ObjectLiteral
src/pages/coach/rating.js:128:52
-     const pieces = Array.from({ length: 80 }, () => ({
-       x: Math.random() * canvas.width, y: -10,
-       w: Math.random() * 8 + 4, h: Math.random() * 12 + 6,
-       r: Math.random() * Math.PI * 2,
-       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 + 2,
-       vr: (Math.random() - 0.5) * 0.2,
-       color: ['#c8ff00', '#fff', '#ff9f0a', '#30d158', '#ff375f'][Math.floor(Math.random() * 5)]
-     }));
+     const pieces = Array.from({ length: 80 }, () => ({}));

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:129:8
-       x: Math.random() * canvas.width, y: -10,
+       x: Math.random() / canvas.width, y: -10,

[NoCoverage] UnaryOperator
src/pages/coach/rating.js:129:41
-       x: Math.random() * canvas.width, y: -10,
+       x: Math.random() * canvas.width, y: +10,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:130:8
-       w: Math.random() * 8 + 4, h: Math.random() * 12 + 6,
+       w: Math.random() * 8 - 4, h: Math.random() * 12 + 6,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:130:8
-       w: Math.random() * 8 + 4, h: Math.random() * 12 + 6,
+       w: Math.random() / 8 + 4, h: Math.random() * 12 + 6,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:130:34
-       w: Math.random() * 8 + 4, h: Math.random() * 12 + 6,
+       w: Math.random() * 8 + 4, h: Math.random() * 12 - 6,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:130:34
-       w: Math.random() * 8 + 4, h: Math.random() * 12 + 6,
+       w: Math.random() * 8 + 4, h: Math.random() / 12 + 6,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:131:8
-       r: Math.random() * Math.PI * 2,
+       r: Math.random() * Math.PI / 2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:131:8
-       r: Math.random() * Math.PI * 2,
+       r: Math.random() / Math.PI * 2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:132:9
-       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 + 2,
+       vx: (Math.random() - 0.5) / 4, vy: Math.random() * 4 + 2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:132:10
-       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 + 2,
+       vx: (Math.random() + 0.5) * 4, vy: Math.random() * 4 + 2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:132:40
-       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 + 2,
+       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 - 2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:132:40
-       vx: (Math.random() - 0.5) * 4, vy: Math.random() * 4 + 2,
+       vx: (Math.random() - 0.5) * 4, vy: Math.random() / 4 + 2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:133:9
-       vr: (Math.random() - 0.5) * 0.2,
+       vr: (Math.random() - 0.5) / 0.2,

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:133:10
-       vr: (Math.random() - 0.5) * 0.2,
+       vr: (Math.random() + 0.5) * 0.2,

[NoCoverage] ArrayDeclaration
src/pages/coach/rating.js:134:12
-       color: ['#c8ff00', '#fff', '#ff9f0a', '#30d158', '#ff375f'][Math.floor(Math.random() * 5)]
+       color: [][Math.floor(Math.random() * 5)]

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:134:76
-       color: ['#c8ff00', '#fff', '#ff9f0a', '#30d158', '#ff375f'][Math.floor(Math.random() * 5)]
+       color: ['#c8ff00', '#fff', '#ff9f0a', '#30d158', '#ff375f'][Math.floor(Math.random() / 5)]

[NoCoverage] BlockStatement
src/pages/coach/rating.js:137:19
-     function draw() {
-       ctx.clearRect(0, 0, canvas.width, canvas.height);
-       pieces.forEach(p => {
-         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;
-         ctx.save(); ctx.translate(p.x, p.y); ctx.rotate(p.r);
-         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h / 2, p.w, p.h);
-         ctx.restore();
-       });
-       frame++;
-       if (frame < 120) requestAnimationFrame(draw);
-       else canvas.remove();
-     }
+     function draw() {}

[NoCoverage] BlockStatement
src/pages/coach/rating.js:139:25
-       pieces.forEach(p => {
-         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;
-         ctx.save(); ctx.translate(p.x, p.y); ctx.rotate(p.r);
-         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h / 2, p.w, p.h);
-         ctx.restore();
-       });
+       pieces.forEach(p => {});

[NoCoverage] AssignmentOperator
src/pages/coach/rating.js:140:7
-         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;
+         p.x -= p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;

[NoCoverage] AssignmentOperator
src/pages/coach/rating.js:140:20
-         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;
+         p.x += p.vx; p.y -= p.vy; p.r += p.vr; p.vy += 0.05;

[NoCoverage] AssignmentOperator
src/pages/coach/rating.js:140:33
-         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;
+         p.x += p.vx; p.y += p.vy; p.r -= p.vr; p.vy += 0.05;

[NoCoverage] AssignmentOperator
src/pages/coach/rating.js:140:46
-         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy += 0.05;
+         p.x += p.vx; p.y += p.vy; p.r += p.vr; p.vy -= 0.05;

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:142:45
-         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h / 2, p.w, p.h);
+         ctx.fillStyle = p.color; ctx.fillRect(-p.w * 2, -p.h / 2, p.w, p.h);

[NoCoverage] UnaryOperator
src/pages/coach/rating.js:142:45
-         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h / 2, p.w, p.h);
+         ctx.fillStyle = p.color; ctx.fillRect(+p.w / 2, -p.h / 2, p.w, p.h);

[NoCoverage] ArithmeticOperator
src/pages/coach/rating.js:142:55
-         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h / 2, p.w, p.h);
+         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h * 2, p.w, p.h);

[NoCoverage] UnaryOperator
src/pages/coach/rating.js:142:55
-         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, -p.h / 2, p.w, p.h);
+         ctx.fillStyle = p.color; ctx.fillRect(-p.w / 2, +p.h / 2, p.w, p.h);

[NoCoverage] UpdateOperator
src/pages/coach/rating.js:145:5
-       frame++;
+       frame--;

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:146:9
-       if (frame < 120) requestAnimationFrame(draw);
+       if (true) requestAnimationFrame(draw);

[NoCoverage] ConditionalExpression
src/pages/coach/rating.js:146:9
-       if (frame < 120) requestAnimationFrame(draw);
+       if (false) requestAnimationFrame(draw);

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:146:9
-       if (frame < 120) requestAnimationFrame(draw);
+       if (frame <= 120) requestAnimationFrame(draw);

[NoCoverage] EqualityOperator
src/pages/coach/rating.js:146:9
-       if (frame < 120) requestAnimationFrame(draw);
+       if (frame >= 120) requestAnimationFrame(draw);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:21:49
-     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${p.hours || 'analiză activă'}`,
+     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${true}`,

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:21:49
-     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${p.hours || 'analiză activă'}`,
+     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${false}`,

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:21:49
-     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${p.hours || 'analiză activă'}`,
+     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${p.hours && 'analiză activă'}`,

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:47:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:47:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:47:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:47:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:48:17
-     const burns = DB.get('session-burns') || [];
+     const burns = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:48:17
-     const burns = DB.get('session-burns') || [];
+     const burns = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:48:17
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:48:44
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:49:19
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:49:19
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:49:19
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = DB.get('session-ratings') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:49:48
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = DB.get('session-ratings') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:52:3
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.forEach(l => {

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:52:15
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.filter(() => undefined).forEach(l => {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:52:20
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.filter(l => true).forEach(l => {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:52:20
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.filter(l => false).forEach(l => {

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:52:20
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.filter(l => !l.baseline || l.session).forEach(l => {

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:52:20
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
+     logs.filter(l => l.baseline && l.session).forEach(l => {

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:52:59
-     logs.filter(l => !l.baseline && l.session).forEach(l => {
-       const key = String(l.session);
-       if (!sessMap[key]) sessMap[key] = [];
-       sessMap[key].push(l);
-     });
+     logs.filter(l => !l.baseline && l.session).forEach(l => {});

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:54:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (sessMap[key]) sessMap[key] = [];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:54:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (true) sessMap[key] = [];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:54:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (false) sessMap[key] = [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:54:39
-       if (!sessMap[key]) sessMap[key] = [];
+       if (!sessMap[key]) sessMap[key] = ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:57:27
-     const sameDaySessions = Object.entries(sessMap)
-       .filter(([, sets]) => {
-         const date = sets[0]?.date;
-         const burn = burns.find(b => b.date === date);
-         return burn && burn.day === dayLabel && date !== today;
-       })
-       .map(([key, sets]) => ({
-         ts: Number(key),
-         date: sets[0].date,
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
-         rating: ratings.find(r => r.session === Number(key))?.rating
-       }))
-       .sort((a, b) => b.ts - a.ts);
+     const sameDaySessions = Object.entries(sessMap).filter(([, sets]) => {
+     const date = sets[0]?.date;
+     const burn = burns.find(b => b.date === date);
+     return burn && burn.day === dayLabel && date !== today;
+   }).map(([key, sets]) => ({
+     ts: Number(key),
+     date: sets[0].date,
+     sets: sets.filter(s => s.ex !== '__early_stop__'),
+     rating: ratings.find(r => r.session === Number(key))?.rating
+   }));

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:57:27
-     const sameDaySessions = Object.entries(sessMap)
-       .filter(([, sets]) => {
-         const date = sets[0]?.date;
-         const burn = burns.find(b => b.date === date);
-         return burn && burn.day === dayLabel && date !== today;
-       })
+     const sameDaySessions = Object.entries(sessMap)

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:58:27
-       .filter(([, sets]) => {
-         const date = sets[0]?.date;
-         const burn = burns.find(b => b.date === date);
-         return burn && burn.day === dayLabel && date !== today;
-       })
+       .filter(([, sets]) => {})
