[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:59:20
-         const date = sets[0]?.date;
+         const date = sets[0].date;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:60:31
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:60:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => true);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:60:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => false);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:60:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => b.date !== date);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:61:14
-         return burn && burn.day === dayLabel && date !== today;
+         return true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:61:14
-         return burn && burn.day === dayLabel && date !== today;
+         return false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:61:14
-         return burn && burn.day === dayLabel && date !== today;
+         return burn && burn.day === dayLabel || date !== today;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:61:14
-         return burn && burn.day === dayLabel && date !== today;
+         return true && date !== today;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:61:14
-         return burn && burn.day === dayLabel && date !== today;
+         return burn || burn.day === dayLabel && date !== today;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:61:22
-         return burn && burn.day === dayLabel && date !== today;
+         return burn && true && date !== today;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:61:22
-         return burn && burn.day === dayLabel && date !== today;
+         return burn && burn.day !== dayLabel && date !== today;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:61:47
-         return burn && burn.day === dayLabel && date !== today;
+         return burn && burn.day === dayLabel && true;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:61:47
-         return burn && burn.day === dayLabel && date !== today;
+         return burn && burn.day === dayLabel && date === today;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:63:10
-       .map(([key, sets]) => ({
-         ts: Number(key),
-         date: sets[0].date,
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
-         rating: ratings.find(r => r.session === Number(key))?.rating
-       }))
+       .map(() => undefined)

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:63:28
-       .map(([key, sets]) => ({
-         ts: Number(key),
-         date: sets[0].date,
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
-         rating: ratings.find(r => r.session === Number(key))?.rating
-       }))
+       .map(([key, sets]) => ({}))

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:66:13
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
+         sets: sets,

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:66:25
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
+         sets: sets.filter(() => undefined),

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:66:30
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
+         sets: sets.filter(s => true),

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:66:30
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
+         sets: sets.filter(s => false),

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:66:30
-         sets: sets.filter(s => s.ex !== '__early_stop__'),
+         sets: sets.filter(s => s.ex === '__early_stop__'),

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:67:15
-         rating: ratings.find(r => r.session === Number(key))?.rating
+         rating: ratings.find(r => r.session === Number(key)).rating

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:67:28
-         rating: ratings.find(r => r.session === Number(key))?.rating
+         rating: ratings.find(() => undefined)?.rating

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:67:33
-         rating: ratings.find(r => r.session === Number(key))?.rating
+         rating: ratings.find(r => true)?.rating

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:67:33
-         rating: ratings.find(r => r.session === Number(key))?.rating
+         rating: ratings.find(r => false)?.rating

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:67:33
-         rating: ratings.find(r => r.session === Number(key))?.rating
+         rating: ratings.find(r => r.session !== Number(key))?.rating

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:69:11
-       .sort((a, b) => b.ts - a.ts);
+       .sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:69:21
-       .sort((a, b) => b.ts - a.ts);
+       .sort((a, b) => b.ts + a.ts);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:71:7
-     if (!last || !last.sets.length) return '';
+     if (true) return '';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:71:7
-     if (!last || !last.sets.length) return '';
+     if (false) return '';

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:71:7
-     if (!last || !last.sets.length) return '';
+     if (!last && !last.sets.length) return '';

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:71:7
-     if (!last || !last.sets.length) return '';
+     if (last || !last.sets.length) return '';

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:71:16
-     if (!last || !last.sets.length) return '';
+     if (!last || last.sets.length) return '';

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:73:17
-     const setKg = (s) => s?.w ?? s?.kg ?? null;
+     const setKg = () => undefined;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:73:24
-     const setKg = (s) => s?.w ?? s?.kg ?? null;
+     const setKg = (s) => (s?.w ?? s?.kg) && null;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:73:24
-     const setKg = (s) => s?.w ?? s?.kg ?? null;
+     const setKg = (s) => s?.w && s?.kg ?? null;

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:73:24
-     const setKg = (s) => s?.w ?? s?.kg ?? null;
+     const setKg = (s) => s.w ?? s?.kg ?? null;

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:73:32
-     const setKg = (s) => s?.w ?? s?.kg ?? null;
+     const setKg = (s) => s?.w ?? s.kg ?? null;

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:75:26
-     last.sets.forEach(s => {
-       const cur = exMap[s.ex];
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
-     });
+     last.sets.forEach(s => {});

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:77:9
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (true) exMap[s.ex] = s;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:77:9
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (false) exMap[s.ex] = s;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:77:9
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur && (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:77:9
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:77:17
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || false) exMap[s.ex] = s;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:77:17
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || (setKg(s) ?? -Infinity) >= (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:77:17
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || (setKg(s) ?? -Infinity) <= (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:77:18
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || (setKg(s) && -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;

[NoCoverage] UnaryOperator
src/pages/coach/renderIdle.js:77:30
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || (setKg(s) ?? +Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:77:44
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) && -Infinity)) exMap[s.ex] = s;

[NoCoverage] UnaryOperator
src/pages/coach/renderIdle.js:77:58
-       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? -Infinity)) exMap[s.ex] = s;
+       if (!cur || (setKg(s) ?? -Infinity) > (setKg(cur) ?? +Infinity)) exMap[s.ex] = s;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:79:16
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity));

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:79:16
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).slice(0, 3);

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:79:42
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort(() => undefined).slice(0, 3);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:79:52
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) + (setKg(a) ?? -Infinity)).slice(0, 3);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:79:53
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) && -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);

[NoCoverage] UnaryOperator
src/pages/coach/renderIdle.js:79:65
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? +Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:79:79
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) && -Infinity)).slice(0, 3);

[NoCoverage] UnaryOperator
src/pages/coach/renderIdle.js:79:91
-     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? -Infinity)).slice(0, 3);
+     const top3 = Object.values(exMap).sort((a, b) => (setKg(b) ?? -Infinity) - (setKg(a) ?? +Infinity)).slice(0, 3);

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:80:20
-     const validRPE = last.sets.filter(s => s.rpe);
+     const validRPE = last.sets;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:80:37
-     const validRPE = last.sets.filter(s => s.rpe);
+     const validRPE = last.sets.filter(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:81:36
-     const avgRPE = validRPE.length ? validRPE.reduce((a, s) => a + s.rpe, 0) / validRPE.length : 0;
+     const avgRPE = validRPE.length ? validRPE.reduce((a, s) => a + s.rpe, 0) * validRPE.length : 0;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:81:52
-     const avgRPE = validRPE.length ? validRPE.reduce((a, s) => a + s.rpe, 0) / validRPE.length : 0;
+     const avgRPE = validRPE.length ? validRPE.reduce(() => undefined, 0) / validRPE.length : 0;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:81:62
-     const avgRPE = validRPE.length ? validRPE.reduce((a, s) => a + s.rpe, 0) / validRPE.length : 0;
+     const avgRPE = validRPE.length ? validRPE.reduce((a, s) => a - s.rpe, 0) / validRPE.length : 0;

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:82:21
-     const ratingLbl = { easy: '⚡ Ușoară', normal: '👍 Normală', hard: '💀 Grea' };
+     const ratingLbl = {};

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:83:59
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (true ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:83:59
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (false ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:83:59
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE >= 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:83:59
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE <= 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:83:86
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : true ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:83:86
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : false ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:83:86
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE <= 7 ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:83:86
-     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE < 7 ? '⚡ Ușoară' : '👍 Normală');
+     const verdict = last.rating ? ratingLbl[last.rating] : (avgRPE > 8.5 ? '💀 Grea' : avgRPE >= 7 ? '⚡ Ușoară' : '👍 Normală');

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:85:49
-     const dateStr = d.toLocaleDateString('ro-RO', { weekday: 'long', day: 'numeric', month: 'long' });
+     const dateStr = d.toLocaleDateString('ro-RO', {});

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:89:136
-       <div style="font-size:10px;color:var(--accent);text-transform:uppercase;letter-spacing:1.5px;margin-bottom:6px">ULTIMA SESIUNE · ${dayLabel.toUpperCase()}</div>
+       <div style="font-size:10px;color:var(--accent);text-transform:uppercase;letter-spacing:1.5px;margin-bottom:6px">ULTIMA SESIUNE · ${dayLabel.toLowerCase()}</div>

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:91:16
-       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${s.reps||'?'}</span></div>`).join('')}
+       ${top3.map(() => undefined).join('')}

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:91:171
-       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${s.reps||'?'}</span></div>`).join('')}
+       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) && '?'}kg×${s.reps||'?'}</span></div>`).join('')}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:91:192
-       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${s.reps||'?'}</span></div>`).join('')}
+       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${true}</span></div>`).join('')}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:91:192
-       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${s.reps||'?'}</span></div>`).join('')}
+       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${false}</span></div>`).join('')}

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:91:192
-       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${s.reps||'?'}</span></div>`).join('')}
+       ${top3.map(s => `<div style="font-size:12px;color:var(--text);margin-bottom:3px">· ${s.ex} <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${setKg(s) ?? '?'}kg×${s.reps && '?'}</span></div>`).join('')}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:93:9
-         ${avgRPE > 0 ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}
+         ${true ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:93:9
-         ${avgRPE > 0 ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}
+         ${false ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:93:9
-         ${avgRPE > 0 ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}
+         ${avgRPE >= 0 ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:93:9
-         ${avgRPE > 0 ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}
+         ${avgRPE <= 0 ? `<span style="font-size:11px;color:var(--text3)">RPE: <span style="color:var(--text2)">${avgRPE.toFixed(1)}</span></span>` : ''}

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:99:35
-   function renderFatigueScore(elId) {
-     const el = $(elId); if (!el) return;
-     const f = calculateFatigueScore();
-     el.style.display = 'block';
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
-   }
+   function renderFatigueScore(elId) {}

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:100:27
-     const el = $(elId); if (!el) return;
+     const el = $(elId); if (el) return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:100:27
-     const el = $(elId); if (!el) return;
+     const el = $(elId); if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:100:27
-     const el = $(elId); if (!el) return;
+     const el = $(elId); if (false) return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:103:83
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
+     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${true} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:103:83
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
+     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${false} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:103:83
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
+     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon && ''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:110:16
-     const dayMap=[6,0,1,2,3,4,5];
+     const dayMap=[];

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:113:48
-     const dateStr=now.toLocaleDateString('ro-RO',{weekday:'long',day:'numeric',month:'long'});
+     const dateStr=now.toLocaleDateString('ro-RO',{});

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:118:6
-     if(!cmdEl)return;
+     if(cmdEl)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:118:6
-     if(!cmdEl)return;
+     if(true)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:118:6
-     if(!cmdEl)return;
+     if(false)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:121:6
-     if(tp.t==='off'){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:121:6
-     if(tp.t==='off'){
+     if(false){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:121:6
-     if(tp.t==='off'){
+     if(tp.t !== 'off'){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:125:8
-       if(timeEl)timeEl.textContent=dateStr;
+       if(true)timeEl.textContent=dateStr;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:125:8
-       if(timeEl)timeEl.textContent=dateStr;
+       if(false)timeEl.textContent=dateStr;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:126:8
-       if(startBtn)startBtn.style.display='none';
+       if(true)startBtn.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:126:8
-       if(startBtn)startBtn.style.display='none';
+       if(false)startBtn.style.display='none';

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:130:16
-       const qPct=Math.min(100,Math.round((quest.stepsToday||0)/8000*100));
+       const qPct=Math.max(100, Math.round((quest.stepsToday || 0) / 8000 * 100));

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:130:40
-       const qPct=Math.min(100,Math.round((quest.stepsToday||0)/8000*100));
+       const qPct=Math.min(100,Math.round((quest.stepsToday || 0) / 8000 / 100));

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:130:40
-       const qPct=Math.min(100,Math.round((quest.stepsToday||0)/8000*100));
+       const qPct=Math.min(100,Math.round((quest.stepsToday || 0) * 8000*100));

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:130:41
-       const qPct=Math.min(100,Math.round((quest.stepsToday||0)/8000*100));
+       const qPct=Math.min(100,Math.round((true)/8000*100));

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:130:41
-       const qPct=Math.min(100,Math.round((quest.stepsToday||0)/8000*100));
+       const qPct=Math.min(100,Math.round((false)/8000*100));

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:130:41
-       const qPct=Math.min(100,Math.round((quest.stepsToday||0)/8000*100));
+       const qPct=Math.min(100,Math.round((quest.stepsToday && 0)/8000*100));

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:131:43
-       const _tpl=$('today-preview-list');if(_tpl)_tpl.innerHTML=`
+       const _tpl=$('today-preview-list');if(true)_tpl.innerHTML=`

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:131:43
-       const _tpl=$('today-preview-list');if(_tpl)_tpl.innerHTML=`
+       const _tpl=$('today-preview-list');if(false)_tpl.innerHTML=`

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:135:112
-             <div style="font-family:'Bebas Neue',sans-serif;font-size:40px;color:var(--purple);line-height:1">${(quest.stepsToday||0).toLocaleString()}</div>
+             <div style="font-family:'Bebas Neue',sans-serif;font-size:40px;color:var(--purple);line-height:1">${(true).toLocaleString()}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:135:112
-             <div style="font-family:'Bebas Neue',sans-serif;font-size:40px;color:var(--purple);line-height:1">${(quest.stepsToday||0).toLocaleString()}</div>
+             <div style="font-family:'Bebas Neue',sans-serif;font-size:40px;color:var(--purple);line-height:1">${(false).toLocaleString()}</div>

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:135:112
-             <div style="font-family:'Bebas Neue',sans-serif;font-size:40px;color:var(--purple);line-height:1">${(quest.stepsToday||0).toLocaleString()}</div>
+             <div style="font-family:'Bebas Neue',sans-serif;font-size:40px;color:var(--purple);line-height:1">${(quest.stepsToday && 0).toLocaleString()}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:138:87
-               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${qPct>=100?'var(--green)':'var(--text3)'}">${qPct}%</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${true?'var(--green)':'var(--text3)'}">${qPct}%</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:138:87
-               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${qPct>=100?'var(--green)':'var(--text3)'}">${qPct}%</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${false?'var(--green)':'var(--text3)'}">${qPct}%</div>

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:138:87
-               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${qPct>=100?'var(--green)':'var(--text3)'}">${qPct}%</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${qPct > 100?'var(--green)':'var(--text3)'}">${qPct}%</div>

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:138:87
-               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${qPct>=100?'var(--green)':'var(--text3)'}">${qPct}%</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:13px;color:${qPct < 100?'var(--green)':'var(--text3)'}">${qPct}%</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:147:22
-               value="${quest.stepsToday||''}"/>
+               value="${true}"/>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:147:22
-               value="${quest.stepsToday||''}"/>
+               value="${false}"/>

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:147:22
-               value="${quest.stepsToday||''}"/>
+               value="${quest.stepsToday && ''}"/>

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:164:9
-       if (!_dirSession) {
+       if (_dirSession) {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:164:9
-       if (!_dirSession) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:164:9
-       if (!_dirSession) {
+       if (false) {
