[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:164:23
-       if (!_dirSession) {
-         try {
-           _dirSession = await coachDirector.buildSession(tp.t.toUpperCase());
-           sessionCache.set(_dirSession);
-         } catch(e) {
-           _dirSession = null;
-           sessionCache.invalidate();
-         }
-       }
+       if (!_dirSession) {}

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:165:11
-         try {
-           _dirSession = await coachDirector.buildSession(tp.t.toUpperCase());
-           sessionCache.set(_dirSession);
-         } catch(e) {
+         try {} catch(e) {

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:166:56
-           _dirSession = await coachDirector.buildSession(tp.t.toUpperCase());
+           _dirSession = await coachDirector.buildSession(tp.t.toLowerCase());

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:168:18
-         } catch(e) {
-           _dirSession = null;
-           sessionCache.invalidate();
-         }
+         } catch(e) {}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:176:9
-       if (_dirSession?.restDay) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:176:9
-       if (_dirSession?.restDay) {
+       if (false) {

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:176:9
-       if (_dirSession?.restDay) {
+       if (_dirSession.restDay) {

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:176:31
-       if (_dirSession?.restDay) {
-         cmdEl.textContent = 'ZI DE ODIHNĂ';
-         cmdEl.style.color = 'var(--text2)';
-         if(startBtn) startBtn.style.display='none';
-         const _tplOff=$('today-preview-list');
-         return;
-       }
+       if (_dirSession?.restDay) {}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:179:10
-         if(startBtn) startBtn.style.display='none';
+         if(true) startBtn.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:179:10
-         if(startBtn) startBtn.style.display='none';
+         if(false) startBtn.style.display='none';

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:185:23
-       cmdEl.textContent=tp.lb.toUpperCase();
+       cmdEl.textContent=tp.lb.toLowerCase();

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:187:8
-       if(timeEl)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;
+       if(true)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:187:8
-       if(timeEl)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;
+       if(false)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:187:50
-       if(timeEl)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;
+       if(timeEl)timeEl.textContent=`${dateStr} · ${true}`;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:187:50
-       if(timeEl)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;
+       if(timeEl)timeEl.textContent=`${dateStr} · ${false}`;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:187:50
-       if(timeEl)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp)||''}`;
+       if(timeEl)timeEl.textContent=`${dateStr} · ${getDisplayTime(tp) && ''}`;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:188:8
-       if(startBtn){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:188:8
-       if(startBtn){
+       if(false){

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:188:17
-       if(startBtn){
-         startBtn.style.display='flex';
-         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s||3);},0);
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
-         $('btn-start-label').textContent=`▶ START ${tp.day.toUpperCase()} · ~${capped} MIN (±10)`;
-       }
+       if(startBtn){}

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:190:43
-         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s||3);},0);
+         const totalSets=tp.ex.reduce((a,e)=>{},0);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:190:81
-         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s||3);},0);
+         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a - (s || 3);},0);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:190:84
-         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s||3);},0);
+         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(true);},0);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:190:84
-         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s||3);},0);
+         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(false);},0);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:190:84
-         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s||3);},0);
+         const totalSets=tp.ex.reduce((a,e)=>{const s=EX_SETS[cleanEx(e.n)];return a+(s && 3);},0);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:191:32
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets * (COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n || '')) ? 3 : 2) - tp.ex.length * 1.5);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:191:32
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets / (COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n || '')) ? 3 : 2)+tp.ex.length*1.5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:191:72
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(true))?3:2)+tp.ex.length*1.5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:191:72
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(false))?3:2)+tp.ex.length*1.5);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:191:72
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n && ''))?3:2)+tp.ex.length*1.5);

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:191:72
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0].n||''))?3:2)+tp.ex.length*1.5);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:191:95
-         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length*1.5);
+         const estMins=Math.round(totalSets*(COMPOUND_EX.includes(cleanEx(tp.ex[0]?.n||''))?3:2)+tp.ex.length / 1.5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:192:20
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=true?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:192:20
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=false?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:192:20
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=tp.tm || tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:192:48
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=tp.tm&&tp.tm.includes('65')?Math.max(estMins, 65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:192:69
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):true?Math.min(estMins,75):estMins;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:192:69
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):false?Math.min(estMins,75):estMins;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:192:69
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm || tp.tm.includes('75')?Math.min(estMins,75):estMins;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:192:97
-         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.min(estMins,75):estMins;
+         const capped=tp.tm&&tp.tm.includes('65')?Math.min(estMins,65):tp.tm&&tp.tm.includes('75')?Math.max(estMins, 75):estMins;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:193:51
-         $('btn-start-label').textContent=`▶ START ${tp.day.toUpperCase()} · ~${capped} MIN (±10)`;
+         $('btn-start-label').textContent=`▶ START ${tp.day.toLowerCase()} · ~${capped} MIN (±10)`;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:196:31
-       const mainLift=tp.ex.find(e=>COMPOUND_EX.includes(cleanEx(e.n)));
+       const mainLift=tp.ex.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:198:8
-       if(mlEl&&mainLift){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:198:8
-       if(mlEl&&mainLift){
+       if(false){

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:198:8
-       if(mlEl&&mainLift){
+       if(mlEl || mainLift){

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:198:23
-       if(mlEl&&mainLift){
-         const mlName=cleanEx(mainLift.n);
-         const mlLast=DP.getLogs(mlName,1)[0];
-         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${mlLast.reps||'?'}`:'';
-         mlEl.innerHTML=`MAIN LIFT: <strong style="color:var(--accent)">${mlName.toUpperCase()}</strong>${mlLastStr}`;
-       } else if(mlEl) mlEl.textContent='';
+       if(mlEl&&mainLift){} else if(mlEl) mlEl.textContent='';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:201:58
-         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${mlLast.reps||'?'}`:'';
+         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${true}`:'';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:201:58
-         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${mlLast.reps||'?'}`:'';
+         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${false}`:'';

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:201:58
-         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${mlLast.reps||'?'}`:'';
+         const mlLastStr=mlLast?` · LAST: ${mlLast.w}kg × ${mlLast.reps && '?'}`:'';

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:202:72
-         mlEl.innerHTML=`MAIN LIFT: <strong style="color:var(--accent)">${mlName.toUpperCase()}</strong>${mlLastStr}`;
+         mlEl.innerHTML=`MAIN LIFT: <strong style="color:var(--accent)">${mlName.toLowerCase()}</strong>${mlLastStr}`;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:203:15
-       } else if(mlEl) mlEl.textContent='';
+       } else if(true) mlEl.textContent='';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:203:15
-       } else if(mlEl) mlEl.textContent='';
+       } else if(false) mlEl.textContent='';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:206:25
-       const laggingAlerts=checkMuscleBalance()||[];
+       const laggingAlerts=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:206:25
-       const laggingAlerts=checkMuscleBalance()||[];
+       const laggingAlerts=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:206:25
-       const laggingAlerts=checkMuscleBalance()||[];
+       const laggingAlerts=checkMuscleBalance() && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:206:47
-       const laggingAlerts=checkMuscleBalance()||[];
+       const laggingAlerts=checkMuscleBalance()||["Stryker was here"];

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:209:35
-       const readinessScore = (() => {
-         if (todayR == null) return null;
-         const yesterday = new Date(); yesterday.setDate(yesterday.getDate()-1);
-         const yDate = todDate(yesterday);
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
-         return getReadinessScore(todayR, kcals[yDate], prots[yDate], KCAL_TARGET, PROT_TARGET);
-       })();
+       const readinessScore = (() => {})();

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:210:11
-         if (todayR == null) return null;
+         if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:210:11
-         if (todayR == null) return null;
+         if (false) return null;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:210:11
-         if (todayR == null) return null;
+         if (todayR != null) return null;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:211:37
-         const yesterday = new Date(); yesterday.setDate(yesterday.getDate()-1);
+         const yesterday = new Date(); yesterday.setTime(yesterday.getDate() - 1);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:211:55
-         const yesterday = new Date(); yesterday.setDate(yesterday.getDate()-1);
+         const yesterday = new Date(); yesterday.setDate(yesterday.getDate() + 1);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:213:21
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
+         const kcals = true, prots = DB.get('prots')||{};

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:213:21
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
+         const kcals = false, prots = DB.get('prots')||{};

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:213:21
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
+         const kcals = DB.get('kcals') && {}, prots = DB.get('prots')||{};

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:213:50
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
+         const kcals = DB.get('kcals')||{}, prots = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:213:50
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
+         const kcals = DB.get('kcals')||{}, prots = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:213:50
-         const kcals = DB.get('kcals')||{}, prots = DB.get('prots')||{};
+         const kcals = DB.get('kcals')||{}, prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:217:21
-       const verdict = readinessScore != null ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;
+       const verdict = true ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:217:21
-       const verdict = readinessScore != null ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;
+       const verdict = false ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:217:21
-       const verdict = readinessScore != null ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;
+       const verdict = readinessScore == null ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:217:82
-       const verdict = readinessScore != null ? getReadinessVerdict(readinessScore, { isInCut: _isInCut }) : null;
+       const verdict = readinessScore != null ? getReadinessVerdict(readinessScore, {}) : null;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:220:27
-       const occupiedEquip = DB.get('equipment-occupied-session') || [];
+       const occupiedEquip = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:220:27
-       const occupiedEquip = DB.get('equipment-occupied-session') || [];
+       const occupiedEquip = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:220:27
-       const occupiedEquip = DB.get('equipment-occupied-session') || [];
+       const occupiedEquip = DB.get('equipment-occupied-session') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:220:67
-       const occupiedEquip = DB.get('equipment-occupied-session') || [];
+       const occupiedEquip = DB.get('equipment-occupied-session') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:221:26
-       const unavailEquip = DB.get('unavailable-equipment') || [];
+       const unavailEquip = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:221:26
-       const unavailEquip = DB.get('unavailable-equipment') || [];
+       const unavailEquip = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:221:26
-       const unavailEquip = DB.get('unavailable-equipment') || [];
+       const unavailEquip = DB.get('unavailable-equipment') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:221:61
-       const unavailEquip = DB.get('unavailable-equipment') || [];
+       const unavailEquip = DB.get('unavailable-equipment') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:222:21
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = tp.ex || [];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:222:22
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (true).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:222:22
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (false).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:222:22
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex && []).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:222:29
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex||["Stryker was here"]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:222:40
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex||[]).filter(() => undefined);

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:222:45
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex||[]).filter(e => unavailEquip.includes(cleanEx(e.n || '')));

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:222:76
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(true)));

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:222:76
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(false)));

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:222:76
-       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n||'')));
+       let rawExList = (tp.ex||[]).filter(e => !unavailEquip.includes(cleanEx(e.n && '')));

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:225:22
-       const isExpanded=!!uiToggleFlags.exListExpanded[todayDayIdx];
+       const isExpanded=!uiToggleFlags.exListExpanded[todayDayIdx];

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:225:23
-       const isExpanded=!!uiToggleFlags.exListExpanded[todayDayIdx];
+       const isExpanded=!uiToggleFlags.exListExpanded[todayDayIdx];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:227:19
-       const showAll=isExpanded||exList.length<=SHOW_LIMIT;
+       const showAll=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:227:19
-       const showAll=isExpanded||exList.length<=SHOW_LIMIT;
+       const showAll=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:227:19
-       const showAll=isExpanded||exList.length<=SHOW_LIMIT;
+       const showAll=isExpanded && exList.length <= SHOW_LIMIT;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:227:31
-       const showAll=isExpanded||exList.length<=SHOW_LIMIT;
+       const showAll=isExpanded||false;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:227:31
-       const showAll=isExpanded||exList.length<=SHOW_LIMIT;
+       const showAll=isExpanded||exList.length < SHOW_LIMIT;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:227:31
-       const showAll=isExpanded||exList.length<=SHOW_LIMIT;
+       const showAll=isExpanded||exList.length > SHOW_LIMIT;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:228:36
-       const visibleEx=showAll?exList:exList.slice(0,SHOW_LIMIT);
+       const visibleEx=showAll?exList:exList;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:229:23
-       const hiddenCount=exList.length-SHOW_LIMIT;
+       const hiddenCount=exList.length + SHOW_LIMIT;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:230:22
-       const _prsData = DB.get('pr-records') || [];
+       const _prsData = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:230:22
-       const _prsData = DB.get('pr-records') || [];
+       const _prsData = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:230:22
-       const _prsData = DB.get('pr-records') || [];
+       const _prsData = DB.get('pr-records') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:230:46
-       const _prsData = DB.get('pr-records') || [];
+       const _prsData = DB.get('pr-records') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:231:43
-       const _tpl=$('today-preview-list');if(_tpl)_tpl.innerHTML=renderLastSessionMemory(tp.day)+`
+       const _tpl=$('today-preview-list');if(true)_tpl.innerHTML=renderLastSessionMemory(tp.day)+`

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:231:43
-       const _tpl=$('today-preview-list');if(_tpl)_tpl.innerHTML=renderLastSessionMemory(tp.day)+`
+       const _tpl=$('today-preview-list');if(false)_tpl.innerHTML=renderLastSessionMemory(tp.day)+`

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:232:14
-         ${(()=>{
-           const banner=_dirSession?.calibrationBanner;
-           const lvl=_dirSession?.calibrationLevel;
-           if(!banner||!lvl)return'';
-           return`<div style="margin:0 16px 10px;padding:10px 14px;background:rgba(123,44,191,0.08);border-radius:var(--rs);border:1px solid rgba(123,44,191,0.35);display:flex;align-items:flex-start;gap:10px">
-             <span style="font-size:18px;flex-shrink:0">🧠</span>
-             <div><div style="font-size:12px;font-weight:700;color:#b57bee">${lvl.displayName}</div>
-             <div style="font-size:11px;color:var(--text3);margin-top:2px">${banner}</div></div>
-           </div>`;
-         })()}
+         ${(()=>{})()}

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:233:22
-           const banner=_dirSession?.calibrationBanner;
+           const banner=_dirSession.calibrationBanner;

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:234:19
-           const lvl=_dirSession?.calibrationLevel;
+           const lvl=_dirSession.calibrationLevel;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:235:12
-           if(!banner||!lvl)return'';
+           if(true)return'';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:235:12
-           if(!banner||!lvl)return'';
+           if(false)return'';

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:235:12
-           if(!banner||!lvl)return'';
+           if(!banner && !lvl)return'';

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:235:12
-           if(!banner||!lvl)return'';
+           if(banner||!lvl)return'';

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:235:21
-           if(!banner||!lvl)return'';
+           if(!banner||lvl)return'';

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:242:14
-         ${(()=>{
-           if (!shouldShowPatternBanner(_dirSession?.context)) return '';
-           const ctx = _dirSession.context;
-           const messages = ctx.patterns
-             .map(formatPatternMessage)
-             .filter(m => m !== null);
-           if (messages.length === 0) return '';
-           return `<div style="margin:0 16px 10px;padding:10px 14px;background:rgba(255,149,0,0.06);border-radius:var(--rs);border:1px solid rgba(255,149,0,0.2)">
-             ${messages.map(m => `<div style="font-size:11px;color:var(--accent2);font-weight:600">${m}</div>`).join('')}
-           </div>`;
-         })()}
+         ${(()=>{})()}

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:243:13
-           if (!shouldShowPatternBanner(_dirSession?.context)) return '';
+           if (shouldShowPatternBanner(_dirSession?.context)) return '';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:243:13
-           if (!shouldShowPatternBanner(_dirSession?.context)) return '';
+           if (true) return '';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:243:13
-           if (!shouldShowPatternBanner(_dirSession?.context)) return '';
+           if (false) return '';

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:243:38
-           if (!shouldShowPatternBanner(_dirSession?.context)) return '';
+           if (!shouldShowPatternBanner(_dirSession.context)) return '';

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:245:26
-           const messages = ctx.patterns
-             .map(formatPatternMessage)
-             .filter(m => m !== null);
+           const messages = ctx.patterns.map(formatPatternMessage);

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:247:19
-             .filter(m => m !== null);
+             .filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:247:24
-             .filter(m => m !== null);
+             .filter(m => true);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:247:24
-             .filter(m => m !== null);
+             .filter(m => false);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:247:24
-             .filter(m => m !== null);
+             .filter(m => m === null);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:248:13
-           if (messages.length === 0) return '';
+           if (true) return '';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:248:13
-           if (messages.length === 0) return '';
+           if (false) return '';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:248:13
-           if (messages.length === 0) return '';
+           if (messages.length !== 0) return '';

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:250:26
-             ${messages.map(m => `<div style="font-size:11px;color:var(--accent2);font-weight:600">${m}</div>`).join('')}
+             ${messages.map(() => undefined).join('')}
