[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:253:9
-         ${_dirSession?.patternApplied?`<div style="margin:0 16px 10px;padding:10px 14px;background:rgba(160,100,255,0.06);border-radius:var(--rs);border:1px solid rgba(160,100,255,0.2)">
+         ${_dirSession.patternApplied?`<div style="margin:0 16px 10px;padding:10px 14px;background:rgba(160,100,255,0.06);border-radius:var(--rs);border:1px solid rgba(160,100,255,0.2)">

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:257:29
-           ${laggingAlerts.map(a=>`<div style="font-size:12px;color:var(--accent2);font-weight:600;margin-bottom:3px">⚠️ ${a}</div>`).join('')}
+           ${laggingAlerts.map(() => undefined).join('')}

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:259:14
-         ${(()=>{
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
-           if(!proAlerts.length)return'';
-           const top=proAlerts[0];
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
-           return`<div style="margin:0 16px 10px;padding:11px 14px;background:${bg};border-radius:var(--rs);border:1px solid ${border}">
-             <div style="font-size:12px;color:${color};font-weight:600">${icon} ${top.message}</div>
-             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}
-           </div>`;
-         })()}
+         ${(()=>{})()}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:260:25
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
+           const proAlerts=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:260:25
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
+           const proAlerts=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:260:25
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
+           const proAlerts=_dirSession?.context?.proactiveAlerts && [];

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:260:25
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
+           const proAlerts=_dirSession?.context.proactiveAlerts||[];

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:260:25
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
+           const proAlerts=_dirSession.context?.proactiveAlerts||[];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:260:64
-           const proAlerts=_dirSession?.context?.proactiveAlerts||[];
+           const proAlerts=_dirSession?.context?.proactiveAlerts||["Stryker was here"];

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:261:12
-           if(!proAlerts.length)return'';
+           if(proAlerts.length)return'';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:261:12
-           if(!proAlerts.length)return'';
+           if(true)return'';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:261:12
-           if(!proAlerts.length)return'';
+           if(false)return'';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:263:21
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
+           const color=true?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:263:21
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
+           const color=false?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:263:21
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
+           const color=top.severity !== 'warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:263:63
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
+           const color=top.severity==='warning'?'var(--accent2)':true?'var(--green)':'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:263:63
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
+           const color=top.severity==='warning'?'var(--accent2)':false?'var(--green)':'var(--accent)';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:263:63
-           const color=top.severity==='warning'?'var(--accent2)':top.severity==='success'?'var(--green)':'var(--accent)';
+           const color=top.severity==='warning'?'var(--accent2)':top.severity !== 'success'?'var(--green)':'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:264:18
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
+           const bg=true?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:264:18
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
+           const bg=false?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:264:18
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
+           const bg=top.severity !== 'warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:264:67
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
+           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':true?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:264:67
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
+           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':false?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:264:67
-           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity==='success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';
+           const bg=top.severity==='warning'?'rgba(255,107,53,0.07)':top.severity !== 'success'?'rgba(0,200,100,0.07)':'rgba(100,150,255,0.07)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:265:22
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
+           const border=true?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:265:22
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
+           const border=false?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:265:22
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
+           const border=top.severity !== 'warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:265:70
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
+           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':true?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:265:70
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
+           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':false?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:265:70
-           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity==='success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';
+           const border=top.severity==='warning'?'rgba(255,107,53,0.2)':top.severity !== 'success'?'rgba(0,200,100,0.2)':'rgba(100,150,255,0.2)';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:266:20
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
+           const icon=true?'⚠️':top.severity==='success'?'✅':'💡';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:266:20
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
+           const icon=false?'⚠️':top.severity==='success'?'✅':'💡';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:266:20
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
+           const icon=top.severity !== 'warning'?'⚠️':top.severity==='success'?'✅':'💡';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:266:50
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
+           const icon=top.severity==='warning'?'⚠️':true?'✅':'💡';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:266:50
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
+           const icon=top.severity==='warning'?'⚠️':false?'✅':'💡';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:266:50
-           const icon=top.severity==='warning'?'⚠️':top.severity==='success'?'✅':'💡';
+           const icon=top.severity==='warning'?'⚠️':top.severity !== 'success'?'✅':'💡';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:269:13
-             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}
+             ${true?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:269:13
-             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}
+             ${false?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:269:13
-             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}
+             ${proAlerts.length >= 1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:269:13
-             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}
+             ${proAlerts.length <= 1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:269:98
-             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length-1} alte alerte</div>`:''}
+             ${proAlerts.length>1?`<div style="font-size:10px;color:var(--text3);margin-top:4px">+${proAlerts.length + 1} alte alerte</div>`:''}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:272:9
-         ${todayR == null ? `<div style="margin:0 16px 10px;padding:14px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs)">
+         ${true ? `<div style="margin:0 16px 10px;padding:14px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs)">

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:272:9
-         ${todayR == null ? `<div style="margin:0 16px 10px;padding:14px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs)">
+         ${false ? `<div style="margin:0 16px 10px;padding:14px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs)">

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:272:9
-         ${todayR == null ? `<div style="margin:0 16px 10px;padding:14px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs)">
+         ${todayR != null ? `<div style="margin:0 16px 10px;padding:14px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs)">

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:275:13
-             ${[1,2,3,4,5].map(v => `<button onclick="selectReadiness(${v})" style="flex:1;background:var(--bg3);border:1px solid var(--border);border-radius:8px;padding:8px 2px;cursor:pointer;transition:border-color .15s">
+             ${[].map(v => `<button onclick="selectReadiness(${v})" style="flex:1;background:var(--bg3);border:1px solid var(--border);border-radius:8px;padding:8px 2px;cursor:pointer;transition:border-color .15s">

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:275:29
-             ${[1,2,3,4,5].map(v => `<button onclick="selectReadiness(${v})" style="flex:1;background:var(--bg3);border:1px solid var(--border);border-radius:8px;padding:8px 2px;cursor:pointer;transition:border-color .15s">
-               <div style="font-size:22px">${READINESS_LABELS[v].emoji}</div>
-               <div style="font-size:8px;color:var(--text3);margin-top:4px;line-height:1.2">${READINESS_LABELS[v].label}</div>
-             </button>`).join('')}
+             ${[1,2,3,4,5].map(() => undefined).join('')}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:284:106
-             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier < 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>
+             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${true ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:284:106
-             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier < 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>
+             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${false ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:284:106
-             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier < 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>
+             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier <= 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:284:106
-             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier < 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>
+             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier >= 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:284:160
-             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier < 1 ? ` · volum ${Math.round(verdict.volumeMultiplier*100)}%` : ''}</div>
+             <div style="font-size:11px;color:var(--text3);margin-top:1px">Readiness ${readinessScore}/100${verdict.volumeMultiplier < 1 ? ` · volum ${Math.round(verdict.volumeMultiplier / 100)}%` : ''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:286:147
-           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${READINESS_LABELS[todayR]?.emoji||'✏️'}</button>
+           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${true}</button>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:286:147
-           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${READINESS_LABELS[todayR]?.emoji||'✏️'}</button>
+           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${false}</button>

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:286:147
-           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${READINESS_LABELS[todayR]?.emoji||'✏️'}</button>
+           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${READINESS_LABELS[todayR]?.emoji && '✏️'}</button>

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:286:147
-           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${READINESS_LABELS[todayR]?.emoji||'✏️'}</button>
+           <button onclick="showReadinessModal()" style="background:none;border:none;color:var(--text3);font-size:10px;cursor:pointer;padding:4px">${READINESS_LABELS[todayR].emoji||'✏️'}</button>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:293:28
-             const hasHistory=DP.getLogs(cleanName,1).length>0;
+             const hasHistory=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:293:28
-             const hasHistory=DP.getLogs(cleanName,1).length>0;
+             const hasHistory=false;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:293:28
-             const hasHistory=DP.getLogs(cleanName,1).length>0;
+             const hasHistory=DP.getLogs(cleanName, 1).length >= 0;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:293:28
-             const hasHistory=DP.getLogs(cleanName,1).length>0;
+             const hasHistory=DP.getLogs(cleanName, 1).length <= 0;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:294:24
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:294:24
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:294:24
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i === visibleEx.length - 1 || !(exList.length > SHOW_LIMIT);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:294:24
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=true&&!(exList.length>SHOW_LIMIT);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:294:24
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i !== visibleEx.length - 1&&!(exList.length>SHOW_LIMIT);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:294:28
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i===visibleEx.length + 1&&!(exList.length>SHOW_LIMIT);

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:294:48
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i===visibleEx.length-1&&exList.length > SHOW_LIMIT;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:294:50
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i===visibleEx.length-1&&!(true);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:294:50
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i===visibleEx.length-1&&!(false);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:294:50
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i===visibleEx.length-1&&!(exList.length >= SHOW_LIMIT);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:294:50
-             const isLast=i===visibleEx.length-1&&!(exList.length>SHOW_LIMIT);
+             const isLast=i===visibleEx.length-1&&!(exList.length <= SHOW_LIMIT);

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:295:36
-             const exPR=_prsData.find(p=>p.ex===cleanName);
+             const exPR=_prsData.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:295:39
-             const exPR=_prsData.find(p=>p.ex===cleanName);
+             const exPR=_prsData.find(p=>true);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:295:39
-             const exPR=_prsData.find(p=>p.ex===cleanName);
+             const exPR=_prsData.find(p=>false);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:295:39
-             const exPR=_prsData.find(p=>p.ex===cleanName);
+             const exPR=_prsData.find(p=>p.ex !== cleanName);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:24
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:24
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:296:24
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR || rec.kg * (parseInt(rec.repsTarget) || 8) >= exPR.kg * (parseInt(exPR.reps) || 8) * 0.9;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:30
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&true;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:296:30
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg * (parseInt(rec.repsTarget) || 8) > exPR.kg * (parseInt(exPR.reps) || 8) * 0.9;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:296:30
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg * (parseInt(rec.repsTarget) || 8) < exPR.kg * (parseInt(exPR.reps) || 8) * 0.9;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:296:30
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg / (parseInt(rec.repsTarget) || 8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:38
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(true)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:38
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(false)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:296:38
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget) && 8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:296:68
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg * (parseInt(exPR.reps) || 8) / 0.9;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:296:68
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg / (parseInt(exPR.reps) || 8)*0.9;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:77
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(true)*0.9;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:296:77
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(false)*0.9;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:296:77
-             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps)||8)*0.9;
+             const nearPR=exPR&&rec.kg*(parseInt(rec.repsTarget)||8)>=exPR.kg*(parseInt(exPR.reps) && 8)*0.9;

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:297:96
-             return `<div style="display:flex;align-items:flex-start;gap:10px;padding:11px 14px;${!isLast?'border-bottom:1px solid var(--border)':''}${isOccupied?';opacity:0.45':''}">
+             return `<div style="display:flex;align-items:flex-start;gap:10px;padding:11px 14px;${isLast?'border-bottom:1px solid var(--border)':''}${isOccupied?';opacity:0.45':''}">

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:301:94
-                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
+                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(true, cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:301:94
-                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
+                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(false, cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:301:94
-                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
+                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s && '', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:301:111
-                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
+                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(true), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
