[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:301:111
-                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
+                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(false), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:301:111
-                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n||''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>
+                 <div style="font-size:10px;color:var(--text3);margin-top:1px">${formatSetsReps(e.s||'', cleanEx(e.n && ''), _isInCut)}${e.ss?' · <span style="color:var(--accent2)">SS</span>':''}</div>

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:314:11
-           ${exList.length>SHOW_LIMIT?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">
+           ${true?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:314:11
-           ${exList.length>SHOW_LIMIT?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">
+           ${false?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:314:11
-           ${exList.length>SHOW_LIMIT?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">
+           ${exList.length >= SHOW_LIMIT?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:314:11
-           ${exList.length>SHOW_LIMIT?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">
+           ${exList.length <= SHOW_LIMIT?`<div onclick="toggleExList(${todayDayIdx})" style="padding:10px 16px;text-align:center;cursor:pointer;color:var(--accent);font-size:12px;border-top:1px solid var(--border)">

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
-         && !modalManager.isSuppressed('aa-friction')
-         && !isAAFrictionDismissedToday()
+         true

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
-         && !modalManager.isSuppressed('aa-friction')
-         && !isAAFrictionDismissedToday()
+         false

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
-         && !modalManager.isSuppressed('aa-friction')
-         && !isAAFrictionDismissedToday()
+         _dirSession?.aaBlocked?.requiresFrictionConfirmation && !modalManager.isSuppressed('aa-friction') || !isAAFrictionDismissedToday()

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
-         && !modalManager.isSuppressed('aa-friction')
+         true

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
-         && !modalManager.isSuppressed('aa-friction')
+         _dirSession?.aaBlocked?.requiresFrictionConfirmation || !modalManager.isSuppressed('aa-friction')

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
+         _dirSession?.aaBlocked.requiresFrictionConfirmation

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:325:7
-         _dirSession?.aaBlocked?.requiresFrictionConfirmation
+         _dirSession.aaBlocked?.requiresFrictionConfirmation

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:326:10
-         && !modalManager.isSuppressed('aa-friction')
+         && modalManager.isSuppressed('aa-friction')

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:327:10
-         && !isAAFrictionDismissedToday()
+         && isAAFrictionDismissedToday()

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:328:7
-       ) {
-         setTimeout(() => {
-           modalManager.show({
-             id: 'aa-friction',
-             category: 'coaching',
-             present: () => showAAFrictionModal(_dirSession, _dirSession.context),
-             onComplete: (result) => {
-               // Mark handled so subsequent renders don't re-trigger.
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
-               if (result?.action === 'override') {
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
-                 sessionCache.set(_dirSession);
-                 renderCoachIdle();
-               } else {
-                 sessionCache.set(_dirSession);
-               }
-             },
-           });
-         }, 100);
-       }
+       ) {}

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:329:24
-         setTimeout(() => {
-           modalManager.show({
-             id: 'aa-friction',
-             category: 'coaching',
-             present: () => showAAFrictionModal(_dirSession, _dirSession.context),
-             onComplete: (result) => {
-               // Mark handled so subsequent renders don't re-trigger.
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
-               if (result?.action === 'override') {
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
-                 sessionCache.set(_dirSession);
-                 renderCoachIdle();
-               } else {
-                 sessionCache.set(_dirSession);
-               }
-             },
-           });
-         }, 100);
+         setTimeout(() => {}, 100);

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:330:27
-           modalManager.show({
-             id: 'aa-friction',
-             category: 'coaching',
-             present: () => showAAFrictionModal(_dirSession, _dirSession.context),
-             onComplete: (result) => {
-               // Mark handled so subsequent renders don't re-trigger.
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
-               if (result?.action === 'override') {
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
-                 sessionCache.set(_dirSession);
-                 renderCoachIdle();
-               } else {
-                 sessionCache.set(_dirSession);
-               }
-             },
-           });
+           modalManager.show({});

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:333:20
-             present: () => showAAFrictionModal(_dirSession, _dirSession.context),
+             present: () => undefined,

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:334:35
-             onComplete: (result) => {
-               // Mark handled so subsequent renders don't re-trigger.
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
-               if (result?.action === 'override') {
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
-                 sessionCache.set(_dirSession);
-                 renderCoachIdle();
-               } else {
-                 sessionCache.set(_dirSession);
-               }
-             },
+             onComplete: (result) => {},

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:336:17
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
+               if (true) _dirSession.aaBlocked.requiresFrictionConfirmation = false;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:336:17
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
+               if (false) _dirSession.aaBlocked.requiresFrictionConfirmation = false;

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:336:17
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
+               if (_dirSession.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:336:94
-               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = false;
+               if (_dirSession?.aaBlocked) _dirSession.aaBlocked.requiresFrictionConfirmation = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:337:17
-               if (result?.action === 'override') {
+               if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:337:17
-               if (result?.action === 'override') {
+               if (false) {

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:337:17
-               if (result?.action === 'override') {
+               if (result?.action !== 'override') {

[NoCoverage] OptionalChaining
src/pages/coach/renderIdle.js:337:17
-               if (result?.action === 'override') {
+               if (result.action === 'override') {

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:337:48
-               if (result?.action === 'override') {
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
-                 sessionCache.set(_dirSession);
-                 renderCoachIdle();
-               } else {
+               if (result?.action === 'override') {} else {

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:338:65
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
+                 _dirSession.exercises = _dirSession.exercises.map(() => undefined);

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:338:71
-                 _dirSession.exercises = _dirSession.exercises.map(e => ({
-                   ...e,
-                   sets: e.aaOriginalSets ?? e.sets,
-                   aaReduced: false,
-                   aaOverridden: true,
-                 }));
+                 _dirSession.exercises = _dirSession.exercises.map(e => ({}));

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:340:23
-                   sets: e.aaOriginalSets ?? e.sets,
+                   sets: e.aaOriginalSets && e.sets,

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:341:28
-                   aaReduced: false,
+                   aaReduced: true,

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:342:31
-                   aaOverridden: true,
+                   aaOverridden: false,

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:344:40
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
+                 _dirSession.aaOverride = {};

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:344:53
-                 _dirSession.aaOverride = { rationale: result.overrideRationale ?? 'override-button', timestamp: Date.now() };
+                 _dirSession.aaOverride = { rationale: result.overrideRationale && 'override-button', timestamp: Date.now() };

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:347:20
-               } else {
-                 sessionCache.set(_dirSession);
-               }
+               } else {}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:357:14
-     const logs=DB.get('logs')||[];
+     const logs=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:357:14
-     const logs=DB.get('logs')||[];
+     const logs=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:357:14
-     const logs=DB.get('logs')||[];
+     const logs=DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:357:30
-     const logs=DB.get('logs')||[];
+     const logs=DB.get('logs')||["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:358:20
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[...new Set(logs.filter(l => !l.baseline).map(l => l.date))].sort();

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:358:20
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[...new Set(logs.filter(l => !l.baseline).map(l => l.date))].reverse();

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:358:20
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[].sort().reverse();

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:358:32
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[...new Set(logs.map(l=>l.date))].sort().reverse();

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:358:44
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[...new Set(logs.filter(() => undefined).map(l=>l.date))].sort().reverse();

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:358:47
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[...new Set(logs.filter(l=>l.baseline).map(l=>l.date))].sort().reverse();

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:358:64
-     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(l=>l.date))].sort().reverse();
+     const uniqueDays=[...new Set(logs.filter(l=>!l.baseline).map(() => undefined))].sort().reverse();

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:360:15
-     for(let i=0;i<uniqueDays.length;i++){
+     for(let i=0;false;i++){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:360:15
-     for(let i=0;i<uniqueDays.length;i++){
+     for(let i=0;i <= uniqueDays.length;i++){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:360:15
-     for(let i=0;i<uniqueDays.length;i++){
+     for(let i=0;i >= uniqueDays.length;i++){

[NoCoverage] UpdateOperator
src/pages/coach/renderIdle.js:360:35
-     for(let i=0;i<uniqueDays.length;i++){
+     for(let i=0;i<uniqueDays.length;i--){

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:360:39
-     for(let i=0;i<uniqueDays.length;i++){
-       const d=new Date(uniqueDays[i]+' 12:00');
-       const exp=new Date(today+' 12:00');exp.setDate(exp.getDate()-i);
-       if(d.toDateString()===exp.toDateString())streak++;
-       else break;
-     }
+     for(let i=0;i<uniqueDays.length;i++){}

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:362:40
-       const exp=new Date(today+' 12:00');exp.setDate(exp.getDate()-i);
+       const exp=new Date(today+' 12:00');exp.setTime(exp.getDate() - i);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:362:52
-       const exp=new Date(today+' 12:00');exp.setDate(exp.getDate()-i);
+       const exp=new Date(today+' 12:00');exp.setDate(exp.getDate() + i);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:363:8
-       if(d.toDateString()===exp.toDateString())streak++;
+       if(true)streak++;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:363:8
-       if(d.toDateString()===exp.toDateString())streak++;
+       if(false)streak++;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:363:8
-       if(d.toDateString()===exp.toDateString())streak++;
+       if(d.toDateString() !== exp.toDateString())streak++;

[NoCoverage] UpdateOperator
src/pages/coach/renderIdle.js:363:46
-       if(d.toDateString()===exp.toDateString())streak++;
+       if(d.toDateString()===exp.toDateString())streak--;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:366:34
-     const sEl=$('today-streak');if(sEl)sEl.textContent=streak;
+     const sEl=$('today-streak');if(true)sEl.textContent=streak;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:366:34
-     const sEl=$('today-streak');if(sEl)sEl.textContent=streak;
+     const sEl=$('today-streak');if(false)sEl.textContent=streak;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:368:6
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(true)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:368:6
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(false)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:368:26
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(kEl)kEl.textContent=true?Math.round(SYS.getCurrentKg()*0.09*50):'—';

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:368:26
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(kEl)kEl.textContent=false?Math.round(SYS.getCurrentKg()*0.09*50):'—';

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:368:26
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(kEl)kEl.textContent=tp.t === 'off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:368:50
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg() * 0.09 / 50):'—';

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:368:50
-     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg()*0.09*50):'—';
+     if(kEl)kEl.textContent=tp.t!=='off'?Math.round(SYS.getCurrentKg() / 0.09*50):'—';

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:369:28
-     const weekAgo=new Date();weekAgo.setDate(weekAgo.getDate()-7);
+     const weekAgo=new Date();weekAgo.setTime(weekAgo.getDate() - 7);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:369:44
-     const weekAgo=new Date();weekAgo.setDate(weekAgo.getDate()-7);
+     const weekAgo=new Date();weekAgo.setDate(weekAgo.getDate() + 7);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:371:6
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(true)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:371:6
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(false)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:371:26
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.length;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:371:38
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:371:41
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>true).length;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:371:41
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>false).length;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:371:41
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline || new Date(l.date) >= weekAgo).length;

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:371:41
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>l.baseline&&new Date(l.date)>=weekAgo).length;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:371:54
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&true).length;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:371:54
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date) > weekAgo).length;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:371:54
-     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date)>=weekAgo).length;
+     if(wEl)wEl.textContent=logs.filter(l=>!l.baseline&&new Date(l.date) < weekAgo).length;

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:379:38
-   export function toggleExList(dayIdx) {
-     uiToggleFlags.exListExpanded[dayIdx] = !uiToggleFlags.exListExpanded[dayIdx];
-     renderCoachIdle();
-   }
+   export function toggleExList(dayIdx) {}

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:380:42
-     uiToggleFlags.exListExpanded[dayIdx] = !uiToggleFlags.exListExpanded[dayIdx];
+     uiToggleFlags.exListExpanded[dayIdx] = uiToggleFlags.exListExpanded[dayIdx];

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:385:14
-     const logs=DB.get('logs')||[];
+     const logs=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:385:14
-     const logs=DB.get('logs')||[];
+     const logs=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:385:14
-     const logs=DB.get('logs')||[];
+     const logs=DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:385:30
-     const logs=DB.get('logs')||[];
+     const logs=DB.get('logs')||["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:386:16
-     const alerts=[];
+     const alerts=["Stryker was here"];

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:388:22
-     const muscleGroups={
-       umeri:['DB Shoulder Press','Lateral Raises','Rear Delt Fly'],
-       piept:['Incline DB Press','Flat DB Press','Pec Deck / Cable Fly'],
-       spate:['Lat Pulldown','Cable Row','Chest-Supported Row'],
-       brate:['Incline DB Curl','Bayesian Curl','Cable Curl','Preacher Curl','Overhead Triceps','Pushdown']
-     };
+     const muscleGroups={};

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:389:11
-       umeri:['DB Shoulder Press','Lateral Raises','Rear Delt Fly'],
+       umeri:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:390:11
-       piept:['Incline DB Press','Flat DB Press','Pec Deck / Cable Fly'],
+       piept:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:391:11
-       spate:['Lat Pulldown','Cable Row','Chest-Supported Row'],
+       spate:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/renderIdle.js:392:11
-       brate:['Incline DB Curl','Bayesian Curl','Cable Curl','Preacher Curl','Overhead Triceps','Pushdown']
+       brate:[]

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:395:56
-     for(const [grp, exs] of Object.entries(muscleGroups)){
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
-       if(grpLogs.length<3) continue;
-       const avgRPE=grpLogs.reduce((a,b)=>a+b.rpe,0)/grpLogs.length;
-       // Check stagnation: same weight 4+ sessions
-       const exStagnant=exs.filter(ex=>{
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
-         if(exLogs.length<4) return false;
-         const w=exLogs[0].w;
-         return exLogs.slice(0,4).every(l=>l.w===w);
-       });
-   
-       if(avgRPE>=9&&exStagnant.length>0){
-         alerts.push(`${grp.toUpperCase()} LAGGING – RPE ${avgRPE.toFixed(1)} · +1 SET recomandat`);
-         // Auto-set extra volume flag
-         DB.set(`muscle-extra-${grp}`,true);
-       }
-     }
+     for(const [grp, exs] of Object.entries(muscleGroups)){}

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:396:19
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l => exs.includes(l.ex) && l.rpe && !l.baseline);

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:396:19
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.slice(0,6);

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:396:31
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(() => undefined).slice(0,6);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:396:34
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l=>true).slice(0,6);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:396:34
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l=>false).slice(0,6);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:396:34
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l=>exs.includes(l.ex) && l.rpe || !l.baseline).slice(0,6);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:396:34
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l=>true&&!l.baseline).slice(0,6);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:396:34
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l=>exs.includes(l.ex) || l.rpe&&!l.baseline).slice(0,6);

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:396:61
-       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&!l.baseline).slice(0,6);
+       const grpLogs=logs.filter(l=>exs.includes(l.ex)&&l.rpe&&l.baseline).slice(0,6);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:397:8
-       if(grpLogs.length<3) continue;
+       if(true) continue;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:397:8
-       if(grpLogs.length<3) continue;
+       if(false) continue;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:397:8
-       if(grpLogs.length<3) continue;
+       if(grpLogs.length <= 3) continue;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:397:8
-       if(grpLogs.length<3) continue;
+       if(grpLogs.length >= 3) continue;
