[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:398:18
-       const avgRPE=grpLogs.reduce((a,b)=>a+b.rpe,0)/grpLogs.length;
+       const avgRPE=grpLogs.reduce((a, b) => a + b.rpe, 0) * grpLogs.length;

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:398:33
-       const avgRPE=grpLogs.reduce((a,b)=>a+b.rpe,0)/grpLogs.length;
+       const avgRPE=grpLogs.reduce(() => undefined,0)/grpLogs.length;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:398:40
-       const avgRPE=grpLogs.reduce((a,b)=>a+b.rpe,0)/grpLogs.length;
+       const avgRPE=grpLogs.reduce((a,b)=>a - b.rpe,0)/grpLogs.length;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:400:22
-       const exStagnant=exs.filter(ex=>{
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
-         if(exLogs.length<4) return false;
-         const w=exLogs[0].w;
-         return exLogs.slice(0,4).every(l=>l.w===w);
-       });
+       const exStagnant=exs;

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:400:37
-       const exStagnant=exs.filter(ex=>{
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
-         if(exLogs.length<4) return false;
-         const w=exLogs[0].w;
-         return exLogs.slice(0,4).every(l=>l.w===w);
-       });
+       const exStagnant=exs.filter(ex=>{});

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:401:20
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l => l.ex === ex && l.w && !l.baseline);

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:401:20
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.slice(0,5);

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:401:32
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(() => undefined).slice(0,5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>true).slice(0,5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>false).slice(0,5);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>l.ex === ex && l.w || !l.baseline).slice(0,5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>true&&!l.baseline).slice(0,5);

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>l.ex === ex || l.w&&!l.baseline).slice(0,5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>true&&l.w&&!l.baseline).slice(0,5);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:401:35
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>l.ex !== ex&&l.w&&!l.baseline).slice(0,5);

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:401:51
-         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&!l.baseline).slice(0,5);
+         const exLogs=logs.filter(l=>l.ex===ex&&l.w&&l.baseline).slice(0,5);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:402:10
-         if(exLogs.length<4) return false;
+         if(true) return false;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:402:10
-         if(exLogs.length<4) return false;
+         if(false) return false;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:402:10
-         if(exLogs.length<4) return false;
+         if(exLogs.length <= 4) return false;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:402:10
-         if(exLogs.length<4) return false;
+         if(exLogs.length >= 4) return false;

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:402:34
-         if(exLogs.length<4) return false;
+         if(exLogs.length<4) return true;

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:404:14
-         return exLogs.slice(0,4).every(l=>l.w===w);
+         return exLogs.slice(0, 4).some(l => l.w === w);

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:404:14
-         return exLogs.slice(0,4).every(l=>l.w===w);
+         return exLogs.every(l=>l.w===w);

[NoCoverage] ArrowFunction
src/pages/coach/renderIdle.js:404:38
-         return exLogs.slice(0,4).every(l=>l.w===w);
+         return exLogs.slice(0,4).every(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:404:41
-         return exLogs.slice(0,4).every(l=>l.w===w);
+         return exLogs.slice(0,4).every(l=>true);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:404:41
-         return exLogs.slice(0,4).every(l=>l.w===w);
+         return exLogs.slice(0,4).every(l=>false);

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:404:41
-         return exLogs.slice(0,4).every(l=>l.w===w);
+         return exLogs.slice(0,4).every(l=>l.w !== w);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:407:8
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:407:8
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(false){

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:407:8
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(avgRPE >= 9 || exStagnant.length > 0){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:407:8
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(true&&exStagnant.length>0){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:407:8
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(avgRPE > 9&&exStagnant.length>0){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:407:8
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(avgRPE < 9&&exStagnant.length>0){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:407:19
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(avgRPE>=9&&true){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:407:19
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(avgRPE>=9&&exStagnant.length >= 0){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:407:19
-       if(avgRPE>=9&&exStagnant.length>0){
+       if(avgRPE>=9&&exStagnant.length <= 0){

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:407:39
-       if(avgRPE>=9&&exStagnant.length>0){
-         alerts.push(`${grp.toUpperCase()} LAGGING – RPE ${avgRPE.toFixed(1)} · +1 SET recomandat`);
-         // Auto-set extra volume flag
-         DB.set(`muscle-extra-${grp}`,true);
-       }
+       if(avgRPE>=9&&exStagnant.length>0){}

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:408:22
-         alerts.push(`${grp.toUpperCase()} LAGGING – RPE ${avgRPE.toFixed(1)} · +1 SET recomandat`);
+         alerts.push(`${grp.toLowerCase()} LAGGING – RPE ${avgRPE.toFixed(1)} · +1 SET recomandat`);

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:410:36
-         DB.set(`muscle-extra-${grp}`,true);
+         DB.set(`muscle-extra-${grp}`,false);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:417:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:417:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:417:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:418:17
-     const dates = Object.keys(ws).sort().reverse();
+     const dates = Object.keys(ws).sort();

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:418:17
-     const dates = Object.keys(ws).sort().reverse();
+     const dates = Object.keys(ws).reverse();

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:419:7
-     if (!dates.length) return;
+     if (dates.length) return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:419:7
-     if (!dates.length) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:419:7
-     if (!dates.length) return;
+     if (false) return;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:421:32
-     const daysSince = Math.floor((new Date() - lastDate) / 86400000);
+     const daysSince = Math.floor((new Date() - lastDate) * 86400000);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:421:33
-     const daysSince = Math.floor((new Date() - lastDate) / 86400000);
+     const daysSince = Math.floor((new Date() + lastDate) / 86400000);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:422:7
-     if (daysSince >= 3) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:422:7
-     if (daysSince >= 3) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:422:7
-     if (daysSince >= 3) {
+     if (daysSince > 3) {

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:422:7
-     if (daysSince >= 3) {
+     if (daysSince < 3) {

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:422:23
-     if (daysSince >= 3) {
-       // Afișăm un banner non-intruziv pe coach screen
-       const existing = $('weight-reminder-banner');
-       if (existing) return;
-       const banner = document.createElement('div');
-       banner.id = 'weight-reminder-banner';
-       banner.style.cssText = 'position:fixed;bottom:70px;left:16px;right:16px;background:var(--card);border:1px solid var(--accent2);border-radius:var(--rs);padding:12px 16px;z-index:50;display:flex;align-items:center;justify-content:space-between;gap:12px';
-       banner.innerHTML = `
-         <div>
-           <div style="font-size:13px;font-weight:700;color:var(--accent2)">AI GRIJĂ — ${daysSince} ZILE FĂRĂ GREUTATE</div>
-           <div style="font-size:11px;color:var(--text3);margin-top:2px">Verifică greutatea în ultimele zile</div>
-         </div>
-         <button onclick="sp('weight',document.querySelectorAll('.nb')[2]);document.getElementById('weight-reminder-banner').remove()"
-           style="background:var(--accent2);color:#000;font-weight:700;font-size:11px;padding:8px 14px;border:none;border-radius:var(--rs);cursor:pointer;font-family:'DM Sans',sans-serif;white-space:nowrap">LOGHEAZĂ</button>
-       `;
-       document.body.appendChild(banner);
-       setTimeout(() => { if(banner.parentNode) banner.remove(); }, 15000);
-     }
+     if (daysSince >= 3) {}

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:425:9
-       if (existing) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:425:9
-       if (existing) return;
+       if (false) return;

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:438:22
-       setTimeout(() => { if(banner.parentNode) banner.remove(); }, 15000);
+       setTimeout(() => {}, 15000);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:438:27
-       setTimeout(() => { if(banner.parentNode) banner.remove(); }, 15000);
+       setTimeout(() => { if(true) banner.remove(); }, 15000);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:438:27
-       setTimeout(() => { if(banner.parentNode) banner.remove(); }, 15000);
+       setTimeout(() => { if(false) banner.remove(); }, 15000);

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:442:33
-   export function saveStepsQuick(){
-     const inp=$('steps-quick-input');
-     if(!inp)return;
-     const steps=parseInt(inp.value);
-     if(isNaN(steps)||steps<0)return;
-     DB.set('steps-today',steps);
-     const target=8000;
-     if(steps>=target){
-       const streaks=DB.get('step-streaks')||{count:0,lastDate:'',totalDays:0};
-       const today=tod();
-       if(streaks.lastDate!==today){
-         const yesterday=new Date();yesterday.setDate(yesterday.getDate()-1);
-         const yStr=todDate(yesterday);
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
-         streaks.lastDate=today;
-         streaks.totalDays=(streaks.totalDays||0)+1;
-         DB.set('step-streaks',streaks);
-       }
-       toast('✅ Quest completat! 🔥','var(--purple)');
-     } else {
-       toast(`✓ ${steps.toLocaleString()} pași`);
-     }
-     renderCoachIdle();
-   }
+   export function saveStepsQuick(){}

[NoCoverage] BooleanLiteral
src/pages/coach/renderIdle.js:444:6
-     if(!inp)return;
+     if(inp)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:444:6
-     if(!inp)return;
+     if(true)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:444:6
-     if(!inp)return;
+     if(false)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:446:6
-     if(isNaN(steps)||steps<0)return;
+     if(true)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:446:6
-     if(isNaN(steps)||steps<0)return;
+     if(false)return;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:446:6
-     if(isNaN(steps)||steps<0)return;
+     if(isNaN(steps) && steps < 0)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:446:20
-     if(isNaN(steps)||steps<0)return;
+     if(isNaN(steps)||false)return;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:446:20
-     if(isNaN(steps)||steps<0)return;
+     if(isNaN(steps)||steps <= 0)return;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:446:20
-     if(isNaN(steps)||steps<0)return;
+     if(isNaN(steps)||steps >= 0)return;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:449:6
-     if(steps>=target){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:449:6
-     if(steps>=target){
+     if(false){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:449:6
-     if(steps>=target){
+     if(steps > target){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:449:6
-     if(steps>=target){
+     if(steps < target){

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:449:20
-     if(steps>=target){
-       const streaks=DB.get('step-streaks')||{count:0,lastDate:'',totalDays:0};
-       const today=tod();
-       if(streaks.lastDate!==today){
-         const yesterday=new Date();yesterday.setDate(yesterday.getDate()-1);
-         const yStr=todDate(yesterday);
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
-         streaks.lastDate=today;
-         streaks.totalDays=(streaks.totalDays||0)+1;
-         DB.set('step-streaks',streaks);
-       }
-       toast('✅ Quest completat! 🔥','var(--purple)');
-     } else {
+     if(steps>=target){} else {

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:450:19
-       const streaks=DB.get('step-streaks')||{count:0,lastDate:'',totalDays:0};
+       const streaks=true;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:450:19
-       const streaks=DB.get('step-streaks')||{count:0,lastDate:'',totalDays:0};
+       const streaks=false;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:450:19
-       const streaks=DB.get('step-streaks')||{count:0,lastDate:'',totalDays:0};
+       const streaks=DB.get('step-streaks') && {
+     count: 0,
+     lastDate: '',
+     totalDays: 0
+   };

[NoCoverage] ObjectLiteral
src/pages/coach/renderIdle.js:450:43
-       const streaks=DB.get('step-streaks')||{count:0,lastDate:'',totalDays:0};
+       const streaks=DB.get('step-streaks')||{};

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:452:8
-       if(streaks.lastDate!==today){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:452:8
-       if(streaks.lastDate!==today){
+       if(false){

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:452:8
-       if(streaks.lastDate!==today){
+       if(streaks.lastDate === today){

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:452:33
-       if(streaks.lastDate!==today){
-         const yesterday=new Date();yesterday.setDate(yesterday.getDate()-1);
-         const yStr=todDate(yesterday);
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
-         streaks.lastDate=today;
-         streaks.totalDays=(streaks.totalDays||0)+1;
-         DB.set('step-streaks',streaks);
-       }
+       if(streaks.lastDate!==today){}

[NoCoverage] MethodExpression
src/pages/coach/renderIdle.js:453:34
-         const yesterday=new Date();yesterday.setDate(yesterday.getDate()-1);
+         const yesterday=new Date();yesterday.setTime(yesterday.getDate() - 1);

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:453:52
-         const yesterday=new Date();yesterday.setDate(yesterday.getDate()-1);
+         const yesterday=new Date();yesterday.setDate(yesterday.getDate() + 1);

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:455:21
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
+         streaks.count=true?streaks.count+1:1;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:455:21
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
+         streaks.count=false?streaks.count+1:1;

[NoCoverage] EqualityOperator
src/pages/coach/renderIdle.js:455:21
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
+         streaks.count=streaks.lastDate !== yStr?streaks.count+1:1;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:455:45
-         streaks.count=streaks.lastDate===yStr?streaks.count+1:1;
+         streaks.count=streaks.lastDate===yStr?streaks.count - 1:1;

[NoCoverage] ArithmeticOperator
src/pages/coach/renderIdle.js:457:25
-         streaks.totalDays=(streaks.totalDays||0)+1;
+         streaks.totalDays=(streaks.totalDays || 0) - 1;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:457:26
-         streaks.totalDays=(streaks.totalDays||0)+1;
+         streaks.totalDays=(true)+1;

[NoCoverage] ConditionalExpression
src/pages/coach/renderIdle.js:457:26
-         streaks.totalDays=(streaks.totalDays||0)+1;
+         streaks.totalDays=(false)+1;

[NoCoverage] LogicalOperator
src/pages/coach/renderIdle.js:457:26
-         streaks.totalDays=(streaks.totalDays||0)+1;
+         streaks.totalDays=(streaks.totalDays && 0)+1;

[NoCoverage] BlockStatement
src/pages/coach/renderIdle.js:461:10
-     } else {
-       toast(`✓ ${steps.toLocaleString()} pași`);
-     }
+     } else {}

[Survived] ConditionalExpression
src/pages/coach/renderIdle.js:20:28
-     STAGNATION: (p) => `📊 ${p.exercises?.length || 0} exerciții stagnate 3+ săptămâni`,
+     STAGNATION: (p) => `📊 ${true} exerciții stagnate 3+ săptămâni`,
Tests ran:
    formatPatternMessage 9. STAGNATION: output contains exercises count

[Survived] ConditionalExpression
src/pages/coach/renderIdle.js:20:28
-     STAGNATION: (p) => `📊 ${p.exercises?.length || 0} exerciții stagnate 3+ săptămâni`,
+     STAGNATION: (p) => `📊 ${false} exerciții stagnate 3+ săptămâni`,
Tests ran:
    formatPatternMessage 9. STAGNATION: output contains exercises count

[Survived] LogicalOperator
src/pages/coach/renderIdle.js:20:28
-     STAGNATION: (p) => `📊 ${p.exercises?.length || 0} exerciții stagnate 3+ săptămâni`,
+     STAGNATION: (p) => `📊 ${p.exercises?.length && 0} exerciții stagnate 3+ săptămâni`,
Tests ran:
    formatPatternMessage 9. STAGNATION: output contains exercises count

[Survived] OptionalChaining
src/pages/coach/renderIdle.js:20:28
-     STAGNATION: (p) => `📊 ${p.exercises?.length || 0} exerciții stagnate 3+ săptămâni`,
+     STAGNATION: (p) => `📊 ${p.exercises.length || 0} exerciții stagnate 3+ săptămâni`,
Tests ran:
    formatPatternMessage 9. STAGNATION: output contains exercises count

[Survived] ConditionalExpression
src/pages/coach/renderIdle.js:38:9
-       if (typeof console !== 'undefined') {
+       if (true) {
Tests ran:
    formatPatternMessage 10. Unknown pattern type returns null and calls console.warn

[Survived] ArrowFunction
src/pages/coach/renderIdle.js:21:15
-     PEAK_HOURS: (p) => `📊 Peak hours detectat: ${p.hours || 'analiză activă'}`,
+     PEAK_HOURS: () => undefined,
Ran all tests for this mutant.

[NoCoverage] ArithmeticOperator
src/pages/coach/restTimer.js:9:26
-   const INACTIVITY_DELAY = 2 * 60 * 1000;
+   const INACTIVITY_DELAY = 2 * 60 / 1000;

[NoCoverage] ArithmeticOperator
src/pages/coach/restTimer.js:9:26
-   const INACTIVITY_DELAY = 2 * 60 * 1000;
+   const INACTIVITY_DELAY = 2 / 60 * 1000;

[NoCoverage] BlockStatement
src/pages/coach/restTimer.js:12:35
-   export function getSmartPause(ex) {
-     const base = COMPOUND_EX.includes(ex) ? PAUSE_COMPOUND : PAUSE_ISO;
-     const rir = SYS.getTempo(ex)?.rir ?? 2;
-     let adj = 0;
-     if (rir <= 1) adj = 30;
-     else if (rir <= 2) adj = 0;
-     else if (rir <= 3) adj = -15;
-     else adj = -30;
-     return Math.max(30, base + adj);
-   }
+   export function getSmartPause(ex) {}

[NoCoverage] LogicalOperator
src/pages/coach/restTimer.js:14:15
-     const rir = SYS.getTempo(ex)?.rir ?? 2;
+     const rir = SYS.getTempo(ex)?.rir && 2;

[NoCoverage] OptionalChaining
src/pages/coach/restTimer.js:14:15
-     const rir = SYS.getTempo(ex)?.rir ?? 2;
+     const rir = SYS.getTempo(ex).rir ?? 2;

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:16:7
-     if (rir <= 1) adj = 30;
+     if (true) adj = 30;

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:16:7
-     if (rir <= 1) adj = 30;
+     if (false) adj = 30;

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:16:7
-     if (rir <= 1) adj = 30;
+     if (rir < 1) adj = 30;

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:16:7
-     if (rir <= 1) adj = 30;
+     if (rir > 1) adj = 30;

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:17:12
-     else if (rir <= 2) adj = 0;
+     else if (true) adj = 0;

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:17:12
-     else if (rir <= 2) adj = 0;
+     else if (false) adj = 0;

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:17:12
-     else if (rir <= 2) adj = 0;
+     else if (rir < 2) adj = 0;

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:17:12
-     else if (rir <= 2) adj = 0;
+     else if (rir > 2) adj = 0;

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:18:12
-     else if (rir <= 3) adj = -15;
+     else if (true) adj = -15;

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:18:12
-     else if (rir <= 3) adj = -15;
+     else if (false) adj = -15;

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:18:12
-     else if (rir <= 3) adj = -15;
+     else if (rir < 3) adj = -15;

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:18:12
-     else if (rir <= 3) adj = -15;
+     else if (rir > 3) adj = -15;

[NoCoverage] UnaryOperator
src/pages/coach/restTimer.js:18:28
-     else if (rir <= 3) adj = -15;
+     else if (rir <= 3) adj = +15;

[NoCoverage] UnaryOperator
src/pages/coach/restTimer.js:19:14
-     else adj = -30;
+     else adj = +30;

[NoCoverage] MethodExpression
src/pages/coach/restTimer.js:20:10
-     return Math.max(30, base + adj);
+     return Math.min(30, base + adj);

[NoCoverage] ArithmeticOperator
src/pages/coach/restTimer.js:20:23
-     return Math.max(30, base + adj);
+     return Math.max(30, base - adj);

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:31:108
-     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir || 2)}` : '';
+     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(true)}` : '';

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:31:108
-     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir || 2)}` : '';
+     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(false)}` : '';

[NoCoverage] LogicalOperator
src/pages/coach/restTimer.js:31:108
-     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir || 2)}` : '';
+     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir && 2)}` : '';

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:31:121
-     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir || 2)}` : '';
+     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(true).rir || 2)}` : '';

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:31:121
-     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir || 2)}` : '';
+     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(false).rir || 2)}` : '';

[NoCoverage] LogicalOperator
src/pages/coach/restTimer.js:31:121
-     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx || '').rir || 2)}` : '';
+     $('ps-rec-reps').textContent = recNext.repsTarget ? `${recNext.repsTarget} reps · ${DP.getIntensityLabel(SYS.getTempo(nextEx && '').rir || 2)}` : '';

[NoCoverage] BlockStatement
src/pages/coach/restTimer.js:36:40
-     state.pauseTimer = setInterval(() => {
-       state.pauseLeft--;
-       $('ps-timer').textContent = state.pauseLeft;
-       $('ps-progress').style.width = (state.pauseLeft / state.pauseTotal * 100) + '%';
-       if (state.pauseLeft === 10) { beep(660, .1); speak('10 secunde.'); }
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
-       if (state.pauseLeft <= 0) {
-         state.lastPauseEndedAt = Date.now();
-         stopPause(); hidePauseScreen();
-         beepAlert();
-         speak(`${nextEx || state.currentEx}. Gata!`);
-         updateExCard();
-       }
-     }, 1000);
+     state.pauseTimer = setInterval(() => {}, 1000);

[NoCoverage] UpdateOperator
src/pages/coach/restTimer.js:37:5
-       state.pauseLeft--;
+       state.pauseLeft++;

[NoCoverage] ArithmeticOperator
src/pages/coach/restTimer.js:39:37
-       $('ps-progress').style.width = (state.pauseLeft / state.pauseTotal * 100) + '%';
+       $('ps-progress').style.width = (state.pauseLeft / state.pauseTotal / 100) + '%';

[NoCoverage] ArithmeticOperator
src/pages/coach/restTimer.js:39:37
-       $('ps-progress').style.width = (state.pauseLeft / state.pauseTotal * 100) + '%';
+       $('ps-progress').style.width = (state.pauseLeft * state.pauseTotal * 100) + '%';

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:40:9
-       if (state.pauseLeft === 10) { beep(660, .1); speak('10 secunde.'); }
+       if (true) { beep(660, .1); speak('10 secunde.'); }

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:40:9
-       if (state.pauseLeft === 10) { beep(660, .1); speak('10 secunde.'); }
+       if (false) { beep(660, .1); speak('10 secunde.'); }

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:40:9
-       if (state.pauseLeft === 10) { beep(660, .1); speak('10 secunde.'); }
+       if (state.pauseLeft !== 10) { beep(660, .1); speak('10 secunde.'); }

[NoCoverage] BlockStatement
src/pages/coach/restTimer.js:40:33
-       if (state.pauseLeft === 10) { beep(660, .1); speak('10 secunde.'); }
+       if (state.pauseLeft === 10) {}

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:41:9
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
+       if (true) beep(880, .08);

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:41:9
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
+       if (false) beep(880, .08);

[NoCoverage] LogicalOperator
src/pages/coach/restTimer.js:41:9
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
+       if (state.pauseLeft <= 3 || state.pauseLeft > 0) beep(880, .08);

[NoCoverage] ConditionalExpression
src/pages/coach/restTimer.js:41:9
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
+       if (true && state.pauseLeft > 0) beep(880, .08);

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:41:9
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
+       if (state.pauseLeft < 3 && state.pauseLeft > 0) beep(880, .08);

[NoCoverage] EqualityOperator
src/pages/coach/restTimer.js:41:9
-       if (state.pauseLeft <= 3 && state.pauseLeft > 0) beep(880, .08);
+       if (state.pauseLeft > 3 && state.pauseLeft > 0) beep(880, .08);
