[Survived] ArrowFunction
src/pages/coach/session.js:172:44
-     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) || 8)), 0);
+     const totalVolume = state.sessLog.reduce(() => undefined, 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArithmeticOperator
src/pages/coach/session.js:172:54
-     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) || 8)), 0);
+     const totalVolume = state.sessLog.reduce((a, s) => a - s.w * (parseInt(s.reps) || 8), 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArithmeticOperator
src/pages/coach/session.js:172:59
-     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) || 8)), 0);
+     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w / (parseInt(s.reps) || 8)), 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:172:66
-     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) || 8)), 0);
+     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (true)), 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:172:66
-     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) || 8)), 0);
+     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (false)), 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:172:66
-     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) || 8)), 0);
+     const totalVolume = state.sessLog.reduce((a, s) => a + (s.w * (parseInt(s.reps) && 8)), 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrayDeclaration
src/pages/coach/session.js:174:20
-     const uniqueEx = [...new Set(state.sessLog.map(s => s.ex))];
+     const uniqueEx = [];
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:174:50
-     const uniqueEx = [...new Set(state.sessLog.map(s => s.ex))];
+     const uniqueEx = [...new Set(state.sessLog.map(() => undefined))];
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:175:18
-     const avgRPE = state.sessLog.filter(s => s.rpe).reduce((a, s, _, arr) => a + s.rpe / arr.length, 0);
+     const avgRPE = state.sessLog.reduce((a, s, _, arr) => a + s.rpe / arr.length, 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:175:39
-     const avgRPE = state.sessLog.filter(s => s.rpe).reduce((a, s, _, arr) => a + s.rpe / arr.length, 0);
+     const avgRPE = state.sessLog.filter(() => undefined).reduce((a, s, _, arr) => a + s.rpe / arr.length, 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:175:58
-     const avgRPE = state.sessLog.filter(s => s.rpe).reduce((a, s, _, arr) => a + s.rpe / arr.length, 0);
+     const avgRPE = state.sessLog.filter(s => s.rpe).reduce(() => undefined, 0);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:176:39
-     const notes = state.sessLog.flatMap(s => s.notes || []);
+     const notes = state.sessLog.flatMap(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:176:44
-     const notes = state.sessLog.flatMap(s => s.notes || []);
+     const notes = state.sessLog.flatMap(s => true);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:176:44
-     const notes = state.sessLog.flatMap(s => s.notes || []);
+     const notes = state.sessLog.flatMap(s => false);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:176:44
-     const notes = state.sessLog.flatMap(s => s.notes || []);
+     const notes = state.sessLog.flatMap(s => s.notes && []);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrayDeclaration
src/pages/coach/session.js:176:55
-     const notes = state.sessLog.flatMap(s => s.notes || []);
+     const notes = state.sessLog.flatMap(s => s.notes || ["Stryker was here"]);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:177:22
-     const feltStrong = notes.filter(n => n === 'strong').length;
+     const feltStrong = notes.length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:177:35
-     const feltStrong = notes.filter(n => n === 'strong').length;
+     const feltStrong = notes.filter(() => undefined).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:178:21
-     const feltHeavy = notes.filter(n => n === 'form' || n === 'fatigue').length;
+     const feltHeavy = notes.length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:178:34
-     const feltHeavy = notes.filter(n => n === 'form' || n === 'fatigue').length;
+     const feltHeavy = notes.filter(() => undefined).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:179:21
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = true ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:179:21
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = false ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:179:21
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = feltStrong >= feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:179:21
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = feltStrong <= feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:179:71
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : true ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:179:71
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : false ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:179:71
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy >= feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:179:71
-     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy > feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
+     const moodLabel = feltStrong > feltHeavy ? '💪 Sesiune puternică' : feltHeavy <= feltStrong ? '😓 Sesiune grea' : '⚡ Sesiune ok';
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrayDeclaration
src/pages/coach/session.js:182:37
-     const allLogs = DB.get('logs') || [];
+     const allLogs = DB.get('logs') || ["Stryker was here"];
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrayDeclaration
src/pages/coach/session.js:183:15
-     const prs = [];
+     const prs = ["Stryker was here"];
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] BlockStatement
src/pages/coach/session.js:184:26
-     uniqueEx.forEach(ex => {
-       const thisSess = state.sessLog.filter(s => s.ex === ex);
-       const bestKg = Math.max(...thisSess.map(s => s.w));
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
-       // Compare to historical (exclude today's session)
-       const historical = allLogs.filter(l => l.ex === ex && l.session !== state.sessStart && !l.baseline);
-       if (!historical.length) {
-         prs.push({ ex, type: 'prima', label: `${ex} — Prima sesiune! ${bestKg}kg × ${bestReps}` });
-       } else {
-         const histBestKg = Math.max(...historical.map(l => l.w || 0));
-         const histBestReps = Math.max(...historical.filter(l => l.w === histBestKg).map(l => parseInt(l.reps) || 8));
-         if (bestKg > histBestKg) {
-           prs.push({ ex, type: 'kg', label: `${ex}: +${bestKg - histBestKg}kg nou maxim (${bestKg}kg × ${bestReps})` });
-         } else if (bestKg === histBestKg && bestReps > histBestReps) {
-           prs.push({ ex, type: 'reps', label: `${ex}: +${bestReps - histBestReps} reps (${bestKg}kg × ${bestReps})` });
-         }
-       }
-     });
+     uniqueEx.forEach(ex => {});
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession

[Survived] MethodExpression
src/pages/coach/session.js:185:22
-       const thisSess = state.sessLog.filter(s => s.ex === ex);
+       const thisSess = state.sessLog;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:185:43
-       const thisSess = state.sessLog.filter(s => s.ex === ex);
+       const thisSess = state.sessLog.filter(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:185:48
-       const thisSess = state.sessLog.filter(s => s.ex === ex);
+       const thisSess = state.sessLog.filter(s => true);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:185:48
-       const thisSess = state.sessLog.filter(s => s.ex === ex);
+       const thisSess = state.sessLog.filter(s => false);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:185:48
-       const thisSess = state.sessLog.filter(s => s.ex === ex);
+       const thisSess = state.sessLog.filter(s => s.ex !== ex);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:186:20
-       const bestKg = Math.max(...thisSess.map(s => s.w));
+       const bestKg = Math.min(...thisSess.map(s => s.w));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:186:45
-       const bestKg = Math.max(...thisSess.map(s => s.w));
+       const bestKg = Math.max(...thisSess.map(() => undefined));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:187:22
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.min(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:187:34
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.map(s => parseInt(s.reps) || 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:187:50
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(() => undefined).map(s => parseInt(s.reps) || 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:187:55
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => true).map(s => parseInt(s.reps) || 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:187:55
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => false).map(s => parseInt(s.reps) || 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:187:75
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(() => undefined));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:187:55
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => s.w !== bestKg).map(s => parseInt(s.reps) || 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:187:80
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => true));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:187:80
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => false));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:187:80
-       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) || 8));
+       const bestReps = Math.max(...thisSess.filter(s => s.w === bestKg).map(s => parseInt(s.reps) && 8));
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:189:24
-       const historical = allLogs.filter(l => l.ex === ex && l.session !== state.sessStart && !l.baseline);
+       const historical = allLogs;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:189:39
-       const historical = allLogs.filter(l => l.ex === ex && l.session !== state.sessStart && !l.baseline);
+       const historical = allLogs.filter(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/pages/coach/session.js:190:9
-       if (!historical.length) {
+       if (historical.length) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!
