[Survived] ConditionalExpression
src/pages/coach/session.js:190:9
-       if (!historical.length) {
+       if (true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:190:9
-       if (!historical.length) {
+       if (false) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/pages/coach/session.js:190:29
-       if (!historical.length) {
-         prs.push({ ex, type: 'prima', label: `${ex} — Prima sesiune! ${bestKg}kg × ${bestReps}` });
-       } else {
+       if (!historical.length) {} else {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/pages/coach/session.js:191:16
-         prs.push({ ex, type: 'prima', label: `${ex} — Prima sesiune! ${bestKg}kg × ${bestReps}` });
+         prs.push({});
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:208:11
-         if (activeEntry) {
+         if (true) {
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:218:25
-           const setsRPE = state.sessLog
-             .filter(s => typeof s.rpe === 'number')
+           const setsRPE = state.sessLog
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:219:19
-             .filter(s => typeof s.rpe === 'number')
+             .filter(() => undefined)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:219:24
-             .filter(s => typeof s.rpe === 'number')
+             .filter(s => true)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:219:24
-             .filter(s => typeof s.rpe === 'number')
+             .filter(s => false)
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:219:24
-             .filter(s => typeof s.rpe === 'number')
+             .filter(s => typeof s.rpe !== 'number')
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:220:16
-             .map(s => s.rpe);
+             .map(() => undefined);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] MethodExpression
src/pages/coach/session.js:224:9
-           cutoff.setDate(cutoff.getDate() - 30);
+           cutoff.setTime(cutoff.getDate() - 30);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArithmeticOperator
src/pages/coach/session.js:224:24
-           cutoff.setDate(cutoff.getDate() - 30);
+           cutoff.setDate(cutoff.getDate() + 30);
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:225:41
-           const recentCDL = readAllActive(e =>
-             e.date < _today && new Date(e.date) >= cutoff
+           const recentCDL = readAllActive(() => undefined
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:226:11
-             e.date < _today && new Date(e.date) >= cutoff
+             true
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:226:11
-             e.date < _today && new Date(e.date) >= cutoff
+             false
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:226:11
-             e.date < _today && new Date(e.date) >= cutoff
+             e.date < _today || new Date(e.date) >= cutoff
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:226:11
-             e.date < _today && new Date(e.date) >= cutoff
+             true && new Date(e.date) >= cutoff
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:226:11
-             e.date < _today && new Date(e.date) >= cutoff
+             e.date <= _today && new Date(e.date) >= cutoff
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:226:11
-             e.date < _today && new Date(e.date) >= cutoff
+             e.date >= _today && new Date(e.date) >= cutoff
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:235:25
-             proposedSets: activeEntry.proposed?.proposedSets ?? 0,  // CRITICAL — needed by AA detector
+             proposedSets: activeEntry.proposed?.proposedSets && 0,  // CRITICAL — needed by AA detector
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/pages/coach/session.js:235:25
-             proposedSets: activeEntry.proposed?.proposedSets ?? 0,  // CRITICAL — needed by AA detector
+             proposedSets: activeEntry.proposed.proposedSets ?? 0,  // CRITICAL — needed by AA detector
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/pages/coach/session.js:245:47
-           const aaResult = detectAutoAggression({
-             currentEntry: { date: _today, outcome: outcomeBase, context: activeEntry.context },
-             recentEntries: recentCDL,
-             hyperfocusData: null,  // FAZA 4 — analytics integration deferred
-           });
+           const aaResult = detectAutoAggression({});
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/pages/coach/session.js:246:25
-             currentEntry: { date: _today, outcome: outcomeBase, context: activeEntry.context },
+             currentEntry: {},
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:253:29
-           const _aaOverride = _cachedDir?.aaOverride ?? null;
+           const _aaOverride = _cachedDir?.aaOverride && null;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] OptionalChaining
src/pages/coach/session.js:253:29
-           const _aaOverride = _cachedDir?.aaOverride ?? null;
+           const _aaOverride = _cachedDir.aaOverride ?? null;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BooleanLiteral
src/pages/coach/session.js:258:44
-             aaOverride: _aaOverride ? true : false,
+             aaOverride: _aaOverride ? true : true,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:259:32
-             aaOverrideRationale: _aaOverride?.rationale ?? null,
+             aaOverrideRationale: _aaOverride?.rationale && null,
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] BlockStatement
src/pages/coach/session.js:267:9
-       try {
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
-           window.Sentry.captureException(err, { tags: { component: 'session', op: 'cdl_outcome' } });
-         }
-       } catch (_) {}
+       try {} catch (_) {}
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] ConditionalExpression
src/pages/coach/session.js:268:11
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+         if (true) {
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] ConditionalExpression
src/pages/coach/session.js:268:11
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+         if (false) {
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] LogicalOperator
src/pages/coach/session.js:268:11
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+         if (typeof window !== 'undefined' || window.Sentry?.captureException) {
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] ConditionalExpression
src/pages/coach/session.js:268:11
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+         if (true && window.Sentry?.captureException) {
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] EqualityOperator
src/pages/coach/session.js:268:11
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+         if (typeof window === 'undefined' && window.Sentry?.captureException) {
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] OptionalChaining
src/pages/coach/session.js:268:44
-         if (typeof window !== 'undefined' && window.Sentry?.captureException) {
+         if (typeof window !== 'undefined' && window.Sentry.captureException) {
Tests ran:
    endSession — CDL outcome (ADR 011) catches immutability error if outcome already set, session still completes

[Survived] MethodExpression
src/pages/coach/session.js:275:21
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ArrowFunction
src/pages/coach/session.js:275:42
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.filter(() => undefined).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:275:47
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.filter(s => true).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:275:47
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.filter(s => false).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:275:47
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined || s.rpe !== null).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:275:47
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.filter(s => true && s.rpe !== null).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:275:47
-     const ratedSets = state.sessLog.filter(s => s.rpe !== undefined && s.rpe !== null).length;
+     const ratedSets = state.sessLog.filter(s => s.rpe === undefined && s.rpe !== null).length;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:276:21
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:276:21
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = false;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] LogicalOperator
src/pages/coach/session.js:276:21
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = state.sessLog.length > 0 || ratedSets === 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:276:21
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = true && ratedSets === 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:276:21
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = state.sessLog.length >= 0 && ratedSets === 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:276:21
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = state.sessLog.length <= 0 && ratedSets === 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] EqualityOperator
src/pages/coach/session.js:276:49
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = state.sessLog.length > 0 && ratedSets !== 0;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:276:49
-     const noneRated = state.sessLog.length > 0 && ratedSets === 0;
+     const noneRated = state.sessLog.length > 0 && true;
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
    endSession — CDL outcome (ADR 011) sets matchScore=null + deviation=true when sessType differs from proposed
  and 2 more tests!

[Survived] ObjectLiteral
src/pages/coach/session.js:277:21
-     showSessionRating({ mins, kcal, totalVolume, totalSets, uniqueEx, avgRPE, prs, noneRated });
+     showSessionRating({});
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 3 more tests!

[Survived] BlockStatement
src/pages/coach/session.js:349:35
-   export function releaseWakeLock() {
-     try { if (wakeLockRef.current) { wakeLockRef.current.release(); wakeLockRef.current = null; } } catch (e) {}
-   }
+   export function releaseWakeLock() {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 5 more tests!

[Survived] BlockStatement
src/pages/coach/session.js:350:7
-     try { if (wakeLockRef.current) { wakeLockRef.current.release(); wakeLockRef.current = null; } } catch (e) {}
+     try {} catch (e) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:350:13
-     try { if (wakeLockRef.current) { wakeLockRef.current.release(); wakeLockRef.current = null; } } catch (e) {}
+     try { if (true) { wakeLockRef.current.release(); wakeLockRef.current = null; } } catch (e) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 5 more tests!

[Survived] ConditionalExpression
src/pages/coach/session.js:350:13
-     try { if (wakeLockRef.current) { wakeLockRef.current.release(); wakeLockRef.current = null; } } catch (e) {}
+     try { if (false) { wakeLockRef.current.release(); wakeLockRef.current = null; } } catch (e) {}
Tests ran:
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 5 more tests!

[NoCoverage] ObjectLiteral
src/pages/coach/state.js:1:29
-   export const sessionCache = {
-     session: null,
-     timestamp: null,
-     TTL_MS: 5 * 60 * 1000,
-     get() {
-       if (!this.session) return null;
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
-       return this.session;
-     },
-     set(s) { this.session = s; this.timestamp = Date.now(); },
-     invalidate() { this.session = null; this.timestamp = null; console.log('[Cache] Director session invalidated'); }
-   };
+   export const sessionCache = {};

[NoCoverage] ArithmeticOperator
src/pages/coach/state.js:4:11
-     TTL_MS: 5 * 60 * 1000,
+     TTL_MS: 5 * 60 / 1000,

[NoCoverage] ArithmeticOperator
src/pages/coach/state.js:4:11
-     TTL_MS: 5 * 60 * 1000,
+     TTL_MS: 5 / 60 * 1000,

[NoCoverage] BlockStatement
src/pages/coach/state.js:5:9
-     get() {
-       if (!this.session) return null;
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
-       return this.session;
-     },
+     get() {},

[NoCoverage] BooleanLiteral
src/pages/coach/state.js:6:9
-       if (!this.session) return null;
+       if (this.session) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/state.js:6:9
-       if (!this.session) return null;
+       if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/state.js:6:9
-       if (!this.session) return null;
+       if (false) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/state.js:7:9
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
+       if (true) { this.session = null; return null; }
