[NoCoverage] ConditionalExpression
src/pages/coach/state.js:7:9
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
+       if (false) { this.session = null; return null; }

[NoCoverage] EqualityOperator
src/pages/coach/state.js:7:9
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
+       if (Date.now() - this.timestamp >= this.TTL_MS) { this.session = null; return null; }

[NoCoverage] EqualityOperator
src/pages/coach/state.js:7:9
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
+       if (Date.now() - this.timestamp <= this.TTL_MS) { this.session = null; return null; }

[NoCoverage] ArithmeticOperator
src/pages/coach/state.js:7:9
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
+       if (Date.now() + this.timestamp > this.TTL_MS) { this.session = null; return null; }

[NoCoverage] BlockStatement
src/pages/coach/state.js:7:52
-       if (Date.now() - this.timestamp > this.TTL_MS) { this.session = null; return null; }
+       if (Date.now() - this.timestamp > this.TTL_MS) {}

[NoCoverage] BlockStatement
src/pages/coach/state.js:10:10
-     set(s) { this.session = s; this.timestamp = Date.now(); },
+     set(s) {},

[NoCoverage] BlockStatement
src/pages/coach/state.js:11:16
-     invalidate() { this.session = null; this.timestamp = null; console.log('[Cache] Director session invalidated'); }
+     invalidate() {}

[NoCoverage] ConditionalExpression
src/pages/coach/state.js:13:5
-   if (typeof window !== 'undefined') window._directorCache = sessionCache;
+   if (true) window._directorCache = sessionCache;

[NoCoverage] ConditionalExpression
src/pages/coach/state.js:13:5
-   if (typeof window !== 'undefined') window._directorCache = sessionCache;
+   if (false) window._directorCache = sessionCache;

[NoCoverage] EqualityOperator
src/pages/coach/state.js:13:5
-   if (typeof window !== 'undefined') window._directorCache = sessionCache;
+   if (typeof window === 'undefined') window._directorCache = sessionCache;

[NoCoverage] BlockStatement
src/pages/coach/state.js:16:37
-   export function getCachedDirector() { return _cachedDirectorValue; }
+   export function getCachedDirector() {}

[NoCoverage] BlockStatement
src/pages/coach/state.js:17:38
-   export function setCachedDirector(s) { _cachedDirectorValue = s; }
+   export function setCachedDirector(s) {}

[NoCoverage] ObjectLiteral
src/pages/coach/state.js:19:28
-   export const wakeLockRef = { current: null };
+   export const wakeLockRef = {};

[NoCoverage] ObjectLiteral
src/pages/coach/state.js:20:30
-   export const uiToggleFlags = { exListExpanded: {}, prWallExpanded: false };
+   export const uiToggleFlags = {};

[NoCoverage] BooleanLiteral
src/pages/coach/state.js:20:68
-   export const uiToggleFlags = { exListExpanded: {}, prWallExpanded: false };
+   export const uiToggleFlags = { exListExpanded: {}, prWallExpanded: true };

[NoCoverage] BlockStatement
src/pages/coach/util.js:6:32
-   export function isInCutPhase() {
-     const phase = DB.get('phase-override') || 'AUTO';
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
-   }
+   export function isInCutPhase() {}

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:7:17
-     const phase = DB.get('phase-override') || 'AUTO';
+     const phase = true;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:7:17
-     const phase = DB.get('phase-override') || 'AUTO';
+     const phase = false;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:7:17
-     const phase = DB.get('phase-override') || 'AUTO';
+     const phase = DB.get('phase-override') && 'AUTO';

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:8:10
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return true;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:8:10
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return false;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:8:10
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' && phase === 'AUTO' && new Date() < TARGET_DATE;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:8:10
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return false || (phase === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:8:10
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase !== 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:8:30
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (false);

[NoCoverage] LogicalOperator
src/pages/coach/util.js:8:30
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (phase === 'AUTO' || new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:8:30
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (true && new Date() < TARGET_DATE);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:8:30
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (phase !== 'AUTO' && new Date() < TARGET_DATE);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:8:50
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (phase === 'AUTO' && true);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:8:50
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (phase === 'AUTO' && new Date() <= TARGET_DATE);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:8:50
-     return phase === 'CUT' || (phase === 'AUTO' && new Date() < TARGET_DATE);
+     return phase === 'CUT' || (phase === 'AUTO' && new Date() >= TARGET_DATE);

[NoCoverage] BlockStatement
src/pages/coach/util.js:11:57
-   export function formatSetsReps(rawStr, exName, isInCut) {
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
-     if (!m) return rawStr;
-     const sets = m[1];
-     const rMin = parseInt(m[2]);
-     const rMax = m[3] ? parseInt(m[3]) : rMin;
-     const suffix = m[4] || '';
-     if (rMax <= 10 || rMax > 15) return rawStr;
-     return `${sets}×${Math.min(rMin, 10)}${suffix}`;
-   }
+   export function formatSetsReps(rawStr, exName, isInCut) {}

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:12:7
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if (true) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:12:7
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if (false) return rawStr;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:12:7
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if ((!isInCut || !rawStr) && COMPOUND_EX.includes(exName)) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:12:7
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if (false || COMPOUND_EX.includes(exName)) return rawStr;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:12:7
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if (!isInCut && !rawStr || COMPOUND_EX.includes(exName)) return rawStr;

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:12:7
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if (isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:12:19
-     if (!isInCut || !rawStr || COMPOUND_EX.includes(exName)) return rawStr;
+     if (!isInCut || rawStr || COMPOUND_EX.includes(exName)) return rawStr;

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/(\d+)×(\d+)(?:–(\d+))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d)×(\d+)(?:–(\d+))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\D+)×(\d+)(?:–(\d+))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\d)(?:–(\d+))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\D+)(?:–(\d+))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\D+))?(.*)$/u);

[NoCoverage] Regex
src/pages/coach/util.js:13:26
-     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.*)$/u);
+     const m = rawStr.match(/^(\d+)×(\d+)(?:–(\d+))?(.)$/u);

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:14:7
-     if (!m) return rawStr;
+     if (m) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:14:7
-     if (!m) return rawStr;
+     if (true) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:14:7
-     if (!m) return rawStr;
+     if (false) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:18:18
-     const suffix = m[4] || '';
+     const suffix = true;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:18:18
-     const suffix = m[4] || '';
+     const suffix = false;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:18:18
-     const suffix = m[4] || '';
+     const suffix = m[4] && '';

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:19:7
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (true) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:19:7
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (false) return rawStr;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:19:7
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (rMax <= 10 && rMax > 15) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:19:7
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (false || rMax > 15) return rawStr;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:19:7
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (rMax < 10 || rMax > 15) return rawStr;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:19:7
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (rMax > 10 || rMax > 15) return rawStr;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:19:21
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (rMax <= 10 || false) return rawStr;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:19:21
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (rMax <= 10 || rMax >= 15) return rawStr;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:19:21
-     if (rMax <= 10 || rMax > 15) return rawStr;
+     if (rMax <= 10 || rMax <= 15) return rawStr;

[NoCoverage] MethodExpression
src/pages/coach/util.js:20:21
-     return `${sets}×${Math.min(rMin, 10)}${suffix}`;
+     return `${sets}×${Math.max(rMin, 10)}${suffix}`;

[NoCoverage] BlockStatement
src/pages/coach/util.js:23:34
-   export function getGroupColor(g) {
-     const c = {spate:'#4fc3f7',piept:'#ffd54f',umeri:'#ffb74d',brate:'#a1887f',picioare:'#81c784',triceps:'#e0e0e0'};
-     return c[g] || 'var(--text3)';
-   }
+   export function getGroupColor(g) {}

[NoCoverage] ObjectLiteral
src/pages/coach/util.js:24:13
-     const c = {spate:'#4fc3f7',piept:'#ffd54f',umeri:'#ffb74d',brate:'#a1887f',picioare:'#81c784',triceps:'#e0e0e0'};
+     const c = {};

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:25:10
-     return c[g] || 'var(--text3)';
+     return true;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:25:10
-     return c[g] || 'var(--text3)';
+     return false;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:25:10
-     return c[g] || 'var(--text3)';
+     return c[g] && 'var(--text3)';

[NoCoverage] BlockStatement
src/pages/coach/util.js:28:32
-   export function getExGroup(ex) {
-     const g = {
-       spate:['Lat Pulldown','Cable Row','Chest-Supported Row','Face Pulls'],
-       piept:['Incline DB Press','Flat DB Press','Pec Deck / Cable Fly'],
-       umeri:['DB Shoulder Press','Lateral Raises','Rear Delt Fly'],
-       brate:['Incline DB Curl','Bayesian Curl','Cable Curl','Preacher Curl'],
-       triceps:['Overhead Triceps','Pushdown'],
-       picioare:['Romanian Deadlift','Leg Press','Leg Curl','Leg Extension','Calf Raises']
-     };
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
-     return 'EXERCIȚIU';
-   }
+   export function getExGroup(ex) {}

[NoCoverage] ObjectLiteral
src/pages/coach/util.js:29:13
-     const g = {
-       spate:['Lat Pulldown','Cable Row','Chest-Supported Row','Face Pulls'],
-       piept:['Incline DB Press','Flat DB Press','Pec Deck / Cable Fly'],
-       umeri:['DB Shoulder Press','Lateral Raises','Rear Delt Fly'],
-       brate:['Incline DB Curl','Bayesian Curl','Cable Curl','Preacher Curl'],
-       triceps:['Overhead Triceps','Pushdown'],
-       picioare:['Romanian Deadlift','Leg Press','Leg Curl','Leg Extension','Calf Raises']
-     };
+     const g = {};

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:30:11
-       spate:['Lat Pulldown','Cable Row','Chest-Supported Row','Face Pulls'],
+       spate:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:31:11
-       piept:['Incline DB Press','Flat DB Press','Pec Deck / Cable Fly'],
+       piept:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:32:11
-       umeri:['DB Shoulder Press','Lateral Raises','Rear Delt Fly'],
+       umeri:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:33:11
-       brate:['Incline DB Curl','Bayesian Curl','Cable Curl','Preacher Curl'],
+       brate:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:34:13
-       triceps:['Overhead Triceps','Pushdown'],
+       triceps:[],

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:35:14
-       picioare:['Romanian Deadlift','Leg Press','Leg Curl','Leg Extension','Calf Raises']
+       picioare:[]

[NoCoverage] BlockStatement
src/pages/coach/util.js:37:47
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
+     for (const [grp, exs] of Object.entries(g)) {}

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:37:53
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
+     for (const [grp, exs] of Object.entries(g)) { if (true) return grp.toUpperCase(); }

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:37:53
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
+     for (const [grp, exs] of Object.entries(g)) { if (false) return grp.toUpperCase(); }

[NoCoverage] MethodExpression
src/pages/coach/util.js:37:53
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
+     for (const [grp, exs] of Object.entries(g)) { if (exs.every(e => ex.includes(e))) return grp.toUpperCase(); }

[NoCoverage] ArrowFunction
src/pages/coach/util.js:37:62
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
+     for (const [grp, exs] of Object.entries(g)) { if (exs.some(() => undefined)) return grp.toUpperCase(); }

[NoCoverage] MethodExpression
src/pages/coach/util.js:37:91
-     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toUpperCase(); }
+     for (const [grp, exs] of Object.entries(g)) { if (exs.some(e => ex.includes(e))) return grp.toLowerCase(); }

[NoCoverage] BlockStatement
src/pages/coach/util.js:41:38
-   export function getDisplayTime(prog) {
-     if (!prog) return null;
-     const adaptive = getAdaptiveTime(prog.day);
-     if (adaptive) return `~${adaptive} min`;
-     const accurate = calcAccurateTime(prog);
-     if (accurate) return `~${accurate} min`;
-     if (prog.tm) return prog.tm.includes('min') ? prog.tm : `~${prog.tm}`;
-     return null;
-   }
+   export function getDisplayTime(prog) {}

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:42:7
-     if (!prog) return null;
+     if (prog) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:42:7
-     if (!prog) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:42:7
-     if (!prog) return null;
+     if (false) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:44:7
-     if (adaptive) return `~${adaptive} min`;
+     if (true) return `~${adaptive} min`;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:44:7
-     if (adaptive) return `~${adaptive} min`;
+     if (false) return `~${adaptive} min`;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:46:7
-     if (accurate) return `~${accurate} min`;
+     if (true) return `~${accurate} min`;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:46:7
-     if (accurate) return `~${accurate} min`;
+     if (false) return `~${accurate} min`;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:47:7
-     if (prog.tm) return prog.tm.includes('min') ? prog.tm : `~${prog.tm}`;
+     if (true) return prog.tm.includes('min') ? prog.tm : `~${prog.tm}`;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:47:7
-     if (prog.tm) return prog.tm.includes('min') ? prog.tm : `~${prog.tm}`;
+     if (false) return prog.tm.includes('min') ? prog.tm : `~${prog.tm}`;

[NoCoverage] BlockStatement
src/pages/coach/util.js:51:40
-   export function calcAccurateTime(prog) {
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
-     const COMPOUND_EX_LIST = ['Lat Pulldown','Cable Row','Incline DB Press',
-       'DB Shoulder Press','Flat DB Press','Chest-Supported Row','Romanian Deadlift',
-       'Leg Press','RDL'];
-     let totalSeconds = 0;
-     prog.ex.forEach(ex => {
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
-       const setsMatch = ex.s ? ex.s.match(/^(\d+)/) : null;
-       const sets = setsMatch ? parseInt(setsMatch[1]) : 3;
-       const setTime = isCompound ? 45 : 30;
-       const restTime = isCompound ? 180 : 90;
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
-       totalSeconds += exTime;
-     });
-     totalSeconds += 8 * 60;
-     return Math.round(totalSeconds / 60);
-   }
+   export function calcAccurateTime(prog) {}

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:52:7
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:52:7
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (false) return null;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:52:7
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if ((!prog || !prog.ex) && prog.ex.length === 0) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:52:7
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (false || prog.ex.length === 0) return null;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:52:7
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (!prog && !prog.ex || prog.ex.length === 0) return null;

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:52:7
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (prog || !prog.ex || prog.ex.length === 0) return null;

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:52:16
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (!prog || prog.ex || prog.ex.length === 0) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:52:28
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (!prog || !prog.ex || false) return null;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:52:28
-     if (!prog || !prog.ex || prog.ex.length === 0) return null;
+     if (!prog || !prog.ex || prog.ex.length !== 0) return null;

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:53:28
-     const COMPOUND_EX_LIST = ['Lat Pulldown','Cable Row','Incline DB Press',
-       'DB Shoulder Press','Flat DB Press','Chest-Supported Row','Romanian Deadlift',
-       'Leg Press','RDL'];
+     const COMPOUND_EX_LIST = [];

[NoCoverage] BlockStatement
src/pages/coach/util.js:57:25
-     prog.ex.forEach(ex => {
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
-       const setsMatch = ex.s ? ex.s.match(/^(\d+)/) : null;
-       const sets = setsMatch ? parseInt(setsMatch[1]) : 3;
-       const setTime = isCompound ? 45 : 30;
-       const restTime = isCompound ? 180 : 90;
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
-       totalSeconds += exTime;
-     });
+     prog.ex.forEach(ex => {});

[NoCoverage] MethodExpression
src/pages/coach/util.js:58:24
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
+       const isCompound = COMPOUND_EX_LIST.every(c => ex.n && ex.n.includes(c.split(' ')[0]));

[NoCoverage] ArrowFunction
src/pages/coach/util.js:58:46
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
+       const isCompound = COMPOUND_EX_LIST.some(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:58:51
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
+       const isCompound = COMPOUND_EX_LIST.some(c => true);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:58:51
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
+       const isCompound = COMPOUND_EX_LIST.some(c => false);

[NoCoverage] LogicalOperator
src/pages/coach/util.js:58:51
-       const isCompound = COMPOUND_EX_LIST.some(c => ex.n && ex.n.includes(c.split(' ')[0]));
+       const isCompound = COMPOUND_EX_LIST.some(c => ex.n || ex.n.includes(c.split(' ')[0]));

[NoCoverage] Regex
src/pages/coach/util.js:59:41
-       const setsMatch = ex.s ? ex.s.match(/^(\d+)/) : null;
+       const setsMatch = ex.s ? ex.s.match(/(\d+)/) : null;

[NoCoverage] Regex
src/pages/coach/util.js:59:41
-       const setsMatch = ex.s ? ex.s.match(/^(\d+)/) : null;
+       const setsMatch = ex.s ? ex.s.match(/^(\d)/) : null;

[NoCoverage] Regex
src/pages/coach/util.js:59:41
-       const setsMatch = ex.s ? ex.s.match(/^(\d+)/) : null;
+       const setsMatch = ex.s ? ex.s.match(/^(\D+)/) : null;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:63:20
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
+       const exTime = sets * setTime + (sets - 1) * restTime - 30;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:63:20
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
+       const exTime = sets * setTime - (sets - 1) * restTime + 30;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:63:20
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
+       const exTime = sets / setTime + (sets - 1) * restTime + 30;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:63:37
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
+       const exTime = sets * setTime + (sets - 1) / restTime + 30;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:63:38
-       const exTime = sets * setTime + (sets - 1) * restTime + 30;
+       const exTime = sets * setTime + (sets + 1) * restTime + 30;

[NoCoverage] AssignmentOperator
src/pages/coach/util.js:64:5
-       totalSeconds += exTime;
+       totalSeconds -= exTime;

[NoCoverage] AssignmentOperator
src/pages/coach/util.js:66:3
-     totalSeconds += 8 * 60;
+     totalSeconds -= 8 * 60;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:66:19
-     totalSeconds += 8 * 60;
+     totalSeconds += 8 / 60;

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:67:21
-     return Math.round(totalSeconds / 60);
+     return Math.round(totalSeconds * 60);

[NoCoverage] BlockStatement
src/pages/coach/util.js:70:43
-   export function getAdaptiveTime(dayLabel) {
-     const burns = DB.get('session-burns') || [];
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
-     if (dayBurns.length < 3) return null;
-     const avg = Math.round(dayBurns.reduce((a, b) => a + b.mins, 0) / dayBurns.length);
-     return avg;
-   }
+   export function getAdaptiveTime(dayLabel) {}

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:71:17
-     const burns = DB.get('session-burns') || [];
+     const burns = true;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:71:17
-     const burns = DB.get('session-burns') || [];
+     const burns = false;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:71:17
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:71:44
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/util.js:72:20
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10);

[NoCoverage] MethodExpression
src/pages/coach/util.js:72:20
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.slice(0, 5);

[NoCoverage] ArrowFunction
src/pages/coach/util.js:72:33
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(() => undefined).slice(0, 5);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:72:38
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => true).slice(0, 5);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:72:38
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => false).slice(0, 5);

[NoCoverage] LogicalOperator
src/pages/coach/util.js:72:38
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => b.day === dayLabel || b.mins > 10).slice(0, 5);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:72:38
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => true && b.mins > 10).slice(0, 5);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:72:38
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => b.day !== dayLabel && b.mins > 10).slice(0, 5);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:72:60
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => b.day === dayLabel && true).slice(0, 5);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:72:60
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins >= 10).slice(0, 5);

[NoCoverage] EqualityOperator
src/pages/coach/util.js:72:60
-     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins > 10).slice(0, 5);
+     const dayBurns = burns.filter(b => b.day === dayLabel && b.mins <= 10).slice(0, 5);

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:73:7
-     if (dayBurns.length < 3) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:73:7
-     if (dayBurns.length < 3) return null;
+     if (false) return null;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:73:7
-     if (dayBurns.length < 3) return null;
+     if (dayBurns.length <= 3) return null;

[NoCoverage] EqualityOperator
src/pages/coach/util.js:73:7
-     if (dayBurns.length < 3) return null;
+     if (dayBurns.length >= 3) return null;
