[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:74:26
-     const avg = Math.round(dayBurns.reduce((a, b) => a + b.mins, 0) / dayBurns.length);
+     const avg = Math.round(dayBurns.reduce((a, b) => a + b.mins, 0) * dayBurns.length);

[NoCoverage] ArrowFunction
src/pages/coach/util.js:74:42
-     const avg = Math.round(dayBurns.reduce((a, b) => a + b.mins, 0) / dayBurns.length);
+     const avg = Math.round(dayBurns.reduce(() => undefined, 0) / dayBurns.length);

[NoCoverage] ArithmeticOperator
src/pages/coach/util.js:74:52
-     const avg = Math.round(dayBurns.reduce((a, b) => a + b.mins, 0) / dayBurns.length);
+     const avg = Math.round(dayBurns.reduce((a, b) => a - b.mins, 0) / dayBurns.length);

[NoCoverage] BlockStatement
src/pages/coach/util.js:78:37
-   export function getTodayExercises() {
-     const dayMap = [6,0,1,2,3,4,5];
-     const tp = PROG[dayMap[new Date().getDay()]];
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
-     const unavail = DB.get('unavailable-equipment') || [];
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
-     return exList;
-   }
+   export function getTodayExercises() {}

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:79:18
-     const dayMap = [6,0,1,2,3,4,5];
+     const dayMap = [];

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:81:7
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (true) return [];

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:81:7
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (false) return [];

[NoCoverage] LogicalOperator
src/pages/coach/util.js:81:7
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if ((!tp || tp.t === 'off') && !tp.ex) return [];

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:81:7
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (false || !tp.ex) return [];

[NoCoverage] LogicalOperator
src/pages/coach/util.js:81:7
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (!tp && tp.t === 'off' || !tp.ex) return [];

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:81:7
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (tp || tp.t === 'off' || !tp.ex) return [];

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:81:14
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (!tp || false || !tp.ex) return [];

[NoCoverage] EqualityOperator
src/pages/coach/util.js:81:14
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (!tp || tp.t !== 'off' || !tp.ex) return [];

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:81:32
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (!tp || tp.t === 'off' || tp.ex) return [];

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:81:47
-     if (!tp || tp.t === 'off' || !tp.ex) return [];
+     if (!tp || tp.t === 'off' || !tp.ex) return ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:82:19
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = true;

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:82:19
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = false;

[NoCoverage] LogicalOperator
src/pages/coach/util.js:82:19
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = DB.get('unavailable-equipment') && [];

[NoCoverage] ArrayDeclaration
src/pages/coach/util.js:82:54
-     const unavail = DB.get('unavailable-equipment') || [];
+     const unavail = DB.get('unavailable-equipment') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/coach/util.js:83:16
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(e => cleanEx(e.n || ''));

[NoCoverage] ArrowFunction
src/pages/coach/util.js:83:26
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(() => undefined).filter(ex => !unavail.includes(ex));

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:83:39
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(e => cleanEx(true)).filter(ex => !unavail.includes(ex));

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:83:39
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(e => cleanEx(false)).filter(ex => !unavail.includes(ex));

[NoCoverage] LogicalOperator
src/pages/coach/util.js:83:39
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(e => cleanEx(e.n && '')).filter(ex => !unavail.includes(ex));

[NoCoverage] ArrowFunction
src/pages/coach/util.js:83:58
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(() => undefined);

[NoCoverage] BooleanLiteral
src/pages/coach/util.js:83:64
-     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => !unavail.includes(ex));
+     let exList = tp.ex.map(e => cleanEx(e.n || '')).filter(ex => unavail.includes(ex));

[NoCoverage] BlockStatement
src/pages/coach/util.js:87:29
-   export function beepStart() { if (typeof beep === 'function') beep(660, 0.1); }
+   export function beepStart() {}

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:87:35
-   export function beepStart() { if (typeof beep === 'function') beep(660, 0.1); }
+   export function beepStart() { if (true) beep(660, 0.1); }

[NoCoverage] ConditionalExpression
src/pages/coach/util.js:87:35
-   export function beepStart() { if (typeof beep === 'function') beep(660, 0.1); }
+   export function beepStart() { if (false) beep(660, 0.1); }

[NoCoverage] EqualityOperator
src/pages/coach/util.js:87:35
-   export function beepStart() { if (typeof beep === 'function') beep(660, 0.1); }
+   export function beepStart() { if (typeof beep !== 'function') beep(660, 0.1); }

[NoCoverage] BlockStatement
src/pages/coach/util.js:88:30
-   export function resetNotes() { state.activeNotes.clear(); }
+   export function resetNotes() {}

[NoCoverage] ArrayDeclaration
src/pages/auth.js:57:20
-     const cleanups = [];
+     const cleanups = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/auth.js:61:9
-       if (pendingEmail) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/auth.js:61:9
-       if (pendingEmail) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/auth.js:61:23
-       if (pendingEmail) {
-         _renderPending(root, pendingEmail, {
-           onResend: async () => {
-             const res = await sendMagicLink(pendingEmail);
-             _toast(res.ok ? 'Link retrimis.' : (COPY.errorSendFailed));
-           },
-           onChange: () => { pendingEmail = null; _writePendingEmail(null); render(); },
-         });
-       } else {
+       if (pendingEmail) {} else {

[NoCoverage] ObjectLiteral
src/pages/auth.js:62:42
-         _renderPending(root, pendingEmail, {
-           onResend: async () => {
-             const res = await sendMagicLink(pendingEmail);
-             _toast(res.ok ? 'Link retrimis.' : (COPY.errorSendFailed));
-           },
-           onChange: () => { pendingEmail = null; _writePendingEmail(null); render(); },
-         });
+         _renderPending(root, pendingEmail, {});

[NoCoverage] BlockStatement
src/pages/auth.js:63:31
-           onResend: async () => {
-             const res = await sendMagicLink(pendingEmail);
-             _toast(res.ok ? 'Link retrimis.' : (COPY.errorSendFailed));
-           },
+           onResend: async () => {},

[NoCoverage] BlockStatement
src/pages/auth.js:67:25
-           onChange: () => { pendingEmail = null; _writePendingEmail(null); render(); },
+           onChange: () => {},

[NoCoverage] BlockStatement
src/pages/auth.js:69:12
-       } else {
-         _renderForm(root, {
-           // Per §56.13.1: sendMagicLink internal 3x retry. Caller handles
-           // post-retry-fail via "Reîncearcă" button (toast + caller can resubmit).
-           onSendMagicLink: async (email) => {
-             const res = await sendMagicLink(email);
-             if (res.ok) { pendingEmail = email; render(); }
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
-           },
-           onGoogle: googleClientId
-             ? () => {
-                 try {
-                   const url = buildGoogleSignInUrl(googleClientId);
-                   window.location.assign(url);
-                 } catch (err) {
-                   _toast(COPY.errorSendFailed);
-                 }
-               }
-             : null,
-         });
-       }
+       } else {}

[NoCoverage] ObjectLiteral
src/pages/auth.js:70:25
-         _renderForm(root, {
-           // Per §56.13.1: sendMagicLink internal 3x retry. Caller handles
-           // post-retry-fail via "Reîncearcă" button (toast + caller can resubmit).
-           onSendMagicLink: async (email) => {
-             const res = await sendMagicLink(email);
-             if (res.ok) { pendingEmail = email; render(); }
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
-           },
-           onGoogle: googleClientId
-             ? () => {
-                 try {
-                   const url = buildGoogleSignInUrl(googleClientId);
-                   window.location.assign(url);
-                 } catch (err) {
-                   _toast(COPY.errorSendFailed);
-                 }
-               }
-             : null,
-         });
+         _renderForm(root, {});

[NoCoverage] BlockStatement
src/pages/auth.js:73:43
-           onSendMagicLink: async (email) => {
-             const res = await sendMagicLink(email);
-             if (res.ok) { pendingEmail = email; render(); }
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
-           },
+           onSendMagicLink: async (email) => {},

[NoCoverage] ConditionalExpression
src/pages/auth.js:75:15
-             if (res.ok) { pendingEmail = email; render(); }
+             if (true) { pendingEmail = email; render(); }

[NoCoverage] ConditionalExpression
src/pages/auth.js:75:15
-             if (res.ok) { pendingEmail = email; render(); }
+             if (false) { pendingEmail = email; render(); }

[NoCoverage] BlockStatement
src/pages/auth.js:75:23
-             if (res.ok) { pendingEmail = email; render(); }
+             if (res.ok) {}

[NoCoverage] BlockStatement
src/pages/auth.js:76:16
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
+             else {}

[NoCoverage] ConditionalExpression
src/pages/auth.js:76:25
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
+             else { _toast(true ? COPY.errorInvalidEmail : COPY.errorSendFailed); }

[NoCoverage] ConditionalExpression
src/pages/auth.js:76:25
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
+             else { _toast(false ? COPY.errorInvalidEmail : COPY.errorSendFailed); }

[NoCoverage] EqualityOperator
src/pages/auth.js:76:25
-             else { _toast(res.error === 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }
+             else { _toast(res.error !== 'invalid_email' ? COPY.errorInvalidEmail : COPY.errorSendFailed); }

[NoCoverage] BlockStatement
src/pages/auth.js:79:19
-             ? () => {
-                 try {
-                   const url = buildGoogleSignInUrl(googleClientId);
-                   window.location.assign(url);
-                 } catch (err) {
-                   _toast(COPY.errorSendFailed);
-                 }
-               }
+             ? () => {}

[NoCoverage] BlockStatement
src/pages/auth.js:80:19
-                 try {
-                   const url = buildGoogleSignInUrl(googleClientId);
-                   window.location.assign(url);
-                 } catch (err) {
+                 try {} catch (err) {

[NoCoverage] BlockStatement
src/pages/auth.js:83:29
-                 } catch (err) {
-                   _toast(COPY.errorSendFailed);
-                 }
+                 } catch (err) {}

[NoCoverage] BlockStatement
src/pages/auth.js:97:16
-     (async () => {
-       const { oobCode, email } = parseMagicLinkUrl();
-       if (!oobCode) return;
-       const e = email || pendingEmail || _readPendingEmail();
-       if (!e) return;
-       const res = await verifyMagicLink(e, oobCode);
-       if (res.ok) {
-         _writePendingEmail(null);
-         if (typeof onAuthSuccess === 'function') onAuthSuccess({ uid: res.uid });
-       } else {
-         _toast(COPY.errorVerifyFailed);
-       }
-     })().catch(() => {});
+     (async () => {})().catch(() => {});

[NoCoverage] BooleanLiteral
src/pages/auth.js:99:9
-       if (!oobCode) return;
+       if (oobCode) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:99:9
-       if (!oobCode) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:99:9
-       if (!oobCode) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:100:15
-       const e = email || pendingEmail || _readPendingEmail();
+       const e = true;

[NoCoverage] ConditionalExpression
src/pages/auth.js:100:15
-       const e = email || pendingEmail || _readPendingEmail();
+       const e = false;

[NoCoverage] LogicalOperator
src/pages/auth.js:100:15
-       const e = email || pendingEmail || _readPendingEmail();
+       const e = (email || pendingEmail) && _readPendingEmail();

[NoCoverage] ConditionalExpression
src/pages/auth.js:100:15
-       const e = email || pendingEmail || _readPendingEmail();
+       const e = false || _readPendingEmail();

[NoCoverage] LogicalOperator
src/pages/auth.js:100:15
-       const e = email || pendingEmail || _readPendingEmail();
+       const e = email && pendingEmail || _readPendingEmail();

[NoCoverage] BooleanLiteral
src/pages/auth.js:101:9
-       if (!e) return;
+       if (e) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:101:9
-       if (!e) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:101:9
-       if (!e) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:103:9
-       if (res.ok) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/auth.js:103:9
-       if (res.ok) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/auth.js:103:17
-       if (res.ok) {
-         _writePendingEmail(null);
-         if (typeof onAuthSuccess === 'function') onAuthSuccess({ uid: res.uid });
-       } else {
+       if (res.ok) {} else {

[NoCoverage] ConditionalExpression
src/pages/auth.js:105:11
-         if (typeof onAuthSuccess === 'function') onAuthSuccess({ uid: res.uid });
+         if (true) onAuthSuccess({ uid: res.uid });

[NoCoverage] ConditionalExpression
src/pages/auth.js:105:11
-         if (typeof onAuthSuccess === 'function') onAuthSuccess({ uid: res.uid });
+         if (false) onAuthSuccess({ uid: res.uid });

[NoCoverage] EqualityOperator
src/pages/auth.js:105:11
-         if (typeof onAuthSuccess === 'function') onAuthSuccess({ uid: res.uid });
+         if (typeof onAuthSuccess !== 'function') onAuthSuccess({ uid: res.uid });

[NoCoverage] ObjectLiteral
src/pages/auth.js:105:62
-         if (typeof onAuthSuccess === 'function') onAuthSuccess({ uid: res.uid });
+         if (typeof onAuthSuccess === 'function') onAuthSuccess({});

[NoCoverage] BlockStatement
src/pages/auth.js:106:12
-       } else {
-         _toast(COPY.errorVerifyFailed);
-       }
+       } else {}

[NoCoverage] ObjectLiteral
src/pages/auth.js:111:10
-     return { element: root, dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }) };
+     return {};

[NoCoverage] ArrowFunction
src/pages/auth.js:111:36
-     return { element: root, dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }) };
+     return { element: root, dispose: () => undefined };

[NoCoverage] BlockStatement
src/pages/auth.js:111:65
-     return { element: root, dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }) };
+     return { element: root, dispose: () => cleanups.forEach(fn => {}) };

[NoCoverage] BlockStatement
src/pages/auth.js:111:71
-     return { element: root, dispose: () => cleanups.forEach(fn => { try { fn(); } catch {} }) };
+     return { element: root, dispose: () => cleanups.forEach(fn => { try {} catch {} }) };

[NoCoverage] BlockStatement
src/pages/auth.js:121:59
-   export async function handleGoogleCallback(googleIdToken) {
-     return signInWithGoogleIdToken(googleIdToken);
-   }
+   export async function handleGoogleCallback(googleIdToken) {}

[NoCoverage] BlockStatement
src/pages/auth.js:131:47
-   export function wireLogoutButton(btn, onDone) {
-     const handler = () => {
-       signOut();
-       if (typeof onDone === 'function') onDone();
-     };
-     btn.addEventListener('click', handler);
-     return () => btn.removeEventListener('click', handler);
-   }
+   export function wireLogoutButton(btn, onDone) {}

[NoCoverage] BlockStatement
src/pages/auth.js:132:25
-     const handler = () => {
-       signOut();
-       if (typeof onDone === 'function') onDone();
-     };
+     const handler = () => {};

[NoCoverage] ConditionalExpression
src/pages/auth.js:134:9
-       if (typeof onDone === 'function') onDone();
+       if (true) onDone();

[NoCoverage] ConditionalExpression
src/pages/auth.js:134:9
-       if (typeof onDone === 'function') onDone();
+       if (false) onDone();

[NoCoverage] EqualityOperator
src/pages/auth.js:134:9
-       if (typeof onDone === 'function') onDone();
+       if (typeof onDone !== 'function') onDone();

[NoCoverage] ArrowFunction
src/pages/auth.js:137:10
-     return () => btn.removeEventListener('click', handler);
+     return () => undefined;

[NoCoverage] BooleanLiteral
src/pages/auth.js:165:20
-     input.required = true;
+     input.required = false;

[NoCoverage] BlockStatement
src/pages/auth.js:183:43
-     form.addEventListener('submit', (ev) => {
-       ev.preventDefault();
-       const email = (input.value || '').trim();
-       // Per §56.13: loading state during 3x retry window (~2s worst case).
-       const originalLabel = sendBtn.textContent;
-       sendBtn.textContent = COPY.sendBtnLoading;
-       sendBtn.disabled = true;
-       Promise.resolve(onSendMagicLink(email)).finally(() => {
-         sendBtn.textContent = originalLabel;
-         sendBtn.disabled = false;
-       });
-     });
+     form.addEventListener('submit', (ev) => {});

[NoCoverage] MethodExpression
src/pages/auth.js:185:19
-       const email = (input.value || '').trim();
+       const email = input.value || '';

[NoCoverage] ConditionalExpression
src/pages/auth.js:185:20
-       const email = (input.value || '').trim();
+       const email = (true).trim();

[NoCoverage] ConditionalExpression
src/pages/auth.js:185:20
-       const email = (input.value || '').trim();
+       const email = (false).trim();

[NoCoverage] LogicalOperator
src/pages/auth.js:185:20
-       const email = (input.value || '').trim();
+       const email = (input.value && '').trim();

[NoCoverage] BooleanLiteral
src/pages/auth.js:189:24
-       sendBtn.disabled = true;
+       sendBtn.disabled = false;

[NoCoverage] BlockStatement
src/pages/auth.js:190:59
-       Promise.resolve(onSendMagicLink(email)).finally(() => {
-         sendBtn.textContent = originalLabel;
-         sendBtn.disabled = false;
-       });
+       Promise.resolve(onSendMagicLink(email)).finally(() => {});

[NoCoverage] BooleanLiteral
src/pages/auth.js:192:26
-         sendBtn.disabled = false;
+         sendBtn.disabled = true;

[NoCoverage] ConditionalExpression
src/pages/auth.js:197:7
-     if (typeof onGoogle === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/auth.js:197:7
-     if (typeof onGoogle === 'function') {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/auth.js:197:7
-     if (typeof onGoogle === 'function') {
+     if (typeof onGoogle !== 'function') {

[NoCoverage] BlockStatement
src/pages/auth.js:197:39
-     if (typeof onGoogle === 'function') {
-       const sep = document.createElement('div');
-       sep.className = 'auth-screen__sep';
-       sep.textContent = '—';
-       root.appendChild(sep);
-       // §56.2.1 — Google OAuth primary (1-tap), so render BEFORE email form
-       // would invert ordering. Spec §56.2.2 places Google CTA primar above
-       // email CTA secundar. Current DOM ordering keeps email form first
-       // pentru users care vor email-only — Daniel decide UX ordering Beta.
-       const googleBtn = document.createElement('button');
-       googleBtn.type = 'button';
-       googleBtn.className = 'auth-screen__google';
-       googleBtn.textContent = COPY.googleBtn;
-       googleBtn.addEventListener('click', onGoogle);
-       root.appendChild(googleBtn);
-     }
+     if (typeof onGoogle === 'function') {}

[NoCoverage] BlockStatement
src/pages/auth.js:216:62
-   function _renderPending(root, email, { onResend, onChange }) {
-     const h = document.createElement('h2');
-     h.className = 'auth-screen__title';
-     h.textContent = COPY.pendingTitle;
-     root.appendChild(h);
-     const body = document.createElement('p');
-     body.className = 'auth-screen__pending-body';
-     body.textContent = COPY.pendingBody(email);
-     root.appendChild(body);
-     const resendBtn = document.createElement('button');
-     resendBtn.type = 'button';
-     resendBtn.className = 'auth-screen__resend';
-     resendBtn.textContent = COPY.resendBtn;
-     resendBtn.addEventListener('click', onResend);
-     root.appendChild(resendBtn);
-     const changeBtn = document.createElement('button');
-     changeBtn.type = 'button';
-     changeBtn.className = 'auth-screen__change';
-     changeBtn.textContent = COPY.changeEmailBtn;
-     changeBtn.addEventListener('click', onChange);
-     root.appendChild(changeBtn);
-   }
+   function _renderPending(root, email, { onResend, onChange }) {}

[NoCoverage] BlockStatement
src/pages/auth.js:242:30
-   function _readPendingEmail() {
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }
-     catch { return null; }
-   }
+   function _readPendingEmail() {}

[NoCoverage] BlockStatement
src/pages/auth.js:243:7
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }
+     try {}

[NoCoverage] ConditionalExpression
src/pages/auth.js:243:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }
+     try { return true ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }

[NoCoverage] ConditionalExpression
src/pages/auth.js:243:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }
+     try { return false ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }

[NoCoverage] EqualityOperator
src/pages/auth.js:243:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }
+     try { return typeof localStorage === 'undefined' ? localStorage.getItem(AUTH_STORAGE_KEYS.pendingEmail) : null; }

[NoCoverage] BlockStatement
src/pages/auth.js:244:9
-     catch { return null; }
+     catch {}

[NoCoverage] BlockStatement
src/pages/auth.js:247:36
-   function _writePendingEmail(value) {
-     try {
-       if (typeof localStorage === 'undefined') return;
-       if (value) localStorage.setItem(AUTH_STORAGE_KEYS.pendingEmail, value);
-       else localStorage.removeItem(AUTH_STORAGE_KEYS.pendingEmail);
-     } catch {}
-   }
+   function _writePendingEmail(value) {}

[NoCoverage] BlockStatement
src/pages/auth.js:248:7
-     try {
-       if (typeof localStorage === 'undefined') return;
-       if (value) localStorage.setItem(AUTH_STORAGE_KEYS.pendingEmail, value);
-       else localStorage.removeItem(AUTH_STORAGE_KEYS.pendingEmail);
-     } catch {}
+     try {} catch {}

[NoCoverage] ConditionalExpression
src/pages/auth.js:249:9
-       if (typeof localStorage === 'undefined') return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:249:9
-       if (typeof localStorage === 'undefined') return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/pages/auth.js:249:9
-       if (typeof localStorage === 'undefined') return;
+       if (typeof localStorage !== 'undefined') return;

[NoCoverage] ConditionalExpression
src/pages/auth.js:250:9
-       if (value) localStorage.setItem(AUTH_STORAGE_KEYS.pendingEmail, value);
+       if (true) localStorage.setItem(AUTH_STORAGE_KEYS.pendingEmail, value);

[NoCoverage] ConditionalExpression
src/pages/auth.js:250:9
-       if (value) localStorage.setItem(AUTH_STORAGE_KEYS.pendingEmail, value);
+       if (false) localStorage.setItem(AUTH_STORAGE_KEYS.pendingEmail, value);

[NoCoverage] BlockStatement
src/pages/auth.js:255:22
-   function _toast(msg) {
-     // Use existing global toast if available; fallback to console.
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
-       window.toast(msg);
-       return;
-     }
-     console.warn('[Auth]', msg);
-   }
+   function _toast(msg) {}

[NoCoverage] ConditionalExpression
src/pages/auth.js:257:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/auth.js:257:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/auth.js:257:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window !== 'undefined' || typeof window.toast === 'function') {

[NoCoverage] ConditionalExpression
src/pages/auth.js:257:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (true && typeof window.toast === 'function') {

[NoCoverage] EqualityOperator
src/pages/auth.js:257:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window === 'undefined' && typeof window.toast === 'function') {

[NoCoverage] ConditionalExpression
src/pages/auth.js:257:40
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window !== 'undefined' && true) {

[NoCoverage] EqualityOperator
src/pages/auth.js:257:40
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window !== 'undefined' && typeof window.toast !== 'function') {

[NoCoverage] BlockStatement
src/pages/auth.js:257:76
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
-       window.toast(msg);
-       return;
-     }
+     if (typeof window !== 'undefined' && typeof window.toast === 'function') {}

[Survived] ObjectLiteral
src/pages/auth.js:21:28
-   const COPY = Object.freeze({
-     title: 'Salvează-ți progresul',
-     description: 'Săptămânile tale de antrenament rămân în siguranță și le poți accesa de pe orice telefon sau tabletă.',
-     emailLabel: 'Adresa de email',
-     emailHint: 'Verifică cu atenție adresa de e-mail introdusă pentru a te asigura că primești link-ul de acces.',
-     sendBtn: 'Trimite-mi link de acces pe e-mail',
-     sendBtnLoading: 'Se trimite link-ul de acces...',
-     googleBtn: 'Continuă cu Google',
-     pendingTitle: 'Verifică emailul',
-     pendingBody: (email) => `Ți-am trimis un link la ${email}. Deschide-l pe acest dispozitiv ca să te conectezi.`,
-     resendBtn: 'Trimite din nou',
-     changeEmailBtn: 'Schimbă emailul',
-     successWelcome: 'Bine ai venit înapoi!',
-     errorInvalidEmail: 'Adresa de email nu pare validă.',
-     errorSendFailed: 'Nu am putut trimite codul. Verifică conexiunea la internet.',
-     errorRetryBtn: 'Reîncearcă',
-     errorVerifyFailed: 'Linkul a expirat sau e invalid. Cere unul nou.',
-     signedOut: 'Te-ai delogat.',
-     signOutBtn: 'Delogare',
-   });
+   const COPY = Object.freeze({});
Ran all tests for this mutant.

[Survived] ArrowFunction
src/pages/auth.js:30:16
-     pendingBody: (email) => `Ți-am trimis un link la ${email}. Deschide-l pe acest dispozitiv ca să te conectezi.`,
+     pendingBody: () => undefined,
Ran all tests for this mutant.

[NoCoverage] BooleanLiteral
src/pages/authShell.js:47:56
-     const { googleClientId, onAuthSuccess, dismissable = true } = opts;
+     const { googleClientId, onAuthSuccess, dismissable = false } = opts;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:49:7
-     if (_activeOverlay) return { close: hideAuthScreen };
+     if (true) return { close: hideAuthScreen };

[NoCoverage] ConditionalExpression
src/pages/authShell.js:49:7
-     if (_activeOverlay) return { close: hideAuthScreen };
+     if (false) return { close: hideAuthScreen };

[NoCoverage] ObjectLiteral
src/pages/authShell.js:49:30
-     if (_activeOverlay) return { close: hideAuthScreen };
+     if (_activeOverlay) return {};
