[NoCoverage] ArrayDeclaration
src/pages/authShell.js:54:27
-     overlay.style.cssText = [
-       'position:fixed', 'inset:0', 'z-index:600',
-       'background:rgba(10,10,15,0.96)', 'backdrop-filter:blur(8px)',
-       'overflow-y:auto', 'padding:60px 20px 40px',
-       'display:flex', 'justify-content:center', 'align-items:flex-start',
-     ].join(';');
+     overlay.style.cssText = [].join(';');

[NoCoverage] ArrayDeclaration
src/pages/authShell.js:62:24
-     card.style.cssText = [
-       'background:var(--bg2)', 'border:1px solid var(--border)',
-       'border-radius:var(--r,16px)', 'padding:28px 22px 24px',
-       'max-width:420px', 'width:100%',
-       'box-shadow:0 12px 48px rgba(0,0,0,0.55)',
-     ].join(';');
+     card.style.cssText = [].join(';');

[NoCoverage] ConditionalExpression
src/pages/authShell.js:69:7
-     if (dismissable) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/authShell.js:69:7
-     if (dismissable) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/authShell.js:69:20
-     if (dismissable) {
-       const closeBtn = document.createElement('button');
-       closeBtn.type = 'button';
-       closeBtn.setAttribute('aria-label', 'Închide');
-       closeBtn.textContent = '×';
-       closeBtn.style.cssText = [
-         'position:absolute', 'top:18px', 'right:22px',
-         'background:none', 'border:none', 'color:var(--text2)',
-         'font-size:28px', 'line-height:1', 'cursor:pointer',
-         'padding:4px 10px', 'font-family:inherit',
-       ].join(';');
-       closeBtn.addEventListener('click', () => hideAuthScreen());
-       overlay.appendChild(closeBtn);
-     }
+     if (dismissable) {}

[NoCoverage] ArrayDeclaration
src/pages/authShell.js:74:30
-       closeBtn.style.cssText = [
-         'position:absolute', 'top:18px', 'right:22px',
-         'background:none', 'border:none', 'color:var(--text2)',
-         'font-size:28px', 'line-height:1', 'cursor:pointer',
-         'padding:4px 10px', 'font-family:inherit',
-       ].join(';');
+       closeBtn.style.cssText = [].join(';');

[NoCoverage] ArrowFunction
src/pages/authShell.js:80:40
-       closeBtn.addEventListener('click', () => hideAuthScreen());
+       closeBtn.addEventListener('click', () => undefined);

[NoCoverage] ObjectLiteral
src/pages/authShell.js:84:35
-     const screen = createAuthScreen({
-       googleClientId,
-       onAuthSuccess: (info) => {
-         _toast(AUTH_SCREEN_COPY.successWelcome || 'Bine ai venit înapoi!', 'var(--green)');
-         hideAuthScreen();
-         if (typeof onAuthSuccess === 'function') {
-           try { onAuthSuccess(info); } catch (err) { console.warn('[authShell] onAuthSuccess threw:', err); }
-         }
-         // Notify rest of app — pages/dashboard/coach can re-render with auth state.
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: info })); } catch {}
-       },
-     });
+     const screen = createAuthScreen({});

[NoCoverage] BlockStatement
src/pages/authShell.js:86:30
-       onAuthSuccess: (info) => {
-         _toast(AUTH_SCREEN_COPY.successWelcome || 'Bine ai venit înapoi!', 'var(--green)');
-         hideAuthScreen();
-         if (typeof onAuthSuccess === 'function') {
-           try { onAuthSuccess(info); } catch (err) { console.warn('[authShell] onAuthSuccess threw:', err); }
-         }
-         // Notify rest of app — pages/dashboard/coach can re-render with auth state.
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: info })); } catch {}
-       },
+       onAuthSuccess: (info) => {},

[NoCoverage] ConditionalExpression
src/pages/authShell.js:87:14
-         _toast(AUTH_SCREEN_COPY.successWelcome || 'Bine ai venit înapoi!', 'var(--green)');
+         _toast(true, 'var(--green)');

[NoCoverage] ConditionalExpression
src/pages/authShell.js:87:14
-         _toast(AUTH_SCREEN_COPY.successWelcome || 'Bine ai venit înapoi!', 'var(--green)');
+         _toast(false, 'var(--green)');

[NoCoverage] LogicalOperator
src/pages/authShell.js:87:14
-         _toast(AUTH_SCREEN_COPY.successWelcome || 'Bine ai venit înapoi!', 'var(--green)');
+         _toast(AUTH_SCREEN_COPY.successWelcome && 'Bine ai venit înapoi!', 'var(--green)');

[NoCoverage] ConditionalExpression
src/pages/authShell.js:89:11
-         if (typeof onAuthSuccess === 'function') {
+         if (true) {

[NoCoverage] ConditionalExpression
src/pages/authShell.js:89:11
-         if (typeof onAuthSuccess === 'function') {
+         if (false) {

[NoCoverage] EqualityOperator
src/pages/authShell.js:89:11
-         if (typeof onAuthSuccess === 'function') {
+         if (typeof onAuthSuccess !== 'function') {

[NoCoverage] BlockStatement
src/pages/authShell.js:89:48
-         if (typeof onAuthSuccess === 'function') {
-           try { onAuthSuccess(info); } catch (err) { console.warn('[authShell] onAuthSuccess threw:', err); }
-         }
+         if (typeof onAuthSuccess === 'function') {}

[NoCoverage] BlockStatement
src/pages/authShell.js:90:13
-           try { onAuthSuccess(info); } catch (err) { console.warn('[authShell] onAuthSuccess threw:', err); }
+           try {} catch (err) { console.warn('[authShell] onAuthSuccess threw:', err); }

[NoCoverage] BlockStatement
src/pages/authShell.js:90:50
-           try { onAuthSuccess(info); } catch (err) { console.warn('[authShell] onAuthSuccess threw:', err); }
+           try { onAuthSuccess(info); } catch (err) {}

[NoCoverage] BlockStatement
src/pages/authShell.js:93:11
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: info })); } catch {}
+         try {} catch {}

[NoCoverage] ObjectLiteral
src/pages/authShell.js:93:72
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: info })); } catch {}
+         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', {})); } catch {}

[NoCoverage] ObjectLiteral
src/pages/authShell.js:100:20
-     _activeOverlay = { overlay, dispose: screen.dispose };
+     _activeOverlay = {};

[NoCoverage] ConditionalExpression
src/pages/authShell.js:102:7
-     if (dismissable) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/authShell.js:102:7
-     if (dismissable) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/authShell.js:102:20
-     if (dismissable) {
-       const onKey = (ev) => {
-         if (ev.key === 'Escape') hideAuthScreen();
-       };
-       document.addEventListener('keydown', onKey);
-       _activeOverlay.onKey = onKey;
-     }
+     if (dismissable) {}

[NoCoverage] BlockStatement
src/pages/authShell.js:103:27
-       const onKey = (ev) => {
-         if (ev.key === 'Escape') hideAuthScreen();
-       };
+       const onKey = (ev) => {};

[NoCoverage] ConditionalExpression
src/pages/authShell.js:104:11
-         if (ev.key === 'Escape') hideAuthScreen();
+         if (true) hideAuthScreen();

[NoCoverage] ConditionalExpression
src/pages/authShell.js:104:11
-         if (ev.key === 'Escape') hideAuthScreen();
+         if (false) hideAuthScreen();

[NoCoverage] EqualityOperator
src/pages/authShell.js:104:11
-         if (ev.key === 'Escape') hideAuthScreen();
+         if (ev.key !== 'Escape') hideAuthScreen();

[NoCoverage] ObjectLiteral
src/pages/authShell.js:110:10
-     return { close: hideAuthScreen };
+     return {};

[NoCoverage] BlockStatement
src/pages/authShell.js:113:34
-   export function hideAuthScreen() {
-     if (!_activeOverlay) return;
-     const { overlay, dispose, onKey } = _activeOverlay;
-     _activeOverlay = null;
-     if (onKey) document.removeEventListener('keydown', onKey);
-     if (typeof dispose === 'function') { try { dispose(); } catch {} }
-     if (overlay && overlay.parentNode) overlay.parentNode.removeChild(overlay);
-   }
+   export function hideAuthScreen() {}

[NoCoverage] BooleanLiteral
src/pages/authShell.js:114:7
-     if (!_activeOverlay) return;
+     if (_activeOverlay) return;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:114:7
-     if (!_activeOverlay) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:114:7
-     if (!_activeOverlay) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:117:7
-     if (onKey) document.removeEventListener('keydown', onKey);
+     if (true) document.removeEventListener('keydown', onKey);

[NoCoverage] ConditionalExpression
src/pages/authShell.js:117:7
-     if (onKey) document.removeEventListener('keydown', onKey);
+     if (false) document.removeEventListener('keydown', onKey);

[NoCoverage] ConditionalExpression
src/pages/authShell.js:118:7
-     if (typeof dispose === 'function') { try { dispose(); } catch {} }
+     if (true) { try { dispose(); } catch {} }

[NoCoverage] ConditionalExpression
src/pages/authShell.js:118:7
-     if (typeof dispose === 'function') { try { dispose(); } catch {} }
+     if (false) { try { dispose(); } catch {} }

[NoCoverage] EqualityOperator
src/pages/authShell.js:118:7
-     if (typeof dispose === 'function') { try { dispose(); } catch {} }
+     if (typeof dispose !== 'function') { try { dispose(); } catch {} }

[NoCoverage] BlockStatement
src/pages/authShell.js:118:38
-     if (typeof dispose === 'function') { try { dispose(); } catch {} }
+     if (typeof dispose === 'function') {}

[NoCoverage] BlockStatement
src/pages/authShell.js:118:44
-     if (typeof dispose === 'function') { try { dispose(); } catch {} }
+     if (typeof dispose === 'function') { try {} catch {} }

[NoCoverage] ConditionalExpression
src/pages/authShell.js:119:7
-     if (overlay && overlay.parentNode) overlay.parentNode.removeChild(overlay);
+     if (true) overlay.parentNode.removeChild(overlay);

[NoCoverage] ConditionalExpression
src/pages/authShell.js:119:7
-     if (overlay && overlay.parentNode) overlay.parentNode.removeChild(overlay);
+     if (false) overlay.parentNode.removeChild(overlay);

[NoCoverage] LogicalOperator
src/pages/authShell.js:119:7
-     if (overlay && overlay.parentNode) overlay.parentNode.removeChild(overlay);
+     if (overlay || overlay.parentNode) overlay.parentNode.removeChild(overlay);

[NoCoverage] ObjectLiteral
src/pages/authShell.js:154:12
-       return { ok: false, provider: 'magic-link', error: res.error };
+       return {};

[NoCoverage] BooleanLiteral
src/pages/authShell.js:154:18
-       return { ok: false, provider: 'magic-link', error: res.error };
+       return { ok: true, provider: 'magic-link', error: res.error };

[NoCoverage] ObjectLiteral
src/pages/authShell.js:169:14
-         return { ok: false, provider: 'google', error: res.error };
+         return {};

[NoCoverage] BooleanLiteral
src/pages/authShell.js:169:20
-         return { ok: false, provider: 'google', error: res.error };
+         return { ok: true, provider: 'google', error: res.error };

[NoCoverage] ConditionalExpression
src/pages/authShell.js:190:7
-     if (typeof document === 'undefined') return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:190:7
-     if (typeof document === 'undefined') return null;
+     if (false) return null;

[NoCoverage] EqualityOperator
src/pages/authShell.js:190:7
-     if (typeof document === 'undefined') return null;
+     if (typeof document !== 'undefined') return null;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:191:7
-     if (isAuthenticated()) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:191:7
-     if (isAuthenticated()) return null;
+     if (false) return null;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:192:7
-     if (document.getElementById('auth-banner-soft')) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/authShell.js:192:7
-     if (document.getElementById('auth-banner-soft')) return null;
+     if (false) return null;

[NoCoverage] ArrayDeclaration
src/pages/authShell.js:198:26
-     banner.style.cssText = [
-       'position:fixed', 'top:0', 'left:0', 'right:0', 'z-index:400',
-       'background:linear-gradient(180deg,var(--bg2) 0%,var(--bg) 100%)',
-       'border-bottom:1px solid var(--border)',
-       'padding:8px 14px', 'display:flex', 'align-items:center', 'gap:10px',
-       'font-family:inherit', 'font-size:12px', 'color:var(--text2)',
-       'cursor:pointer',
-     ].join(';');
+     banner.style.cssText = [].join(';');

[NoCoverage] ArrayDeclaration
src/pages/authShell.js:221:27
-     dismiss.style.cssText = [
-       'background:none', 'border:none', 'color:var(--text3)',
-       'font-size:18px', 'line-height:1', 'cursor:pointer',
-       'padding:0 4px', 'margin-left:6px',
-     ].join(';');
+     dismiss.style.cssText = [].join(';');

[NoCoverage] BlockStatement
src/pages/authShell.js:226:45
-     dismiss.addEventListener('click', (ev) => {
-       ev.stopPropagation();
-       unmount();
-     });
+     dismiss.addEventListener('click', (ev) => {});

[NoCoverage] BlockStatement
src/pages/authShell.js:232:42
-     banner.addEventListener('click', () => {
-       showAuthScreen({
-         googleClientId: opts.googleClientId,
-         onAuthSuccess: opts.onAuthSuccess,
-       });
-     });
+     banner.addEventListener('click', () => {});

[NoCoverage] ObjectLiteral
src/pages/authShell.js:233:20
-       showAuthScreen({
-         googleClientId: opts.googleClientId,
-         onAuthSuccess: opts.onAuthSuccess,
-       });
+       showAuthScreen({});

[NoCoverage] ArrowFunction
src/pages/authShell.js:242:18
-     const onAuth = () => unmount();
+     const onAuth = () => undefined;

[NoCoverage] BlockStatement
src/pages/authShell.js:245:22
-     function unmount() {
-       window.removeEventListener('andura:authsuccess', onAuth);
-       if (banner.parentNode) banner.parentNode.removeChild(banner);
-     }
+     function unmount() {}

[NoCoverage] ConditionalExpression
src/pages/authShell.js:247:9
-       if (banner.parentNode) banner.parentNode.removeChild(banner);
+       if (true) banner.parentNode.removeChild(banner);

[NoCoverage] ConditionalExpression
src/pages/authShell.js:247:9
-       if (banner.parentNode) banner.parentNode.removeChild(banner);
+       if (false) banner.parentNode.removeChild(banner);

[NoCoverage] ObjectLiteral
src/pages/authShell.js:250:10
-     return { unmount };
+     return {};

[NoCoverage] BlockStatement
src/pages/authShell.js:257:9
-     catch { return null; }
+     catch {}

[NoCoverage] BlockStatement
src/pages/authShell.js:278:29
-   function _toast(msg, color) {
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
-       window.toast(msg, color);
-       return;
-     }
-     console.log('[Auth]', msg);
-   }
+   function _toast(msg, color) {}

[NoCoverage] ConditionalExpression
src/pages/authShell.js:279:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/authShell.js:279:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/authShell.js:279:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window !== 'undefined' || typeof window.toast === 'function') {

[NoCoverage] ConditionalExpression
src/pages/authShell.js:279:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (true && typeof window.toast === 'function') {

[NoCoverage] EqualityOperator
src/pages/authShell.js:279:7
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window === 'undefined' && typeof window.toast === 'function') {

[NoCoverage] ConditionalExpression
src/pages/authShell.js:279:40
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window !== 'undefined' && true) {

[NoCoverage] EqualityOperator
src/pages/authShell.js:279:40
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
+     if (typeof window !== 'undefined' && typeof window.toast !== 'function') {

[NoCoverage] BlockStatement
src/pages/authShell.js:279:76
-     if (typeof window !== 'undefined' && typeof window.toast === 'function') {
-       window.toast(msg, color);
-       return;
-     }
+     if (typeof window !== 'undefined' && typeof window.toast === 'function') {}

[Survived] ConditionalExpression
src/pages/authShell.js:136:7
-     if (typeof window === 'undefined' || !window.location) return null;
+     if (false) return null;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is NOT /auth-callback
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is /coach (other route)
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/authShell.js:136:7
-     if (typeof window === 'undefined' || !window.location) return null;
+     if (false || !window.location) return null;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is NOT /auth-callback
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is /coach (other route)
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
  and 2 more tests!

[Survived] LogicalOperator
src/pages/authShell.js:136:7
-     if (typeof window === 'undefined' || !window.location) return null;
+     if (typeof window === 'undefined' && !window.location) return null;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is NOT /auth-callback
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is /coach (other route)
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/authShell.js:138:7
-     if (!path.endsWith('/auth-callback')) return null;
+     if (false) return null;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is NOT /auth-callback
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is /coach (other route)
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
  and 2 more tests!

[Survived] MethodExpression
src/pages/authShell.js:138:8
-     if (!path.endsWith('/auth-callback')) return null;
+     if (!path.startsWith('/auth-callback')) return null;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is NOT /auth-callback
    handleAuthCallbackRoute — §56.10.1 callback detection returns null when path is /coach (other route)
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
  and 2 more tests!

[Survived] ConditionalExpression
src/pages/authShell.js:148:9
-       if (res.ok) {
+       if (true) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] BlockStatement
src/pages/authShell.js:151:11
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: { uid: res.uid, provider: 'magic-link' } })); } catch {}
+         try {} catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ObjectLiteral
src/pages/authShell.js:151:72
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: { uid: res.uid, provider: 'magic-link' } })); } catch {}
+         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', {})); } catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ObjectLiteral
src/pages/authShell.js:151:82
-         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: { uid: res.uid, provider: 'magic-link' } })); } catch {}
+         try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: {} })); } catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ConditionalExpression
src/pages/authShell.js:159:7
-     if (hash) {
+     if (true) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] ConditionalExpression
src/pages/authShell.js:162:9
-       if (idToken) {
+       if (true) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] ConditionalExpression
src/pages/authShell.js:164:11
-         if (res.ok) {
+         if (true) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] BlockStatement
src/pages/authShell.js:166:13
-           try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: { uid: res.uid, provider: 'google' } })); } catch {}
+           try {} catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] ObjectLiteral
src/pages/authShell.js:166:74
-           try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: { uid: res.uid, provider: 'google' } })); } catch {}
+           try { window.dispatchEvent(new CustomEvent('andura:authsuccess', {})); } catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] ObjectLiteral
src/pages/authShell.js:166:84
-           try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: { uid: res.uid, provider: 'google' } })); } catch {}
+           try { window.dispatchEvent(new CustomEvent('andura:authsuccess', { detail: {} })); } catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] BlockStatement
src/pages/authShell.js:255:30
-   function _readPendingEmail() {
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
-     catch { return null; }
-   }
+   function _readPendingEmail() {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email

[Survived] BlockStatement
src/pages/authShell.js:256:7
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
+     try {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email

[Survived] ConditionalExpression
src/pages/authShell.js:256:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
+     try { return true ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email

[Survived] ConditionalExpression
src/pages/authShell.js:256:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
+     try { return false ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email

[Survived] EqualityOperator
src/pages/authShell.js:256:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
+     try { return typeof localStorage === 'undefined' ? localStorage.getItem(PENDING_EMAIL_KEY) : null; }
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email

[Survived] BlockStatement
src/pages/authShell.js:260:36
-   function _writePendingEmail(value) {
-     try {
-       if (typeof localStorage === 'undefined') return;
-       if (value) localStorage.setItem(PENDING_EMAIL_KEY, value);
-       else localStorage.removeItem(PENDING_EMAIL_KEY);
-     } catch {}
-   }
+   function _writePendingEmail(value) {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] BlockStatement
src/pages/authShell.js:261:7
-     try {
-       if (typeof localStorage === 'undefined') return;
-       if (value) localStorage.setItem(PENDING_EMAIL_KEY, value);
-       else localStorage.removeItem(PENDING_EMAIL_KEY);
-     } catch {}
+     try {} catch {}
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ConditionalExpression
src/pages/authShell.js:262:9
-       if (typeof localStorage === 'undefined') return;
+       if (true) return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ConditionalExpression
src/pages/authShell.js:262:9
-       if (typeof localStorage === 'undefined') return;
+       if (false) return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] EqualityOperator
src/pages/authShell.js:262:9
-       if (typeof localStorage === 'undefined') return;
+       if (typeof localStorage !== 'undefined') return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ConditionalExpression
src/pages/authShell.js:263:9
-       if (value) localStorage.setItem(PENDING_EMAIL_KEY, value);
+       if (true) localStorage.setItem(PENDING_EMAIL_KEY, value);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ConditionalExpression
src/pages/authShell.js:263:9
-       if (value) localStorage.setItem(PENDING_EMAIL_KEY, value);
+       if (false) localStorage.setItem(PENDING_EMAIL_KEY, value);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL

[Survived] ConditionalExpression
src/pages/authShell.js:272:9
-       if (typeof window === 'undefined' || !window.history?.replaceState) return;
+       if (false) return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] LogicalOperator
src/pages/authShell.js:272:9
-       if (typeof window === 'undefined' || !window.history?.replaceState) return;
+       if (typeof window === 'undefined' && !window.history?.replaceState) return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] ConditionalExpression
src/pages/authShell.js:272:9
-       if (typeof window === 'undefined' || !window.history?.replaceState) return;
+       if (false || !window.history?.replaceState) return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] OptionalChaining
src/pages/authShell.js:272:43
-       if (typeof window === 'undefined' || !window.history?.replaceState) return;
+       if (typeof window === 'undefined' || !window.history.replaceState) return;
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[NoCoverage] BlockStatement
src/pages/dashboard.js:16:35
-   function renderFatigueScore(elId) {
-     const el = $(elId); if (!el) return;
-     const f = calculateFatigueScore();
-     el.style.display = 'block';
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
-   }
+   function renderFatigueScore(elId) {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:17:27
-     const el = $(elId); if (!el) return;
+     const el = $(elId); if (el) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:17:27
-     const el = $(elId); if (!el) return;
+     const el = $(elId); if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:17:27
-     const el = $(elId); if (!el) return;
+     const el = $(elId); if (false) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:20:83
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
+     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${true} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
