[NoCoverage] ConditionalExpression
src/pages/dashboard.js:20:83
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
+     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${false} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:20:83
-     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon||''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;
+     el.innerHTML = `<span style="color:${f.color};font-size:11px;font-weight:600">${f.icon && ''} ${f.label}</span><div style="font-size:10px;color:var(--text3);margin-top:2px">${f.detail}</div>`;

[NoCoverage] BlockStatement
src/pages/dashboard.js:23:43
-   function calcProjection(ws, kcals, dates) {
-     if (dates.length < 4) {
-       const lastW = dates.length ? ws[dates[dates.length-1]] : 100;
-       return { gaining: false, rate: 0, kg2w: lastW.toFixed(1), kg4w: lastW.toFixed(1), kg8w: lastW.toFixed(1) };
-     }
-     const recent = dates.slice(-8).map(d => ws[d]);
-     const n = recent.length;
-     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a+b,0);
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
-     const lastW = ws[dates[dates.length-1]];
-     return {
-       gaining: slope > 0,
-       rate: Math.round(slope * 7 * 100) / 100,
-       kg2w: (lastW + slope * 14).toFixed(1),
-       kg4w: (lastW + slope * 28).toFixed(1),
-       kg8w: (lastW + slope * 56).toFixed(1),
-     };
-   }
+   function calcProjection(ws, kcals, dates) {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:24:7
-     if (dates.length < 4) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:24:7
-     if (dates.length < 4) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:24:7
-     if (dates.length < 4) {
+     if (dates.length <= 4) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:24:7
-     if (dates.length < 4) {
+     if (dates.length >= 4) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:24:25
-     if (dates.length < 4) {
-       const lastW = dates.length ? ws[dates[dates.length-1]] : 100;
-       return { gaining: false, rate: 0, kg2w: lastW.toFixed(1), kg4w: lastW.toFixed(1), kg8w: lastW.toFixed(1) };
-     }
+     if (dates.length < 4) {}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:25:43
-       const lastW = dates.length ? ws[dates[dates.length-1]] : 100;
+       const lastW = dates.length ? ws[dates[dates.length + 1]] : 100;

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:26:12
-       return { gaining: false, rate: 0, kg2w: lastW.toFixed(1), kg4w: lastW.toFixed(1), kg8w: lastW.toFixed(1) };
+       return {};

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:26:23
-       return { gaining: false, rate: 0, kg2w: lastW.toFixed(1), kg4w: lastW.toFixed(1), kg8w: lastW.toFixed(1) };
+       return { gaining: true, rate: 0, kg2w: lastW.toFixed(1), kg4w: lastW.toFixed(1), kg8w: lastW.toFixed(1) };

[NoCoverage] MethodExpression
src/pages/dashboard.js:28:18
-     const recent = dates.slice(-8).map(d => ws[d]);
+     const recent = dates.map(d => ws[d]);

[NoCoverage] UnaryOperator
src/pages/dashboard.js:28:30
-     const recent = dates.slice(-8).map(d => ws[d]);
+     const recent = dates.slice(+8).map(d => ws[d]);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:28:38
-     const recent = dates.slice(-8).map(d => ws[d]);
+     const recent = dates.slice(-8).map(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:30:16
-     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a+b,0);
+     const sumX = n * (n - 1) * 2, sumY = recent.reduce((a,b)=>a+b,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:30:16
-     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a+b,0);
+     const sumX = n / (n - 1)/2, sumY = recent.reduce((a,b)=>a+b,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:30:19
-     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a+b,0);
+     const sumX = n*(n + 1)/2, sumY = recent.reduce((a,b)=>a+b,0);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:30:48
-     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a+b,0);
+     const sumX = n*(n-1)/2, sumY = recent.reduce(() => undefined,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:30:55
-     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a+b,0);
+     const sumX = n*(n-1)/2, sumY = recent.reduce((a,b)=>a - b,0);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:31:31
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
+     const sumXY = recent.reduce(() => undefined,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:31:40
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
+     const sumXY = recent.reduce((s,v,i)=>s - i * v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:31:42
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
+     const sumXY = recent.reduce((s,v,i)=>s+i / v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:31:72
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
+     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce(() => undefined,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:31:81
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
+     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s - i * i,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:31:83
-     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i*i,0);
+     const sumXY = recent.reduce((s,v,i)=>s+i*v,0), sumX2 = recent.reduce((s,_,i)=>s+i / i,0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:17
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n * sumXY - sumX * sumY) * (n * sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:18
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n * sumXY + sumX * sumY) / (n*sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:18
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n / sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:28
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX / sumY) / (n*sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:42
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX*sumY) / (n * sumX2 + sumX * sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:42
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX*sumY) / (n / sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:32:52
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX / sumX);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:33:26
-     const lastW = ws[dates[dates.length-1]];
+     const lastW = ws[dates[dates.length + 1]];

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:34:10
-     return {
-       gaining: slope > 0,
-       rate: Math.round(slope * 7 * 100) / 100,
-       kg2w: (lastW + slope * 14).toFixed(1),
-       kg4w: (lastW + slope * 28).toFixed(1),
-       kg8w: (lastW + slope * 56).toFixed(1),
-     };
+     return {};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:35:14
-       gaining: slope > 0,
+       gaining: true,

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:35:14
-       gaining: slope > 0,
+       gaining: false,

[NoCoverage] EqualityOperator
src/pages/dashboard.js:35:14
-       gaining: slope > 0,
+       gaining: slope >= 0,

[NoCoverage] EqualityOperator
src/pages/dashboard.js:35:14
-       gaining: slope > 0,
+       gaining: slope <= 0,

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:36:11
-       rate: Math.round(slope * 7 * 100) / 100,
+       rate: Math.round(slope * 7 * 100) * 100,

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:36:22
-       rate: Math.round(slope * 7 * 100) / 100,
+       rate: Math.round(slope * 7 / 100) / 100,

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:36:22
-       rate: Math.round(slope * 7 * 100) / 100,
+       rate: Math.round(slope / 7 * 100) / 100,

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:37:12
-       kg2w: (lastW + slope * 14).toFixed(1),
+       kg2w: (lastW - slope * 14).toFixed(1),

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:37:20
-       kg2w: (lastW + slope * 14).toFixed(1),
+       kg2w: (lastW + slope / 14).toFixed(1),

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:38:12
-       kg4w: (lastW + slope * 28).toFixed(1),
+       kg4w: (lastW - slope * 28).toFixed(1),

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:38:20
-       kg4w: (lastW + slope * 28).toFixed(1),
+       kg4w: (lastW + slope / 28).toFixed(1),

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:39:12
-       kg8w: (lastW + slope * 56).toFixed(1),
+       kg8w: (lastW - slope * 56).toFixed(1),

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:39:20
-       kg8w: (lastW + slope * 56).toFixed(1),
+       kg8w: (lastW + slope / 56).toFixed(1),

[NoCoverage] BlockStatement
src/pages/dashboard.js:43:34
-   function scheduleNotifications() {
-     if ('serviceWorker' in navigator && navigator.serviceWorker.controller) {
-       navigator.serviceWorker.controller.postMessage({ type: 'SCHEDULE_NOTIF' });
-     }
-   }
+   function scheduleNotifications() {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:44:7
-     if ('serviceWorker' in navigator && navigator.serviceWorker.controller) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:44:7
-     if ('serviceWorker' in navigator && navigator.serviceWorker.controller) {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/dashboard.js:44:7
-     if ('serviceWorker' in navigator && navigator.serviceWorker.controller) {
+     if ('serviceWorker' in navigator || navigator.serviceWorker.controller) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:44:75
-     if ('serviceWorker' in navigator && navigator.serviceWorker.controller) {
-       navigator.serviceWorker.controller.postMessage({ type: 'SCHEDULE_NOTIF' });
-     }
+     if ('serviceWorker' in navigator && navigator.serviceWorker.controller) {}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:45:52
-       navigator.serviceWorker.controller.postMessage({ type: 'SCHEDULE_NOTIF' });
+       navigator.serviceWorker.controller.postMessage({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:52:7
-     if (existing) { existing.remove(); return; }
+     if (true) { existing.remove(); return; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:52:7
-     if (existing) { existing.remove(); return; }
+     if (false) { existing.remove(); return; }

[NoCoverage] BlockStatement
src/pages/dashboard.js:52:17
-     if (existing) { existing.remove(); return; }
+     if (existing) {}

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:62:9
-         ${[
-           ['🚶', 'Mers 20-30 min', 'Circulație activă fără stres muscular'],
-           ['🧘', 'Stretching / mobilitate', 'Concentrează-te pe grupele lucrate ieri'],
-           ['💧', 'Hidratare', 'Minim 2.5L apă — recuperarea depinde de asta'],
-           ['😴', 'Somn 7-9h', 'Cel mai important anabolizant natural'],
-           ['🥩', 'Proteină', 'Menține minimul de 160g chiar și în zilele OFF'],
-         ].map(([emoji, title, desc]) => `
+         ${[].map(([emoji, title, desc]) => `

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:63:9
-           ['🚶', 'Mers 20-30 min', 'Circulație activă fără stres muscular'],
+           [],

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:64:9
-           ['🧘', 'Stretching / mobilitate', 'Concentrează-te pe grupele lucrate ieri'],
+           [],

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:65:9
-           ['💧', 'Hidratare', 'Minim 2.5L apă — recuperarea depinde de asta'],
+           [],

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:66:9
-           ['😴', 'Somn 7-9h', 'Cel mai important anabolizant natural'],
+           [],

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:67:9
-           ['🥩', 'Proteină', 'Menține minimul de 160g chiar și în zilele OFF'],
+           [],

[NoCoverage] ArrowFunction
src/pages/dashboard.js:68:13
-         ].map(([emoji, title, desc]) => `
-           <div style="background:var(--card);border:1px solid var(--border);border-radius:var(--rs);padding:12px 14px;display:flex;gap:12px;align-items:flex-start">
-             <div style="font-size:22px;line-height:1">${emoji}</div>
-             <div>
-               <div style="font-size:13px;font-weight:700;margin-bottom:2px">${title}</div>
-               <div style="font-size:11px;color:var(--text3)">${desc}</div>
-             </div>
-           </div>`).join('')}
+         ].map(() => undefined).join('')}

[NoCoverage] BlockStatement
src/pages/dashboard.js:78:40
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => {});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:78:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (true) modal.remove(); });

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:78:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (false) modal.remove(); });

[NoCoverage] EqualityOperator
src/pages/dashboard.js:78:46
-     modal.addEventListener('click', e => { if (e.target === modal) modal.remove(); });
+     modal.addEventListener('click', e => { if (e.target !== modal) modal.remove(); });

[NoCoverage] BlockStatement
src/pages/dashboard.js:82:36
-   export function dismissMFPPrompt() {
-     DB.set('mfp-prompt-dismissed', Date.now());
-     renderDash();
-   }
+   export function dismissMFPPrompt() {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:89:12
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),today=tod();
+     const ws=true,dates=Object.keys(ws).sort(),today=tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:89:12
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),today=tod();
+     const ws=false,dates=Object.keys(ws).sort(),today=tod();

[NoCoverage] LogicalOperator
src/pages/dashboard.js:89:12
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),today=tod();
+     const ws=DB.get('weights') && {},dates=Object.keys(ws).sort(),today=tod();

[NoCoverage] MethodExpression
src/pages/dashboard.js:89:40
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),today=tod();
+     const ws=DB.get('weights')||{},dates=Object.keys(ws),today=tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:90:14
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=true,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:90:14
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=false,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:90:14
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=ws[today] && null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:90:58
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length + 1]]:null,dW=todW||lastW;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:90:83
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:90:83
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:90:83
-     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW||lastW;
+     const todW=ws[today]||null,lastW=dates.length?ws[dates[dates.length-1]]:null,dW=todW && lastW;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:13
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW - (SW - TW) * Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT)) * 10) * 10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:24
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW - (SW - TW) * Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT)) / 10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:25
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW + (SW - TW) * Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:28
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW - TW) / Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:29
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW + TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;

[NoCoverage] MethodExpression
src/pages/dashboard.js:92:36
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.max(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:47
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0, Math.round((new Date() - SD2) / 86400000)) * DTOT))*10)/10;

[NoCoverage] MethodExpression
src/pages/dashboard.js:92:47
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.min(0, Math.round((new Date() - SD2) / 86400000))/DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:69
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date() - SD2) * 86400000))/DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:92:70
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date() + SD2)/86400000))/DTOT))*10)/10;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:93:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:93:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=false;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:93:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now > PILOT;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:93:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now < PILOT;

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:94:16
-     const dayMap=[6,0,1,2,3,4,5],tp=PROG[dayMap[now.getDay()]]||PROG[0];
+     const dayMap=[],tp=PROG[dayMap[now.getDay()]]||PROG[0];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:94:35
-     const dayMap=[6,0,1,2,3,4,5],tp=PROG[dayMap[now.getDay()]]||PROG[0];
+     const dayMap=[6,0,1,2,3,4,5],tp=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:94:35
-     const dayMap=[6,0,1,2,3,4,5],tp=PROG[dayMap[now.getDay()]]||PROG[0];
+     const dayMap=[6,0,1,2,3,4,5],tp=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:94:35
-     const dayMap=[6,0,1,2,3,4,5],tp=PROG[dayMap[now.getDay()]]||PROG[0];
+     const dayMap=[6,0,1,2,3,4,5],tp=PROG[dayMap[now.getDay()]] && PROG[0];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:96:15
-     const kcals=DB.get('kcals')||{};
+     const kcals=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:96:15
-     const kcals=DB.get('kcals')||{};
+     const kcals=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:96:15
-     const kcals=DB.get('kcals')||{};
+     const kcals=DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:97:19
-     const todayKcal=kcals[today]!==undefined?kcals[today]:sysKcal;
+     const todayKcal=true?kcals[today]:sysKcal;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:97:19
-     const todayKcal=kcals[today]!==undefined?kcals[today]:sysKcal;
+     const todayKcal=false?kcals[today]:sysKcal;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:97:19
-     const todayKcal=kcals[today]!==undefined?kcals[today]:sysKcal;
+     const todayKcal=kcals[today] === undefined?kcals[today]:sysKcal;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:98:19
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=true?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:98:19
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=false?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:98:19
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal >= sysKcal + 200?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:98:19
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal <= sysKcal + 200?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:98:30
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal>(sysKcal - 200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:98:60
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':true?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:98:60
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':false?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:98:60
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal <= sysKcal - 200?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:98:60
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal >= sysKcal - 200?'var(--accent3)':'var(--green)';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:98:71
-     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal-200)?'var(--accent3)':'var(--green)';
+     const kcalColor=todayKcal>(sysKcal+200)?'var(--accent2)':todayKcal<(sysKcal + 200)?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:99:22
-     const workoutToday=tp.t==='off'?'ODIHNĂ':tp.lb.toUpperCase();
+     const workoutToday=true?'ODIHNĂ':tp.lb.toUpperCase();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:99:22
-     const workoutToday=tp.t==='off'?'ODIHNĂ':tp.lb.toUpperCase();
+     const workoutToday=false?'ODIHNĂ':tp.lb.toUpperCase();

[NoCoverage] EqualityOperator
src/pages/dashboard.js:99:22
-     const workoutToday=tp.t==='off'?'ODIHNĂ':tp.lb.toUpperCase();
+     const workoutToday=tp.t !== 'off'?'ODIHNĂ':tp.lb.toUpperCase();

[NoCoverage] MethodExpression
src/pages/dashboard.js:99:44
-     const workoutToday=tp.t==='off'?'ODIHNĂ':tp.lb.toUpperCase();
+     const workoutToday=tp.t==='off'?'ODIHNĂ':tp.lb.toLowerCase();

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:100:21
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:100:29
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':true?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:100:29
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':false?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:100:29
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW < tgt + 0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:100:29
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW > tgt + 0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:100:33
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW<=tgt - 0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:100:52
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':true?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:100:52
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':false?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:100:52
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW < tgt + 1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:100:52
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW > tgt + 1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:100:56
-     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt+1?'ÎN URMĂ':'OFF TRACK';
+     const statusToday=!dW?'—':dW<=tgt+0.3?'ON TRACK':dW<=tgt - 1?'ÎN URMĂ':'OFF TRACK';

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:101:21
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
