[NoCoverage] ConditionalExpression
src/pages/dashboard.js:101:40
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':true?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:101:40
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':false?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:101:40
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW < tgt + 0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:101:40
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW > tgt + 0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:101:44
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW<=tgt - 0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:101:67
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':true?'var(--accent2)':'var(--red)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:101:67
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':false?'var(--accent2)':'var(--red)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:101:67
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW < tgt + 1?'var(--accent2)':'var(--red)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:101:67
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW > tgt + 1?'var(--accent2)':'var(--red)';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:101:71
-     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt+1?'var(--accent2)':'var(--red)';
+     const statusColor=!dW?'var(--text2)':dW<=tgt+0.3?'var(--green)':dW<=tgt - 1?'var(--accent2)':'var(--red)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:102:18
-     const ctaLabel=tp.t==='off'?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';
+     const ctaLabel=true?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:102:18
-     const ctaLabel=tp.t==='off'?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';
+     const ctaLabel=false?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:102:18
-     const ctaLabel=tp.t==='off'?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';
+     const ctaLabel=tp.t !== 'off'?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:102:44
-     const ctaLabel=tp.t==='off'?'ODIHNĂ AZI':!todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';
+     const ctaLabel=tp.t==='off'?'ODIHNĂ AZI':todW?'LOG GREUTATE ▶':'ANTRENAMENT ▶';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:103:19
-     const ctaAction=tp.t==='off'?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;
+     const ctaAction=true?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:103:19
-     const ctaAction=tp.t==='off'?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;
+     const ctaAction=false?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:103:19
-     const ctaAction=tp.t==='off'?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;
+     const ctaAction=tp.t !== 'off'?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:103:37
-     const ctaAction=tp.t==='off'?null:!todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;
+     const ctaAction=tp.t==='off'?null:todW?`sp('weight',document.querySelectorAll('.nb')[2])`:`sp('coach',document.querySelectorAll('.nb')[0])`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:104:23
-     const dd=$('dd');if(dd)dd.textContent=now.toLocaleDateString('ro-RO',{weekday:'long',day:'numeric',month:'long'});
+     const dd=$('dd');if(true)dd.textContent=now.toLocaleDateString('ro-RO',{weekday:'long',day:'numeric',month:'long'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:104:23
-     const dd=$('dd');if(dd)dd.textContent=now.toLocaleDateString('ro-RO',{weekday:'long',day:'numeric',month:'long'});
+     const dd=$('dd');if(false)dd.textContent=now.toLocaleDateString('ro-RO',{weekday:'long',day:'numeric',month:'long'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:104:72
-     const dd=$('dd');if(dd)dd.textContent=now.toLocaleDateString('ro-RO',{weekday:'long',day:'numeric',month:'long'});
+     const dd=$('dd');if(dd)dd.textContent=now.toLocaleDateString('ro-RO',{});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:106:22
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = true, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:106:22
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = false, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};

[NoCoverage] LogicalOperator
src/pages/dashboard.js:106:22
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots') && {}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:106:56
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots')||{}, alertKcals = true, alertWs = DB.get('weights')||{};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:106:56
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots')||{}, alertKcals = false, alertWs = DB.get('weights')||{};

[NoCoverage] LogicalOperator
src/pages/dashboard.js:106:56
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals') && {}, alertWs = DB.get('weights')||{};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:106:87
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:106:87
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:106:87
-     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights')||{};
+     const alertProts = DB.get('prots')||{}, alertKcals = DB.get('kcals')||{}, alertWs = DB.get('weights') && {};

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:107:32
-     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last3Days = Array.from({},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});

[NoCoverage] BlockStatement
src/pages/dashboard.js:107:50
-     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last3Days = Array.from({length:3},(_,i)=>{});

[NoCoverage] MethodExpression
src/pages/dashboard.js:107:71
-     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setTime(dt.getDate() - i - 1);return todDate(dt);});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:107:82
-     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate() - i + 1);return todDate(dt);});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:107:82
-     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last3Days = Array.from({length:3},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate() + i-1);return todDate(dt);});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:108:32
-     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last7Days = Array.from({},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});

[NoCoverage] BlockStatement
src/pages/dashboard.js:108:50
-     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last7Days = Array.from({length:7},(_,i)=>{});

[NoCoverage] MethodExpression
src/pages/dashboard.js:108:71
-     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setTime(dt.getDate() - i - 1);return todDate(dt);});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:108:82
-     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate() - i + 1);return todDate(dt);});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:108:82
-     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate()-i-1);return todDate(dt);});
+     const last7Days = Array.from({length:7},(_,i)=>{const dt=new Date();dt.setDate(dt.getDate() + i-1);return todDate(dt);});

[NoCoverage] MethodExpression
src/pages/dashboard.js:109:26
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.length;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:109:43
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:109:46
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>true).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:109:46
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>false).length;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:109:46
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>alertProts[d] !== undefined || alertProts[d] < 160).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:109:46
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>true&&alertProts[d]<160).length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:109:46
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>alertProts[d] === undefined&&alertProts[d]<160).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:109:73
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&true).length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:109:73
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d] <= 160).length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:109:73
-     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d]<160).length;
+     const protBelowCount = last3Days.filter(d=>alertProts[d]!==undefined&&alertProts[d] >= 160).length;

[NoCoverage] MethodExpression
src/pages/dashboard.js:110:26
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.length;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:110:43
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:110:46
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>true).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:110:46
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>false).length;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:110:46
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>alertKcals[d] !== undefined || alertKcals[d] < 1500).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:110:46
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>true&&alertKcals[d]<1500).length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:110:46
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>alertKcals[d] === undefined&&alertKcals[d]<1500).length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:110:73
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&true).length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:110:73
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d] <= 1500).length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:110:73
-     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d]<1500).length;
+     const kcalBelowCount = last3Days.filter(d=>alertKcals[d]!==undefined&&alertKcals[d] >= 1500).length;

[NoCoverage] MethodExpression
src/pages/dashboard.js:111:28
-     const recentWeightVals = last7Days.map(d=>alertWs[d]).filter(Boolean);
+     const recentWeightVals = last7Days.map(d => alertWs[d]);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:111:42
-     const recentWeightVals = last7Days.map(d=>alertWs[d]).filter(Boolean);
+     const recentWeightVals = last7Days.map(() => undefined).filter(Boolean);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:112:26
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:112:26
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:112:26
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length >= 5 || Math.max(...recentWeightVals) - Math.min(...recentWeightVals) < 0.3;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:112:26
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = true&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:112:26
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length > 5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:112:26
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length < 5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:112:54
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length>=5&&true;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:112:54
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length>=5&&Math.max(...recentWeightVals) - Math.min(...recentWeightVals) <= 0.3;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:112:54
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length>=5&&Math.max(...recentWeightVals) - Math.min(...recentWeightVals) >= 0.3;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:112:55
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals) + Math.min(...recentWeightVals))<0.3;

[NoCoverage] MethodExpression
src/pages/dashboard.js:112:55
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length>=5&&(Math.min(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;

[NoCoverage] MethodExpression
src/pages/dashboard.js:112:85
-     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.min(...recentWeightVals))<0.3;
+     const weightStagnant = recentWeightVals.length>=5&&(Math.max(...recentWeightVals)-Math.max(...recentWeightVals))<0.3;

[NoCoverage] MethodExpression
src/pages/dashboard.js:113:22
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs') || []).filter(l => !l.baseline && l.rpe).map(l=>l.rpe);

[NoCoverage] MethodExpression
src/pages/dashboard.js:113:22
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = DB.get('logs') || [].slice(0,15).map(l=>l.rpe);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:113:23
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (true).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:113:23
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (false).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:113:23
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs') && []).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:113:39
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||["Stryker was here"]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:113:50
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||[]).filter(() => undefined).slice(0,15).map(l=>l.rpe);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:113:53
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||[]).filter(l=>true).slice(0,15).map(l=>l.rpe);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:113:53
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||[]).filter(l=>false).slice(0,15).map(l=>l.rpe);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:113:53
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline || l.rpe).slice(0,15).map(l=>l.rpe);

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:113:53
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||[]).filter(l=>l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:113:89
-     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(l=>l.rpe);
+     const recentRPEs = (DB.get('logs')||[]).filter(l=>!l.baseline&&l.rpe).slice(0,15).map(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:114:42
-     const avgRecentRPE = recentRPEs.length?recentRPEs.reduce((a,b)=>a+b,0)/recentRPEs.length:0;
+     const avgRecentRPE = recentRPEs.length?recentRPEs.reduce((a, b) => a + b, 0) * recentRPEs.length:0;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:114:60
-     const avgRecentRPE = recentRPEs.length?recentRPEs.reduce((a,b)=>a+b,0)/recentRPEs.length:0;
+     const avgRecentRPE = recentRPEs.length?recentRPEs.reduce(() => undefined,0)/recentRPEs.length:0;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:114:67
-     const avgRecentRPE = recentRPEs.length?recentRPEs.reduce((a,b)=>a+b,0)/recentRPEs.length:0;
+     const avgRecentRPE = recentRPEs.length?recentRPEs.reduce((a,b)=>a - b,0)/recentRPEs.length:0;

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:115:18
-     let brutAlerts=[];
+     let brutAlerts=["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:116:6
-     if(protBelowCount>=2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});
+     if(true) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:116:6
-     if(protBelowCount>=2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});
+     if(false) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:116:6
-     if(protBelowCount>=2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});
+     if(protBelowCount > 2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:116:6
-     if(protBelowCount>=2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});
+     if(protBelowCount < 2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:116:41
-     if(protBelowCount>=2) brutAlerts.push({msg:`NU MĂNÂNCI DESTUL PROTEINĂ. PIERZI MASĂ.`,sub:`${protBelowCount}/3 zile sub 160g`,color:'var(--red)'});
+     if(protBelowCount>=2) brutAlerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:117:6
-     if(kcalBelowCount>=2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});
+     if(true) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:117:6
-     if(kcalBelowCount>=2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});
+     if(false) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:117:6
-     if(kcalBelowCount>=2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});
+     if(kcalBelowCount > 2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:117:6
-     if(kcalBelowCount>=2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});
+     if(kcalBelowCount < 2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:117:41
-     if(kcalBelowCount>=2) brutAlerts.push({msg:`DEFICIT EXTREM. METABOLISMUL ÎNCETINEȘTE.`,sub:`${kcalBelowCount}/3 zile sub 1500 kcal`,color:'var(--red)'});
+     if(kcalBelowCount>=2) brutAlerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:118:6
-     if(weightStagnant) brutAlerts.push({msg:`TREND STAGNEAZĂ. VERIFICĂ KCAL ȘI SOMN.`,sub:`7 zile fără schimbare reală`,color:'var(--accent2)'});
+     if(true) brutAlerts.push({msg:`TREND STAGNEAZĂ. VERIFICĂ KCAL ȘI SOMN.`,sub:`7 zile fără schimbare reală`,color:'var(--accent2)'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:118:6
-     if(weightStagnant) brutAlerts.push({msg:`TREND STAGNEAZĂ. VERIFICĂ KCAL ȘI SOMN.`,sub:`7 zile fără schimbare reală`,color:'var(--accent2)'});
+     if(false) brutAlerts.push({msg:`TREND STAGNEAZĂ. VERIFICĂ KCAL ȘI SOMN.`,sub:`7 zile fără schimbare reală`,color:'var(--accent2)'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:118:38
-     if(weightStagnant) brutAlerts.push({msg:`TREND STAGNEAZĂ. VERIFICĂ KCAL ȘI SOMN.`,sub:`7 zile fără schimbare reală`,color:'var(--accent2)'});
+     if(weightStagnant) brutAlerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:119:6
-     if(avgRecentRPE>8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});
+     if(true) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:119:6
-     if(avgRecentRPE>8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});
+     if(false) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});
