[NoCoverage] EqualityOperator
src/pages/dashboard.js:119:6
-     if(avgRecentRPE>8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});
+     if(avgRecentRPE >= 8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:119:6
-     if(avgRecentRPE>8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});
+     if(avgRecentRPE <= 8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:119:40
-     if(avgRecentRPE>8.5) brutAlerts.push({msg:`RPE MEDIU PREA MARE. SCADE GREUTATEA.`,sub:`Medie ${avgRecentRPE.toFixed(1)} — risc supraantrenament`,color:'var(--accent2)'});
+     if(avgRecentRPE>8.5) brutAlerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:123:6
-     if(dcmd)dcmd.innerHTML=_alertHtml+`<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);overflow:hidden">
+     if(true)dcmd.innerHTML=_alertHtml+`<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);overflow:hidden">

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:123:6
-     if(dcmd)dcmd.innerHTML=_alertHtml+`<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);overflow:hidden">
+     if(false)dcmd.innerHTML=_alertHtml+`<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);overflow:hidden">

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:142:6
-     if(mfpEl){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:142:6
-     if(mfpEl){
+     if(false){

[NoCoverage] BlockStatement
src/pages/dashboard.js:142:12
-     if(mfpEl){
-       const lastDismiss=DB.get('mfp-prompt-dismissed')||0;
-       const show=Date.now()-lastDismiss > 3*86400000;
-       if(show){
-         mfpEl.style.display='block';
-         mfpEl.innerHTML=`<div style="display:flex;align-items:center;justify-content:space-between;gap:8px;padding:10px 14px;background:rgba(200,255,0,0.06);border:1px solid rgba(200,255,0,0.2);border-radius:var(--rs);margin-bottom:8px">
-           <div style="font-size:12px;color:var(--text2);flex:1">📲 Importă nutriție din CSV pentru kcal și proteină exacte</div>
-           <button onclick="triggerMFPImport()" style="background:var(--accent);color:#000;font-weight:700;font-size:11px;padding:6px 12px;border:none;border-radius:var(--rs);cursor:pointer;white-space:nowrap;font-family:'DM Sans',sans-serif">Import nutriție CSV</button>
-           <button onclick="dismissMFPPrompt()" style="background:none;border:1px solid var(--border);color:var(--text3);font-size:11px;padding:6px 10px;border-radius:var(--rs);cursor:pointer;font-family:'DM Sans',sans-serif">✕</button>
-         </div>`;
-       } else {
-         mfpEl.style.display='none';
-       }
-     }
+     if(mfpEl){}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:143:23
-       const lastDismiss=DB.get('mfp-prompt-dismissed')||0;
+       const lastDismiss=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:143:23
-       const lastDismiss=DB.get('mfp-prompt-dismissed')||0;
+       const lastDismiss=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:143:23
-       const lastDismiss=DB.get('mfp-prompt-dismissed')||0;
+       const lastDismiss=DB.get('mfp-prompt-dismissed') && 0;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:144:16
-       const show=Date.now()-lastDismiss > 3*86400000;
+       const show=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:144:16
-       const show=Date.now()-lastDismiss > 3*86400000;
+       const show=false;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:144:16
-       const show=Date.now()-lastDismiss > 3*86400000;
+       const show=Date.now() - lastDismiss >= 3 * 86400000;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:144:16
-       const show=Date.now()-lastDismiss > 3*86400000;
+       const show=Date.now() - lastDismiss <= 3 * 86400000;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:144:16
-       const show=Date.now()-lastDismiss > 3*86400000;
+       const show=Date.now() + lastDismiss > 3*86400000;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:144:41
-       const show=Date.now()-lastDismiss > 3*86400000;
+       const show=Date.now()-lastDismiss > 3 / 86400000;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:145:8
-       if(show){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:145:8
-       if(show){
+       if(false){

[NoCoverage] BlockStatement
src/pages/dashboard.js:145:13
-       if(show){
-         mfpEl.style.display='block';
-         mfpEl.innerHTML=`<div style="display:flex;align-items:center;justify-content:space-between;gap:8px;padding:10px 14px;background:rgba(200,255,0,0.06);border:1px solid rgba(200,255,0,0.2);border-radius:var(--rs);margin-bottom:8px">
-           <div style="font-size:12px;color:var(--text2);flex:1">📲 Importă nutriție din CSV pentru kcal și proteină exacte</div>
-           <button onclick="triggerMFPImport()" style="background:var(--accent);color:#000;font-weight:700;font-size:11px;padding:6px 12px;border:none;border-radius:var(--rs);cursor:pointer;white-space:nowrap;font-family:'DM Sans',sans-serif">Import nutriție CSV</button>
-           <button onclick="dismissMFPPrompt()" style="background:none;border:1px solid var(--border);color:var(--text3);font-size:11px;padding:6px 10px;border-radius:var(--rs);cursor:pointer;font-family:'DM Sans',sans-serif">✕</button>
-         </div>`;
-       } else {
+       if(show){} else {

[NoCoverage] BlockStatement
src/pages/dashboard.js:152:12
-       } else {
-         mfpEl.style.display='none';
-       }
+       } else {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:158:6
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(true){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:158:6
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(false){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] BlockStatement
src/pages/dashboard.js:158:9
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
-     else if(dW<=tgt+1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';
-     else sb.innerHTML='<div class="sbadge off">❌ OFF TRACK</div>';}
+     if(sb){}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:158:13
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:158:13
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(true)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:158:13
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(false)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:158:41
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(!dW)sb.innerHTML='';else if(true)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:158:41
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(!dW)sb.innerHTML='';else if(false)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:158:41
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(!dW)sb.innerHTML='';else if(dW < tgt + 0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:158:41
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(!dW)sb.innerHTML='';else if(dW > tgt + 0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:158:45
-     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt+0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';
+     if(sb){if(!dW)sb.innerHTML='';else if(dW<=tgt - 0.3)sb.innerHTML='<div class="sbadge on">✅ ON TRACK</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:159:11
-     else if(dW<=tgt+1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';
+     else if(true)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:159:11
-     else if(dW<=tgt+1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';
+     else if(false)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:159:11
-     else if(dW<=tgt+1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';
+     else if(dW < tgt + 1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:159:11
-     else if(dW<=tgt+1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';
+     else if(dW > tgt + 1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:159:15
-     else if(dW<=tgt+1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';
+     else if(dW<=tgt - 1)sb.innerHTML='<div class="sbadge warn">⚠ ÎN URMĂ</div>';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:164:6
-     if(cdDash){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:164:6
-     if(cdDash){
+     if(false){

[NoCoverage] BlockStatement
src/pages/dashboard.js:164:13
-     if(cdDash){
-       const closed=DB.get('closed-days')||{};
-       if(!closed[today]){
-         cdDash.style.display='flex';
-         cdDash.innerHTML=`<button onclick="closeDayFromDash()" style="background:var(--accent);color:#000;font-weight:700;font-size:12px;padding:8px 16px;border:none;border-radius:40px;cursor:pointer;font-family:'DM Sans',sans-serif;white-space:nowrap">🌙 ÎNCHIDE ZIUA</button>`;
-       } else {
-         cdDash.style.display='none';
-       }
-     }
+     if(cdDash){}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:165:18
-       const closed=DB.get('closed-days')||{};
+       const closed=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:165:18
-       const closed=DB.get('closed-days')||{};
+       const closed=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:165:18
-       const closed=DB.get('closed-days')||{};
+       const closed=DB.get('closed-days') && {};

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:166:8
-       if(!closed[today]){
+       if(closed[today]){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:166:8
-       if(!closed[today]){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:166:8
-       if(!closed[today]){
+       if(false){

[NoCoverage] BlockStatement
src/pages/dashboard.js:166:23
-       if(!closed[today]){
-         cdDash.style.display='flex';
-         cdDash.innerHTML=`<button onclick="closeDayFromDash()" style="background:var(--accent);color:#000;font-weight:700;font-size:12px;padding:8px 16px;border:none;border-radius:40px;cursor:pointer;font-family:'DM Sans',sans-serif;white-space:nowrap">🌙 ÎNCHIDE ZIUA</button>`;
-       } else {
+       if(!closed[today]){} else {

[NoCoverage] BlockStatement
src/pages/dashboard.js:169:12
-       } else {
-         cdDash.style.display='none';
-       }
+       } else {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:175:6
-     if(dal)dal.innerHTML=alerts.slice(0,4).map(a=>{
+     if(true)dal.innerHTML=alerts.slice(0,4).map(a=>{

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:175:6
-     if(dal)dal.innerHTML=alerts.slice(0,4).map(a=>{
+     if(false)dal.innerHTML=alerts.slice(0,4).map(a=>{

[NoCoverage] MethodExpression
src/pages/dashboard.js:175:24
-     if(dal)dal.innerHTML=alerts.slice(0,4).map(a=>{
+     if(dal)dal.innerHTML=alerts.map(a=>{

[NoCoverage] BlockStatement
src/pages/dashboard.js:175:49
-     if(dal)dal.innerHTML=alerts.slice(0,4).map(a=>{
-       const arrow=a.nav?'<div style="font-size:20px;color:var(--text3);flex-shrink:0;margin-left:8px">›</div>':'';
-       const onclick=a.nav?` onclick="goTo('${a.nav}')" style="cursor:pointer"`:'';
-       return `<div class="abox ${a.t}"${onclick}><div class="ai2">${a.i}</div><div style="flex:1"><div class="at2">${a.tt}</div><div class="as2">${a.s}</div></div>${arrow}</div>`;
-     }).join('');
+     if(dal)dal.innerHTML=alerts.slice(0,4).map(a=>{}).join('');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:180:23
-     const kw=$('kw');if(kw){kw.textContent=dW?dW.toFixed(1):'—';$('kws').textContent=todW?'kg azi':dW?'kg (ultima)':'kg';}
+     const kw=$('kw');if(true){kw.textContent=dW?dW.toFixed(1):'—';$('kws').textContent=todW?'kg azi':dW?'kg (ultima)':'kg';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:180:23
-     const kw=$('kw');if(kw){kw.textContent=dW?dW.toFixed(1):'—';$('kws').textContent=todW?'kg azi':dW?'kg (ultima)':'kg';}
+     const kw=$('kw');if(false){kw.textContent=dW?dW.toFixed(1):'—';$('kws').textContent=todW?'kg azi':dW?'kg (ultima)':'kg';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:180:26
-     const kw=$('kw');if(kw){kw.textContent=dW?dW.toFixed(1):'—';$('kws').textContent=todW?'kg azi':dW?'kg (ultima)':'kg';}
+     const kw=$('kw');if(kw){}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:181:24
-     const kl=$('kl2');if(kl)kl.textContent=dW?(SW-dW).toFixed(1):'—';
+     const kl=$('kl2');if(true)kl.textContent=dW?(SW-dW).toFixed(1):'—';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:181:24
-     const kl=$('kl2');if(kl)kl.textContent=dW?(SW-dW).toFixed(1):'—';
+     const kl=$('kl2');if(false)kl.textContent=dW?(SW-dW).toFixed(1):'—';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:181:46
-     const kl=$('kl2');if(kl)kl.textContent=dW?(SW-dW).toFixed(1):'—';
+     const kl=$('kl2');if(kl)kl.textContent=dW?(SW + dW).toFixed(1):'—';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:182:6
-     if(trend!==null){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:182:6
-     if(trend!==null){
+     if(false){

[NoCoverage] EqualityOperator
src/pages/dashboard.js:182:6
-     if(trend!==null){
+     if(trend === null){

[NoCoverage] BlockStatement
src/pages/dashboard.js:182:19
-     if(trend!==null){
-       const kt=$('kt'),kts=$('kts');
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
-     } else {
+     if(trend!==null){} else {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:184:8
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(true)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:184:8
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(false)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:184:26
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(kt)kt.textContent=(trend > 0 ? '+' : '') - trend.toFixed(2);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:184:27
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(kt)kt.textContent=(true?'+':'')+trend.toFixed(2);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:184:27
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(kt)kt.textContent=(false?'+':'')+trend.toFixed(2);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:184:27
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(kt)kt.textContent=(trend >= 0?'+':'')+trend.toFixed(2);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:184:27
-       if(kt)kt.textContent=(trend>0?'+':'')+trend.toFixed(2);
+       if(kt)kt.textContent=(trend <= 0?'+':'')+trend.toFixed(2);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:8
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(true)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:8
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(false)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:28
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=true?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:28
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=false?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] LogicalOperator
src/pages/dashboard.js:185:28
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend <= -0.3 || trend >= -1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:28
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=true&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:185:28
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend < -0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:185:28
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend > -0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] UnaryOperator
src/pages/dashboard.js:185:35
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=+0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:41
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&true?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:185:41
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend > -1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:185:41
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend < -1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] UnaryOperator
src/pages/dashboard.js:185:48
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend>=+1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:63
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':true?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:185:63
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':false?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:185:63
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend <= -1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:185:63
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend >= -1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] UnaryOperator
src/pages/dashboard.js:185:69
-       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<-1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';
+       if(kts)kts.textContent=trend<=-0.3&&trend>=-1.2?'kg/7z ✅':trend<+1.2?'kg/7z ⚠ rapid':'kg/7z ⚠ lent';

[NoCoverage] BlockStatement
src/pages/dashboard.js:186:10
-     } else {
-       const need=Math.max(0,4-dates.length);
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
-     }
+     } else {}

[NoCoverage] MethodExpression
src/pages/dashboard.js:187:16
-       const need=Math.max(0,4-dates.length);
+       const need=Math.min(0, 4 - dates.length);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:187:27
-       const need=Math.max(0,4-dates.length);
+       const need=Math.max(0,4 + dates.length);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:188:25
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
+       const kt=$('kt');if(true)kt.textContent=need>0?`${need}`:dates.length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:188:25
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
+       const kt=$('kt');if(false)kt.textContent=need>0?`${need}`:dates.length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:188:43
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
+       const kt=$('kt');if(kt)kt.textContent=true?`${need}`:dates.length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:188:43
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
+       const kt=$('kt');if(kt)kt.textContent=false?`${need}`:dates.length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:188:43
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
+       const kt=$('kt');if(kt)kt.textContent=need >= 0?`${need}`:dates.length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:188:43
-       const kt=$('kt');if(kt)kt.textContent=need>0?`${need}`:dates.length;
+       const kt=$('kt');if(kt)kt.textContent=need <= 0?`${need}`:dates.length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:189:27
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
+       const kts=$('kts');if(true)kts.textContent=need>0?'zile până la trend':'zile date';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:189:27
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
+       const kts=$('kts');if(false)kts.textContent=need>0?'zile până la trend':'zile date';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:189:47
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
+       const kts=$('kts');if(kts)kts.textContent=true?'zile până la trend':'zile date';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:189:47
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
+       const kts=$('kts');if(kts)kts.textContent=false?'zile până la trend':'zile date';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:189:47
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
+       const kts=$('kts');if(kts)kts.textContent=need >= 0?'zile până la trend':'zile date';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:189:47
-       const kts=$('kts');if(kts)kts.textContent=need>0?'zile până la trend':'zile date';
+       const kts=$('kts');if(kts)kts.textContent=need <= 0?'zile până la trend':'zile date';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:192:6
-     if(kpib){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:192:6
-     if(kpib){
+     if(false){

[NoCoverage] BlockStatement
src/pages/dashboard.js:192:11
-     if(kpib){
-       if(pilotActive){$('kpi-days-label').textContent='TDEE Real';$('kd').textContent=SYS.estimateTDEE();$('kpi-days-sub').textContent='kcal mentenanță';}
-       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2-now)/86400000));$('kpi-days-sub').textContent='până 20 iulie';}
-     }
+     if(kpib){}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:193:8
-       if(pilotActive){$('kpi-days-label').textContent='TDEE Real';$('kd').textContent=SYS.estimateTDEE();$('kpi-days-sub').textContent='kcal mentenanță';}
+       if(true){$('kpi-days-label').textContent='TDEE Real';$('kd').textContent=SYS.estimateTDEE();$('kpi-days-sub').textContent='kcal mentenanță';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:193:8
-       if(pilotActive){$('kpi-days-label').textContent='TDEE Real';$('kd').textContent=SYS.estimateTDEE();$('kpi-days-sub').textContent='kcal mentenanță';}
+       if(false){$('kpi-days-label').textContent='TDEE Real';$('kd').textContent=SYS.estimateTDEE();$('kpi-days-sub').textContent='kcal mentenanță';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:193:20
-       if(pilotActive){$('kpi-days-label').textContent='TDEE Real';$('kd').textContent=SYS.estimateTDEE();$('kpi-days-sub').textContent='kcal mentenanță';}
+       if(pilotActive){}

[NoCoverage] BlockStatement
src/pages/dashboard.js:194:9
-       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2-now)/86400000));$('kpi-days-sub').textContent='până 20 iulie';}
+       else{}

[NoCoverage] MethodExpression
src/pages/dashboard.js:194:76
-       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2-now)/86400000));$('kpi-days-sub').textContent='până 20 iulie';}
+       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.min(0, Math.round((TD2 - now) / 86400000));$('kpi-days-sub').textContent='până 20 iulie';}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:194:98
-       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2-now)/86400000));$('kpi-days-sub').textContent='până 20 iulie';}
+       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2 - now) * 86400000));$('kpi-days-sub').textContent='până 20 iulie';}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:194:99
-       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2-now)/86400000));$('kpi-days-sub').textContent='până 20 iulie';}
+       else{$('kpi-days-label').textContent='Zile rămase';$('kd').textContent=Math.max(0,Math.round((TD2 + now)/86400000));$('kpi-days-sub').textContent='până 20 iulie';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:197:6
-     if(dv&&dr&&dec){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:197:6
-     if(dv&&dr&&dec){
+     if(false){

[NoCoverage] LogicalOperator
src/pages/dashboard.js:197:6
-     if(dv&&dr&&dec){
+     if(dv && dr || dec){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:197:6
-     if(dv&&dr&&dec){
+     if(true&&dec){

[NoCoverage] LogicalOperator
src/pages/dashboard.js:197:6
-     if(dv&&dr&&dec){
+     if(dv || dr&&dec){
