[NoCoverage] ConditionalExpression
src/pages/dashboard.js:198:8
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(true){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:198:8
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(false){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:198:8
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend !== null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:198:21
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){}

[NoCoverage] MethodExpression
src/pages/dashboard.js:198:30
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.min(0, 4 - dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:198:41
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4 + dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:198:72
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=true?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:198:72
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=false?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:198:72
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n >= 0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:198:72
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n <= 0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:198:133
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=true?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:198:133
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=false?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:198:133
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n >= 0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:198:133
-       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n>0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}
+       if(trend===null){const n=Math.max(0,4-dates.length);dv.textContent=n>0?`COMPLETEAZĂ ${n} ZILE`:`${sysKcal} KCAL`;dr.textContent=n <= 0?`${n} zile până la decizie`:'Date insuficiente';dec.style.borderColor='var(--text3)';dv.style.color='var(--text2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:199:13
-       else if(trend<-1.2){
+       else if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:199:13
-       else if(trend<-1.2){
+       else if(false){

[NoCoverage] EqualityOperator
src/pages/dashboard.js:199:13
-       else if(trend<-1.2){
+       else if(trend <= -1.2){

[NoCoverage] EqualityOperator
src/pages/dashboard.js:199:13
-       else if(trend<-1.2){
+       else if(trend >= -1.2){

[NoCoverage] UnaryOperator
src/pages/dashboard.js:199:19
-       else if(trend<-1.2){
+       else if(trend<+1.2){

[NoCoverage] BlockStatement
src/pages/dashboard.js:199:24
-       else if(trend<-1.2){
-         const kcalDiff=todayKcal-sysKcal;
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
-         else if(todayKcal>=sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
-         else{dv.textContent=`Mărește la ${sysKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
-       }
+       else if(trend<-1.2){}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:200:22
-         const kcalDiff=todayKcal-sysKcal;
+         const kcalDiff=todayKcal + sysKcal;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:201:10
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+         if(true){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:201:10
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+         if(false){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:201:10
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+         if(todayKcal > sysKcal + 100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:201:10
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+         if(todayKcal < sysKcal + 100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:201:21
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+         if(todayKcal>=sysKcal - 100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:201:33
-         if(todayKcal>=sysKcal+100){dv.textContent=`Depășești cu ${kcalDiff} kcal`;dr.textContent=`Azi: ${todayKcal} kcal · Trend prea rapid`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+         if(todayKcal>=sysKcal+100){}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:202:15
-         else if(todayKcal>=sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
+         else if(true){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:202:15
-         else if(todayKcal>=sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
+         else if(false){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:202:15
-         else if(todayKcal>=sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
+         else if(todayKcal > sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:202:15
-         else if(todayKcal>=sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
+         else if(todayKcal < sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:202:34
-         else if(todayKcal>=sysKcal){dv.textContent=`Menții targetul ✓ · ${todayKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
+         else if(todayKcal>=sysKcal){}

[NoCoverage] BlockStatement
src/pages/dashboard.js:203:11
-         else{dv.textContent=`Mărește la ${sysKcal} kcal`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → prea rapid`;dec.style.borderColor='var(--accent3)';dv.style.color='var(--accent3)';}
+         else{}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:205:13
-       else if(trend>-0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+       else if(true){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:205:13
-       else if(trend>-0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+       else if(false){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:205:13
-       else if(trend>-0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+       else if(trend >= -0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:205:13
-       else if(trend>-0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+       else if(trend <= -0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] UnaryOperator
src/pages/dashboard.js:205:19
-       else if(trend>-0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+       else if(trend>+0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:205:24
-       else if(trend>-0.3){dv.textContent=`SCADE LA ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → stagnare`;dec.style.borderColor='var(--accent2)';dv.style.color='var(--accent2)';}
+       else if(trend>-0.3){}

[NoCoverage] BlockStatement
src/pages/dashboard.js:206:9
-       else{dv.textContent=`MENȚINE ${sysKcal} KCAL`;dr.textContent=`Trend: −${Math.abs(trend).toFixed(2)} kg/7z → perfect`;dec.style.borderColor='var(--accent)';dv.style.color='var(--accent)';}
+       else{}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:208:22
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:208:22
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:208:22
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=!pilotActive || !_phOvr || _phOvr === 'AUTO';

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:208:22
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=pilotActive&&(!_phOvr||_phOvr==='AUTO');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:208:37
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=!pilotActive&&(true);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:208:37
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=!pilotActive&&(!_phOvr && _phOvr === 'AUTO');

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:208:37
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=!pilotActive&&(_phOvr||_phOvr==='AUTO');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:208:46
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=!pilotActive&&(!_phOvr||false);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:208:46
-       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr==='AUTO');
+       const _autoFixed=!pilotActive&&(!_phOvr||_phOvr !== 'AUTO');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:209:8
-       if(_autoFixed){dr.innerHTML=dr.textContent+'<br><span style="font-size:9px;color:var(--text3);opacity:0.75">Fix până 20 iulie • Schimbă faza manual dacă vrei alt plan</span>';}
+       if(true){dr.innerHTML=dr.textContent+'<br><span style="font-size:9px;color:var(--text3);opacity:0.75">Fix până 20 iulie • Schimbă faza manual dacă vrei alt plan</span>';}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:209:8
-       if(_autoFixed){dr.innerHTML=dr.textContent+'<br><span style="font-size:9px;color:var(--text3);opacity:0.75">Fix până 20 iulie • Schimbă faza manual dacă vrei alt plan</span>';}
+       if(false){dr.innerHTML=dr.textContent+'<br><span style="font-size:9px;color:var(--text3);opacity:0.75">Fix până 20 iulie • Schimbă faza manual dacă vrei alt plan</span>';}

[NoCoverage] BlockStatement
src/pages/dashboard.js:209:19
-       if(_autoFixed){dr.innerHTML=dr.textContent+'<br><span style="font-size:9px;color:var(--text3);opacity:0.75">Fix până 20 iulie • Schimbă faza manual dacă vrei alt plan</span>';}
+       if(_autoFixed){}

[NoCoverage] MethodExpression
src/pages/dashboard.js:211:16
-     const filled=Math.min(dates.length,8);
+     const filled=Math.max(dates.length, 8);

[NoCoverage] MethodExpression
src/pages/dashboard.js:213:30
-     const weekStart=new Date();weekStart.setDate(weekStart.getDate()-weekStart.getDay());
+     const weekStart=new Date();weekStart.setTime(weekStart.getDate() - weekStart.getDay());

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:213:48
-     const weekStart=new Date();weekStart.setDate(weekStart.getDate()-weekStart.getDay());
+     const weekStart=new Date();weekStart.setDate(weekStart.getDate() + weekStart.getDay());

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:214:17
-     const allLogs=DB.get('logs')||[];
+     const allLogs=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:214:17
-     const allLogs=DB.get('logs')||[];
+     const allLogs=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:214:17
-     const allLogs=DB.get('logs')||[];
+     const allLogs=DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:214:33
-     const allLogs=DB.get('logs')||[];
+     const allLogs=DB.get('logs')||["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:215:29
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[].length;

[NoCoverage] MethodExpression
src/pages/dashboard.js:215:41
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.map(l=>l.date))].length;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:215:56
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(() => undefined).map(l=>l.date))].length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:215:59
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>true).map(l=>l.date))].length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:215:59
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>false).map(l=>l.date))].length;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:215:59
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline || new Date(l.date) >= weekStart).map(l=>l.date))].length;

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:215:59
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:215:72
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&true).map(l=>l.date))].length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:215:72
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date) > weekStart).map(l=>l.date))].length;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:215:72
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date) < weekStart).map(l=>l.date))].length;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:215:105
-     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(l=>l.date))].length;
+     const workoutDaysThisWeek=[...new Set(allLogs.filter(l=>!l.baseline&&new Date(l.date)>=weekStart).map(() => undefined))].length;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:218:6
-     if(wwEl)wwEl.innerHTML=`
+     if(true)wwEl.innerHTML=`

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:218:6
-     if(wwEl)wwEl.innerHTML=`
+     if(false)wwEl.innerHTML=`

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:222:20
-     const streakMsgs=['0/8 – începe azi','1/8 – prima zi! Continuă mâine','2/8 – 2 zile, creierul observă','3/8 – încă 5 zile','4/8 – jumătate. NU RATA','5/8 – 3 zile rămase','6/8 – NU RATA. 2 zile','7/8 – O ZI. NU RATA','8/8 – ✅ Trend activ'];
+     const streakMsgs=[];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:223:25
-     const cwl=$('cwl');if(cwl)cwl.textContent=streakMsgs[Math.min(filled,8)];
+     const cwl=$('cwl');if(true)cwl.textContent=streakMsgs[Math.min(filled,8)];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:223:25
-     const cwl=$('cwl');if(cwl)cwl.textContent=streakMsgs[Math.min(filled,8)];
+     const cwl=$('cwl');if(false)cwl.textContent=streakMsgs[Math.min(filled,8)];

[NoCoverage] MethodExpression
src/pages/dashboard.js:223:56
-     const cwl=$('cwl');if(cwl)cwl.textContent=streakMsgs[Math.min(filled,8)];
+     const cwl=$('cwl');if(cwl)cwl.textContent=streakMsgs[Math.max(filled, 8)];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:224:25
-     const cpf=$('cpf');if(cpf)cpf.style.width=(filled/8*100)+'%';
+     const cpf=$('cpf');if(true)cpf.style.width=(filled/8*100)+'%';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:224:25
-     const cpf=$('cpf');if(cpf)cpf.style.width=(filled/8*100)+'%';
+     const cpf=$('cpf');if(false)cpf.style.width=(filled/8*100)+'%';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:224:46
-     const cpf=$('cpf');if(cpf)cpf.style.width=(filled/8*100)+'%';
+     const cpf=$('cpf');if(cpf)cpf.style.width=(filled / 8 / 100)+'%';

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:224:46
-     const cpf=$('cpf');if(cpf)cpf.style.width=(filled/8*100)+'%';
+     const cpf=$('cpf');if(cpf)cpf.style.width=(filled * 8*100)+'%';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:225:25
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(true)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:225:25
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(false)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:225:54
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');

[NoCoverage] ArrowFunction
src/pages/dashboard.js:225:65
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},() => undefined).join('');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:225:91
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${true?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:225:91
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${false?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');

[NoCoverage] EqualityOperator
src/pages/dashboard.js:225:91
-     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i<filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
+     const cwd=$('cwd');if(cwd)cwd.innerHTML=Array.from({length:8},(_,i)=>`<div class="dot ${i <= filled?'ok':''}">${i<filled?'✓':i+1}</div>`).join('');
