[NoCoverage] ConditionalExpression
src/pages/dashboard.js:271:52
-         ? analyzeFromCDL().filter(p => Date.now() - (p.appliedAt || Date.now()) < 14*86400000)
+         ? analyzeFromCDL().filter(p => Date.now() - (false) < 14*86400000)

[NoCoverage] LogicalOperator
src/pages/dashboard.js:271:52
-         ? analyzeFromCDL().filter(p => Date.now() - (p.appliedAt || Date.now()) < 14*86400000)
+         ? analyzeFromCDL().filter(p => Date.now() - (p.appliedAt && Date.now()) < 14*86400000)

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:271:81
-         ? analyzeFromCDL().filter(p => Date.now() - (p.appliedAt || Date.now()) < 14*86400000)
+         ? analyzeFromCDL().filter(p => Date.now() - (p.appliedAt || Date.now()) < 14 / 86400000)

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:272:9
-         : [];
+         : ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:273:9
-       if (patterns.length) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:273:9
-       if (patterns.length) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:273:26
-       if (patterns.length) {
-         autoRecEl.style.display = 'block';
-         autoRecEl.innerHTML = `<div style="background:rgba(0,240,255,0.04);border:1px solid rgba(0,240,255,0.15);border-radius:var(--r);padding:14px 16px;margin-bottom:8px">
-           <div style="display:flex;align-items:center;gap:8px;margin-bottom:10px">
-             <div style="font-size:16px">🤖</div>
-             <div style="font-size:13px;font-weight:700">Am ajustat programul automat</div>
-           </div>
-           ${patterns.slice(0,3).map(p => `<div style="margin-bottom:6px">
-             <div style="font-size:11px;color:var(--text3)">${p.description}</div>
-           </div>`).join('')}
-         </div>`;
-       } else {
+       if (patterns.length) {} else {

[NoCoverage] MethodExpression
src/pages/dashboard.js:280:11
-           ${patterns.slice(0,3).map(p => `<div style="margin-bottom:6px">
+           ${patterns.map(p => `<div style="margin-bottom:6px">

[NoCoverage] ArrowFunction
src/pages/dashboard.js:280:35
-           ${patterns.slice(0,3).map(p => `<div style="margin-bottom:6px">
-             <div style="font-size:11px;color:var(--text3)">${p.description}</div>
-           </div>`).join('')}
+           ${patterns.slice(0,3).map(() => undefined).join('')}

[NoCoverage] BlockStatement
src/pages/dashboard.js:284:12
-       } else {
-         autoRecEl.style.display = 'none';
-       }
+       } else {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:291:7
-     if (sessHistEl) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:291:7
-     if (sessHistEl) {
+     if (false) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:292:21
-       const allLogs = DB.get('logs') || [];
+       const allLogs = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:292:21
-       const allLogs = DB.get('logs') || [];
+       const allLogs = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:292:21
-       const allLogs = DB.get('logs') || [];
+       const allLogs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:292:39
-       const allLogs = DB.get('logs') || [];
+       const allLogs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:293:22
-       const allBurns = DB.get('session-burns') || [];
+       const allBurns = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:293:22
-       const allBurns = DB.get('session-burns') || [];
+       const allBurns = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:293:22
-       const allBurns = DB.get('session-burns') || [];
+       const allBurns = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:293:49
-       const allBurns = DB.get('session-burns') || [];
+       const allBurns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/dashboard.js:295:23
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:295:38
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:295:43
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:295:43
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => false);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:295:43
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 || l.ex !== '__early_stop__');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:295:43
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => true && l.ex !== '__early_stop__');

[NoCoverage] LogicalOperator
src/pages/dashboard.js:295:43
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => !l.baseline || l.date === today2 && l.ex !== '__early_stop__');

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:295:43
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => l.baseline && l.date === today2 && l.ex !== '__early_stop__');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:295:58
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => !l.baseline && true && l.ex !== '__early_stop__');

[NoCoverage] EqualityOperator
src/pages/dashboard.js:295:58
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => !l.baseline && l.date !== today2 && l.ex !== '__early_stop__');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:295:79
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && true);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:295:79
-       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex !== '__early_stop__');
+       const todayLogs = allLogs.filter(l => !l.baseline && l.date === today2 && l.ex === '__early_stop__');

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:296:9
-       if (todayLogs.length) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:296:9
-       if (todayLogs.length) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:298:30
-         todayLogs.forEach(l => {
-           if (!exMap2[l.ex]) exMap2[l.ex] = [];
-           exMap2[l.ex].push(l);
-         });
+         todayLogs.forEach(l => {});

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:299:13
-           if (!exMap2[l.ex]) exMap2[l.ex] = [];
+           if (exMap2[l.ex]) exMap2[l.ex] = [];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:299:13
-           if (!exMap2[l.ex]) exMap2[l.ex] = [];
+           if (true) exMap2[l.ex] = [];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:299:13
-           if (!exMap2[l.ex]) exMap2[l.ex] = [];
+           if (false) exMap2[l.ex] = [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:299:43
-           if (!exMap2[l.ex]) exMap2[l.ex] = [];
+           if (!exMap2[l.ex]) exMap2[l.ex] = ["Stryker was here"];

[NoCoverage] ArrowFunction
src/pages/dashboard.js:302:35
-         const burn2 = allBurns.find(b => b.date === today2);
+         const burn2 = allBurns.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:302:40
-         const burn2 = allBurns.find(b => b.date === today2);
+         const burn2 = allBurns.find(b => true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:302:40
-         const burn2 = allBurns.find(b => b.date === today2);
+         const burn2 = allBurns.find(b => false);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:302:40
-         const burn2 = allBurns.find(b => b.date === today2);
+         const burn2 = allBurns.find(b => b.date !== today2);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:303:41
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce(() => undefined, 0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:303:50
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s - (l.w || 0) * (parseInt(l.reps) || 0), 0);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:303:54
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (l.w || 0) / (parseInt(l.reps) || 0), 0);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:303:55
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (true)*(parseInt(l.reps)||0), 0);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:303:55
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (false)*(parseInt(l.reps)||0), 0);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:303:55
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (l.w && 0)*(parseInt(l.reps)||0), 0);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:303:64
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(true), 0);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:303:64
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(false), 0);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:303:64
-         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps)||0), 0);
+         const totalVol = todayLogs.reduce((s,l) => s + (l.w||0)*(parseInt(l.reps) && 0), 0);

[NoCoverage] OptionalChaining
src/pages/dashboard.js:307:60
-             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol/1000*10)/10}t volum</div>
+             <div style="font-size:11px;color:var(--text3)">${burn2.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol/1000*10)/10}t volum</div>

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:307:102
-             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol/1000*10)/10}t volum</div>
+             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol / 1000 * 10) * 10}t volum</div>

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:307:113
-             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol/1000*10)/10}t volum</div>
+             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol / 1000 / 10)/10}t volum</div>

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:307:113
-             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol/1000*10)/10}t volum</div>
+             <div style="font-size:11px;color:var(--text3)">${burn2?.mins ? burn2.mins+' min' : ''} · ${Math.round(totalVol * 1000*10)/10}t volum</div>

[NoCoverage] BlockStatement
src/pages/dashboard.js:309:53
-           ${Object.entries(exMap2).map(([ex,sets]) => {
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
-             return `<div style="display:flex;align-items:center;gap:10px;padding:9px 16px;border-bottom:1px solid var(--border)">
-               <div style="flex:1;font-size:12px;font-weight:600">${ex}</div>
-               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${bestSet.reps||'?'} @ ${bestSet.w}kg</div>
-             </div>`;
-           }).join('')}
+           ${Object.entries(exMap2).map(([ex,sets]) => {}).join('')}

[NoCoverage] ArrowFunction
src/pages/dashboard.js:310:39
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce(() => undefined, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:310:51
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => true?s:best, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:310:51
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => false?s:best, sets[0]);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:310:51
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (s.w || 0) >= (best.w || 0)?s:best, sets[0]);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:310:51
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (s.w || 0) <= (best.w || 0)?s:best, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:310:52
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (true)>(best.w||0)?s:best, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:310:52
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (false)>(best.w||0)?s:best, sets[0]);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:310:52
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (s.w && 0)>(best.w||0)?s:best, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:310:61
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (s.w||0)>(true)?s:best, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:310:61
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (s.w||0)>(false)?s:best, sets[0]);

[NoCoverage] LogicalOperator
src/pages/dashboard.js:310:61
-             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w||0)?s:best, sets[0]);
+             const bestSet = sets.reduce((best,s) => (s.w||0)>(best.w && 0)?s:best, sets[0]);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:313:117
-               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${bestSet.reps||'?'} @ ${bestSet.w}kg</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${true} @ ${bestSet.w}kg</div>

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:313:117
-               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${bestSet.reps||'?'} @ ${bestSet.w}kg</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${false} @ ${bestSet.w}kg</div>

[NoCoverage] LogicalOperator
src/pages/dashboard.js:313:117
-               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${bestSet.reps||'?'} @ ${bestSet.w}kg</div>
+               <div style="font-family:'JetBrains Mono',monospace;font-size:12px;color:var(--accent)">${sets.length}×${bestSet.reps && '?'} @ ${bestSet.w}kg</div>

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:317:16
-       } else if (tp.t !== 'off') {
+       } else if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:317:16
-       } else if (tp.t !== 'off') {
+       } else if (false) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:317:16
-       } else if (tp.t !== 'off') {
+       } else if (tp.t === 'off') {

[NoCoverage] BlockStatement
src/pages/dashboard.js:317:32
-       } else if (tp.t !== 'off') {
-         sessHistEl.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:12px;padding:24px 20px;text-align:center;margin-bottom:8px">
-           <div style="font-size:32px;margin-bottom:10px">💪</div>
-           <div style="font-size:14px;font-weight:700;color:var(--text);margin-bottom:6px">Nicio sesiune azi</div>
-           <button onclick="goTo('coach')" style="background:var(--accent);color:#000;font-weight:700;font-size:13px;padding:10px 20px;border:none;border-radius:40px;cursor:pointer;font-family:'DM Sans',sans-serif;margin-top:4px">ÎNCEPE ANTRENAMENTUL</button>
-         </div>`;
-       } else {
+       } else if (tp.t !== 'off') {} else {

[NoCoverage] BlockStatement
src/pages/dashboard.js:323:12
-       } else {
-         sessHistEl.innerHTML = '';
-       }
+       } else {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:330:7
-     if (calEl) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:330:7
-     if (calEl) {
+     if (false) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:331:23
-       const allBurns2 = DB.get('session-burns') || [];
+       const allBurns2 = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:331:23
-       const allBurns2 = DB.get('session-burns') || [];
+       const allBurns2 = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:331:23
-       const allBurns2 = DB.get('session-burns') || [];
+       const allBurns2 = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:331:50
-       const allBurns2 = DB.get('session-burns') || [];
+       const allBurns2 = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:332:25
-       const earlyStops2 = DB.get('early-stops') || [];
+       const earlyStops2 = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:332:25
-       const earlyStops2 = DB.get('early-stops') || [];
+       const earlyStops2 = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:332:25
-       const earlyStops2 = DB.get('early-stops') || [];
+       const earlyStops2 = DB.get('early-stops') && [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:332:50
-       const earlyStops2 = DB.get('early-stops') || [];
+       const earlyStops2 = DB.get('early-stops') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:333:20
-       const skips2 = DB.get('workout-skips') || [];
+       const skips2 = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:333:20
-       const skips2 = DB.get('workout-skips') || [];
+       const skips2 = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:333:20
-       const skips2 = DB.get('workout-skips') || [];
+       const skips2 = DB.get('workout-skips') && [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:333:47
-       const skips2 = DB.get('workout-skips') || [];
+       const skips2 = DB.get('workout-skips') || ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:334:19
-       const days7 = ['L','M','M','J','V','S','D'];
+       const days7 = [];

[NoCoverage] MethodExpression
src/pages/dashboard.js:337:5
-       monday.setDate(today3.getDate() - ((today3.getDay()+6)%7));
+       monday.setTime(today3.getDate() - (today3.getDay() + 6) % 7);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:337:20
-       monday.setDate(today3.getDate() - ((today3.getDay()+6)%7));
+       monday.setDate(today3.getDate() + (today3.getDay() + 6) % 7);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:337:40
-       monday.setDate(today3.getDate() - ((today3.getDay()+6)%7));
+       monday.setDate(today3.getDate() - ((today3.getDay() + 6) * 7));

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:337:41
-       monday.setDate(today3.getDate() - ((today3.getDay()+6)%7));
+       monday.setDate(today3.getDate() - ((today3.getDay() - 6)%7));

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:339:20
-         ${Array.from({length:7},(_,i)=>{
+         ${Array.from({},(_,i)=>{

[NoCoverage] MethodExpression
src/pages/dashboard.js:340:37
-           const d = new Date(monday); d.setDate(monday.getDate()+i);
+           const d = new Date(monday); d.setTime(monday.getDate() + i);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:340:47
-           const d = new Date(monday); d.setDate(monday.getDate()+i);
+           const d = new Date(monday); d.setDate(monday.getDate() - i);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:342:25
-           const isToday = dStr === tod();
+           const isToday = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:342:25
-           const isToday = dStr === tod();
+           const isToday = false;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:342:25
-           const isToday = dStr === tod();
+           const isToday = dStr !== tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:343:26
-           const isFuture = d > today3 && !isToday;
+           const isFuture = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:343:26
-           const isFuture = d > today3 && !isToday;
+           const isFuture = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:343:26
-           const isFuture = d > today3 && !isToday;
+           const isFuture = d > today3 || !isToday;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:343:26
-           const isFuture = d > today3 && !isToday;
+           const isFuture = true && !isToday;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:343:26
-           const isFuture = d > today3 && !isToday;
+           const isFuture = d >= today3 && !isToday;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:343:26
-           const isFuture = d > today3 && !isToday;
+           const isFuture = d <= today3 && !isToday;

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:343:40
-           const isFuture = d > today3 && !isToday;
+           const isFuture = d > today3 && isToday;

[NoCoverage] MethodExpression
src/pages/dashboard.js:344:25
-           const hasBurn = allBurns2.some(b=>b.date===dStr);
+           const hasBurn = allBurns2.every(b => b.date === dStr);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:344:40
-           const hasBurn = allBurns2.some(b=>b.date===dStr);
+           const hasBurn = allBurns2.some(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:344:43
-           const hasBurn = allBurns2.some(b=>b.date===dStr);
+           const hasBurn = allBurns2.some(b=>true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:344:43
-           const hasBurn = allBurns2.some(b=>b.date===dStr);
+           const hasBurn = allBurns2.some(b=>false);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:344:43
-           const hasBurn = allBurns2.some(b=>b.date===dStr);
+           const hasBurn = allBurns2.some(b=>b.date !== dStr);

[NoCoverage] MethodExpression
src/pages/dashboard.js:345:26
-           const hasEarly = earlyStops2.some(e=>e.date===dStr);
+           const hasEarly = earlyStops2.every(e => e.date === dStr);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:345:43
-           const hasEarly = earlyStops2.some(e=>e.date===dStr);
+           const hasEarly = earlyStops2.some(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:345:46
-           const hasEarly = earlyStops2.some(e=>e.date===dStr);
+           const hasEarly = earlyStops2.some(e=>true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:345:46
-           const hasEarly = earlyStops2.some(e=>e.date===dStr);
+           const hasEarly = earlyStops2.some(e=>false);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:345:46
-           const hasEarly = earlyStops2.some(e=>e.date===dStr);
+           const hasEarly = earlyStops2.some(e=>e.date !== dStr);

[NoCoverage] MethodExpression
src/pages/dashboard.js:346:25
-           const hasSkip = skips2.some(s=>s.date===dStr);
+           const hasSkip = skips2.every(s => s.date === dStr);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:346:37
-           const hasSkip = skips2.some(s=>s.date===dStr);
+           const hasSkip = skips2.some(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:346:40
-           const hasSkip = skips2.some(s=>s.date===dStr);
+           const hasSkip = skips2.some(s=>true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:346:40
-           const hasSkip = skips2.some(s=>s.date===dStr);
+           const hasSkip = skips2.some(s=>false);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:346:40
-           const hasSkip = skips2.some(s=>s.date===dStr);
+           const hasSkip = skips2.some(s=>s.date !== dStr);

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:347:23
-           const dayMap2=[6,0,1,2,3,4,5];
+           const dayMap2=[];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:349:32
-           const PROG_DAYS_DATA = window.__constants?.PROG || [];
+           const PROG_DAYS_DATA = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:349:32
-           const PROG_DAYS_DATA = window.__constants?.PROG || [];
+           const PROG_DAYS_DATA = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:349:32
-           const PROG_DAYS_DATA = window.__constants?.PROG || [];
+           const PROG_DAYS_DATA = window.__constants?.PROG && [];

[NoCoverage] OptionalChaining
src/pages/dashboard.js:349:32
-           const PROG_DAYS_DATA = window.__constants?.PROG || [];
+           const PROG_DAYS_DATA = window.__constants.PROG || [];

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:349:60
-           const PROG_DAYS_DATA = window.__constants?.PROG || [];
+           const PROG_DAYS_DATA = window.__constants?.PROG || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:350:23
-           const isOff = PROG_DAYS_DATA[PROG_IDX]?.t === 'off';
+           const isOff = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:350:23
-           const isOff = PROG_DAYS_DATA[PROG_IDX]?.t === 'off';
+           const isOff = false;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:350:23
-           const isOff = PROG_DAYS_DATA[PROG_IDX]?.t === 'off';
+           const isOff = PROG_DAYS_DATA[PROG_IDX]?.t !== 'off';

[NoCoverage] OptionalChaining
src/pages/dashboard.js:350:23
-           const isOff = PROG_DAYS_DATA[PROG_IDX]?.t === 'off';
+           const isOff = PROG_DAYS_DATA[PROG_IDX].t === 'off';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:352:13
-           if (isFuture) dotColor = 'var(--bg3)';
+           if (true) dotColor = 'var(--bg3)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:352:13
-           if (isFuture) dotColor = 'var(--bg3)';
+           if (false) dotColor = 'var(--bg3)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:353:18
-           else if (isOff) dotColor = 'rgba(80,120,200,0.5)';
+           else if (true) dotColor = 'rgba(80,120,200,0.5)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:353:18
-           else if (isOff) dotColor = 'rgba(80,120,200,0.5)';
+           else if (false) dotColor = 'rgba(80,120,200,0.5)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:354:18
-           else if (hasBurn && hasEarly) dotColor = 'var(--accent2)';
+           else if (true) dotColor = 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:354:18
-           else if (hasBurn && hasEarly) dotColor = 'var(--accent2)';
+           else if (false) dotColor = 'var(--accent2)';

[NoCoverage] LogicalOperator
src/pages/dashboard.js:354:18
-           else if (hasBurn && hasEarly) dotColor = 'var(--accent2)';
+           else if (hasBurn || hasEarly) dotColor = 'var(--accent2)';
