[NoCoverage] ConditionalExpression
src/pages/dashboard.js:355:18
-           else if (hasBurn) dotColor = 'var(--green)';
+           else if (true) dotColor = 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:355:18
-           else if (hasBurn) dotColor = 'var(--green)';
+           else if (false) dotColor = 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:356:18
-           else if (hasSkip) dotColor = 'var(--red)';
+           else if (true) dotColor = 'var(--red)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:356:18
-           else if (hasSkip) dotColor = 'var(--red)';
+           else if (false) dotColor = 'var(--red)';

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:357:18
-           else if (!isFuture) dotColor = 'rgba(255,68,68,0.35)';
+           else if (isFuture) dotColor = 'rgba(255,68,68,0.35)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:357:18
-           else if (!isFuture) dotColor = 'rgba(255,68,68,0.35)';
+           else if (true) dotColor = 'rgba(255,68,68,0.35)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:357:18
-           else if (!isFuture) dotColor = 'rgba(255,68,68,0.35)';
+           else if (false) dotColor = 'rgba(255,68,68,0.35)';

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:370:7
-     if (!box) return;
+     if (box) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:370:7
-     if (!box) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:370:7
-     if (!box) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:371:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:371:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:371:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/dashboard.js:372:17
-     const dates = Object.keys(ws).sort();
+     const dates = Object.keys(ws);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:373:7
-     if (dates.length < 4) { box.style.display = 'none'; return; }
+     if (true) { box.style.display = 'none'; return; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:373:7
-     if (dates.length < 4) { box.style.display = 'none'; return; }
+     if (false) { box.style.display = 'none'; return; }

[NoCoverage] EqualityOperator
src/pages/dashboard.js:373:7
-     if (dates.length < 4) { box.style.display = 'none'; return; }
+     if (dates.length <= 4) { box.style.display = 'none'; return; }

[NoCoverage] EqualityOperator
src/pages/dashboard.js:373:7
-     if (dates.length < 4) { box.style.display = 'none'; return; }
+     if (dates.length >= 4) { box.style.display = 'none'; return; }

[NoCoverage] BlockStatement
src/pages/dashboard.js:373:25
-     if (dates.length < 4) { box.style.display = 'none'; return; }
+     if (dates.length < 4) {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:375:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:375:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:375:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:377:26
-     const lastW = ws[dates[dates.length - 1]];
+     const lastW = ws[dates[dates.length + 1]];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:378:45
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : true ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:378:45
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : false ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:378:45
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) >= 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:378:45
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) <= 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:378:89
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : true ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:378:89
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : false ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:378:89
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) <= 0.2 ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:378:89
-     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) < 0.2 ? 'var(--accent2)' : 'var(--green)';
+     const pColor = p.gaining ? 'var(--red)' : Math.abs(p.rate) > 1.2 ? 'var(--accent3)' : Math.abs(p.rate) >= 0.2 ? 'var(--accent2)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:382:7
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:382:7
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/dashboard.js:382:7
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate < -0.1 || parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:382:7
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (true && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] LogicalOperator
src/pages/dashboard.js:382:7
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining || p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:382:7
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:382:21
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && true && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:382:21
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate <= -0.1 && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:382:21
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate >= -0.1 && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] UnaryOperator
src/pages/dashboard.js:382:30
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate < +0.1 && parseFloat(p.kg4w) < TW + 0.5) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:382:38
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate < -0.1 && true) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:382:38
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) <= TW + 0.5) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:382:38
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) >= TW + 0.5) {

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:382:59
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
+     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW - 0.5) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:382:69
-     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {
-       const daysToTarget = Math.round((lastW - TW) / Math.abs(p.rate) * 7);
-       if (daysToTarget > 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;
-     }
+     if (!p.gaining && p.rate < -0.1 && parseFloat(p.kg4w) < TW + 0.5) {}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:383:37
-       const daysToTarget = Math.round((lastW - TW) / Math.abs(p.rate) * 7);
+       const daysToTarget = Math.round((lastW - TW) / Math.abs(p.rate) / 7);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:383:37
-       const daysToTarget = Math.round((lastW - TW) / Math.abs(p.rate) * 7);
+       const daysToTarget = Math.round((lastW - TW) * Math.abs(p.rate) * 7);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:383:38
-       const daysToTarget = Math.round((lastW - TW) / Math.abs(p.rate) * 7);
+       const daysToTarget = Math.round((lastW + TW) / Math.abs(p.rate) * 7);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:384:9
-       if (daysToTarget > 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;
+       if (true) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:384:9
-       if (daysToTarget > 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;
+       if (false) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:384:9
-       if (daysToTarget > 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;
+       if (daysToTarget >= 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:384:9
-       if (daysToTarget > 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;
+       if (daysToTarget <= 0) etaHtml = `<div style="margin-top:8px;font-size:11px;color:var(--green);text-align:center">🎯 Atingi targetul în ~${daysToTarget} zile</div>`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:388:7
-     if (p.gaining)              msg = '⚠️ <strong style="color:var(--red)">Trendul actual duce la creștere în greutate.</strong> Verifică kcal.';
+     if (true)              msg = '⚠️ <strong style="color:var(--red)">Trendul actual duce la creștere în greutate.</strong> Verifică kcal.';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:388:7
-     if (p.gaining)              msg = '⚠️ <strong style="color:var(--red)">Trendul actual duce la creștere în greutate.</strong> Verifică kcal.';
+     if (false)              msg = '⚠️ <strong style="color:var(--red)">Trendul actual duce la creștere în greutate.</strong> Verifică kcal.';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:389:12
-     else if (Math.abs(p.rate) < 0.2) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;
+     else if (true) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:389:12
-     else if (Math.abs(p.rate) < 0.2) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;
+     else if (false) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:389:12
-     else if (Math.abs(p.rate) < 0.2) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;
+     else if (Math.abs(p.rate) <= 0.2) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:389:12
-     else if (Math.abs(p.rate) < 0.2) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;
+     else if (Math.abs(p.rate) >= 0.2) msg = `⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — scade 100 kcal.`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:390:12
-     else if (Math.abs(p.rate) > 1.2) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;
+     else if (true) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:390:12
-     else if (Math.abs(p.rate) > 1.2) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;
+     else if (false) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:390:12
-     else if (Math.abs(p.rate) > 1.2) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;
+     else if (Math.abs(p.rate) >= 1.2) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:390:12
-     else if (Math.abs(p.rate) > 1.2) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;
+     else if (Math.abs(p.rate) <= 1.2) msg = `⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> (${Math.abs(p.rate).toFixed(2)} kg/7z) — adaugă 150 kcal.`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:400:40
-     const msgEl = $('proj-message'); if (msgEl) msgEl.innerHTML = msg;
+     const msgEl = $('proj-message'); if (true) msgEl.innerHTML = msg;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:400:40
-     const msgEl = $('proj-message'); if (msgEl) msgEl.innerHTML = msg;
+     const msgEl = $('proj-message'); if (false) msgEl.innerHTML = msg;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:401:44
-     const dtEl  = $('proj-date-target'); if (dtEl) dtEl.innerHTML = etaHtml;
+     const dtEl  = $('proj-date-target'); if (true) dtEl.innerHTML = etaHtml;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:401:44
-     const dtEl  = $('proj-date-target'); if (dtEl) dtEl.innerHTML = etaHtml;
+     const dtEl  = $('proj-date-target'); if (false) dtEl.innerHTML = etaHtml;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:402:43
-     const basedEl = $('proj-based-on'); if (basedEl) basedEl.textContent = `Bazat pe ultimele ${Math.min(dates.length, 8)} zile`;
+     const basedEl = $('proj-based-on'); if (true) basedEl.textContent = `Bazat pe ultimele ${Math.min(dates.length, 8)} zile`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:402:43
-     const basedEl = $('proj-based-on'); if (basedEl) basedEl.textContent = `Bazat pe ultimele ${Math.min(dates.length, 8)} zile`;
+     const basedEl = $('proj-based-on'); if (false) basedEl.textContent = `Bazat pe ultimele ${Math.min(dates.length, 8)} zile`;

[NoCoverage] MethodExpression
src/pages/dashboard.js:402:95
-     const basedEl = $('proj-based-on'); if (basedEl) basedEl.textContent = `Bazat pe ultimele ${Math.min(dates.length, 8)} zile`;
+     const basedEl = $('proj-based-on'); if (basedEl) basedEl.textContent = `Bazat pe ultimele ${Math.max(dates.length, 8)} zile`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:403:39
-     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;
+     const rateEl  = $('proj-rate'); if (true) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:403:39
-     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;
+     const rateEl  = $('proj-rate'); if (false) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:403:71
-     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;
+     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${true ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:403:71
-     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;
+     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${false ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:403:71
-     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;
+     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate >= 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:403:71
-     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate > 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;
+     const rateEl  = $('proj-rate'); if (rateEl) rateEl.textContent = `${p.rate <= 0 ? '+' : ''}${p.rate.toFixed(2)} kg/7z`;

[NoCoverage] BlockStatement
src/pages/dashboard.js:406:31
-   function renderRealityCheck() {
-     const el = $('reality-check-alert');
-     if (!el) return;
-     const rc = getRealityCheck();
-     if (!rc) { el.style.display = 'none'; return; }
-     el.style.display = 'block';
-     el.innerHTML = `<div style="padding:12px 16px;background:${rc.color}18;border-left:4px solid ${rc.color};margin-bottom:8px;border-radius:0 var(--rs) var(--rs) 0">
-       <div style="font-size:13px;font-weight:700;color:${rc.color};letter-spacing:.3px">${rc.icon} REALITY CHECK</div>
-       <div style="font-size:12px;color:var(--text2);margin-top:3px">${rc.message}</div>
-     </div>`;
-   }
+   function renderRealityCheck() {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:408:7
-     if (!el) return;
+     if (el) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:408:7
-     if (!el) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:408:7
-     if (!el) return;
+     if (false) return;

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:410:7
-     if (!rc) { el.style.display = 'none'; return; }
+     if (rc) { el.style.display = 'none'; return; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:410:7
-     if (!rc) { el.style.display = 'none'; return; }
+     if (true) { el.style.display = 'none'; return; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:410:7
-     if (!rc) { el.style.display = 'none'; return; }
+     if (false) { el.style.display = 'none'; return; }

[NoCoverage] BlockStatement
src/pages/dashboard.js:410:12
-     if (!rc) { el.style.display = 'none'; return; }
+     if (!rc) {}

[NoCoverage] BlockStatement
src/pages/dashboard.js:418:33
-   function renderAdherenceScore() {
-     const el = $('adherence-score');
-     if (!el) return;
-     const a = getAdherenceScore();
-     el.style.display = 'block';
-     el.innerHTML = `<div style="padding:10px 16px;background:var(--card);border:1px solid var(--border);border-radius:var(--rs);display:flex;align-items:center;justify-content:space-between;margin-bottom:8px">
-       <div style="font-size:11px;color:var(--text3);text-transform:uppercase;letter-spacing:1px">Adherence azi</div>
-       <div style="display:flex;align-items:center;gap:8px">
-         <div style="font-family:'JetBrains Mono',monospace;font-size:18px;font-weight:700;color:${a.color}">${a.score}%</div>
-         <div style="font-size:11px;font-weight:600;color:${a.color};padding:2px 8px;border-radius:10px;background:${a.color}18">${a.label}</div>
-       </div>
-     </div>`;
-   }
+   function renderAdherenceScore() {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:420:7
-     if (!el) return;
+     if (el) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:420:7
-     if (!el) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:420:7
-     if (!el) return;
+     if (false) return;

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:435:7
-     if (!canvas) return;
+     if (canvas) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:435:7
-     if (!canvas) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:435:7
-     if (!canvas) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:437:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:437:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:437:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/dashboard.js:438:20
-     const allDates = Object.keys(ws).sort();
+     const allDates = Object.keys(ws);

[NoCoverage] MethodExpression
src/pages/dashboard.js:441:3
-     cutoff.setDate(cutoff.getDate() - 30);
+     cutoff.setTime(cutoff.getDate() - 30);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:441:18
-     cutoff.setDate(cutoff.getDate() - 30);
+     cutoff.setDate(cutoff.getDate() + 30);

[NoCoverage] MethodExpression
src/pages/dashboard.js:443:20
-     const filtered = allDates.filter(d => d >= cutoffStr);
+     const filtered = allDates;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:443:36
-     const filtered = allDates.filter(d => d >= cutoffStr);
+     const filtered = allDates.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:443:41
-     const filtered = allDates.filter(d => d >= cutoffStr);
+     const filtered = allDates.filter(d => true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:443:41
-     const filtered = allDates.filter(d => d >= cutoffStr);
+     const filtered = allDates.filter(d => false);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:443:41
-     const filtered = allDates.filter(d => d >= cutoffStr);
+     const filtered = allDates.filter(d => d > cutoffStr);

[NoCoverage] EqualityOperator
src/pages/dashboard.js:443:41
-     const filtered = allDates.filter(d => d >= cutoffStr);
+     const filtered = allDates.filter(d => d < cutoffStr);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:444:17
-     const dates = filtered.length >= 2 ? filtered : allDates;
+     const dates = true ? filtered : allDates;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:444:17
-     const dates = filtered.length >= 2 ? filtered : allDates;
+     const dates = false ? filtered : allDates;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:444:17
-     const dates = filtered.length >= 2 ? filtered : allDates;
+     const dates = filtered.length > 2 ? filtered : allDates;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:444:17
-     const dates = filtered.length >= 2 ? filtered : allDates;
+     const dates = filtered.length < 2 ? filtered : allDates;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:446:7
-     if (dates.length < 2) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:446:7
-     if (dates.length < 2) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:446:7
-     if (dates.length < 2) {
+     if (dates.length <= 2) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:446:7
-     if (dates.length < 2) {
+     if (dates.length >= 2) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:446:25
-     if (dates.length < 2) {
-       canvas.style.display = 'none';
-       if (msgEl) { msgEl.style.display = 'block'; msgEl.textContent = 'Mai ai nevoie de cel puțin 2 cântăriri pentru grafic.'; }
-       return;
-     }
+     if (dates.length < 2) {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:448:9
-       if (msgEl) { msgEl.style.display = 'block'; msgEl.textContent = 'Mai ai nevoie de cel puțin 2 cântăriri pentru grafic.'; }
+       if (true) { msgEl.style.display = 'block'; msgEl.textContent = 'Mai ai nevoie de cel puțin 2 cântăriri pentru grafic.'; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:448:9
-       if (msgEl) { msgEl.style.display = 'block'; msgEl.textContent = 'Mai ai nevoie de cel puțin 2 cântăriri pentru grafic.'; }
+       if (false) { msgEl.style.display = 'block'; msgEl.textContent = 'Mai ai nevoie de cel puțin 2 cântăriri pentru grafic.'; }

[NoCoverage] BlockStatement
src/pages/dashboard.js:448:16
-       if (msgEl) { msgEl.style.display = 'block'; msgEl.textContent = 'Mai ai nevoie de cel puțin 2 cântăriri pentru grafic.'; }
+       if (msgEl) {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:453:7
-     if (msgEl) msgEl.style.display = 'none';
+     if (true) msgEl.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:453:7
-     if (msgEl) msgEl.style.display = 'none';
+     if (false) msgEl.style.display = 'none';

[NoCoverage] BlockStatement
src/pages/dashboard.js:455:33
-     const labels = dates.map(d => { const [, m, day] = d.split('-'); return `${day}.${m}`; });
+     const labels = dates.map(d => {});

[NoCoverage] ArrowFunction
src/pages/dashboard.js:456:28
-     const values = dates.map(d => ws[d]);
+     const values = dates.map(() => undefined);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:457:32
-     const targetLine = dates.map(() => TW_KG);
+     const targetLine = dates.map(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:459:7
-     if (_dashWeightChart) { _dashWeightChart.destroy(); _dashWeightChart = null; }
+     if (true) { _dashWeightChart.destroy(); _dashWeightChart = null; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:459:7
-     if (_dashWeightChart) { _dashWeightChart.destroy(); _dashWeightChart = null; }
+     if (false) { _dashWeightChart.destroy(); _dashWeightChart = null; }

[NoCoverage] BlockStatement
src/pages/dashboard.js:459:25
-     if (_dashWeightChart) { _dashWeightChart.destroy(); _dashWeightChart = null; }
+     if (_dashWeightChart) {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:461:7
-     if (typeof window.Chart === 'undefined') return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:461:7
-     if (typeof window.Chart === 'undefined') return;
+     if (false) return;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:461:7
-     if (typeof window.Chart === 'undefined') return;
+     if (typeof window.Chart !== 'undefined') return;
