[NoCoverage] ObjectLiteral
src/pages/dashboard.js:465:11
-       data: {
-         labels,
-         datasets: [
-           {
-             label: 'Greutate',
-             data: values,
-             borderColor: '#c8ff00',
-             backgroundColor: 'rgba(200,255,0,0.07)',
-             tension: 0.3,
-             fill: true,
-             pointRadius: 3,
-             pointBackgroundColor: '#c8ff00',
-             pointBorderColor: '#c8ff00',
-             pointHoverRadius: 5,
-           },
-           {
-             label: `Target ${TW_KG} kg`,
-             data: targetLine,
-             borderColor: 'rgba(255,59,48,0.55)',
-             borderDash: [6, 4],
-             borderWidth: 1.5,
-             pointRadius: 0,
-             fill: false,
-             tension: 0,
-           }
-         ]
-       },
+       data: {},

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:467:17
-         datasets: [
-           {
-             label: 'Greutate',
-             data: values,
-             borderColor: '#c8ff00',
-             backgroundColor: 'rgba(200,255,0,0.07)',
-             tension: 0.3,
-             fill: true,
-             pointRadius: 3,
-             pointBackgroundColor: '#c8ff00',
-             pointBorderColor: '#c8ff00',
-             pointHoverRadius: 5,
-           },
-           {
-             label: `Target ${TW_KG} kg`,
-             data: targetLine,
-             borderColor: 'rgba(255,59,48,0.55)',
-             borderDash: [6, 4],
-             borderWidth: 1.5,
-             pointRadius: 0,
-             fill: false,
-             tension: 0,
-           }
-         ]
+         datasets: []

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:468:9
-           {
-             label: 'Greutate',
-             data: values,
-             borderColor: '#c8ff00',
-             backgroundColor: 'rgba(200,255,0,0.07)',
-             tension: 0.3,
-             fill: true,
-             pointRadius: 3,
-             pointBackgroundColor: '#c8ff00',
-             pointBorderColor: '#c8ff00',
-             pointHoverRadius: 5,
-           },
+           {},

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:474:17
-             fill: true,
+             fill: false,

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:480:9
-           {
-             label: `Target ${TW_KG} kg`,
-             data: targetLine,
-             borderColor: 'rgba(255,59,48,0.55)',
-             borderDash: [6, 4],
-             borderWidth: 1.5,
-             pointRadius: 0,
-             fill: false,
-             tension: 0,
-           }
+           {}

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:484:23
-             borderDash: [6, 4],
+             borderDash: [],

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:487:17
-             fill: false,
+             fill: true,

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:493:19
-         responsive: true,
+         responsive: false,

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:494:28
-         maintainAspectRatio: false,
+         maintainAspectRatio: true,

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:495:20
-         interaction: { mode: 'index', intersect: false },
+         interaction: {},

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:495:48
-         interaction: { mode: 'index', intersect: false },
+         interaction: { mode: 'index', intersect: true },

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:496:16
-         plugins: {
-           legend: { display: false },
-           tooltip: {
-             callbacks: {
-               title: (items) => {
-                 const d = dates[items[0].dataIndex];
-                 const [y, m, day] = d.split('-');
-                 return `${day}.${m}.${y}`;
-               },
-               label: (item) => item.datasetIndex === 0
-                 ? `${Number(item.raw).toFixed(1)} kg`
-                 : `Target: ${item.raw} kg`
-             }
-           }
-         },
+         plugins: {},

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:497:17
-           legend: { display: false },
+           legend: {},

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:497:28
-           legend: { display: false },
+           legend: { display: true },

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:498:18
-           tooltip: {
-             callbacks: {
-               title: (items) => {
-                 const d = dates[items[0].dataIndex];
-                 const [y, m, day] = d.split('-');
-                 return `${day}.${m}.${y}`;
-               },
-               label: (item) => item.datasetIndex === 0
-                 ? `${Number(item.raw).toFixed(1)} kg`
-                 : `Target: ${item.raw} kg`
-             }
-           }
+           tooltip: {}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:499:22
-             callbacks: {
-               title: (items) => {
-                 const d = dates[items[0].dataIndex];
-                 const [y, m, day] = d.split('-');
-                 return `${day}.${m}.${y}`;
-               },
-               label: (item) => item.datasetIndex === 0
-                 ? `${Number(item.raw).toFixed(1)} kg`
-                 : `Target: ${item.raw} kg`
-             }
+             callbacks: {}

[NoCoverage] BlockStatement
src/pages/dashboard.js:500:31
-               title: (items) => {
-                 const d = dates[items[0].dataIndex];
-                 const [y, m, day] = d.split('-');
-                 return `${day}.${m}.${y}`;
-               },
+               title: (items) => {},

[NoCoverage] ArrowFunction
src/pages/dashboard.js:505:20
-               label: (item) => item.datasetIndex === 0
-                 ? `${Number(item.raw).toFixed(1)} kg`
-                 : `Target: ${item.raw} kg`
+               label: () => undefined

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:505:30
-               label: (item) => item.datasetIndex === 0
+               label: (item) => true

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:505:30
-               label: (item) => item.datasetIndex === 0
+               label: (item) => false

[NoCoverage] EqualityOperator
src/pages/dashboard.js:505:30
-               label: (item) => item.datasetIndex === 0
+               label: (item) => item.datasetIndex !== 0

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:511:15
-         scales: {
-           x: {
-             grid: { color: 'rgba(255,255,255,0.05)' },
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, maxTicksLimit: 8 }
-           },
-           y: {
-             grid: { color: 'rgba(255,255,255,0.05)' },
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, callback: v => v + ' kg' }
-           }
-         }
+         scales: {}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:512:12
-           x: {
-             grid: { color: 'rgba(255,255,255,0.05)' },
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, maxTicksLimit: 8 }
-           },
+           x: {},

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:513:17
-             grid: { color: 'rgba(255,255,255,0.05)' },
+             grid: {},

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:514:18
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, maxTicksLimit: 8 }
+             ticks: {}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:514:41
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, maxTicksLimit: 8 }
+             ticks: { color: '#aaa', font: {}, maxTicksLimit: 8 }

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:516:12
-           y: {
-             grid: { color: 'rgba(255,255,255,0.05)' },
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, callback: v => v + ' kg' }
-           }
+           y: {}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:517:17
-             grid: { color: 'rgba(255,255,255,0.05)' },
+             grid: {},

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:518:18
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, callback: v => v + ' kg' }
+             ticks: {}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:518:41
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, callback: v => v + ' kg' }
+             ticks: { color: '#aaa', font: {}, callback: v => v + ' kg' }

[NoCoverage] ArrowFunction
src/pages/dashboard.js:518:103
-             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, callback: v => v + ' kg' }
+             ticks: { color: '#aaa', font: { size: 10, family: "'JetBrains Mono',monospace" }, callback: () => undefined }

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:526:16
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=["Stryker was here"],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:526:22
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=true,logs=DB.get('logs')||[],today=tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:526:22
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=false,logs=DB.get('logs')||[],today=tod();

[NoCoverage] LogicalOperator
src/pages/dashboard.js:526:22
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=DB.get('weights') && {},logs=DB.get('logs')||[],today=tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:526:49
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=DB.get('weights')||{},logs=true,today=tod();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:526:49
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=DB.get('weights')||{},logs=false,today=tod();

[NoCoverage] LogicalOperator
src/pages/dashboard.js:526:49
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs') && [],today=tod();

[NoCoverage] ArrayDeclaration
src/pages/dashboard.js:526:65
-     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||[],today=tod();
+     const alerts=[],ws=DB.get('weights')||{},logs=DB.get('logs')||["Stryker was here"],today=tod();

[NoCoverage] MethodExpression
src/pages/dashboard.js:527:15
-     const dates=Object.keys(ws).sort();
+     const dates=Object.keys(ws);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:528:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:528:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=false;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:528:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now > PILOT;

[NoCoverage] EqualityOperator
src/pages/dashboard.js:528:54
-     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now>=PILOT;
+     const now=new Date(),PILOT=TARGET_DATE,pilotActive=now < PILOT;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:529:37
-     const daysToCheckpoint=Math.round((PILOT-now)/86400000);
+     const daysToCheckpoint=Math.round((PILOT - now) * 86400000);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:529:38
-     const daysToCheckpoint=Math.round((PILOT-now)/86400000);
+     const daysToCheckpoint=Math.round((PILOT + now)/86400000);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:530:6
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(true)

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:530:6
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(false)

[NoCoverage] LogicalOperator
src/pages/dashboard.js:530:6
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive && daysToCheckpoint <= 7 || daysToCheckpoint > 0)

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:530:6
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(true&&daysToCheckpoint>0)

[NoCoverage] LogicalOperator
src/pages/dashboard.js:530:6
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive || daysToCheckpoint <= 7&&daysToCheckpoint>0)

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:530:6
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:530:20
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive&&true&&daysToCheckpoint>0)

[NoCoverage] EqualityOperator
src/pages/dashboard.js:530:20
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive&&daysToCheckpoint < 7&&daysToCheckpoint>0)

[NoCoverage] EqualityOperator
src/pages/dashboard.js:530:20
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive&&daysToCheckpoint > 7&&daysToCheckpoint>0)

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:530:41
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive&&daysToCheckpoint<=7&&true)

[NoCoverage] EqualityOperator
src/pages/dashboard.js:530:41
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint >= 0)

[NoCoverage] EqualityOperator
src/pages/dashboard.js:530:41
-     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint>0)
+     if(!pilotActive&&daysToCheckpoint<=7&&daysToCheckpoint <= 0)

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:531:17
-       alerts.push({t:'y',i:'⏰',tt:`CHECKPOINT ÎN ${daysToCheckpoint} ZILE`,s:'Pe 20 iulie sistemul preia controlul kcal.'});
+       alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:532:6
-     if(today===TARGET_DATE.toISOString().slice(0,10))
+     if(true)

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:532:6
-     if(today===TARGET_DATE.toISOString().slice(0,10))
+     if(false)

[NoCoverage] EqualityOperator
src/pages/dashboard.js:532:6
-     if(today===TARGET_DATE.toISOString().slice(0,10))
+     if(today !== TARGET_DATE.toISOString().slice(0, 10))

[NoCoverage] MethodExpression
src/pages/dashboard.js:532:14
-     if(today===TARGET_DATE.toISOString().slice(0,10))
+     if(today===TARGET_DATE.toISOString())

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:533:17
-       alerts.push({t:'g',i:'🤖',tt:'PILOT AUTOMAT ACTIV',s:`TDEE: ${SYS.estimateTDEE()} kcal · Fază: ${SYS.getPhase()} · Kcal: ${SYS.getKcalTarget()}`});
+       alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(true)

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(false)

[NoCoverage] LogicalOperator
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive && SYS.getPhase() === 'MAINTENANCE' && SYS.getBF() > 15 || !DB.get('phase-override'))

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(true&&!DB.get('phase-override'))

[NoCoverage] LogicalOperator
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive && SYS.getPhase() === 'MAINTENANCE' || SYS.getBF() > 15&&!DB.get('phase-override'))

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(true&&SYS.getBF()>15&&!DB.get('phase-override'))

[NoCoverage] LogicalOperator
src/pages/dashboard.js:534:6
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive || SYS.getPhase() === 'MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:534:19
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive&&true&&SYS.getBF()>15&&!DB.get('phase-override'))

[NoCoverage] EqualityOperator
src/pages/dashboard.js:534:19
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive&&SYS.getPhase() !== 'MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:534:51
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&true&&!DB.get('phase-override'))

[NoCoverage] EqualityOperator
src/pages/dashboard.js:534:51
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF() >= 15&&!DB.get('phase-override'))

[NoCoverage] EqualityOperator
src/pages/dashboard.js:534:51
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF() <= 15&&!DB.get('phase-override'))

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:534:67
-     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&!DB.get('phase-override'))
+     if(pilotActive&&SYS.getPhase()==='MAINTENANCE'&&SYS.getBF()>15&&DB.get('phase-override'))

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:535:17
-       alerts.push({t:'y',i:'⚠️',tt:'BF >15% dar faza e mentenanță',s:'Override la CUT din tab Plan'});
+       alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:536:12
-     const wb=DB.get('wellbeing')||{},todWell=wb[today]||{};
+     const wb=true,todWell=wb[today]||{};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:536:12
-     const wb=DB.get('wellbeing')||{},todWell=wb[today]||{};
+     const wb=false,todWell=wb[today]||{};

[NoCoverage] LogicalOperator
src/pages/dashboard.js:536:12
-     const wb=DB.get('wellbeing')||{},todWell=wb[today]||{};
+     const wb=DB.get('wellbeing') && {},todWell=wb[today]||{};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:536:44
-     const wb=DB.get('wellbeing')||{},todWell=wb[today]||{};
+     const wb=DB.get('wellbeing')||{},todWell=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:536:44
-     const wb=DB.get('wellbeing')||{},todWell=wb[today]||{};
+     const wb=DB.get('wellbeing')||{},todWell=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:536:44
-     const wb=DB.get('wellbeing')||{},todWell=wb[today]||{};
+     const wb=DB.get('wellbeing')||{},todWell=wb[today] && {};

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:537:6
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(true) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:537:6
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(false) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});

[NoCoverage] LogicalOperator
src/pages/dashboard.js:537:6
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(todWell.sleep || todWell.sleep <= 2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:537:21
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(todWell.sleep&&true) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:537:21
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(todWell.sleep&&todWell.sleep < 2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:537:21
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(todWell.sleep&&todWell.sleep > 2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:537:51
-     if(todWell.sleep&&todWell.sleep<=2) alerts.push({t:'y',i:'😴',tt:'SOMN PROST AZI',s:'RPE artificial ridicat. Nu crești greutatea azi.'});
+     if(todWell.sleep&&todWell.sleep<=2) alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:538:15
-     const prots=DB.get('prots')||{},todProt=prots[today];
+     const prots=true,todProt=prots[today];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:538:15
-     const prots=DB.get('prots')||{},todProt=prots[today];
+     const prots=false,todProt=prots[today];

[NoCoverage] LogicalOperator
src/pages/dashboard.js:538:15
-     const prots=DB.get('prots')||{},todProt=prots[today];
+     const prots=DB.get('prots') && {},todProt=prots[today];

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:539:6
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(true) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:539:6
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(false) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] LogicalOperator
src/pages/dashboard.js:539:6
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt !== undefined || todProt < 150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:539:6
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(true&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:539:6
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt === undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:539:27
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt!==undefined&&true) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:539:27
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt!==undefined&&todProt <= 150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:539:27
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt!==undefined&&todProt >= 150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:539:52
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt!==undefined&&todProt<150) alerts.push({});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:539:131
-     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET-todProt}g`});
+     if(todProt!==undefined&&todProt<150) alerts.push({t:'r',i:'🥩',tt:`PROTEINĂ: ${todProt}g`,s:`Target ${PROT_TARGET}g · Deficit ${PROT_TARGET + todProt}g`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:540:11
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(true) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:540:11
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(false) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] LogicalOperator
src/pages/dashboard.js:540:11
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(!todProt || dates.length >= 2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:540:11
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:540:21
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(!todProt&&true) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:540:21
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(!todProt&&dates.length > 2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:540:21
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(!todProt&&dates.length < 2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:540:50
-     else if(!todProt&&dates.length>=2) alerts.push({t:'o',i:'🥩',tt:'PROTEINĂ NELOGATĂ',s:`${PROT_TARGET}g+ esențial · Apasă pentru a loga`,nav:'weight'});
+     else if(!todProt&&dates.length>=2) alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:541:6
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(true) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:541:6
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(false) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
