[NoCoverage] LogicalOperator
src/pages/dashboard.js:541:6
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(dates.length >= 3 || !ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:541:6
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(true&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:541:6
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(dates.length > 3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:541:6
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(dates.length < 3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:541:23
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(dates.length>=3&&ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:541:47
-     if(dates.length>=3&&!ws[today]) alerts.push({t:'r',i:'🚨',tt:'GREUTATE NELOGATĂ AZI',s:'Dimineața pe nemâncat → tab Greutate.'});
+     if(dates.length>=3&&!ws[today]) alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:542:6
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(true){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:542:6
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(false){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:542:6
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length > 7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:542:6
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length < 7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] BlockStatement
src/pages/dashboard.js:542:22
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){}

[NoCoverage] MethodExpression
src/pages/dashboard.js:542:32
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] UnaryOperator
src/pages/dashboard.js:542:44
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(+7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] ArrowFunction
src/pages/dashboard.js:542:52
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(() => undefined);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:542:65
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(true) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:542:65
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(false) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:542:65
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7) - Math.min(...l7) <= 0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] EqualityOperator
src/pages/dashboard.js:542:65
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7) - Math.min(...l7) >= 0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:542:65
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7) + Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] MethodExpression
src/pages/dashboard.js:542:65
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.min(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] MethodExpression
src/pages/dashboard.js:542:81
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.max(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:542:114
-     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({t:'r',i:'🔴',tt:'STAGNARE 7 ZILE',s:'→ scazi 100 kcal AZI'});}
+     if(dates.length>=7){const l7=dates.slice(-7).map(d=>ws[d]);if(Math.max(...l7)-Math.min(...l7)<0.5) alerts.push({});}

[NoCoverage] MethodExpression
src/pages/dashboard.js:543:14
-     const rRPE=logs.slice(-9).filter(l=>l.rpe).map(l=>l.rpe);
+     const rRPE=logs.slice(-9).map(l=>l.rpe);

[NoCoverage] MethodExpression
src/pages/dashboard.js:543:14
-     const rRPE=logs.slice(-9).filter(l=>l.rpe).map(l=>l.rpe);
+     const rRPE=logs.filter(l=>l.rpe).map(l=>l.rpe);

[NoCoverage] UnaryOperator
src/pages/dashboard.js:543:25
-     const rRPE=logs.slice(-9).filter(l=>l.rpe).map(l=>l.rpe);
+     const rRPE=logs.slice(+9).filter(l=>l.rpe).map(l=>l.rpe);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:543:36
-     const rRPE=logs.slice(-9).filter(l=>l.rpe).map(l=>l.rpe);
+     const rRPE=logs.slice(-9).filter(() => undefined).map(l=>l.rpe);

[NoCoverage] ArrowFunction
src/pages/dashboard.js:543:50
-     const rRPE=logs.slice(-9).filter(l=>l.rpe).map(l=>l.rpe);
+     const rRPE=logs.slice(-9).filter(l=>l.rpe).map(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:544:28
-     const avgRPE=rRPE.length?rRPE.reduce((a,b)=>a+b,0)/rRPE.length:null;
+     const avgRPE=rRPE.length?rRPE.reduce((a, b) => a + b, 0) * rRPE.length:null;

[NoCoverage] ArrowFunction
src/pages/dashboard.js:544:40
-     const avgRPE=rRPE.length?rRPE.reduce((a,b)=>a+b,0)/rRPE.length:null;
+     const avgRPE=rRPE.length?rRPE.reduce(() => undefined,0)/rRPE.length:null;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:544:47
-     const avgRPE=rRPE.length?rRPE.reduce((a,b)=>a+b,0)/rRPE.length:null;
+     const avgRPE=rRPE.length?rRPE.reduce((a,b)=>a - b,0)/rRPE.length:null;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:545:6
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(true) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:545:6
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(false) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});

[NoCoverage] LogicalOperator
src/pages/dashboard.js:545:6
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(avgRPE || avgRPE >= 8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:545:14
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(avgRPE&&true) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:545:14
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(avgRPE&&avgRPE > 8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:545:14
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(avgRPE&&avgRPE < 8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:545:39
-     if(avgRPE&&avgRPE>=8.5) alerts.push({t:'r',i:'🚨',tt:`DELOAD – RPE ${avgRPE.toFixed(1)}`,s:'Reduce volum 40% săptămâna asta'});
+     if(avgRPE&&avgRPE>=8.5) alerts.push({});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:13
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW - (SW - TW) * Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT)) * 10) * 10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:24
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW - (SW - TW) * Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT)) / 10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:25
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW + (SW - TW) * Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:28
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW - TW) / Math.min(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:29
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW + TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;

[NoCoverage] MethodExpression
src/pages/dashboard.js:546:36
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.max(1, Math.max(0, Math.round((new Date() - SD2) / 86400000)) / DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:47
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0, Math.round((new Date() - SD2) / 86400000)) * DTOT))*10)/10;

[NoCoverage] MethodExpression
src/pages/dashboard.js:546:47
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.min(0, Math.round((new Date() - SD2) / 86400000))/DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:69
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date() - SD2) * 86400000))/DTOT))*10)/10;

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:546:70
-     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date()-SD2)/86400000))/DTOT))*10)/10;
+     const tgt=Math.round((SW-(SW-TW)*Math.min(1,Math.max(0,Math.round((new Date() + SD2)/86400000))/DTOT))*10)/10;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:548:6
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(true) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:548:6
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(false) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] LogicalOperator
src/pages/dashboard.js:548:6
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW && todW <= tgt + 0.2 || !alerts.find(a => a.t === 'r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:548:6
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(true&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] LogicalOperator
src/pages/dashboard.js:548:6
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW || todW <= tgt + 0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:548:12
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&true&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:548:12
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW < tgt + 0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:548:12
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW > tgt + 0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ArithmeticOperator
src/pages/dashboard.js:548:18
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt - 0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:548:27
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt+0.2&&alerts.find(a => a.t === 'r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ArrowFunction
src/pages/dashboard.js:548:40
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt+0.2&&!alerts.find(() => undefined)) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:548:43
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>true)) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:548:43
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>false)) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] EqualityOperator
src/pages/dashboard.js:548:43
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t !== 'r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});

[NoCoverage] ObjectLiteral
src/pages/dashboard.js:548:67
-     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({t:'g',i:'✅',tt:'PE TRASEU',s:`${todW.toFixed(1)} kg · Ținta azi: ${tgt.toFixed(1)} kg`});
+     if(todW&&todW<=tgt+0.2&&!alerts.find(a=>a.t==='r')) alerts.push({});

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:553:12
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=true, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:553:12
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=false, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();

[NoCoverage] LogicalOperator
src/pages/dashboard.js:553:12
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=DB.get('weights') && {}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:553:41
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=DB.get('weights')||{}, kcals=true, dates=Object.keys(ws).sort();

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:553:41
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=DB.get('weights')||{}, kcals=false, dates=Object.keys(ws).sort();

[NoCoverage] LogicalOperator
src/pages/dashboard.js:553:41
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=DB.get('weights')||{}, kcals=DB.get('kcals') && {}, dates=Object.keys(ws).sort();

[NoCoverage] MethodExpression
src/pages/dashboard.js:553:68
-     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws).sort();
+     const ws=DB.get('weights')||{}, kcals=DB.get('kcals')||{}, dates=Object.keys(ws);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:554:16
-     const closed=DB.get('closed-days')||{};
+     const closed=true;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:554:16
-     const closed=DB.get('closed-days')||{};
+     const closed=false;

[NoCoverage] LogicalOperator
src/pages/dashboard.js:554:16
-     const closed=DB.get('closed-days')||{};
+     const closed=DB.get('closed-days') && {};

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:555:17
-     closed[tod()]=true; DB.set('closed-days',closed);
+     closed[tod()]=false; DB.set('closed-days',closed);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:559:6
-     if(cdDash){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:559:6
-     if(cdDash){
+     if(false){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:560:41
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':true?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:560:41
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':false?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:560:41
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':Math.abs(p.rate) <= 0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:560:41
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':Math.abs(p.rate) >= 0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:560:79
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':true?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:560:79
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':false?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:560:79
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate) >= 1.2?'var(--accent3)':'var(--green)';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:560:79
-       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate)>1.2?'var(--accent3)':'var(--green)';
+       const pColor=p.gaining?'var(--red)':Math.abs(p.rate)<0.2?'var(--accent2)':Math.abs(p.rate) <= 1.2?'var(--accent3)':'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:581:8
-       if(el){
+       if(true){

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:581:8
-       if(el){
+       if(false){

[NoCoverage] BlockStatement
src/pages/dashboard.js:581:11
-       if(el){
-         if(p.gaining) el.innerHTML='⚠️ <strong style="color:var(--red)">Trend de creștere</strong> – verifică kcal';
-         else if(Math.abs(p.rate)<0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';
-         else if(Math.abs(p.rate)>1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';
-         else el.innerHTML=`✅ <strong style="color:var(--green)">Ritm perfect</strong> – ${Math.abs(p.rate).toFixed(2)} kg/săpt · continui`;
-       }
+       if(el){}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:582:10
-         if(p.gaining) el.innerHTML='⚠️ <strong style="color:var(--red)">Trend de creștere</strong> – verifică kcal';
+         if(true) el.innerHTML='⚠️ <strong style="color:var(--red)">Trend de creștere</strong> – verifică kcal';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:582:10
-         if(p.gaining) el.innerHTML='⚠️ <strong style="color:var(--red)">Trend de creștere</strong> – verifică kcal';
+         if(false) el.innerHTML='⚠️ <strong style="color:var(--red)">Trend de creștere</strong> – verifică kcal';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:583:15
-         else if(Math.abs(p.rate)<0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';
+         else if(true) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:583:15
-         else if(Math.abs(p.rate)<0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';
+         else if(false) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:583:15
-         else if(Math.abs(p.rate)<0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';
+         else if(Math.abs(p.rate) <= 0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:583:15
-         else if(Math.abs(p.rate)<0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';
+         else if(Math.abs(p.rate) >= 0.2) el.innerHTML='⚠️ <strong style="color:var(--accent2)">Scădere prea lentă</strong> – scade 100 kcal';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:584:15
-         else if(Math.abs(p.rate)>1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';
+         else if(true) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:584:15
-         else if(Math.abs(p.rate)>1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';
+         else if(false) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';

[NoCoverage] EqualityOperator
src/pages/dashboard.js:584:15
-         else if(Math.abs(p.rate)>1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';
+         else if(Math.abs(p.rate) >= 1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';
