[NoCoverage] EqualityOperator
src/pages/dashboard.js:584:15
-         else if(Math.abs(p.rate)>1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';
+         else if(Math.abs(p.rate) <= 1.2) el.innerHTML='⚡ <strong style="color:var(--accent3)">Scădere prea rapidă</strong> – adaugă 150 kcal';

[NoCoverage] BlockStatement
src/pages/dashboard.js:590:40
-   export function updateNotifBtn(active) {
-     const btn = $('notif-btn');
-     if (!btn) return;
-     if (active) {
-       btn.innerHTML = '🔔 Notificări ACTIVE';
-       btn.style.background = 'rgba(48,209,88,0.12)';
-       btn.style.borderColor = 'var(--green)';
-       btn.style.color = 'var(--green)';
-     } else {
-       btn.innerHTML = '🔕 Notificări INACTIVE';
-       btn.style.background = 'rgba(255,59,48,0.08)';
-       btn.style.borderColor = 'var(--red)';
-       btn.style.color = 'var(--red)';
-     }
-   }
+   export function updateNotifBtn(active) {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:592:7
-     if (!btn) return;
+     if (btn) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:592:7
-     if (!btn) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:592:7
-     if (!btn) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:593:7
-     if (active) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:593:7
-     if (active) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:593:15
-     if (active) {
-       btn.innerHTML = '🔔 Notificări ACTIVE';
-       btn.style.background = 'rgba(48,209,88,0.12)';
-       btn.style.borderColor = 'var(--green)';
-       btn.style.color = 'var(--green)';
-     } else {
+     if (active) {} else {

[NoCoverage] BlockStatement
src/pages/dashboard.js:598:10
-     } else {
-       btn.innerHTML = '🔕 Notificări INACTIVE';
-       btn.style.background = 'rgba(255,59,48,0.08)';
-       btn.style.borderColor = 'var(--red)';
-       btn.style.color = 'var(--red)';
-     }
+     } else {}

[NoCoverage] BlockStatement
src/pages/dashboard.js:606:46
-   export async function requestNotifications() {
-     if (!('Notification' in window)) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }
-     
-     // Toggle: dacă e activ, dezactivează
-     const isEnabled = DB.get('notif-enabled');
-     if (Notification.permission === 'granted' && isEnabled) {
-       DB.set('notif-enabled', false);
-       updateNotifBtn(false);
-       toast('🔕 Notificări dezactivate', 'var(--accent2)');
-       return;
-     }
-     
-     if (Notification.permission === 'granted') { 
-       scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); 
-       toast('✅ Notificări active', 'var(--green)'); return; 
-     }
-     const perm = await Notification.requestPermission();
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
-     else { updateNotifBtn(false); toast('⚠ Permisiune refuzată', 'var(--accent2)'); }
-   }
+   export async function requestNotifications() {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:607:7
-     if (!('Notification' in window)) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }
+     if ('Notification' in window) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:607:7
-     if (!('Notification' in window)) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }
+     if (true) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:607:7
-     if (!('Notification' in window)) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }
+     if (false) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }

[NoCoverage] BlockStatement
src/pages/dashboard.js:607:36
-     if (!('Notification' in window)) { toast('⚠ Browser-ul nu suportă notificări', 'var(--accent2)'); return; }
+     if (!('Notification' in window)) {}

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:611:7
-     if (Notification.permission === 'granted' && isEnabled) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:611:7
-     if (Notification.permission === 'granted' && isEnabled) {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/dashboard.js:611:7
-     if (Notification.permission === 'granted' && isEnabled) {
+     if (Notification.permission === 'granted' || isEnabled) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:611:7
-     if (Notification.permission === 'granted' && isEnabled) {
+     if (true && isEnabled) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:611:7
-     if (Notification.permission === 'granted' && isEnabled) {
+     if (Notification.permission !== 'granted' && isEnabled) {

[NoCoverage] BlockStatement
src/pages/dashboard.js:611:59
-     if (Notification.permission === 'granted' && isEnabled) {
-       DB.set('notif-enabled', false);
-       updateNotifBtn(false);
-       toast('🔕 Notificări dezactivate', 'var(--accent2)');
-       return;
-     }
+     if (Notification.permission === 'granted' && isEnabled) {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:612:29
-       DB.set('notif-enabled', false);
+       DB.set('notif-enabled', true);

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:613:20
-       updateNotifBtn(false);
+       updateNotifBtn(true);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:618:7
-     if (Notification.permission === 'granted') { 
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:618:7
-     if (Notification.permission === 'granted') { 
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/dashboard.js:618:7
-     if (Notification.permission === 'granted') { 
+     if (Notification.permission !== 'granted') {

[NoCoverage] BlockStatement
src/pages/dashboard.js:618:46
-     if (Notification.permission === 'granted') { 
-       scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); 
-       toast('✅ Notificări active', 'var(--green)'); return; 
-     }
+     if (Notification.permission === 'granted') {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:619:54
-       scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); 
+       scheduleNotifications(); DB.set('notif-enabled', false); updateNotifBtn(true);

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:619:76
-       scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); 
+       scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(false);

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:623:7
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
+     if (true) { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }

[NoCoverage] ConditionalExpression
src/pages/dashboard.js:623:7
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
+     if (false) { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }

[NoCoverage] EqualityOperator
src/pages/dashboard.js:623:7
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
+     if (perm !== 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }

[NoCoverage] BlockStatement
src/pages/dashboard.js:623:27
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
+     if (perm === 'granted') {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:623:78
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
+     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', false); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:623:100
-     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(true); toast('✅ Notificări activate!', 'var(--green)'); }
+     if (perm === 'granted') { scheduleNotifications(); DB.set('notif-enabled', true); updateNotifBtn(false); toast('✅ Notificări activate!', 'var(--green)'); }

[NoCoverage] BlockStatement
src/pages/dashboard.js:624:8
-     else { updateNotifBtn(false); toast('⚠ Permisiune refuzată', 'var(--accent2)'); }
+     else {}

[NoCoverage] BooleanLiteral
src/pages/dashboard.js:624:25
-     else { updateNotifBtn(false); toast('⚠ Permisiune refuzată', 'var(--accent2)'); }
+     else { updateNotifBtn(true); toast('⚠ Permisiune refuzată', 'var(--accent2)'); }

[NoCoverage] ConditionalExpression
src/pages/plan.js:21:35
-     const pdEl = $('plan-date'); if(pdEl) pdEl.textContent = now.toLocaleDateString('ro-RO', {weekday:'long', day:'numeric', month:'long'});
+     const pdEl = $('plan-date'); if(true) pdEl.textContent = now.toLocaleDateString('ro-RO', {weekday:'long', day:'numeric', month:'long'});

[NoCoverage] ConditionalExpression
src/pages/plan.js:21:35
-     const pdEl = $('plan-date'); if(pdEl) pdEl.textContent = now.toLocaleDateString('ro-RO', {weekday:'long', day:'numeric', month:'long'});
+     const pdEl = $('plan-date'); if(false) pdEl.textContent = now.toLocaleDateString('ro-RO', {weekday:'long', day:'numeric', month:'long'});

[NoCoverage] ObjectLiteral
src/pages/plan.js:21:92
-     const pdEl = $('plan-date'); if(pdEl) pdEl.textContent = now.toLocaleDateString('ro-RO', {weekday:'long', day:'numeric', month:'long'});
+     const pdEl = $('plan-date'); if(pdEl) pdEl.textContent = now.toLocaleDateString('ro-RO', {});

[NoCoverage] ObjectLiteral
src/pages/plan.js:24:23
-     const phaseConfig = {
-       CUT: {color:'var(--accent3)', detail:`BF ${bf}% → obiectiv vară · Deficit caloric activ`},
-       BULK: {color:'var(--accent3)', detail:`BF ${bf}% → creștere masă musculară · Surplus controlat`},
-       MAINTENANCE: {color:'var(--green)', detail:`BF ${bf}% → menții masa musculară · Sezon vară`},
-       STRENGTH: {color:'var(--purple)', detail:`Focus forță · Volum redus, intensitate crescută`}
-     };
+     const phaseConfig = {};

[NoCoverage] ObjectLiteral
src/pages/plan.js:25:10
-       CUT: {color:'var(--accent3)', detail:`BF ${bf}% → obiectiv vară · Deficit caloric activ`},
+       CUT: {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:26:11
-       BULK: {color:'var(--accent3)', detail:`BF ${bf}% → creștere masă musculară · Surplus controlat`},
+       BULK: {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:27:18
-       MAINTENANCE: {color:'var(--green)', detail:`BF ${bf}% → menții masa musculară · Sezon vară`},
+       MAINTENANCE: {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:28:15
-       STRENGTH: {color:'var(--purple)', detail:`Focus forță · Volum redus, intensitate crescută`}
+       STRENGTH: {}

[NoCoverage] ConditionalExpression
src/pages/plan.js:30:14
-     const pc = phaseConfig[phase] || phaseConfig.CUT;
+     const pc = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:30:14
-     const pc = phaseConfig[phase] || phaseConfig.CUT;
+     const pc = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:30:14
-     const pc = phaseConfig[phase] || phaseConfig.CUT;
+     const pc = phaseConfig[phase] && phaseConfig.CUT;

[NoCoverage] ConditionalExpression
src/pages/plan.js:31:38
-     const pbEl = $('phase-banner'); if(pbEl) pbEl.style.borderColor = pc.color;
+     const pbEl = $('phase-banner'); if(true) pbEl.style.borderColor = pc.color;

[NoCoverage] ConditionalExpression
src/pages/plan.js:31:38
-     const pbEl = $('phase-banner'); if(pbEl) pbEl.style.borderColor = pc.color;
+     const pbEl = $('phase-banner'); if(false) pbEl.style.borderColor = pc.color;

[NoCoverage] ConditionalExpression
src/pages/plan.js:32:36
-     const pnEl = $('phase-name'); if(pnEl) { pnEl.style.color = pc.color; pnEl.textContent = phase; }
+     const pnEl = $('phase-name'); if(true) { pnEl.style.color = pc.color; pnEl.textContent = phase; }

[NoCoverage] ConditionalExpression
src/pages/plan.js:32:36
-     const pnEl = $('phase-name'); if(pnEl) { pnEl.style.color = pc.color; pnEl.textContent = phase; }
+     const pnEl = $('phase-name'); if(false) { pnEl.style.color = pc.color; pnEl.textContent = phase; }

[NoCoverage] BlockStatement
src/pages/plan.js:32:42
-     const pnEl = $('phase-name'); if(pnEl) { pnEl.style.color = pc.color; pnEl.textContent = phase; }
+     const pnEl = $('phase-name'); if(pnEl) {}

[NoCoverage] ConditionalExpression
src/pages/plan.js:33:39
-     const pdtEl = $('phase-detail'); if(pdtEl) pdtEl.textContent = pc.detail;
+     const pdtEl = $('phase-detail'); if(true) pdtEl.textContent = pc.detail;

[NoCoverage] ConditionalExpression
src/pages/plan.js:33:39
-     const pdtEl = $('phase-detail'); if(pdtEl) pdtEl.textContent = pc.detail;
+     const pdtEl = $('phase-detail'); if(false) pdtEl.textContent = pc.detail;

[NoCoverage] ConditionalExpression
src/pages/plan.js:36:19
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = true ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/plan.js:36:19
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = false ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/plan.js:36:19
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf > 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/plan.js:36:19
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf < 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/plan.js:36:45
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : true ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/plan.js:36:45
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : false ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/plan.js:36:45
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : bf > 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/plan.js:36:45
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : bf < 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/plan.js:36:75
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : true ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/plan.js:36:75
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : false ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/plan.js:36:75
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf > 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/plan.js:36:75
-     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf >= 18 ? 'var(--accent3)' : 'var(--green)';
+     const bfColor = bf >= 30 ? 'var(--red)' : bf >= 25 ? 'var(--accent2)' : bf < 18 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/plan.js:38:6
-     if(bfEl) { bfEl.textContent = bf.toFixed(1); bfEl.style.color = bfColor; }
+     if(true) { bfEl.textContent = bf.toFixed(1); bfEl.style.color = bfColor; }

[NoCoverage] ConditionalExpression
src/pages/plan.js:38:6
-     if(bfEl) { bfEl.textContent = bf.toFixed(1); bfEl.style.color = bfColor; }
+     if(false) { bfEl.textContent = bf.toFixed(1); bfEl.style.color = bfColor; }

[NoCoverage] BlockStatement
src/pages/plan.js:38:12
-     if(bfEl) { bfEl.textContent = bf.toFixed(1); bfEl.style.color = bfColor; }
+     if(bfEl) {}

[NoCoverage] ConditionalExpression
src/pages/plan.js:39:44
-     const kcalDispEl = $('kcal-display'); if(kcalDispEl) kcalDispEl.textContent = kcal;
+     const kcalDispEl = $('kcal-display'); if(true) kcalDispEl.textContent = kcal;

[NoCoverage] ConditionalExpression
src/pages/plan.js:39:44
-     const kcalDispEl = $('kcal-display'); if(kcalDispEl) kcalDispEl.textContent = kcal;
+     const kcalDispEl = $('kcal-display'); if(false) kcalDispEl.textContent = kcal;

[NoCoverage] ConditionalExpression
src/pages/plan.js:40:44
-     const tdeeDispEl = $('tdee-display'); if(tdeeDispEl) tdeeDispEl.textContent = tdee;
+     const tdeeDispEl = $('tdee-display'); if(true) tdeeDispEl.textContent = tdee;

[NoCoverage] ConditionalExpression
src/pages/plan.js:40:44
-     const tdeeDispEl = $('tdee-display'); if(tdeeDispEl) tdeeDispEl.textContent = tdee;
+     const tdeeDispEl = $('tdee-display'); if(false) tdeeDispEl.textContent = tdee;

[NoCoverage] ConditionalExpression
src/pages/plan.js:41:42
-     const lbmDispEl = $('lbm-display'); if(lbmDispEl) lbmDispEl.textContent = lbm;
+     const lbmDispEl = $('lbm-display'); if(true) lbmDispEl.textContent = lbm;

[NoCoverage] ConditionalExpression
src/pages/plan.js:41:42
-     const lbmDispEl = $('lbm-display'); if(lbmDispEl) lbmDispEl.textContent = lbm;
+     const lbmDispEl = $('lbm-display'); if(false) lbmDispEl.textContent = lbm;

[NoCoverage] ConditionalExpression
src/pages/plan.js:44:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:44:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:44:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/plan.js:45:19
-     const todProt = prots[tod()] || 0;
+     const todProt = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:45:19
-     const todProt = prots[tod()] || 0;
+     const todProt = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:45:19
-     const todProt = prots[tod()] || 0;
+     const todProt = prots[tod()] && 0;

[NoCoverage] ArrowFunction
src/pages/plan.js:47:55
-     document.querySelectorAll('#prot-plan-box').forEach(el => el.remove());
+     document.querySelectorAll('#prot-plan-box').forEach(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/plan.js:49:59
-       <div style="background:var(--card);border:1px solid ${todProt>=PROT_TARGET?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">
+       <div style="background:var(--card);border:1px solid ${true?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">

[NoCoverage] ConditionalExpression
src/pages/plan.js:49:59
-       <div style="background:var(--card);border:1px solid ${todProt>=PROT_TARGET?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">
+       <div style="background:var(--card);border:1px solid ${false?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">

[NoCoverage] EqualityOperator
src/pages/plan.js:49:59
-       <div style="background:var(--card);border:1px solid ${todProt>=PROT_TARGET?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">
+       <div style="background:var(--card);border:1px solid ${todProt > PROT_TARGET?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">

[NoCoverage] EqualityOperator
src/pages/plan.js:49:59
-       <div style="background:var(--card);border:1px solid ${todProt>=PROT_TARGET?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">
+       <div style="background:var(--card);border:1px solid ${todProt < PROT_TARGET?'rgba(48,209,88,0.3)':'var(--border)'};border-radius:var(--r);padding:14px;position:relative;overflow:hidden;margin-bottom:0" id="prot-plan-box">

[NoCoverage] ConditionalExpression
src/pages/plan.js:50:82
-         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${todProt>=PROT_TARGET?'var(--green)':'var(--text3)'}"></div>
+         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${true?'var(--green)':'var(--text3)'}"></div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:50:82
-         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${todProt>=PROT_TARGET?'var(--green)':'var(--text3)'}"></div>
+         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${false?'var(--green)':'var(--text3)'}"></div>

[NoCoverage] EqualityOperator
src/pages/plan.js:50:82
-         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${todProt>=PROT_TARGET?'var(--green)':'var(--text3)'}"></div>
+         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${todProt > PROT_TARGET?'var(--green)':'var(--text3)'}"></div>

[NoCoverage] EqualityOperator
src/pages/plan.js:50:82
-         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${todProt>=PROT_TARGET?'var(--green)':'var(--text3)'}"></div>
+         <div style="position:absolute;top:0;left:0;right:0;height:2px;background:${todProt < PROT_TARGET?'var(--green)':'var(--text3)'}"></div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:52:78
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${true?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:52:78
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${false?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:52:78
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt > PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:52:78
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt < PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:52:114
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':true?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:52:114
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':false?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:52:114
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt >= 0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:52:114
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt <= 0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:52:160
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${true}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:52:160
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${false}</div>

[NoCoverage] LogicalOperator
src/pages/plan.js:52:160
-         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt||'—'}</div>
+         <div style="font-family:'Bebas Neue',sans-serif;font-size:36px;color:${todProt>=PROT_TARGET?'var(--green)':todProt>0?'var(--accent3)':'var(--text3)'}">${todProt && '—'}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:59:6
-     if(bfNoteEl) bfNoteEl.textContent = bfOvr
+     if(true) bfNoteEl.textContent = bfOvr

[NoCoverage] ConditionalExpression
src/pages/plan.js:59:6
-     if(bfNoteEl) bfNoteEl.textContent = bfOvr
+     if(false) bfNoteEl.textContent = bfOvr

[NoCoverage] ConditionalExpression
src/pages/plan.js:62:7
-     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }
+     if (true) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }

[NoCoverage] ConditionalExpression
src/pages/plan.js:62:7
-     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }
+     if (false) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }

[NoCoverage] BlockStatement
src/pages/plan.js:62:14
-     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }
+     if (bfOvr) {}

[NoCoverage] ConditionalExpression
src/pages/plan.js:62:59
-     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }
+     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(true) bfInpEl.value = bfOvr; }
