[NoCoverage] ConditionalExpression
src/pages/plan.js:62:59
-     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(bfInpEl) bfInpEl.value = bfOvr; }
+     if (bfOvr) { const bfInpEl = $('bf-override-input'); if(false) bfInpEl.value = bfOvr; }

[NoCoverage] BlockStatement
src/pages/plan.js:65:58
-     document.querySelectorAll('.phase-btn').forEach(btn => {
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
-     });
+     document.querySelectorAll('.phase-btn').forEach(btn => {});

[NoCoverage] ConditionalExpression
src/pages/plan.js:66:42
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
+       btn.classList.toggle('active-phase', true);

[NoCoverage] ConditionalExpression
src/pages/plan.js:66:42
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
+       btn.classList.toggle('active-phase', false);

[NoCoverage] EqualityOperator
src/pages/plan.js:66:42
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
+       btn.classList.toggle('active-phase', btn.dataset.phase !== (DB.get('phase-override') || ''));

[NoCoverage] ConditionalExpression
src/pages/plan.js:66:65
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
+       btn.classList.toggle('active-phase', btn.dataset.phase === (true));

[NoCoverage] ConditionalExpression
src/pages/plan.js:66:65
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
+       btn.classList.toggle('active-phase', btn.dataset.phase === (false));

[NoCoverage] LogicalOperator
src/pages/plan.js:66:65
-       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override')||''));
+       btn.classList.toggle('active-phase', btn.dataset.phase === (DB.get('phase-override') && ''));

[NoCoverage] ConditionalExpression
src/pages/plan.js:72:6
-     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
+     if(true) clEl.innerHTML = checkpoints.map(cp => `

[NoCoverage] ConditionalExpression
src/pages/plan.js:72:6
-     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
+     if(false) clEl.innerHTML = checkpoints.map(cp => `

[NoCoverage] ConditionalExpression
src/pages/plan.js:72:29
-     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
-       <div class="checkpoint-item ${cp.type}" style="border-left-color:${cp.color}">
-         <div class="ci-left">
-           <div class="ci-label">${cp.label}</div>
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
-         </div>
-         <div class="ci-right">
-           <div class="ci-weeks" style="color:${cp.color}">${cp.weeks}</div>
-           <div class="ci-weeks-lbl">săptămâni</div>
-         </div>
-       </div>`).join('') || '<div style="color:var(--text3);font-size:12px;padding:8px 0">Toate checkpoints-urile atinse ✅</div>';
+     if(clEl) clEl.innerHTML = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:72:29
-     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
-       <div class="checkpoint-item ${cp.type}" style="border-left-color:${cp.color}">
-         <div class="ci-left">
-           <div class="ci-label">${cp.label}</div>
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
-         </div>
-         <div class="ci-right">
-           <div class="ci-weeks" style="color:${cp.color}">${cp.weeks}</div>
-           <div class="ci-weeks-lbl">săptămâni</div>
-         </div>
-       </div>`).join('') || '<div style="color:var(--text3);font-size:12px;padding:8px 0">Toate checkpoints-urile atinse ✅</div>';
+     if(clEl) clEl.innerHTML = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:72:29
-     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
-       <div class="checkpoint-item ${cp.type}" style="border-left-color:${cp.color}">
-         <div class="ci-left">
-           <div class="ci-label">${cp.label}</div>
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
-         </div>
-         <div class="ci-right">
-           <div class="ci-weeks" style="color:${cp.color}">${cp.weeks}</div>
-           <div class="ci-weeks-lbl">săptămâni</div>
-         </div>
-       </div>`).join('') || '<div style="color:var(--text3);font-size:12px;padding:8px 0">Toate checkpoints-urile atinse ✅</div>';
+     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
+       <div class="checkpoint-item ${cp.type}" style="border-left-color:${cp.color}">
+         <div class="ci-left">
+           <div class="ci-label">${cp.label}</div>
+           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
+         </div>
+         <div class="ci-right">
+           <div class="ci-weeks" style="color:${cp.color}">${cp.weeks}</div>
+           <div class="ci-weeks-lbl">săptămâni</div>
+         </div>
+       </div>`).join('') && '<div style="color:var(--text3);font-size:12px;padding:8px 0">Toate checkpoints-urile atinse ✅</div>';

[NoCoverage] ArrowFunction
src/pages/plan.js:72:45
-     if(clEl) clEl.innerHTML = checkpoints.map(cp => `
-       <div class="checkpoint-item ${cp.type}" style="border-left-color:${cp.color}">
-         <div class="ci-left">
-           <div class="ci-label">${cp.label}</div>
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
-         </div>
-         <div class="ci-right">
-           <div class="ci-weeks" style="color:${cp.color}">${cp.weeks}</div>
-           <div class="ci-weeks-lbl">săptămâni</div>
-         </div>
-       </div>`).join('') || '<div style="color:var(--text3);font-size:12px;padding:8px 0">Toate checkpoints-urile atinse ✅</div>';
+     if(clEl) clEl.innerHTML = checkpoints.map(() => undefined).join('') || '<div style="color:var(--text3);font-size:12px;padding:8px 0">Toate checkpoints-urile atinse ✅</div>';

[NoCoverage] ConditionalExpression
src/pages/plan.js:76:31
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
+           <div class="ci-sub">${true} · ${SYS.fmtDate(cp.date)}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:76:31
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
+           <div class="ci-sub">${false} · ${SYS.fmtDate(cp.date)}</div>

[NoCoverage] LogicalOperator
src/pages/plan.js:76:31
-           <div class="ci-sub">${cp.sub || ''} · ${SYS.fmtDate(cp.date)}</div>
+           <div class="ci-sub">${cp.sub && ''} · ${SYS.fmtDate(cp.date)}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:87:6
-     if(stEl) stEl.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);padding:14px 16px">
+     if(true) stEl.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);padding:14px 16px">

[NoCoverage] ConditionalExpression
src/pages/plan.js:87:6
-     if(stEl) stEl.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);padding:14px 16px">
+     if(false) stEl.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:var(--r);padding:14px 16px">

[NoCoverage] BlockStatement
src/pages/plan.js:88:25
-       ${timeline.map(t => {
-         const colors = {cut:'var(--accent2)', summer:'var(--accent)', bulk:'var(--accent3)'};
-         return `<div class="tl-item">
-           <div class="tl-dot ${t.status}" style="${t.status==='current'?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>
-           <div class="tl-content">
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
-             <div class="tl-date">${SYS.fmtDate(t.date)} – ${SYS.fmtDate(t.endDate)}</div>
-           </div>
-         </div>`;
-       }).join('')}
+       ${timeline.map(t => {}).join('')}

[NoCoverage] ObjectLiteral
src/pages/plan.js:89:22
-         const colors = {cut:'var(--accent2)', summer:'var(--accent)', bulk:'var(--accent3)'};
+         const colors = {};

[NoCoverage] ConditionalExpression
src/pages/plan.js:91:50
-           <div class="tl-dot ${t.status}" style="${t.status==='current'?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>
+           <div class="tl-dot ${t.status}" style="${true?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:91:50
-           <div class="tl-dot ${t.status}" style="${t.status==='current'?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>
+           <div class="tl-dot ${t.status}" style="${false?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>

[NoCoverage] EqualityOperator
src/pages/plan.js:91:50
-           <div class="tl-dot ${t.status}" style="${t.status==='current'?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>
+           <div class="tl-dot ${t.status}" style="${t.status !== 'current'?`background:${colors[t.type]};box-shadow:0 0 8px ${colors[t.type]}44`:''}"></div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:93:48
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${true?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:93:48
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${false?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:93:48
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status !== 'past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:93:81
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':true?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:93:81
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':false?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:93:81
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status !== 'current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:93:145
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${true?' ← ACUM':''}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:93:145
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${false?' ← ACUM':''}</div>

[NoCoverage] EqualityOperator
src/pages/plan.js:93:145
-             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status==='current'?' ← ACUM':''}</div>
+             <div class="tl-label" style="color:${t.status==='past'?'var(--text3)':t.status==='current'?colors[t.type]:'var(--text)'}">${t.label}${t.status !== 'current'?' ← ACUM':''}</div>

[NoCoverage] BooleanLiteral
src/pages/plan.js:104:23
-     const pc=$('pc');if(!pc)return;
+     const pc=$('pc');if(pc)return;

[NoCoverage] ConditionalExpression
src/pages/plan.js:104:23
-     const pc=$('pc');if(!pc)return;
+     const pc=$('pc');if(true)return;

[NoCoverage] ConditionalExpression
src/pages/plan.js:104:23
-     const pc=$('pc');if(!pc)return;
+     const pc=$('pc');if(false)return;

[NoCoverage] ObjectLiteral
src/pages/plan.js:107:23
-     const muscleEmoji = {
-       'spate': '🔙', 'piept': '💪', 'umeri': '🔝',
-       'brate': '💪', 'triceps': '💪', 'picioare': '🦵',
-       'core': '⚡', 'umeri+brate': '🔝'
-     };
+     const muscleEmoji = {};

[NoCoverage] ObjectLiteral
src/pages/plan.js:114:21
-     const dayColors = {
-       'Luni':    {bg:'rgba(80,80,80,0.15)', border:'rgba(120,120,120,0.3)', text:'var(--text3)'},
-       'Marți':   {bg:'rgba(0,212,255,0.08)', border:'rgba(0,212,255,0.25)', text:'var(--accent3)'},
-       'Miercuri':{bg:'rgba(200,255,0,0.08)', border:'rgba(200,255,0,0.25)', text:'var(--accent)'},
-       'Joi':     {bg:'rgba(191,90,242,0.08)', border:'rgba(191,90,242,0.25)', text:'var(--purple)'},
-       'Vineri':  {bg:'rgba(255,107,53,0.08)', border:'rgba(255,107,53,0.25)', text:'var(--accent2)'},
-       'Sâmbătă': {bg:'rgba(48,209,88,0.08)', border:'rgba(48,209,88,0.25)', text:'var(--green)'},
-       'Duminică':{bg:'rgba(80,80,80,0.15)', border:'rgba(120,120,120,0.3)', text:'var(--text3)'},
-     };
+     const dayColors = {};

[NoCoverage] ObjectLiteral
src/pages/plan.js:115:16
-       'Luni':    {bg:'rgba(80,80,80,0.15)', border:'rgba(120,120,120,0.3)', text:'var(--text3)'},
+       'Luni':    {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:116:16
-       'Marți':   {bg:'rgba(0,212,255,0.08)', border:'rgba(0,212,255,0.25)', text:'var(--accent3)'},
+       'Marți':   {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:117:16
-       'Miercuri':{bg:'rgba(200,255,0,0.08)', border:'rgba(200,255,0,0.25)', text:'var(--accent)'},
+       'Miercuri':{},

[NoCoverage] ObjectLiteral
src/pages/plan.js:118:16
-       'Joi':     {bg:'rgba(191,90,242,0.08)', border:'rgba(191,90,242,0.25)', text:'var(--purple)'},
+       'Joi':     {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:119:16
-       'Vineri':  {bg:'rgba(255,107,53,0.08)', border:'rgba(255,107,53,0.25)', text:'var(--accent2)'},
+       'Vineri':  {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:120:16
-       'Sâmbătă': {bg:'rgba(48,209,88,0.08)', border:'rgba(48,209,88,0.25)', text:'var(--green)'},
+       'Sâmbătă': {},

[NoCoverage] ObjectLiteral
src/pages/plan.js:121:16
-       'Duminică':{bg:'rgba(80,80,80,0.15)', border:'rgba(120,120,120,0.3)', text:'var(--text3)'},
+       'Duminică':{},

[NoCoverage] ConditionalExpression
src/pages/plan.js:125:17
-       const col = dayColors[day.day] || {bg:'var(--card)', border:'var(--border)', text:'var(--text2)'};
+       const col = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:125:17
-       const col = dayColors[day.day] || {bg:'var(--card)', border:'var(--border)', text:'var(--text2)'};
+       const col = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:125:17
-       const col = dayColors[day.day] || {bg:'var(--card)', border:'var(--border)', text:'var(--text2)'};
+       const col = dayColors[day.day] && {
+     bg: 'var(--card)',
+     border: 'var(--border)',
+     text: 'var(--text2)'
+   };

[NoCoverage] ObjectLiteral
src/pages/plan.js:125:39
-       const col = dayColors[day.day] || {bg:'var(--card)', border:'var(--border)', text:'var(--text2)'};
+       const col = dayColors[day.day] || {};

[NoCoverage] ConditionalExpression
src/pages/plan.js:126:8
-       if(day.t==='off') return `
+       if(true) return `

[NoCoverage] ConditionalExpression
src/pages/plan.js:126:8
-       if(day.t==='off') return `
+       if(false) return `

[NoCoverage] EqualityOperator
src/pages/plan.js:126:8
-       if(day.t==='off') return `
+       if(day.t !== 'off') return `

[NoCoverage] BlockStatement
src/pages/plan.js:139:41
-           <div class="el">${day.ex.map(e=>{
-             const emoji = muscleEmoji[e.g] || '💪';
-             return `<div class="ei"><span style="font-size:14px;margin-right:6px">${emoji}</span><div class="en">${cleanEx(e.n)}</div><div class="es2">${e.s}</div></div>`;
-           }).join('')}</div>
+           <div class="el">${day.ex.map(e=>{}).join('')}</div>

[NoCoverage] ConditionalExpression
src/pages/plan.js:140:25
-             const emoji = muscleEmoji[e.g] || '💪';
+             const emoji = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:140:25
-             const emoji = muscleEmoji[e.g] || '💪';
+             const emoji = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:140:25
-             const emoji = muscleEmoji[e.g] || '💪';
+             const emoji = muscleEmoji[e.g] && '💪';

[NoCoverage] BlockStatement
src/pages/plan.js:147:41
-   export function setPhaseOverride(phase) {
-     DB.set('phase-change-date', tod());
-     DB.set('phase-override', phase);
-     // Logăm schimbarea de fază cu data și kcalTarget — pentru culori corecte în istoric
-     const today = tod();
-     const phaseLogs = DB.get('phase-log') || [];
-     // Calculăm kcalTarget temporar (după ce setăm override-ul)
-     const tdee = SYS.estimateTDEE();
-     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };
-     const kcalTarget = kcalMap[phase] || KCAL_TARGET;
-     // Înlocuim sau adăugăm entry pentru azi
-     const filtered = phaseLogs.filter(e => e.date !== today);
-     filtered.push({ date: today, phase, kcalTarget });
-     DB.set('phase-log', filtered);
-     toast(`✓ Fază setată: ${phase} · ${kcalTarget} kcal`);
-     renderPlan();
-     renderDash();
-     renderUnifiedHistory();
-   }
+   export function setPhaseOverride(phase) {}

[NoCoverage] ConditionalExpression
src/pages/plan.js:152:21
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:152:21
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:152:21
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = DB.get('phase-log') && [];

[NoCoverage] ArrayDeclaration
src/pages/plan.js:152:44
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = DB.get('phase-log') || ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/pages/plan.js:155:19
-     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };
+     const kcalMap = {};

[NoCoverage] ArithmeticOperator
src/pages/plan.js:155:37
-     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };
+     const kcalMap = { CUT: Math.round(tdee / 0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };

[NoCoverage] ArithmeticOperator
src/pages/plan.js:155:66
-     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };
+     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee / 1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };

[NoCoverage] ArithmeticOperator
src/pages/plan.js:155:118
-     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee*1.05) };
+     const kcalMap = { CUT: Math.round(tdee*0.82), BULK: Math.round(tdee*1.08), MAINTENANCE: tdee, STRENGTH: Math.round(tdee / 1.05) };

[NoCoverage] ConditionalExpression
src/pages/plan.js:156:22
-     const kcalTarget = kcalMap[phase] || KCAL_TARGET;
+     const kcalTarget = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:156:22
-     const kcalTarget = kcalMap[phase] || KCAL_TARGET;
+     const kcalTarget = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:156:22
-     const kcalTarget = kcalMap[phase] || KCAL_TARGET;
+     const kcalTarget = kcalMap[phase] && KCAL_TARGET;

[NoCoverage] MethodExpression
src/pages/plan.js:158:20
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs;

[NoCoverage] ArrowFunction
src/pages/plan.js:158:37
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/plan.js:158:42
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(e => true);

[NoCoverage] ConditionalExpression
src/pages/plan.js:158:42
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(e => false);

[NoCoverage] EqualityOperator
src/pages/plan.js:158:42
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(e => e.date === today);

[NoCoverage] ObjectLiteral
src/pages/plan.js:159:17
-     filtered.push({ date: today, phase, kcalTarget });
+     filtered.push({});

[NoCoverage] BlockStatement
src/pages/plan.js:168:43
-   window.addEventListener('storage', (e) => {
-     if (e.key === 'bf-override') {
-       renderPlan();
-     }
-   });
+   window.addEventListener('storage', (e) => {});

[NoCoverage] ConditionalExpression
src/pages/plan.js:169:7
-     if (e.key === 'bf-override') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/plan.js:169:7
-     if (e.key === 'bf-override') {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/plan.js:169:7
-     if (e.key === 'bf-override') {
+     if (e.key !== 'bf-override') {

[NoCoverage] BlockStatement
src/pages/plan.js:169:32
-     if (e.key === 'bf-override') {
-       renderPlan();
-     }
+     if (e.key === 'bf-override') {}

[NoCoverage] BlockStatement
src/pages/plan.js:174:38
-   export function clearPhaseOverride() {
-     DB.set('phase-change-date', tod());
-     DB.set('phase-override', null);
-     const today = tod();
-     const phaseLogs = DB.get('phase-log') || [];
-     const filtered = phaseLogs.filter(e => e.date !== today);
-     const autoKcal = SYS.getKcalTarget();
-     filtered.push({ date: today, phase: 'AUTO', kcalTarget: autoKcal });
-     DB.set('phase-log', filtered);
-     toast(`✓ Fază setată: AUTO · ${autoKcal} kcal`);
-     renderPlan();
-     renderDash();
-     renderUnifiedHistory();
-   }
+   export function clearPhaseOverride() {}

[NoCoverage] ConditionalExpression
src/pages/plan.js:178:21
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = true;

[NoCoverage] ConditionalExpression
src/pages/plan.js:178:21
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = false;

[NoCoverage] LogicalOperator
src/pages/plan.js:178:21
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = DB.get('phase-log') && [];

[NoCoverage] ArrayDeclaration
src/pages/plan.js:178:44
-     const phaseLogs = DB.get('phase-log') || [];
+     const phaseLogs = DB.get('phase-log') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/plan.js:179:20
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs;

[NoCoverage] ArrowFunction
src/pages/plan.js:179:37
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/plan.js:179:42
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(e => true);

[NoCoverage] ConditionalExpression
src/pages/plan.js:179:42
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(e => false);

[NoCoverage] EqualityOperator
src/pages/plan.js:179:42
-     const filtered = phaseLogs.filter(e => e.date !== today);
+     const filtered = phaseLogs.filter(e => e.date === today);

[NoCoverage] ObjectLiteral
src/pages/plan.js:181:17
-     filtered.push({ date: today, phase: 'AUTO', kcalTarget: autoKcal });
+     filtered.push({});

[NoCoverage] ConditionalExpression
src/pages/settings.js:28:10
-     doc = (typeof document !== 'undefined' ? document : null),
+     doc = (true ? document : null),

[NoCoverage] ConditionalExpression
src/pages/settings.js:28:10
-     doc = (typeof document !== 'undefined' ? document : null),
+     doc = (false ? document : null),

[NoCoverage] EqualityOperator
src/pages/settings.js:28:10
-     doc = (typeof document !== 'undefined' ? document : null),
+     doc = (typeof document === 'undefined' ? document : null),

[NoCoverage] BlockStatement
src/pages/settings.js:47:56
-     btnEmailChange.addEventListener('click', async () => {
-       const result = await openEmailChangeForm({ doc });
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
-         const out = await onEmailChangeSubmit(result.email).catch(() => ({ ok: false, error: 'unknown' }));
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
-           const errModal = doc.createElement('div');
-           errModal.className = 'andura-modal-overlay andura-error-modal';
-           errModal.textContent = EMAIL_CHANGE_COPY.errorAlreadyUsed;
-           const close = doc.createElement('button');
-           close.textContent = 'Închide';
-           close.addEventListener('click', () => { try { errModal.remove(); } catch {} });
-           errModal.appendChild(close);
-           doc.body.appendChild(errModal);
-         }
-       }
-     });
+     btnEmailChange.addEventListener('click', async () => {});

[NoCoverage] ObjectLiteral
src/pages/settings.js:48:46
-       const result = await openEmailChangeForm({ doc });
+       const result = await openEmailChangeForm({});

[NoCoverage] ConditionalExpression
src/pages/settings.js:49:9
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/settings.js:49:9
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
+       if (false) {

[NoCoverage] LogicalOperator
src/pages/settings.js:49:9
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
+       if (result.submitted || typeof onEmailChangeSubmit === 'function') {

[NoCoverage] ConditionalExpression
src/pages/settings.js:49:29
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
+       if (result.submitted && true) {

[NoCoverage] EqualityOperator
src/pages/settings.js:49:29
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
+       if (result.submitted && typeof onEmailChangeSubmit !== 'function') {

[NoCoverage] BlockStatement
src/pages/settings.js:49:72
-       if (result.submitted && typeof onEmailChangeSubmit === 'function') {
-         const out = await onEmailChangeSubmit(result.email).catch(() => ({ ok: false, error: 'unknown' }));
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
-           const errModal = doc.createElement('div');
-           errModal.className = 'andura-modal-overlay andura-error-modal';
-           errModal.textContent = EMAIL_CHANGE_COPY.errorAlreadyUsed;
-           const close = doc.createElement('button');
-           close.textContent = 'Închide';
-           close.addEventListener('click', () => { try { errModal.remove(); } catch {} });
-           errModal.appendChild(close);
-           doc.body.appendChild(errModal);
-         }
-       }
+       if (result.submitted && typeof onEmailChangeSubmit === 'function') {}

[NoCoverage] ArrowFunction
src/pages/settings.js:50:65
-         const out = await onEmailChangeSubmit(result.email).catch(() => ({ ok: false, error: 'unknown' }));
+         const out = await onEmailChangeSubmit(result.email).catch(() => undefined);

[NoCoverage] ObjectLiteral
src/pages/settings.js:50:72
-         const out = await onEmailChangeSubmit(result.email).catch(() => ({ ok: false, error: 'unknown' }));
+         const out = await onEmailChangeSubmit(result.email).catch(() => ({}));

[NoCoverage] BooleanLiteral
src/pages/settings.js:50:78
-         const out = await onEmailChangeSubmit(result.email).catch(() => ({ ok: false, error: 'unknown' }));
+         const out = await onEmailChangeSubmit(result.email).catch(() => ({ ok: true, error: 'unknown' }));
