[NoCoverage] ConditionalExpression
src/pages/settings.js:51:11
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
+         if (true) {

[NoCoverage] ConditionalExpression
src/pages/settings.js:51:11
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
+         if (false) {

[NoCoverage] LogicalOperator
src/pages/settings.js:51:11
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
+         if (!out.ok || out.error === 'EMAIL_EXISTS') {

[NoCoverage] BooleanLiteral
src/pages/settings.js:51:11
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
+         if (out.ok && out.error === 'EMAIL_EXISTS') {

[NoCoverage] ConditionalExpression
src/pages/settings.js:51:22
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
+         if (!out.ok && true) {

[NoCoverage] EqualityOperator
src/pages/settings.js:51:22
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
+         if (!out.ok && out.error !== 'EMAIL_EXISTS') {

[NoCoverage] BlockStatement
src/pages/settings.js:51:52
-         if (!out.ok && out.error === 'EMAIL_EXISTS') {
-           const errModal = doc.createElement('div');
-           errModal.className = 'andura-modal-overlay andura-error-modal';
-           errModal.textContent = EMAIL_CHANGE_COPY.errorAlreadyUsed;
-           const close = doc.createElement('button');
-           close.textContent = 'Închide';
-           close.addEventListener('click', () => { try { errModal.remove(); } catch {} });
-           errModal.appendChild(close);
-           doc.body.appendChild(errModal);
-         }
+         if (!out.ok && out.error === 'EMAIL_EXISTS') {}

[NoCoverage] BlockStatement
src/pages/settings.js:57:47
-           close.addEventListener('click', () => { try { errModal.remove(); } catch {} });
+           close.addEventListener('click', () => {});

[NoCoverage] BlockStatement
src/pages/settings.js:57:53
-           close.addEventListener('click', () => { try { errModal.remove(); } catch {} });
+           close.addEventListener('click', () => { try {} catch {} });

[NoCoverage] BlockStatement
src/pages/settings.js:74:51
-     btnRecoveryLost.addEventListener('click', () => { openRecoveryEmailLostModal({ doc }); });
+     btnRecoveryLost.addEventListener('click', () => {});

[NoCoverage] ObjectLiteral
src/pages/settings.js:74:80
-     btnRecoveryLost.addEventListener('click', () => { openRecoveryEmailLostModal({ doc }); });
+     btnRecoveryLost.addEventListener('click', () => { openRecoveryEmailLostModal({}); });

[NoCoverage] BlockStatement
src/pages/settings.js:87:51
-     btnDelete.addEventListener('click', async () => {
-       const verdict = await openDeleteAccountModal({ doc });
-       if (verdict.confirmed) {
-         const flag = buildSoftDeleteFlag();
-         if (typeof onAccountDeleted === 'function') {
-           await onAccountDeleted(flag).catch(() => {});
-         }
-         try { signOut(); } catch {}
-         const splash = renderDeletePostSplash({ doc });
-         root.innerHTML = '';
-         if (splash) root.appendChild(splash);
-       }
-     });
+     btnDelete.addEventListener('click', async () => {});

[NoCoverage] ObjectLiteral
src/pages/settings.js:88:50
-       const verdict = await openDeleteAccountModal({ doc });
+       const verdict = await openDeleteAccountModal({});

[NoCoverage] ConditionalExpression
src/pages/settings.js:89:9
-       if (verdict.confirmed) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/settings.js:89:9
-       if (verdict.confirmed) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/settings.js:89:28
-       if (verdict.confirmed) {
-         const flag = buildSoftDeleteFlag();
-         if (typeof onAccountDeleted === 'function') {
-           await onAccountDeleted(flag).catch(() => {});
-         }
-         try { signOut(); } catch {}
-         const splash = renderDeletePostSplash({ doc });
-         root.innerHTML = '';
-         if (splash) root.appendChild(splash);
-       }
+       if (verdict.confirmed) {}

[NoCoverage] ConditionalExpression
src/pages/settings.js:91:11
-         if (typeof onAccountDeleted === 'function') {
+         if (true) {

[NoCoverage] ConditionalExpression
src/pages/settings.js:91:11
-         if (typeof onAccountDeleted === 'function') {
+         if (false) {

[NoCoverage] EqualityOperator
src/pages/settings.js:91:11
-         if (typeof onAccountDeleted === 'function') {
+         if (typeof onAccountDeleted !== 'function') {

[NoCoverage] BlockStatement
src/pages/settings.js:91:51
-         if (typeof onAccountDeleted === 'function') {
-           await onAccountDeleted(flag).catch(() => {});
-         }
+         if (typeof onAccountDeleted === 'function') {}

[NoCoverage] BlockStatement
src/pages/settings.js:94:11
-         try { signOut(); } catch {}
+         try {} catch {}

[NoCoverage] ObjectLiteral
src/pages/settings.js:95:45
-         const splash = renderDeletePostSplash({ doc });
+         const splash = renderDeletePostSplash({});

[NoCoverage] ConditionalExpression
src/pages/settings.js:97:11
-         if (splash) root.appendChild(splash);
+         if (true) root.appendChild(splash);

[NoCoverage] ConditionalExpression
src/pages/settings.js:97:11
-         if (splash) root.appendChild(splash);
+         if (false) root.appendChild(splash);

[NoCoverage] BlockStatement
src/pages/settings.js:112:51
-     btnLogout.addEventListener('click', async () => {
-       const step1 = await openLogoutStep1({ doc });
-       if (!step1.continue) return;
-       const step2 = await openLogoutStep2({ doc });
-       if (!step2.confirmed) return;
-       const auth = getAuthState();
-       const uid = auth?.uid;
-       try { signOut(); } catch {}
-       if (step1.wipeLocal && uid) {
-         try { await wipeUserDB(uid); } catch {}
-         try { await trackEvent(EVENTS.LOGOUT_WITH_WIPE); } catch {}
-       } else {
-         try { await trackEvent(EVENTS.LOGOUT_NO_WIPE); } catch {}
-       }
-       const splash = renderLogoutSplash({ doc });
-       root.innerHTML = '';
-       if (splash) root.appendChild(splash);
-     });
+     btnLogout.addEventListener('click', async () => {});

[NoCoverage] ObjectLiteral
src/pages/settings.js:113:41
-       const step1 = await openLogoutStep1({ doc });
+       const step1 = await openLogoutStep1({});

[NoCoverage] BooleanLiteral
src/pages/settings.js:114:9
-       if (!step1.continue) return;
+       if (step1.continue) return;

[NoCoverage] ConditionalExpression
src/pages/settings.js:114:9
-       if (!step1.continue) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/settings.js:114:9
-       if (!step1.continue) return;
+       if (false) return;

[NoCoverage] ObjectLiteral
src/pages/settings.js:115:41
-       const step2 = await openLogoutStep2({ doc });
+       const step2 = await openLogoutStep2({});

[NoCoverage] BooleanLiteral
src/pages/settings.js:116:9
-       if (!step2.confirmed) return;
+       if (step2.confirmed) return;

[NoCoverage] ConditionalExpression
src/pages/settings.js:116:9
-       if (!step2.confirmed) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/settings.js:116:9
-       if (!step2.confirmed) return;
+       if (false) return;

[NoCoverage] OptionalChaining
src/pages/settings.js:118:17
-       const uid = auth?.uid;
+       const uid = auth.uid;

[NoCoverage] BlockStatement
src/pages/settings.js:119:9
-       try { signOut(); } catch {}
+       try {} catch {}

[NoCoverage] ConditionalExpression
src/pages/settings.js:120:9
-       if (step1.wipeLocal && uid) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/settings.js:120:9
-       if (step1.wipeLocal && uid) {
+       if (false) {

[NoCoverage] LogicalOperator
src/pages/settings.js:120:9
-       if (step1.wipeLocal && uid) {
+       if (step1.wipeLocal || uid) {

[NoCoverage] BlockStatement
src/pages/settings.js:120:33
-       if (step1.wipeLocal && uid) {
-         try { await wipeUserDB(uid); } catch {}
-         try { await trackEvent(EVENTS.LOGOUT_WITH_WIPE); } catch {}
-       } else {
+       if (step1.wipeLocal && uid) {} else {

[NoCoverage] BlockStatement
src/pages/settings.js:121:11
-         try { await wipeUserDB(uid); } catch {}
+         try {} catch {}

[NoCoverage] BlockStatement
src/pages/settings.js:122:11
-         try { await trackEvent(EVENTS.LOGOUT_WITH_WIPE); } catch {}
+         try {} catch {}

[NoCoverage] BlockStatement
src/pages/settings.js:123:12
-       } else {
-         try { await trackEvent(EVENTS.LOGOUT_NO_WIPE); } catch {}
-       }
+       } else {}

[NoCoverage] BlockStatement
src/pages/settings.js:124:11
-         try { await trackEvent(EVENTS.LOGOUT_NO_WIPE); } catch {}
+         try {} catch {}

[NoCoverage] ObjectLiteral
src/pages/settings.js:126:39
-       const splash = renderLogoutSplash({ doc });
+       const splash = renderLogoutSplash({});

[NoCoverage] ConditionalExpression
src/pages/settings.js:128:9
-       if (splash) root.appendChild(splash);
+       if (true) root.appendChild(splash);

[NoCoverage] ConditionalExpression
src/pages/settings.js:128:9
-       if (splash) root.appendChild(splash);
+       if (false) root.appendChild(splash);

[NoCoverage] BooleanLiteral
src/pages/weight.js:8:29
-   export let historyShowAll = false;
+   export let historyShowAll = true;

[NoCoverage] BlockStatement
src/pages/weight.js:14:24
-   export function initW(){
-     const ws=DB.get('weights')||{};
-     const logDate=getLogDate();
-     if(ws[logDate]){curW=ws[logDate];return;}
-     // Fall back to last known weight as starting point
-     const dates=Object.keys(ws).sort((a,b) => a.localeCompare(b));
-     if(dates.length) curW=ws[dates[dates.length-1]];
-   }
+   export function initW(){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:15:12
-     const ws=DB.get('weights')||{};
+     const ws=true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:15:12
-     const ws=DB.get('weights')||{};
+     const ws=false;

[NoCoverage] LogicalOperator
src/pages/weight.js:15:12
-     const ws=DB.get('weights')||{};
+     const ws=DB.get('weights') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:17:6
-     if(ws[logDate]){curW=ws[logDate];return;}
+     if(true){curW=ws[logDate];return;}

[NoCoverage] ConditionalExpression
src/pages/weight.js:17:6
-     if(ws[logDate]){curW=ws[logDate];return;}
+     if(false){curW=ws[logDate];return;}

[NoCoverage] BlockStatement
src/pages/weight.js:17:18
-     if(ws[logDate]){curW=ws[logDate];return;}
+     if(ws[logDate]){}

[NoCoverage] MethodExpression
src/pages/weight.js:19:15
-     const dates=Object.keys(ws).sort((a,b) => a.localeCompare(b));
+     const dates=Object.keys(ws);

[NoCoverage] ArrowFunction
src/pages/weight.js:19:36
-     const dates=Object.keys(ws).sort((a,b) => a.localeCompare(b));
+     const dates=Object.keys(ws).sort(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:20:6
-     if(dates.length) curW=ws[dates[dates.length-1]];
+     if(true) curW=ws[dates[dates.length-1]];

[NoCoverage] ConditionalExpression
src/pages/weight.js:20:6
-     if(dates.length) curW=ws[dates[dates.length-1]];
+     if(false) curW=ws[dates[dates.length-1]];

[NoCoverage] ArithmeticOperator
src/pages/weight.js:20:34
-     if(dates.length) curW=ws[dates[dates.length-1]];
+     if(dates.length) curW=ws[dates[dates.length + 1]];

[NoCoverage] BlockStatement
src/pages/weight.js:23:31
-   export function renderWeight(){
-     syncLogDateUI();
-     initW();initKcal();initProt();initWater();initSuppl();syncW();
-     // Check if weight already saved today
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),trend=getTrend();
-     const todayW=ws[getLogDate()];
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
-     else{unlockWeight();}
-     const tr=$('wtr2');
-     if(tr){
-       if(trend===null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
-       else{tr.className='wtr gd';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · ✅ Pe traseu`;}
-     }
-     renderUnifiedHistory();
-     renderSessionHistory();
-     renderDailyDropdown();
-     renderSessionsDropdown();
-     renderPhotos();
-     renderSleepEnergy();
-     checkSleepEnergyAlert();
-     renderChart();
-     renderSuppl();
-     checkClosedDay();
-   }
+   export function renderWeight(){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:27:12
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),trend=getTrend();
+     const ws=true,dates=Object.keys(ws).sort(),trend=getTrend();

[NoCoverage] ConditionalExpression
src/pages/weight.js:27:12
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),trend=getTrend();
+     const ws=false,dates=Object.keys(ws).sort(),trend=getTrend();

[NoCoverage] LogicalOperator
src/pages/weight.js:27:12
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),trend=getTrend();
+     const ws=DB.get('weights') && {},dates=Object.keys(ws).sort(),trend=getTrend();

[NoCoverage] MethodExpression
src/pages/weight.js:27:40
-     const ws=DB.get('weights')||{},dates=Object.keys(ws).sort(),trend=getTrend();
+     const ws=DB.get('weights')||{},dates=Object.keys(ws),trend=getTrend();

[NoCoverage] ConditionalExpression
src/pages/weight.js:29:6
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
+     if(true){lockWeight(todayW);}

[NoCoverage] ConditionalExpression
src/pages/weight.js:29:6
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
+     if(false){lockWeight(todayW);}

[NoCoverage] LogicalOperator
src/pages/weight.js:29:6
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
+     if(todayW || state.logDateOffset === 0){lockWeight(todayW);}

[NoCoverage] ConditionalExpression
src/pages/weight.js:29:14
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
+     if(todayW&&true){lockWeight(todayW);}

[NoCoverage] EqualityOperator
src/pages/weight.js:29:14
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
+     if(todayW&&state.logDateOffset !== 0){lockWeight(todayW);}

[NoCoverage] BlockStatement
src/pages/weight.js:29:39
-     if(todayW&&state.logDateOffset ===0){lockWeight(todayW);}
+     if(todayW&&state.logDateOffset ===0){}

[NoCoverage] BlockStatement
src/pages/weight.js:30:7
-     else{unlockWeight();}
+     else{}

[NoCoverage] ConditionalExpression
src/pages/weight.js:32:6
-     if(tr){
+     if(true){

[NoCoverage] ConditionalExpression
src/pages/weight.js:32:6
-     if(tr){
+     if(false){

[NoCoverage] BlockStatement
src/pages/weight.js:32:9
-     if(tr){
-       if(trend===null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
-       else{tr.className='wtr gd';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · ✅ Pe traseu`;}
-     }
+     if(tr){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:33:8
-       if(trend===null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}
+       if(true){tr.className='wtr nt';tr.textContent='— completează câteva zile';}

[NoCoverage] ConditionalExpression
src/pages/weight.js:33:8
-       if(trend===null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}
+       if(false){tr.className='wtr nt';tr.textContent='— completează câteva zile';}

[NoCoverage] EqualityOperator
src/pages/weight.js:33:8
-       if(trend===null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}
+       if(trend !== null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}

[NoCoverage] BlockStatement
src/pages/weight.js:33:21
-       if(trend===null){tr.className='wtr nt';tr.textContent='— completează câteva zile';}
+       if(trend===null){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:34:13
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
+       else if(true){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}

[NoCoverage] ConditionalExpression
src/pages/weight.js:34:13
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
+       else if(false){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}

[NoCoverage] EqualityOperator
src/pages/weight.js:34:13
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
+       else if(trend <= -1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}

[NoCoverage] EqualityOperator
src/pages/weight.js:34:13
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
+       else if(trend >= -1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}

[NoCoverage] UnaryOperator
src/pages/weight.js:34:19
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
+       else if(trend<+1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}

[NoCoverage] BlockStatement
src/pages/weight.js:34:24
-       else if(trend<-1.2){tr.className='wtr ft';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · Scade rapid → +150 kcal`;}
+       else if(trend<-1.2){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:35:13
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
+       else if(true){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}

[NoCoverage] ConditionalExpression
src/pages/weight.js:35:13
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
+       else if(false){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}

[NoCoverage] EqualityOperator
src/pages/weight.js:35:13
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
+       else if(trend >= 0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}

[NoCoverage] EqualityOperator
src/pages/weight.js:35:13
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
+       else if(trend <= 0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}

[NoCoverage] BlockStatement
src/pages/weight.js:35:21
-       else if(trend>0){tr.className='wtr sl';tr.innerHTML=`↑ ${trend.toFixed(2)} kg/7z · Probabil retenție apă — trendul pe 7 zile contează, nu ziua de azi`;}
+       else if(trend>0){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:36:13
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
+       else if(true){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}

[NoCoverage] ConditionalExpression
src/pages/weight.js:36:13
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
+       else if(false){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}

[NoCoverage] EqualityOperator
src/pages/weight.js:36:13
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
+       else if(trend >= -0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}

[NoCoverage] EqualityOperator
src/pages/weight.js:36:13
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
+       else if(trend <= -0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}

[NoCoverage] UnaryOperator
src/pages/weight.js:36:19
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
+       else if(trend>+0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}

[NoCoverage] BlockStatement
src/pages/weight.js:36:24
-       else if(trend>-0.3){tr.className='wtr sl';tr.innerHTML=`→ ${Math.abs(trend).toFixed(2)} kg/7z · Prea lent → −100 kcal`;}
+       else if(trend>-0.3){}

[NoCoverage] BlockStatement
src/pages/weight.js:37:9
-       else{tr.className='wtr gd';tr.innerHTML=`↓ ${Math.abs(trend).toFixed(2)} kg/7z · ✅ Pe traseu`;}
+       else{}

[NoCoverage] BlockStatement
src/pages/weight.js:51:24
-   export function saveW(){
-     const ws=DB.get('weights')||{};
-     ws[getLogDate()]=curW;DB.set('weights',ws);
-     const label=state.logDateOffset ===0?'azi':getLogDateLabel();
-     toast(`✓ Greutate salvată (${label})`,'var(--green)');
-     if(state.logDateOffset ===0) lockWeight(curW);
-     renderWeight();if(window.renderDash)window.renderDash();
-   }
+   export function saveW(){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:52:12
-     const ws=DB.get('weights')||{};
+     const ws=true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:52:12
-     const ws=DB.get('weights')||{};
+     const ws=false;

[NoCoverage] LogicalOperator
src/pages/weight.js:52:12
-     const ws=DB.get('weights')||{};
+     const ws=DB.get('weights') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:54:15
-     const label=state.logDateOffset ===0?'azi':getLogDateLabel();
+     const label=true?'azi':getLogDateLabel();

[NoCoverage] ConditionalExpression
src/pages/weight.js:54:15
-     const label=state.logDateOffset ===0?'azi':getLogDateLabel();
+     const label=false?'azi':getLogDateLabel();

[NoCoverage] EqualityOperator
src/pages/weight.js:54:15
-     const label=state.logDateOffset ===0?'azi':getLogDateLabel();
+     const label=state.logDateOffset !== 0?'azi':getLogDateLabel();

[NoCoverage] ConditionalExpression
src/pages/weight.js:56:6
-     if(state.logDateOffset ===0) lockWeight(curW);
+     if(true) lockWeight(curW);

[NoCoverage] ConditionalExpression
src/pages/weight.js:56:6
-     if(state.logDateOffset ===0) lockWeight(curW);
+     if(false) lockWeight(curW);

[NoCoverage] EqualityOperator
src/pages/weight.js:56:6
-     if(state.logDateOffset ===0) lockWeight(curW);
+     if(state.logDateOffset !== 0) lockWeight(curW);

[NoCoverage] ConditionalExpression
src/pages/weight.js:57:21
-     renderWeight();if(window.renderDash)window.renderDash();
+     renderWeight();if(true)window.renderDash();

[NoCoverage] ConditionalExpression
src/pages/weight.js:57:21
-     renderWeight();if(window.renderDash)window.renderDash();
+     renderWeight();if(false)window.renderDash();

[NoCoverage] BlockStatement
src/pages/weight.js:60:31
-   export function lockWeight(kg){
-     const saved=$('weight-saved-state'), edit=$('weight-edit-state');
-     const val=$('weight-saved-val');
-     if(saved){saved.style.display='flex';}
-     if(edit){edit.style.display='none';}
-     if(val){val.textContent=kg.toFixed(1)+' kg';}
-   }
+   export function lockWeight(kg){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:63:6
-     if(saved){saved.style.display='flex';}
+     if(true){saved.style.display='flex';}

[NoCoverage] ConditionalExpression
src/pages/weight.js:63:6
-     if(saved){saved.style.display='flex';}
+     if(false){saved.style.display='flex';}

[NoCoverage] BlockStatement
src/pages/weight.js:63:12
-     if(saved){saved.style.display='flex';}
+     if(saved){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:64:6
-     if(edit){edit.style.display='none';}
+     if(true){edit.style.display='none';}

[NoCoverage] ConditionalExpression
src/pages/weight.js:64:6
-     if(edit){edit.style.display='none';}
+     if(false){edit.style.display='none';}

[NoCoverage] BlockStatement
src/pages/weight.js:64:11
-     if(edit){edit.style.display='none';}
+     if(edit){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:65:6
-     if(val){val.textContent=kg.toFixed(1)+' kg';}
+     if(true){val.textContent=kg.toFixed(1)+' kg';}

[NoCoverage] ConditionalExpression
src/pages/weight.js:65:6
-     if(val){val.textContent=kg.toFixed(1)+' kg';}
+     if(false){val.textContent=kg.toFixed(1)+' kg';}

[NoCoverage] BlockStatement
src/pages/weight.js:65:10
-     if(val){val.textContent=kg.toFixed(1)+' kg';}
+     if(val){}

[NoCoverage] BlockStatement
src/pages/weight.js:68:31
-   export function unlockWeight(){
-     const saved=$('weight-saved-state'), edit=$('weight-edit-state');
-     if(saved){saved.style.display='none';}
-     if(edit){edit.style.display='block';}
-   }
+   export function unlockWeight(){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:70:6
-     if(saved){saved.style.display='none';}
+     if(true){saved.style.display='none';}

[NoCoverage] ConditionalExpression
src/pages/weight.js:70:6
-     if(saved){saved.style.display='none';}
+     if(false){saved.style.display='none';}

[NoCoverage] BlockStatement
src/pages/weight.js:70:12
-     if(saved){saved.style.display='none';}
+     if(saved){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:71:6
-     if(edit){edit.style.display='block';}
+     if(true){edit.style.display='block';}

[NoCoverage] ConditionalExpression
src/pages/weight.js:71:6
-     if(edit){edit.style.display='block';}
+     if(false){edit.style.display='block';}

[NoCoverage] BlockStatement
src/pages/weight.js:71:11
-     if(edit){edit.style.display='block';}
+     if(edit){}

[NoCoverage] BlockStatement
src/pages/weight.js:74:28
-   export function initKcal() {
-     const kcals = DB.get('kcals') || {};
-     const today = getLogDate();
-     const pilotActive = new Date() >= TARGET_DATE;
-     const sysTarget = pilotActive ? SYS.getKcalTarget() : KCAL_TARGET;
-     currentKcal = kcals[today] !== undefined ? kcals[today] : sysTarget;
-     // Don't auto-save default to storage — write only when user explicitly saves.
-     // Auto-saving 1800 contaminates history and prevents adminPrefill from showing real data.
-     syncKcalDisplay();
-     if (state.logDateOffset === 0) lockKcal(); else unlockKcal();
-     const noteEl = $('kcal-save-note');
-     if (noteEl) {
-       if (!pilotActive) {
-         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) / 86400000));
-         noteEl.textContent = `Target fix: ${KCAL_TARGET} kcal până pe 20 iulie (${daysLeft} zile)`;
-       } else {
-         noteEl.textContent = `🤖 Pilot activ · TDEE real: ${SYS.estimateTDEE()} kcal · ${SYS.getPhase()}`;
-         noteEl.style.color = 'var(--accent)';
-       }
-     }
-   }
+   export function initKcal() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:75:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:75:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:75:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:77:23
-     const pilotActive = new Date() >= TARGET_DATE;
+     const pilotActive = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:77:23
-     const pilotActive = new Date() >= TARGET_DATE;
+     const pilotActive = false;

[NoCoverage] EqualityOperator
src/pages/weight.js:77:23
-     const pilotActive = new Date() >= TARGET_DATE;
+     const pilotActive = new Date() > TARGET_DATE;

[NoCoverage] EqualityOperator
src/pages/weight.js:77:23
-     const pilotActive = new Date() >= TARGET_DATE;
+     const pilotActive = new Date() < TARGET_DATE;

[NoCoverage] ConditionalExpression
src/pages/weight.js:79:17
-     currentKcal = kcals[today] !== undefined ? kcals[today] : sysTarget;
+     currentKcal = true ? kcals[today] : sysTarget;

[NoCoverage] ConditionalExpression
src/pages/weight.js:79:17
-     currentKcal = kcals[today] !== undefined ? kcals[today] : sysTarget;
+     currentKcal = false ? kcals[today] : sysTarget;
