[NoCoverage] EqualityOperator
src/pages/weight.js:79:17
-     currentKcal = kcals[today] !== undefined ? kcals[today] : sysTarget;
+     currentKcal = kcals[today] === undefined ? kcals[today] : sysTarget;

[NoCoverage] ConditionalExpression
src/pages/weight.js:83:7
-     if (state.logDateOffset === 0) lockKcal(); else unlockKcal();
+     if (true) lockKcal(); else unlockKcal();

[NoCoverage] ConditionalExpression
src/pages/weight.js:83:7
-     if (state.logDateOffset === 0) lockKcal(); else unlockKcal();
+     if (false) lockKcal(); else unlockKcal();

[NoCoverage] EqualityOperator
src/pages/weight.js:83:7
-     if (state.logDateOffset === 0) lockKcal(); else unlockKcal();
+     if (state.logDateOffset !== 0) lockKcal(); else unlockKcal();

[NoCoverage] ConditionalExpression
src/pages/weight.js:85:7
-     if (noteEl) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:85:7
-     if (noteEl) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:85:15
-     if (noteEl) {
-       if (!pilotActive) {
-         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) / 86400000));
-         noteEl.textContent = `Target fix: ${KCAL_TARGET} kcal până pe 20 iulie (${daysLeft} zile)`;
-       } else {
-         noteEl.textContent = `🤖 Pilot activ · TDEE real: ${SYS.estimateTDEE()} kcal · ${SYS.getPhase()}`;
-         noteEl.style.color = 'var(--accent)';
-       }
-     }
+     if (noteEl) {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:86:9
-       if (!pilotActive) {
+       if (pilotActive) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:86:9
-       if (!pilotActive) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:86:9
-       if (!pilotActive) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:86:23
-       if (!pilotActive) {
-         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) / 86400000));
-         noteEl.textContent = `Target fix: ${KCAL_TARGET} kcal până pe 20 iulie (${daysLeft} zile)`;
-       } else {
+       if (!pilotActive) {} else {

[NoCoverage] MethodExpression
src/pages/weight.js:87:24
-         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) / 86400000));
+         const daysLeft = Math.min(0, Math.round((TARGET_DATE - new Date()) / 86400000));

[NoCoverage] ArithmeticOperator
src/pages/weight.js:87:47
-         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) / 86400000));
+         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) * 86400000));

[NoCoverage] ArithmeticOperator
src/pages/weight.js:87:48
-         const daysLeft = Math.max(0, Math.round((TARGET_DATE - new Date()) / 86400000));
+         const daysLeft = Math.max(0, Math.round((TARGET_DATE + new Date()) / 86400000));

[NoCoverage] BlockStatement
src/pages/weight.js:89:12
-       } else {
-         noteEl.textContent = `🤖 Pilot activ · TDEE real: ${SYS.estimateTDEE()} kcal · ${SYS.getPhase()}`;
-         noteEl.style.color = 'var(--accent)';
-       }
+       } else {}

[NoCoverage] BlockStatement
src/pages/weight.js:96:35
-   export function syncKcalDisplay() {
-     const el = $('kcal-today-display'); if(!el) return;
-     el.textContent = currentKcal;
-     const diff = currentKcal - KCAL_TARGET;
-     const dEl = $('kcal-diff-display');
-     if(dEl) {
-       if(diff === 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
-       else { dEl.textContent = `${diff} kcal`; dEl.style.color = 'var(--accent3)'; }
-     }
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
-   }
+   export function syncKcalDisplay() {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:97:42
-     const el = $('kcal-today-display'); if(!el) return;
+     const el = $('kcal-today-display'); if(el) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:97:42
-     const el = $('kcal-today-display'); if(!el) return;
+     const el = $('kcal-today-display'); if(true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:97:42
-     const el = $('kcal-today-display'); if(!el) return;
+     const el = $('kcal-today-display'); if(false) return;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:99:16
-     const diff = currentKcal - KCAL_TARGET;
+     const diff = currentKcal + KCAL_TARGET;

[NoCoverage] ConditionalExpression
src/pages/weight.js:101:6
-     if(dEl) {
+     if(true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:101:6
-     if(dEl) {
+     if(false) {

[NoCoverage] BlockStatement
src/pages/weight.js:101:11
-     if(dEl) {
-       if(diff === 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
-       else { dEl.textContent = `${diff} kcal`; dEl.style.color = 'var(--accent3)'; }
-     }
+     if(dEl) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:102:8
-       if(diff === 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }
+       if(true) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:102:8
-       if(diff === 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }
+       if(false) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:102:8
-       if(diff === 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }
+       if(diff !== 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }

[NoCoverage] BlockStatement
src/pages/weight.js:102:20
-       if(diff === 0) { dEl.textContent = '= target'; dEl.style.color = 'var(--green)'; }
+       if(diff === 0) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:103:13
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
+       else if(true) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:103:13
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
+       else if(false) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:103:13
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
+       else if(diff >= 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:103:13
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
+       else if(diff <= 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }

[NoCoverage] BlockStatement
src/pages/weight.js:103:23
-       else if(diff > 0) { dEl.textContent = `+${diff} kcal`; dEl.style.color = 'var(--accent2)'; }
+       else if(diff > 0) {}

[NoCoverage] BlockStatement
src/pages/weight.js:104:10
-       else { dEl.textContent = `${diff} kcal`; dEl.style.color = 'var(--accent3)'; }
+       else {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:106:20
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = true ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:106:20
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = false ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] EqualityOperator
src/pages/weight.js:106:20
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff >= 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] EqualityOperator
src/pages/weight.js:106:20
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff <= 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:106:52
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff > 200 ? 'var(--accent2)' : true ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:106:52
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff > 200 ? 'var(--accent2)' : false ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] EqualityOperator
src/pages/weight.js:106:52
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff > 200 ? 'var(--accent2)' : diff <= -200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] EqualityOperator
src/pages/weight.js:106:52
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff > 200 ? 'var(--accent2)' : diff >= -200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] UnaryOperator
src/pages/weight.js:106:59
-     el.style.color = diff > 200 ? 'var(--accent2)' : diff < -200 ? 'var(--accent3)' : 'var(--accent)';
+     el.style.color = diff > 200 ? 'var(--accent2)' : diff < +200 ? 'var(--accent3)' : 'var(--accent)';

[NoCoverage] BlockStatement
src/pages/weight.js:109:32
-   export function adjKcal(delta) {
-     currentKcal = Math.max(800, Math.min(5000, currentKcal + delta));
-     syncKcalDisplay();
-   }
+   export function adjKcal(delta) {}

[NoCoverage] MethodExpression
src/pages/weight.js:110:17
-     currentKcal = Math.max(800, Math.min(5000, currentKcal + delta));
+     currentKcal = Math.min(800, Math.min(5000, currentKcal + delta));

[NoCoverage] MethodExpression
src/pages/weight.js:110:31
-     currentKcal = Math.max(800, Math.min(5000, currentKcal + delta));
+     currentKcal = Math.max(800, Math.max(5000, currentKcal + delta));

[NoCoverage] ArithmeticOperator
src/pages/weight.js:110:46
-     currentKcal = Math.max(800, Math.min(5000, currentKcal + delta));
+     currentKcal = Math.max(800, Math.min(5000, currentKcal - delta));

[NoCoverage] BlockStatement
src/pages/weight.js:114:33
-   export function setKcalDirect() {
-     const v = parseInt($('kcal-direct-input')?.value);
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
-   }
+   export function setKcalDirect() {}

[NoCoverage] OptionalChaining
src/pages/weight.js:115:22
-     const v = parseInt($('kcal-direct-input')?.value);
+     const v = parseInt($('kcal-direct-input').value);

[NoCoverage] ConditionalExpression
src/pages/weight.js:116:7
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (true) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:116:7
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (false) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] LogicalOperator
src/pages/weight.js:116:7
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v > 500 || v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:116:7
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (true && v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] LogicalOperator
src/pages/weight.js:116:7
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) || v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] BooleanLiteral
src/pages/weight.js:116:7
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:116:20
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && true && v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:116:20
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v >= 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:116:20
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v <= 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:116:31
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v > 500 && true) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:116:31
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v > 500 && v <= 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:116:31
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v > 500 && v >= 6000) { currentKcal = v; syncKcalDisplay(); }

[NoCoverage] BlockStatement
src/pages/weight.js:116:41
-     if (!isNaN(v) && v > 500 && v < 6000) { currentKcal = v; syncKcalDisplay(); }
+     if (!isNaN(v) && v > 500 && v < 6000) {}

[NoCoverage] BlockStatement
src/pages/weight.js:119:28
-   export function saveKcal() {
-     const kcals = DB.get('kcals') || {};
-     kcals[getLogDate()] = currentKcal;
-     DB.set('kcals', kcals);
-     if(state.logDateOffset ===0) DB.set('current-kcal', currentKcal);
-     const diff = currentKcal - KCAL_TARGET;
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
-       diff > 200 ? 'var(--accent2)' : 'var(--accent)');
-     renderWeight();
-     if (state.logDateOffset === 0) lockKcal();
-   }
+   export function saveKcal() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:120:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:120:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:120:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:123:6
-     if(state.logDateOffset ===0) DB.set('current-kcal', currentKcal);
+     if(true) DB.set('current-kcal', currentKcal);

[NoCoverage] ConditionalExpression
src/pages/weight.js:123:6
-     if(state.logDateOffset ===0) DB.set('current-kcal', currentKcal);
+     if(false) DB.set('current-kcal', currentKcal);

[NoCoverage] EqualityOperator
src/pages/weight.js:123:6
-     if(state.logDateOffset ===0) DB.set('current-kcal', currentKcal);
+     if(state.logDateOffset !== 0) DB.set('current-kcal', currentKcal);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:124:16
-     const diff = currentKcal - KCAL_TARGET;
+     const diff = currentKcal + KCAL_TARGET;

[NoCoverage] ConditionalExpression
src/pages/weight.js:125:9
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(true ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] ConditionalExpression
src/pages/weight.js:125:9
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(false ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] EqualityOperator
src/pages/weight.js:125:9
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(diff !== 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] ConditionalExpression
src/pages/weight.js:125:55
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : true ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] ConditionalExpression
src/pages/weight.js:125:55
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : false ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] EqualityOperator
src/pages/weight.js:125:55
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff >= 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] EqualityOperator
src/pages/weight.js:125:55
-     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff > 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,
+     toast(diff === 0 ? `✓ ${KCAL_TARGET} kcal salvat` : diff <= 0 ? `✓ Salvat (+${diff} față de target)` : `✓ Salvat (${diff} față de target)`,

[NoCoverage] ConditionalExpression
src/pages/weight.js:126:5
-       diff > 200 ? 'var(--accent2)' : 'var(--accent)');
+       true ? 'var(--accent2)' : 'var(--accent)');

[NoCoverage] ConditionalExpression
src/pages/weight.js:126:5
-       diff > 200 ? 'var(--accent2)' : 'var(--accent)');
+       false ? 'var(--accent2)' : 'var(--accent)');

[NoCoverage] EqualityOperator
src/pages/weight.js:126:5
-       diff > 200 ? 'var(--accent2)' : 'var(--accent)');
+       diff >= 200 ? 'var(--accent2)' : 'var(--accent)');

[NoCoverage] EqualityOperator
src/pages/weight.js:126:5
-       diff > 200 ? 'var(--accent2)' : 'var(--accent)');
+       diff <= 200 ? 'var(--accent2)' : 'var(--accent)');

[NoCoverage] ConditionalExpression
src/pages/weight.js:128:7
-     if (state.logDateOffset === 0) lockKcal();
+     if (true) lockKcal();

[NoCoverage] ConditionalExpression
src/pages/weight.js:128:7
-     if (state.logDateOffset === 0) lockKcal();
+     if (false) lockKcal();

[NoCoverage] EqualityOperator
src/pages/weight.js:128:7
-     if (state.logDateOffset === 0) lockKcal();
+     if (state.logDateOffset !== 0) lockKcal();

[NoCoverage] BlockStatement
src/pages/weight.js:131:28
-   export function lockKcal() {
-     const btn=$('save-kcal-btn'), saved=$('kcal-saved-state');
-     if(btn) btn.style.display='none';
-     if(saved) saved.style.display='flex';
-   }
+   export function lockKcal() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:133:6
-     if(btn) btn.style.display='none';
+     if(true) btn.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:133:6
-     if(btn) btn.style.display='none';
+     if(false) btn.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:134:6
-     if(saved) saved.style.display='flex';
+     if(true) saved.style.display='flex';

[NoCoverage] ConditionalExpression
src/pages/weight.js:134:6
-     if(saved) saved.style.display='flex';
+     if(false) saved.style.display='flex';

[NoCoverage] BlockStatement
src/pages/weight.js:137:30
-   export function unlockKcal() {
-     const btn=$('save-kcal-btn'), saved=$('kcal-saved-state');
-     if(btn) btn.style.display='block';
-     if(saved) saved.style.display='none';
-   }
+   export function unlockKcal() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:139:6
-     if(btn) btn.style.display='block';
+     if(true) btn.style.display='block';

[NoCoverage] ConditionalExpression
src/pages/weight.js:139:6
-     if(btn) btn.style.display='block';
+     if(false) btn.style.display='block';

[NoCoverage] ConditionalExpression
src/pages/weight.js:140:6
-     if(saved) saved.style.display='none';
+     if(true) saved.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:140:6
-     if(saved) saved.style.display='none';
+     if(false) saved.style.display='none';

[NoCoverage] BlockStatement
src/pages/weight.js:143:37
-   export function renderKcalHistory() { renderUnifiedHistory(); }
+   export function renderKcalHistory() {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:146:39
-     const el = $('unified-history'); if(!el) return;
+     const el = $('unified-history'); if(el) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:146:39
-     const el = $('unified-history'); if(!el) return;
+     const el = $('unified-history'); if(true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:146:39
-     const el = $('unified-history'); if(!el) return;
+     const el = $('unified-history'); if(false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:147:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:147:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:147:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:148:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:148:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:148:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:149:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:149:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:149:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/weight.js:152:20
-     const allDates = [...new Set([
-       ...Object.keys(kcals),
-       ...Object.keys(prots),
-       ...Object.keys(ws)
-     ])].sort().reverse();
+     const allDates = [...new Set([...Object.keys(kcals), ...Object.keys(prots), ...Object.keys(ws)])].sort();

[NoCoverage] MethodExpression
src/pages/weight.js:152:20
-     const allDates = [...new Set([
-       ...Object.keys(kcals),
-       ...Object.keys(prots),
-       ...Object.keys(ws)
-     ])].sort().reverse();
+     const allDates = [...new Set([...Object.keys(kcals), ...Object.keys(prots), ...Object.keys(ws)])].reverse();

[NoCoverage] ArrayDeclaration
src/pages/weight.js:152:20
-     const allDates = [...new Set([
-       ...Object.keys(kcals),
-       ...Object.keys(prots),
-       ...Object.keys(ws)
-     ])].sort().reverse();
+     const allDates = [].sort().reverse();

[NoCoverage] ArrayDeclaration
src/pages/weight.js:152:32
-     const allDates = [...new Set([
-       ...Object.keys(kcals),
-       ...Object.keys(prots),
-       ...Object.keys(ws)
-     ])].sort().reverse();
+     const allDates = [...new Set([])].sort().reverse();

[NoCoverage] BooleanLiteral
src/pages/weight.js:158:7
-     if (!allDates.length) {
+     if (allDates.length) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:158:7
-     if (!allDates.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:158:7
-     if (!allDates.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:158:25
-     if (!allDates.length) {
-       el.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:12px;padding:24px 20px;text-align:center;margin:4px 0">
-         <div style="font-size:32px;margin-bottom:10px">📋</div>
-         <div style="font-size:14px;font-weight:700;color:var(--text);margin-bottom:6px">Nicio înregistrare</div>
-         <div style="font-size:12px;color:var(--text3);line-height:1.5">Loghează greutatea, kcal sau proteina pentru a vedea istoricul</div>
-       </div>`;
-       return;
-     }
+     if (!allDates.length) {}

[NoCoverage] MethodExpression
src/pages/weight.js:167:49
-     const showDates = historyShowAll ? allDates : allDates.slice(0, 7);
+     const showDates = historyShowAll ? allDates : allDates;

[NoCoverage] ConditionalExpression
src/pages/weight.js:179:21
-       const isToday = d === tod();
+       const isToday = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:179:21
-       const isToday = d === tod();
+       const isToday = false;

[NoCoverage] EqualityOperator
src/pages/weight.js:179:21
-       const isToday = d === tod();
+       const isToday = d !== tod();

[NoCoverage] ArithmeticOperator
src/pages/weight.js:185:31
-       const prevDate = allDates[i + 1];
+       const prevDate = allDates[i - 1];

[NoCoverage] ConditionalExpression
src/pages/weight.js:187:20
-       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) / 10 : null;
+       const wDiff = (true) ? Math.round((w - prevW) * 10) / 10 : null;

[NoCoverage] ConditionalExpression
src/pages/weight.js:187:20
-       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) / 10 : null;
+       const wDiff = (false) ? Math.round((w - prevW) * 10) / 10 : null;

[NoCoverage] LogicalOperator
src/pages/weight.js:187:20
-       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) / 10 : null;
+       const wDiff = (w || prevW) ? Math.round((w - prevW) * 10) / 10 : null;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:187:34
-       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) / 10 : null;
+       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) * 10 : null;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:187:45
-       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) / 10 : null;
+       const wDiff = (w && prevW) ? Math.round((w - prevW) / 10) / 10 : null;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:187:46
-       const wDiff = (w && prevW) ? Math.round((w - prevW) * 10) / 10 : null;
+       const wDiff = (w && prevW) ? Math.round((w + prevW) * 10) / 10 : null;

[NoCoverage] ConditionalExpression
src/pages/weight.js:188:22
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = true ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] ConditionalExpression
src/pages/weight.js:188:22
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = false ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] EqualityOperator
src/pages/weight.js:188:22
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = wDiff !== null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] ConditionalExpression
src/pages/weight.js:188:45
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = wDiff === null ? '' : (true ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] ConditionalExpression
src/pages/weight.js:188:45
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = wDiff === null ? '' : (false ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] EqualityOperator
src/pages/weight.js:188:45
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = wDiff === null ? '' : (wDiff >= 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] EqualityOperator
src/pages/weight.js:188:45
-       const wDiffStr = wDiff === null ? '' : (wDiff > 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));
+       const wDiffStr = wDiff === null ? '' : (wDiff <= 0 ? `+${wDiff.toFixed(1)}` : wDiff.toFixed(1));

[NoCoverage] ConditionalExpression
src/pages/weight.js:189:24
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = true ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:189:24
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = false ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:189:24
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff !== null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
