[NoCoverage] ConditionalExpression
src/pages/weight.js:189:46
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : true ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:189:46
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : false ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:189:46
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : wDiff <= 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:189:46
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : wDiff >= 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:189:75
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : true ? 'var(--red)' : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:189:75
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : false ? 'var(--red)' : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:189:75
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff >= 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:189:75
-       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff > 0 ? 'var(--red)' : 'var(--text3)';
+       const wDiffColor = wDiff === null ? '' : wDiff < 0 ? 'var(--green)' : wDiff <= 0 ? 'var(--red)' : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:193:19
-       const kdiff = k !== undefined ? k - kcalTarget : null;
+       const kdiff = true ? k - kcalTarget : null;

[NoCoverage] ConditionalExpression
src/pages/weight.js:193:19
-       const kdiff = k !== undefined ? k - kcalTarget : null;
+       const kdiff = false ? k - kcalTarget : null;

[NoCoverage] EqualityOperator
src/pages/weight.js:193:19
-       const kdiff = k !== undefined ? k - kcalTarget : null;
+       const kdiff = k === undefined ? k - kcalTarget : null;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:193:37
-       const kdiff = k !== undefined ? k - kcalTarget : null;
+       const kdiff = k !== undefined ? k + kcalTarget : null;

[NoCoverage] ConditionalExpression
src/pages/weight.js:194:16
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = true ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:194:16
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = false ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:194:16
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff !== null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:194:50
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : true ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:194:50
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : false ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:194:50
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff >= 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:194:50
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff <= 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:194:83
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : true ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:194:83
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : false ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:194:83
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff <= -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:194:83
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff >= -200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] UnaryOperator
src/pages/weight.js:194:91
-       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < -200 ? 'var(--accent3)' : 'var(--green)';
+       const kc = kdiff === null ? 'var(--text3)' : kdiff > 200 ? 'var(--accent2)' : kdiff < +200 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:197:16
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = true ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:197:16
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = false ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:197:16
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = p === undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:197:35
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = p !== undefined ? (true ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:197:35
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = p !== undefined ? (false ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:197:35
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = p !== undefined ? (p > PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:197:35
-       const pc = p !== undefined ? (p >= PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+       const pc = p !== undefined ? (p < PROT_TARGET ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:204:122
-         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${kc};text-align:right">${k !== undefined ? k : '<span style="color:var(--text3)">—</span>'}</span>
+         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${kc};text-align:right">${true ? k : '<span style="color:var(--text3)">—</span>'}</span>

[NoCoverage] ConditionalExpression
src/pages/weight.js:204:122
-         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${kc};text-align:right">${k !== undefined ? k : '<span style="color:var(--text3)">—</span>'}</span>
+         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${kc};text-align:right">${false ? k : '<span style="color:var(--text3)">—</span>'}</span>

[NoCoverage] EqualityOperator
src/pages/weight.js:204:122
-         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${kc};text-align:right">${k !== undefined ? k : '<span style="color:var(--text3)">—</span>'}</span>
+         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${kc};text-align:right">${k === undefined ? k : '<span style="color:var(--text3)">—</span>'}</span>

[NoCoverage] ConditionalExpression
src/pages/weight.js:205:122
-         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${pc};text-align:right">${p !== undefined ? p+'g' : '<span style="color:var(--text3)">—</span>'}</span>
+         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${pc};text-align:right">${true ? p+'g' : '<span style="color:var(--text3)">—</span>'}</span>

[NoCoverage] ConditionalExpression
src/pages/weight.js:205:122
-         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${pc};text-align:right">${p !== undefined ? p+'g' : '<span style="color:var(--text3)">—</span>'}</span>
+         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${pc};text-align:right">${false ? p+'g' : '<span style="color:var(--text3)">—</span>'}</span>

[NoCoverage] EqualityOperator
src/pages/weight.js:205:122
-         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${pc};text-align:right">${p !== undefined ? p+'g' : '<span style="color:var(--text3)">—</span>'}</span>
+         <span style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:${pc};text-align:right">${p === undefined ? p+'g' : '<span style="color:var(--text3)">—</span>'}</span>

[NoCoverage] ConditionalExpression
src/pages/weight.js:210:18
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = true

[NoCoverage] ConditionalExpression
src/pages/weight.js:210:18
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = false

[NoCoverage] LogicalOperator
src/pages/weight.js:210:18
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = !historyShowAll || allDates.length > 7

[NoCoverage] BooleanLiteral
src/pages/weight.js:210:18
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = historyShowAll && allDates.length > 7

[NoCoverage] ConditionalExpression
src/pages/weight.js:210:37
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = !historyShowAll && true

[NoCoverage] EqualityOperator
src/pages/weight.js:210:37
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = !historyShowAll && allDates.length >= 7

[NoCoverage] EqualityOperator
src/pages/weight.js:210:37
-     const footer = !historyShowAll && allDates.length > 7
+     const footer = !historyShowAll && allDates.length <= 7

[NoCoverage] ArithmeticOperator
src/pages/weight.js:211:94
-       ? `<div style="padding:10px 16px;text-align:center;color:var(--text3);font-size:11px">+${allDates.length - 7} zile mai vechi — apasă TOATE</div>`
+       ? `<div style="padding:10px 16px;text-align:center;color:var(--text3);font-size:11px">+${allDates.length + 7} zile mai vechi — apasă TOATE</div>`

[NoCoverage] ArithmeticOperator
src/pages/weight.js:214:18
-     el.innerHTML = header + rows + footer;
+     el.innerHTML = header + rows - footer;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:214:18
-     el.innerHTML = header + rows + footer;
+     el.innerHTML = header - rows + footer;

[NoCoverage] BlockStatement
src/pages/weight.js:217:36
-   export function toggleHistoryAll() {
-     historyShowAll = !historyShowAll;
-     const btn = $('hist-expand-btn');
-     if (btn) btn.textContent = historyShowAll ? 'RESTRÂNGE ▴' : 'TOATE ▾';
-     renderUnifiedHistory();
-   }
+   export function toggleHistoryAll() {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:218:20
-     historyShowAll = !historyShowAll;
+     historyShowAll = historyShowAll;

[NoCoverage] ConditionalExpression
src/pages/weight.js:220:7
-     if (btn) btn.textContent = historyShowAll ? 'RESTRÂNGE ▴' : 'TOATE ▾';
+     if (true) btn.textContent = historyShowAll ? 'RESTRÂNGE ▴' : 'TOATE ▾';

[NoCoverage] ConditionalExpression
src/pages/weight.js:220:7
-     if (btn) btn.textContent = historyShowAll ? 'RESTRÂNGE ▴' : 'TOATE ▾';
+     if (false) btn.textContent = historyShowAll ? 'RESTRÂNGE ▴' : 'TOATE ▾';

[NoCoverage] BlockStatement
src/pages/weight.js:224:47
-   export function getKcalTargetForDate(dateStr) {
-     // Citește phase-log pentru a ști ce target era activ în data respectivă
-     const phaseLogs = DB.get('phase-log') || []; // [{date, phase, kcalTarget}]
-     // Sortate desc — găsim primul log cu data <= dateStr
-     const sorted = [...phaseLogs].sort((a,b) => b.date.localeCompare(a.date));
-     const entry = sorted.find(e => e.date <= dateStr);
-     return entry ? entry.kcalTarget : KCAL_TARGET; // default CUT
-   }
+   export function getKcalTargetForDate(dateStr) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:226:21
-     const phaseLogs = DB.get('phase-log') || []; // [{date, phase, kcalTarget}]
+     const phaseLogs = true; // [{date, phase, kcalTarget}]

[NoCoverage] ConditionalExpression
src/pages/weight.js:226:21
-     const phaseLogs = DB.get('phase-log') || []; // [{date, phase, kcalTarget}]
+     const phaseLogs = false; // [{date, phase, kcalTarget}]

[NoCoverage] LogicalOperator
src/pages/weight.js:226:21
-     const phaseLogs = DB.get('phase-log') || []; // [{date, phase, kcalTarget}]
+     const phaseLogs = DB.get('phase-log') && []; // [{date, phase, kcalTarget}]

[NoCoverage] ArrayDeclaration
src/pages/weight.js:226:44
-     const phaseLogs = DB.get('phase-log') || []; // [{date, phase, kcalTarget}]
+     const phaseLogs = DB.get('phase-log') || ["Stryker was here"]; // [{date, phase, kcalTarget}]

[NoCoverage] MethodExpression
src/pages/weight.js:228:18
-     const sorted = [...phaseLogs].sort((a,b) => b.date.localeCompare(a.date));
+     const sorted = [...phaseLogs];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:228:18
-     const sorted = [...phaseLogs].sort((a,b) => b.date.localeCompare(a.date));
+     const sorted = [].sort((a,b) => b.date.localeCompare(a.date));

[NoCoverage] ArrowFunction
src/pages/weight.js:228:38
-     const sorted = [...phaseLogs].sort((a,b) => b.date.localeCompare(a.date));
+     const sorted = [...phaseLogs].sort(() => undefined);

[NoCoverage] ArrowFunction
src/pages/weight.js:229:29
-     const entry = sorted.find(e => e.date <= dateStr);
+     const entry = sorted.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:229:34
-     const entry = sorted.find(e => e.date <= dateStr);
+     const entry = sorted.find(e => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:229:34
-     const entry = sorted.find(e => e.date <= dateStr);
+     const entry = sorted.find(e => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:229:34
-     const entry = sorted.find(e => e.date <= dateStr);
+     const entry = sorted.find(e => e.date < dateStr);

[NoCoverage] EqualityOperator
src/pages/weight.js:229:34
-     const entry = sorted.find(e => e.date <= dateStr);
+     const entry = sorted.find(e => e.date > dateStr);

[NoCoverage] BlockStatement
src/pages/weight.js:233:28
-   export function initProt() {
-     const prots = DB.get('prots') || {};
-     const today = getLogDate();
-     currentProt = prots[today] !== undefined ? prots[today] : PROT_TARGET;
-     // Don't auto-save default to storage — same reason as initKcal.
-     syncProtDisplay();
-     if (state.logDateOffset === 0) lockProt(); else unlockProt();
-   }
+   export function initProt() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:234:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:234:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:234:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:236:17
-     currentProt = prots[today] !== undefined ? prots[today] : PROT_TARGET;
+     currentProt = true ? prots[today] : PROT_TARGET;

[NoCoverage] ConditionalExpression
src/pages/weight.js:236:17
-     currentProt = prots[today] !== undefined ? prots[today] : PROT_TARGET;
+     currentProt = false ? prots[today] : PROT_TARGET;

[NoCoverage] EqualityOperator
src/pages/weight.js:236:17
-     currentProt = prots[today] !== undefined ? prots[today] : PROT_TARGET;
+     currentProt = prots[today] === undefined ? prots[today] : PROT_TARGET;

[NoCoverage] ConditionalExpression
src/pages/weight.js:239:7
-     if (state.logDateOffset === 0) lockProt(); else unlockProt();
+     if (true) lockProt(); else unlockProt();

[NoCoverage] ConditionalExpression
src/pages/weight.js:239:7
-     if (state.logDateOffset === 0) lockProt(); else unlockProt();
+     if (false) lockProt(); else unlockProt();

[NoCoverage] EqualityOperator
src/pages/weight.js:239:7
-     if (state.logDateOffset === 0) lockProt(); else unlockProt();
+     if (state.logDateOffset !== 0) lockProt(); else unlockProt();

[NoCoverage] BlockStatement
src/pages/weight.js:242:35
-   export function syncProtDisplay() {
-     const el = $('prot-display'); if(!el) return;
-     const pct = Math.min(100, Math.round(currentProt / PROT_TARGET * 100));
-     el.textContent = currentProt;
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
-     const dEl = $('prot-diff-display');
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
-   }
+   export function syncProtDisplay() {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:243:36
-     const el = $('prot-display'); if(!el) return;
+     const el = $('prot-display'); if(el) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:243:36
-     const el = $('prot-display'); if(!el) return;
+     const el = $('prot-display'); if(true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:243:36
-     const el = $('prot-display'); if(!el) return;
+     const el = $('prot-display'); if(false) return;

[NoCoverage] MethodExpression
src/pages/weight.js:244:15
-     const pct = Math.min(100, Math.round(currentProt / PROT_TARGET * 100));
+     const pct = Math.max(100, Math.round(currentProt / PROT_TARGET * 100));

[NoCoverage] ArithmeticOperator
src/pages/weight.js:244:40
-     const pct = Math.min(100, Math.round(currentProt / PROT_TARGET * 100));
+     const pct = Math.min(100, Math.round(currentProt / PROT_TARGET / 100));

[NoCoverage] ArithmeticOperator
src/pages/weight.js:244:40
-     const pct = Math.min(100, Math.round(currentProt / PROT_TARGET * 100));
+     const pct = Math.min(100, Math.round(currentProt * PROT_TARGET * 100));

[NoCoverage] ConditionalExpression
src/pages/weight.js:246:33
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(true) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:246:33
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(false) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] BlockStatement
src/pages/weight.js:246:38
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:246:92
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = true ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:246:92
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = false ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:246:92
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct > 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:246:92
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct < 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:246:122
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : true ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:246:122
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : false ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:246:122
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct > 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] EqualityOperator
src/pages/weight.js:246:122
-     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)'; }
+     const bar = $('prot-bar'); if(bar) { bar.style.width = pct + '%'; bar.style.background = pct >= 100 ? 'var(--green)' : pct < 80 ? 'var(--accent)' : 'var(--accent2)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:247:20
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = true ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:247:20
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = false ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] EqualityOperator
src/pages/weight.js:247:20
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = pct > 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] EqualityOperator
src/pages/weight.js:247:20
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = pct < 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:247:50
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = pct >= 100 ? 'var(--green)' : true ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:247:50
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = pct >= 100 ? 'var(--green)' : false ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] EqualityOperator
src/pages/weight.js:247:50
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = pct >= 100 ? 'var(--green)' : pct > 80 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] EqualityOperator
src/pages/weight.js:247:50
-     el.style.color = pct >= 100 ? 'var(--green)' : pct >= 80 ? 'var(--accent)' : 'var(--accent2)';
+     el.style.color = pct >= 100 ? 'var(--green)' : pct < 80 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:249:6
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(true) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] ConditionalExpression
src/pages/weight.js:249:6
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(false) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] BlockStatement
src/pages/weight.js:249:11
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) {}

[NoCoverage] ArithmeticOperator
src/pages/weight.js:249:26
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt + PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
