[NoCoverage] ConditionalExpression
src/pages/weight.js:249:56
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt - PROT_TARGET; if(true) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] ConditionalExpression
src/pages/weight.js:249:56
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt - PROT_TARGET; if(false) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] EqualityOperator
src/pages/weight.js:249:56
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff > 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] EqualityOperator
src/pages/weight.js:249:56
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff < 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] BlockStatement
src/pages/weight.js:249:67
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) {} else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }

[NoCoverage] BlockStatement
src/pages/weight.js:249:141
-     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else { dEl.textContent = `${diff}g față de target`; dEl.style.color = 'var(--accent2)'; } }
+     if(dEl) { const diff = currentProt - PROT_TARGET; if(diff >= 0) { dEl.textContent = `✅ ${pct}%`; dEl.style.color = 'var(--green)'; } else {} }

[NoCoverage] BlockStatement
src/pages/weight.js:252:28
-   export function adjProt(d) { currentProt = Math.max(0, Math.min(500, currentProt + d)); syncProtDisplay(); }
+   export function adjProt(d) {}

[NoCoverage] MethodExpression
src/pages/weight.js:252:44
-   export function adjProt(d) { currentProt = Math.max(0, Math.min(500, currentProt + d)); syncProtDisplay(); }
+   export function adjProt(d) { currentProt = Math.min(0, Math.min(500, currentProt + d)); syncProtDisplay(); }

[NoCoverage] MethodExpression
src/pages/weight.js:252:56
-   export function adjProt(d) { currentProt = Math.max(0, Math.min(500, currentProt + d)); syncProtDisplay(); }
+   export function adjProt(d) { currentProt = Math.max(0, Math.max(500, currentProt + d)); syncProtDisplay(); }

[NoCoverage] ArithmeticOperator
src/pages/weight.js:252:70
-   export function adjProt(d) { currentProt = Math.max(0, Math.min(500, currentProt + d)); syncProtDisplay(); }
+   export function adjProt(d) { currentProt = Math.max(0, Math.min(500, currentProt - d)); syncProtDisplay(); }

[NoCoverage] BlockStatement
src/pages/weight.js:254:33
-   export function setProtDirect() {
-     const v = parseInt($('prot-input')?.value);
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
-   }
+   export function setProtDirect() {}

[NoCoverage] OptionalChaining
src/pages/weight.js:255:22
-     const v = parseInt($('prot-input')?.value);
+     const v = parseInt($('prot-input').value);

[NoCoverage] ConditionalExpression
src/pages/weight.js:256:7
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (true) { currentProt = v; syncProtDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:256:7
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (false) { currentProt = v; syncProtDisplay(); }

[NoCoverage] LogicalOperator
src/pages/weight.js:256:7
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v >= 0 || v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:256:7
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (true && v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] LogicalOperator
src/pages/weight.js:256:7
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) || v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] BooleanLiteral
src/pages/weight.js:256:7
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:256:20
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && true && v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:256:20
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v > 0 && v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:256:20
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v < 0 && v < 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] ConditionalExpression
src/pages/weight.js:256:30
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v >= 0 && true) { currentProt = v; syncProtDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:256:30
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v >= 0 && v <= 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] EqualityOperator
src/pages/weight.js:256:30
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v >= 0 && v >= 600) { currentProt = v; syncProtDisplay(); }

[NoCoverage] BlockStatement
src/pages/weight.js:256:39
-     if (!isNaN(v) && v >= 0 && v < 600) { currentProt = v; syncProtDisplay(); }
+     if (!isNaN(v) && v >= 0 && v < 600) {}

[NoCoverage] BlockStatement
src/pages/weight.js:259:28
-   export function saveProt() {
-     const prots = DB.get('prots') || {};
-     prots[getLogDate()] = currentProt; DB.set('prots', prots);
-     const ok = currentProt >= PROT_TARGET;
-     toast(ok ? `✓ ${currentProt}g ✅` : `✓ ${currentProt}g — mai ai ${PROT_TARGET - currentProt}g`, ok ? 'var(--green)' : 'var(--accent2)');
-     renderKcalHistory();
-     if (state.logDateOffset === 0) lockProt();
-   }
+   export function saveProt() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:260:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:260:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:260:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:262:14
-     const ok = currentProt >= PROT_TARGET;
+     const ok = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:262:14
-     const ok = currentProt >= PROT_TARGET;
+     const ok = false;

[NoCoverage] EqualityOperator
src/pages/weight.js:262:14
-     const ok = currentProt >= PROT_TARGET;
+     const ok = currentProt > PROT_TARGET;

[NoCoverage] EqualityOperator
src/pages/weight.js:262:14
-     const ok = currentProt >= PROT_TARGET;
+     const ok = currentProt < PROT_TARGET;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:263:68
-     toast(ok ? `✓ ${currentProt}g ✅` : `✓ ${currentProt}g — mai ai ${PROT_TARGET - currentProt}g`, ok ? 'var(--green)' : 'var(--accent2)');
+     toast(ok ? `✓ ${currentProt}g ✅` : `✓ ${currentProt}g — mai ai ${PROT_TARGET + currentProt}g`, ok ? 'var(--green)' : 'var(--accent2)');

[NoCoverage] ConditionalExpression
src/pages/weight.js:265:7
-     if (state.logDateOffset === 0) lockProt();
+     if (true) lockProt();

[NoCoverage] ConditionalExpression
src/pages/weight.js:265:7
-     if (state.logDateOffset === 0) lockProt();
+     if (false) lockProt();

[NoCoverage] EqualityOperator
src/pages/weight.js:265:7
-     if (state.logDateOffset === 0) lockProt();
+     if (state.logDateOffset !== 0) lockProt();

[NoCoverage] BlockStatement
src/pages/weight.js:268:28
-   export function lockProt() {
-     const btn=$('save-prot-btn'), saved=$('prot-saved-state');
-     if(btn) btn.style.display='none';
-     if(saved) saved.style.display='flex';
-   }
+   export function lockProt() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:270:6
-     if(btn) btn.style.display='none';
+     if(true) btn.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:270:6
-     if(btn) btn.style.display='none';
+     if(false) btn.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:271:6
-     if(saved) saved.style.display='flex';
+     if(true) saved.style.display='flex';

[NoCoverage] ConditionalExpression
src/pages/weight.js:271:6
-     if(saved) saved.style.display='flex';
+     if(false) saved.style.display='flex';

[NoCoverage] BlockStatement
src/pages/weight.js:274:30
-   export function unlockProt() {
-     const btn=$('save-prot-btn'), saved=$('prot-saved-state');
-     if(btn) btn.style.display='block';
-     if(saved) saved.style.display='none';
-   }
+   export function unlockProt() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:276:6
-     if(btn) btn.style.display='block';
+     if(true) btn.style.display='block';

[NoCoverage] ConditionalExpression
src/pages/weight.js:276:6
-     if(btn) btn.style.display='block';
+     if(false) btn.style.display='block';

[NoCoverage] ConditionalExpression
src/pages/weight.js:277:6
-     if(saved) saved.style.display='none';
+     if(true) saved.style.display='none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:277:6
-     if(saved) saved.style.display='none';
+     if(false) saved.style.display='none';

[NoCoverage] BlockStatement
src/pages/weight.js:280:29
-   export function exportCSV() {
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
-     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].sort();
-     let csv = 'DATA,GREUTATE(kg),KCAL,PROTEINA(g)\n';
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
-     csv += '\n\nDATA,EXERCITIU,GREUTATE(kg),REPS,RPE\n';
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
-     const blob = new Blob([csv], {type:'text/csv;charset=utf-8;'});
-     const url = URL.createObjectURL(blob);
-     const a = document.createElement('a'); a.href = url; a.download = `andura-${tod()}.csv`;
-     document.body.appendChild(a); a.click(); document.body.removeChild(a); URL.revokeObjectURL(url);
-     toast('✓ CSV exportat');
-   }
+   export function exportCSV() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:14
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = true, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:14
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = false, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];

[NoCoverage] LogicalOperator
src/pages/weight.js:281:14
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') && {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:47
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = true, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:47
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = false, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];

[NoCoverage] LogicalOperator
src/pages/weight.js:281:47
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') && {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:78
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = true, logs = DB.get('logs') || [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:78
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = false, logs = DB.get('logs') || [];

[NoCoverage] LogicalOperator
src/pages/weight.js:281:78
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') && {}, logs = DB.get('logs') || [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:108
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:281:108
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:281:108
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:281:126
-     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || [];
+     const ws = DB.get('weights') || {}, kcals = DB.get('kcals') || {}, prots = DB.get('prots') || {}, logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/weight.js:282:20
-     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].sort();
+     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:282:20
-     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].sort();
+     const allDates = [].sort();

[NoCoverage] ArrayDeclaration
src/pages/weight.js:282:32
-     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].sort();
+     const allDates = [...new Set([])].sort();

[NoCoverage] BlockStatement
src/pages/weight.js:284:25
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:284:42
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${true},${kcals[d]||''},${prots[d]||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:284:42
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${false},${kcals[d]||''},${prots[d]||''}\n`; });

[NoCoverage] LogicalOperator
src/pages/weight.js:284:42
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d] && ''},${kcals[d]||''},${prots[d]||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:284:55
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d]||''},${true},${prots[d]||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:284:55
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d]||''},${false},${prots[d]||''}\n`; });

[NoCoverage] LogicalOperator
src/pages/weight.js:284:55
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d] && ''},${prots[d]||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:284:71
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${true}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:284:71
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${false}\n`; });

[NoCoverage] LogicalOperator
src/pages/weight.js:284:71
-     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d]||''}\n`; });
+     allDates.forEach(d => { csv += `${d},${ws[d]||''},${kcals[d]||''},${prots[d] && ''}\n`; });

[NoCoverage] BlockStatement
src/pages/weight.js:286:21
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:286:53
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${true},${l.reps||''},${l.rpe||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:286:53
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${false},${l.reps||''},${l.rpe||''}\n`; });

[NoCoverage] LogicalOperator
src/pages/weight.js:286:53
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w && ''},${l.reps||''},${l.rpe||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:286:64
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${true},${l.rpe||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:286:64
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${false},${l.rpe||''}\n`; });

[NoCoverage] LogicalOperator
src/pages/weight.js:286:64
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps && ''},${l.rpe||''}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:286:78
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${true}\n`; });

[NoCoverage] ConditionalExpression
src/pages/weight.js:286:78
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${false}\n`; });

[NoCoverage] LogicalOperator
src/pages/weight.js:286:78
-     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe||''}\n`; });
+     logs.forEach(l => { csv += `${l.date},"${l.ex}",${l.w||''},${l.reps||''},${l.rpe && ''}\n`; });

[NoCoverage] ArrayDeclaration
src/pages/weight.js:287:25
-     const blob = new Blob([csv], {type:'text/csv;charset=utf-8;'});
+     const blob = new Blob([], {type:'text/csv;charset=utf-8;'});

[NoCoverage] ObjectLiteral
src/pages/weight.js:287:32
-     const blob = new Blob([csv], {type:'text/csv;charset=utf-8;'});
+     const blob = new Blob([csv], {});

[NoCoverage] BlockStatement
src/pages/weight.js:294:30
-   export function exportJSON() {
-     const keys = ['logs','weights','kcals','prots','waters','wellbeing',
-       'suppl-list','suppl-taken-v2','step-streaks','steps-today','closed-days',
-       'photos','onboarding-done','muted','bf-override','phase-override',
-       'current-kcal','aa-cooldown','phase-log'];
-     const data = {version: 'andura-v1', exported: new Date().toISOString()};
-     const allKeys = [];
-     for(let i=0; i<localStorage.length; i++) allKeys.push(localStorage.key(i));
-     allKeys.forEach(k => {
-       try { data[k] = JSON.parse(localStorage.getItem(k)); } catch(e) { data[k] = localStorage.getItem(k); }
-     });
-     const blob = new Blob([JSON.stringify(data, null, 2)], {type:'application/json'});
-     const url = URL.createObjectURL(blob);
-     const a = document.createElement('a');
-     a.href = url; a.download = `andura-backup-${tod()}.json`;
-     document.body.appendChild(a); a.click();
-     document.body.removeChild(a); URL.revokeObjectURL(url);
-     toast('✓ Backup exportat — trimite fișierul pe telefon', 'var(--green)');
-   }
+   export function exportJSON() {}

[NoCoverage] ArrayDeclaration
src/pages/weight.js:295:16
-     const keys = ['logs','weights','kcals','prots','waters','wellbeing',
-       'suppl-list','suppl-taken-v2','step-streaks','steps-today','closed-days',
-       'photos','onboarding-done','muted','bf-override','phase-override',
-       'current-kcal','aa-cooldown','phase-log'];
+     const keys = [];

[NoCoverage] ObjectLiteral
src/pages/weight.js:299:16
-     const data = {version: 'andura-v1', exported: new Date().toISOString()};
+     const data = {};

[NoCoverage] ArrayDeclaration
src/pages/weight.js:300:19
-     const allKeys = [];
+     const allKeys = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/weight.js:301:16
-     for(let i=0; i<localStorage.length; i++) allKeys.push(localStorage.key(i));
+     for(let i=0; false; i++) allKeys.push(localStorage.key(i));

[NoCoverage] EqualityOperator
src/pages/weight.js:301:16
-     for(let i=0; i<localStorage.length; i++) allKeys.push(localStorage.key(i));
+     for(let i=0; i <= localStorage.length; i++) allKeys.push(localStorage.key(i));

[NoCoverage] EqualityOperator
src/pages/weight.js:301:16
-     for(let i=0; i<localStorage.length; i++) allKeys.push(localStorage.key(i));
+     for(let i=0; i >= localStorage.length; i++) allKeys.push(localStorage.key(i));

[NoCoverage] UpdateOperator
src/pages/weight.js:301:39
-     for(let i=0; i<localStorage.length; i++) allKeys.push(localStorage.key(i));
+     for(let i=0; i<localStorage.length; i--) allKeys.push(localStorage.key(i));

[NoCoverage] BlockStatement
src/pages/weight.js:302:24
-     allKeys.forEach(k => {
-       try { data[k] = JSON.parse(localStorage.getItem(k)); } catch(e) { data[k] = localStorage.getItem(k); }
-     });
+     allKeys.forEach(k => {});

[NoCoverage] BlockStatement
src/pages/weight.js:303:9
-       try { data[k] = JSON.parse(localStorage.getItem(k)); } catch(e) { data[k] = localStorage.getItem(k); }
+       try {} catch(e) { data[k] = localStorage.getItem(k); }

[NoCoverage] BlockStatement
src/pages/weight.js:303:69
-       try { data[k] = JSON.parse(localStorage.getItem(k)); } catch(e) { data[k] = localStorage.getItem(k); }
+       try { data[k] = JSON.parse(localStorage.getItem(k)); } catch(e) {}

[NoCoverage] ArrayDeclaration
src/pages/weight.js:305:25
-     const blob = new Blob([JSON.stringify(data, null, 2)], {type:'application/json'});
+     const blob = new Blob([], {type:'application/json'});

[NoCoverage] ObjectLiteral
src/pages/weight.js:305:58
-     const blob = new Blob([JSON.stringify(data, null, 2)], {type:'application/json'});
+     const blob = new Blob([JSON.stringify(data, null, 2)], {});

[NoCoverage] BlockStatement
src/pages/weight.js:317:25
-     input.onchange = e => {
-       const file = e.target.files[0]; if(!file) return;
-       const reader = new FileReader();
-       reader.onload = ev => {
-         try {
-           const data = JSON.parse(ev.target.result);
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
-             toast('⚠ Fișier invalid', 'var(--red)'); return;
-           }
-           const skip = ['version','exported'];
-           let count = 0;
-           Object.keys(data).forEach(k => {
-             if(skip.includes(k)) return;
-             localStorage.setItem(k, JSON.stringify(data[k]));
-             count++;
-           });
-           toast(`✓ ${count} chei importate · Reîncarcă pagina`, 'var(--green)');
-           setTimeout(() => location.reload(), 1500);
-         } catch(err) {
-           toast('⚠ Eroare import: ' + err.message, 'var(--red)');
-         }
-       };
-       reader.readAsText(file);
-     };
+     input.onchange = e => {};

[NoCoverage] BooleanLiteral
src/pages/weight.js:318:40
-       const file = e.target.files[0]; if(!file) return;
+       const file = e.target.files[0]; if(file) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:318:40
-       const file = e.target.files[0]; if(!file) return;
+       const file = e.target.files[0]; if(true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:318:40
-       const file = e.target.files[0]; if(!file) return;
+       const file = e.target.files[0]; if(false) return;

[NoCoverage] BlockStatement
src/pages/weight.js:320:27
-       reader.onload = ev => {
-         try {
-           const data = JSON.parse(ev.target.result);
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
-             toast('⚠ Fișier invalid', 'var(--red)'); return;
-           }
-           const skip = ['version','exported'];
-           let count = 0;
-           Object.keys(data).forEach(k => {
-             if(skip.includes(k)) return;
-             localStorage.setItem(k, JSON.stringify(data[k]));
-             count++;
-           });
-           toast(`✓ ${count} chei importate · Reîncarcă pagina`, 'var(--green)');
-           setTimeout(() => location.reload(), 1500);
-         } catch(err) {
-           toast('⚠ Eroare import: ' + err.message, 'var(--red)');
-         }
-       };
+       reader.onload = ev => {};

[NoCoverage] BlockStatement
src/pages/weight.js:321:11
-         try {
-           const data = JSON.parse(ev.target.result);
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
-             toast('⚠ Fișier invalid', 'var(--red)'); return;
-           }
-           const skip = ['version','exported'];
-           let count = 0;
-           Object.keys(data).forEach(k => {
-             if(skip.includes(k)) return;
-             localStorage.setItem(k, JSON.stringify(data[k]));
-             count++;
-           });
-           toast(`✓ ${count} chei importate · Reîncarcă pagina`, 'var(--green)');
-           setTimeout(() => location.reload(), 1500);
-         } catch(err) {
+         try {} catch(err) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:323:12
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(true) {
