[NoCoverage] ConditionalExpression
src/pages/weight.js:323:12
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(false) {

[NoCoverage] LogicalOperator
src/pages/weight.js:323:12
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(!data.version && !data.version.includes('andura') && !data.version.includes('salafull')) {

[NoCoverage] BooleanLiteral
src/pages/weight.js:323:12
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:323:30
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(!data.version || (false)) {

[NoCoverage] LogicalOperator
src/pages/weight.js:323:30
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(!data.version || (!data.version.includes('andura') || !data.version.includes('salafull'))) {

[NoCoverage] BooleanLiteral
src/pages/weight.js:323:30
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(!data.version || (data.version.includes('andura') && !data.version.includes('salafull'))) {

[NoCoverage] BooleanLiteral
src/pages/weight.js:323:66
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
+           if(!data.version || (!data.version.includes('andura') && data.version.includes('salafull'))) {

[NoCoverage] BlockStatement
src/pages/weight.js:323:103
-           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {
-             toast('⚠ Fișier invalid', 'var(--red)'); return;
-           }
+           if(!data.version || (!data.version.includes('andura') && !data.version.includes('salafull'))) {}

[NoCoverage] ArrayDeclaration
src/pages/weight.js:326:22
-           const skip = ['version','exported'];
+           const skip = [];

[NoCoverage] BlockStatement
src/pages/weight.js:328:40
-           Object.keys(data).forEach(k => {
-             if(skip.includes(k)) return;
-             localStorage.setItem(k, JSON.stringify(data[k]));
-             count++;
-           });
+           Object.keys(data).forEach(k => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:329:14
-             if(skip.includes(k)) return;
+             if(true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:329:14
-             if(skip.includes(k)) return;
+             if(false) return;

[NoCoverage] UpdateOperator
src/pages/weight.js:331:11
-             count++;
+             count--;

[NoCoverage] ArrowFunction
src/pages/weight.js:334:20
-           setTimeout(() => location.reload(), 1500);
+           setTimeout(() => undefined, 1500);

[NoCoverage] BlockStatement
src/pages/weight.js:335:20
-         } catch(err) {
-           toast('⚠ Eroare import: ' + err.message, 'var(--red)');
-         }
+         } catch(err) {}

[NoCoverage] MethodExpression
src/pages/weight.js:346:17
-     const lines = text.split('\n').filter(l => l.trim());
+     const lines = text.split('\n');

[NoCoverage] ArrowFunction
src/pages/weight.js:346:41
-     const lines = text.split('\n').filter(l => l.trim());
+     const lines = text.split('\n').filter(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:346:46
-     const lines = text.split('\n').filter(l => l.trim());
+     const lines = text.split('\n').filter(l => l);

[NoCoverage] BooleanLiteral
src/pages/weight.js:347:7
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:347:7
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (true) { toast('⚠ CSV gol', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:347:7
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (false) { toast('⚠ CSV gol', 'var(--accent2)'); return; }

[NoCoverage] BlockStatement
src/pages/weight.js:347:22
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (!lines.length) {}

[NoCoverage] ArrowFunction
src/pages/weight.js:348:43
-     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g,'').toLowerCase());
+     const headers = lines[0].split(',').map(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:348:48
-     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g,'').toLowerCase());
+     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g, '').toUpperCase());

[NoCoverage] MethodExpression
src/pages/weight.js:348:48
-     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g,'').toLowerCase());
+     const headers = lines[0].split(',').map(h => h.replace(/"/g,'').toLowerCase());

[NoCoverage] ArrowFunction
src/pages/weight.js:349:37
-     const dateIdx = headers.findIndex(h => h.includes('date'));
+     const dateIdx = headers.findIndex(() => undefined);

[NoCoverage] ArrowFunction
src/pages/weight.js:350:37
-     const kcalIdx = headers.findIndex(h => h.includes('calori') || h.includes('kcal'));
+     const kcalIdx = headers.findIndex(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:350:42
-     const kcalIdx = headers.findIndex(h => h.includes('calori') || h.includes('kcal'));
+     const kcalIdx = headers.findIndex(h => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:350:42
-     const kcalIdx = headers.findIndex(h => h.includes('calori') || h.includes('kcal'));
+     const kcalIdx = headers.findIndex(h => false);

[NoCoverage] LogicalOperator
src/pages/weight.js:350:42
-     const kcalIdx = headers.findIndex(h => h.includes('calori') || h.includes('kcal'));
+     const kcalIdx = headers.findIndex(h => h.includes('calori') && h.includes('kcal'));

[NoCoverage] ArrowFunction
src/pages/weight.js:351:37
-     const protIdx = headers.findIndex(h => h.includes('protein'));
+     const protIdx = headers.findIndex(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:352:7
-     if (dateIdx === -1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }
+     if (true) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:352:7
-     if (dateIdx === -1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }
+     if (false) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }

[NoCoverage] EqualityOperator
src/pages/weight.js:352:7
-     if (dateIdx === -1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }
+     if (dateIdx !== -1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }

[NoCoverage] UnaryOperator
src/pages/weight.js:352:19
-     if (dateIdx === -1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }
+     if (dateIdx === +1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }

[NoCoverage] BlockStatement
src/pages/weight.js:352:23
-     if (dateIdx === -1) { toast('⚠ Nu am găsit coloana Date', 'var(--accent2)'); return; }
+     if (dateIdx === -1) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:354:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:354:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:354:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:355:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:355:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:355:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] MethodExpression
src/pages/weight.js:358:3
-     lines.slice(1).forEach(line => {
+     lines.forEach(line => {

[NoCoverage] BlockStatement
src/pages/weight.js:358:34
-     lines.slice(1).forEach(line => {
-       const parts = line.split(',').map(p => p.trim().replace(/"/g,''));
-       const rawDate = parts[dateIdx];
-       if (!rawDate) return;
-       // Parse date — MFP uses MM/DD/YYYY or YYYY-MM-DD
-       let dateStr = '';
-       if (rawDate.includes('/')) {
-         const [m,d,y] = rawDate.split('/');
-         dateStr = `${y}-${m.padStart(2,'0')}-${d.padStart(2,'0')}`;
-       } else {
-         dateStr = rawDate.slice(0,10);
-       }
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
-       if (kcalIdx !== -1) {
-         const v = parseInt(parts[kcalIdx]);
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
-       }
-       if (protIdx !== -1) {
-         const v = parseInt(parts[protIdx]);
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
-       }
-     });
+     lines.slice(1).forEach(line => {});

[NoCoverage] ArrowFunction
src/pages/weight.js:359:39
-       const parts = line.split(',').map(p => p.trim().replace(/"/g,''));
+       const parts = line.split(',').map(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:359:44
-       const parts = line.split(',').map(p => p.trim().replace(/"/g,''));
+       const parts = line.split(',').map(p => p.replace(/"/g,''));

[NoCoverage] BooleanLiteral
src/pages/weight.js:361:9
-       if (!rawDate) return;
+       if (rawDate) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:361:9
-       if (!rawDate) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:361:9
-       if (!rawDate) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:364:9
-       if (rawDate.includes('/')) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:364:9
-       if (rawDate.includes('/')) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:364:32
-       if (rawDate.includes('/')) {
-         const [m,d,y] = rawDate.split('/');
-         dateStr = `${y}-${m.padStart(2,'0')}-${d.padStart(2,'0')}`;
-       } else {
+       if (rawDate.includes('/')) {} else {

[NoCoverage] BlockStatement
src/pages/weight.js:367:12
-       } else {
-         dateStr = rawDate.slice(0,10);
-       }
+       } else {}

[NoCoverage] MethodExpression
src/pages/weight.js:368:17
-         dateStr = rawDate.slice(0,10);
+         dateStr = rawDate;

[NoCoverage] BooleanLiteral
src/pages/weight.js:370:9
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:370:9
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:370:9
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (false) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d{2}-\d{2}/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\D{4}-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\D{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d{2}-\d$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:370:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d{2}-\D{2}$/.test(dateStr)) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:371:9
-       if (kcalIdx !== -1) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:371:9
-       if (kcalIdx !== -1) {
+       if (false) {

[NoCoverage] EqualityOperator
src/pages/weight.js:371:9
-       if (kcalIdx !== -1) {
+       if (kcalIdx === -1) {

[NoCoverage] UnaryOperator
src/pages/weight.js:371:21
-       if (kcalIdx !== -1) {
+       if (kcalIdx !== +1) {

[NoCoverage] BlockStatement
src/pages/weight.js:371:25
-       if (kcalIdx !== -1) {
-         const v = parseInt(parts[kcalIdx]);
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
-       }
+       if (kcalIdx !== -1) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:373:11
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (true) { kcals[dateStr] = v; countK++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:373:11
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (false) { kcals[dateStr] = v; countK++; }

[NoCoverage] LogicalOperator
src/pages/weight.js:373:11
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (!isNaN(v) || v > 0) { kcals[dateStr] = v; countK++; }

[NoCoverage] BooleanLiteral
src/pages/weight.js:373:11
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:373:24
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (!isNaN(v) && true) { kcals[dateStr] = v; countK++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:373:24
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (!isNaN(v) && v >= 0) { kcals[dateStr] = v; countK++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:373:24
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (!isNaN(v) && v <= 0) { kcals[dateStr] = v; countK++; }

[NoCoverage] BlockStatement
src/pages/weight.js:373:31
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (!isNaN(v) && v > 0) {}

[NoCoverage] UpdateOperator
src/pages/weight.js:373:53
-         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK++; }
+         if (!isNaN(v) && v > 0) { kcals[dateStr] = v; countK--; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:375:9
-       if (protIdx !== -1) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:375:9
-       if (protIdx !== -1) {
+       if (false) {

[NoCoverage] EqualityOperator
src/pages/weight.js:375:9
-       if (protIdx !== -1) {
+       if (protIdx === -1) {

[NoCoverage] UnaryOperator
src/pages/weight.js:375:21
-       if (protIdx !== -1) {
+       if (protIdx !== +1) {

[NoCoverage] BlockStatement
src/pages/weight.js:375:25
-       if (protIdx !== -1) {
-         const v = parseInt(parts[protIdx]);
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
-       }
+       if (protIdx !== -1) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:377:11
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (true) { prots[dateStr] = v; countP++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:377:11
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (false) { prots[dateStr] = v; countP++; }

[NoCoverage] LogicalOperator
src/pages/weight.js:377:11
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (!isNaN(v) || v >= 0) { prots[dateStr] = v; countP++; }

[NoCoverage] BooleanLiteral
src/pages/weight.js:377:11
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:377:24
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (!isNaN(v) && true) { prots[dateStr] = v; countP++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:377:24
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (!isNaN(v) && v > 0) { prots[dateStr] = v; countP++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:377:24
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (!isNaN(v) && v < 0) { prots[dateStr] = v; countP++; }

[NoCoverage] BlockStatement
src/pages/weight.js:377:32
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (!isNaN(v) && v >= 0) {}

[NoCoverage] UpdateOperator
src/pages/weight.js:377:54
-         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP++; }
+         if (!isNaN(v) && v >= 0) { prots[dateStr] = v; countP--; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:381:7
-     if (kcalIdx !== -1) DB.set('kcals', kcals);
+     if (true) DB.set('kcals', kcals);

[NoCoverage] ConditionalExpression
src/pages/weight.js:381:7
-     if (kcalIdx !== -1) DB.set('kcals', kcals);
+     if (false) DB.set('kcals', kcals);

[NoCoverage] EqualityOperator
src/pages/weight.js:381:7
-     if (kcalIdx !== -1) DB.set('kcals', kcals);
+     if (kcalIdx === -1) DB.set('kcals', kcals);

[NoCoverage] UnaryOperator
src/pages/weight.js:381:19
-     if (kcalIdx !== -1) DB.set('kcals', kcals);
+     if (kcalIdx !== +1) DB.set('kcals', kcals);

[NoCoverage] ConditionalExpression
src/pages/weight.js:382:7
-     if (protIdx !== -1) DB.set('prots', prots);
+     if (true) DB.set('prots', prots);

[NoCoverage] ConditionalExpression
src/pages/weight.js:382:7
-     if (protIdx !== -1) DB.set('prots', prots);
+     if (false) DB.set('prots', prots);

[NoCoverage] EqualityOperator
src/pages/weight.js:382:7
-     if (protIdx !== -1) DB.set('prots', prots);
+     if (protIdx === -1) DB.set('prots', prots);

[NoCoverage] UnaryOperator
src/pages/weight.js:382:19
-     if (protIdx !== -1) DB.set('prots', prots);
+     if (protIdx !== +1) DB.set('prots', prots);

[NoCoverage] ConditionalExpression
src/pages/weight.js:385:7
-     if (window.renderDash) window.renderDash();
+     if (true) window.renderDash();

[NoCoverage] ConditionalExpression
src/pages/weight.js:385:7
-     if (window.renderDash) window.renderDash();
+     if (false) window.renderDash();

[NoCoverage] MethodExpression
src/pages/weight.js:390:17
-     const lines = text.split('\n').filter(l => l.trim());
+     const lines = text.split('\n');

[NoCoverage] ArrowFunction
src/pages/weight.js:390:41
-     const lines = text.split('\n').filter(l => l.trim());
+     const lines = text.split('\n').filter(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:390:46
-     const lines = text.split('\n').filter(l => l.trim());
+     const lines = text.split('\n').filter(l => l);

[NoCoverage] BooleanLiteral
src/pages/weight.js:391:7
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:391:7
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (true) { toast('⚠ CSV gol', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:391:7
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (false) { toast('⚠ CSV gol', 'var(--accent2)'); return; }

[NoCoverage] BlockStatement
src/pages/weight.js:391:22
-     if (!lines.length) { toast('⚠ CSV gol', 'var(--accent2)'); return; }
+     if (!lines.length) {}

[NoCoverage] ArrowFunction
src/pages/weight.js:392:43
-     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g,'').toLowerCase());
+     const headers = lines[0].split(',').map(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:392:48
-     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g,'').toLowerCase());
+     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g, '').toUpperCase());

[NoCoverage] MethodExpression
src/pages/weight.js:392:48
-     const headers = lines[0].split(',').map(h => h.trim().replace(/"/g,'').toLowerCase());
+     const headers = lines[0].split(',').map(h => h.replace(/"/g,'').toLowerCase());

[NoCoverage] ArrowFunction
src/pages/weight.js:393:37
-     const dateIdx = headers.findIndex(h => h.includes('date'));
+     const dateIdx = headers.findIndex(() => undefined);

[NoCoverage] ArrowFunction
src/pages/weight.js:394:36
-     const valIdx = headers.findIndex(h => h.includes('value') || h.includes('weight'));
+     const valIdx = headers.findIndex(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:394:41
-     const valIdx = headers.findIndex(h => h.includes('value') || h.includes('weight'));
+     const valIdx = headers.findIndex(h => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:394:41
-     const valIdx = headers.findIndex(h => h.includes('value') || h.includes('weight'));
+     const valIdx = headers.findIndex(h => false);

[NoCoverage] LogicalOperator
src/pages/weight.js:394:41
-     const valIdx = headers.findIndex(h => h.includes('value') || h.includes('weight'));
+     const valIdx = headers.findIndex(h => h.includes('value') && h.includes('weight'));

[NoCoverage] ConditionalExpression
src/pages/weight.js:395:7
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (true) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:395:7
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (false) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] LogicalOperator
src/pages/weight.js:395:7
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx === -1 && valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:395:7
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (false || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] EqualityOperator
src/pages/weight.js:395:7
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx !== -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] UnaryOperator
src/pages/weight.js:395:19
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx === +1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:395:25
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx === -1 || false) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] EqualityOperator
src/pages/weight.js:395:25
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx === -1 || valIdx !== -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] UnaryOperator
src/pages/weight.js:395:36
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx === -1 || valIdx === +1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }

[NoCoverage] BlockStatement
src/pages/weight.js:395:40
-     if (dateIdx === -1 || valIdx === -1) { toast('⚠ Format CSV invalid', 'var(--accent2)'); return; }
+     if (dateIdx === -1 || valIdx === -1) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:397:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:397:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:397:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/weight.js:399:3
-     lines.slice(1).forEach(line => {
+     lines.forEach(line => {

[NoCoverage] BlockStatement
src/pages/weight.js:399:34
-     lines.slice(1).forEach(line => {
-       const parts = line.split(',').map(p => p.trim().replace(/"/g,''));
-       const rawDate = parts[dateIdx];
-       const rawVal = parts[valIdx];
-       if (!rawDate || !rawVal) return;
-       let dateStr = '';
-       if (rawDate.includes('/')) {
-         const [m,d,y] = rawDate.split('/');
-         dateStr = `${y}-${m.padStart(2,'0')}-${d.padStart(2,'0')}`;
-       } else {
-         dateStr = rawDate.slice(0,10);
-       }
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
-       const v = parseFloat(rawVal);
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
-     });
+     lines.slice(1).forEach(line => {});

[NoCoverage] ArrowFunction
src/pages/weight.js:400:39
-       const parts = line.split(',').map(p => p.trim().replace(/"/g,''));
+       const parts = line.split(',').map(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:400:44
-       const parts = line.split(',').map(p => p.trim().replace(/"/g,''));
+       const parts = line.split(',').map(p => p.replace(/"/g,''));

[NoCoverage] ConditionalExpression
src/pages/weight.js:403:9
-       if (!rawDate || !rawVal) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:403:9
-       if (!rawDate || !rawVal) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/pages/weight.js:403:9
-       if (!rawDate || !rawVal) return;
+       if (!rawDate && !rawVal) return;

[NoCoverage] BooleanLiteral
src/pages/weight.js:403:9
-       if (!rawDate || !rawVal) return;
+       if (rawDate || !rawVal) return;

[NoCoverage] BooleanLiteral
src/pages/weight.js:403:21
-       if (!rawDate || !rawVal) return;
+       if (!rawDate || rawVal) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:405:9
-       if (rawDate.includes('/')) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:405:9
-       if (rawDate.includes('/')) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:405:32
-       if (rawDate.includes('/')) {
-         const [m,d,y] = rawDate.split('/');
-         dateStr = `${y}-${m.padStart(2,'0')}-${d.padStart(2,'0')}`;
-       } else {
+       if (rawDate.includes('/')) {} else {

[NoCoverage] BlockStatement
src/pages/weight.js:408:12
-       } else {
-         dateStr = rawDate.slice(0,10);
-       }
+       } else {}

[NoCoverage] MethodExpression
src/pages/weight.js:409:17
-         dateStr = rawDate.slice(0,10);
+         dateStr = rawDate;

[NoCoverage] BooleanLiteral
src/pages/weight.js:411:9
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:411:9
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:411:9
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (false) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d{2}-\d{2}/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\D{4}-\d{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\D{2}-\d{2}$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d{2}-\d$/.test(dateStr)) return;

[NoCoverage] Regex
src/pages/weight.js:411:10
-       if (!/^\d{4}-\d{2}-\d{2}$/.test(dateStr)) return;
+       if (!/^\d{4}-\d{2}-\D{2}$/.test(dateStr)) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:413:9
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (true) { ws[dateStr] = v; count++; }
