[NoCoverage] ConditionalExpression
src/pages/weight.js:413:9
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (false) { ws[dateStr] = v; count++; }

[NoCoverage] LogicalOperator
src/pages/weight.js:413:9
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v > 30 || v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:413:9
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (true && v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] LogicalOperator
src/pages/weight.js:413:9
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) || v > 30 && v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] BooleanLiteral
src/pages/weight.js:413:9
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:413:22
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && true && v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:413:22
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v >= 30 && v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:413:22
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v <= 30 && v < 300) { ws[dateStr] = v; count++; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:413:32
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v > 30 && true) { ws[dateStr] = v; count++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:413:32
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v > 30 && v <= 300) { ws[dateStr] = v; count++; }

[NoCoverage] EqualityOperator
src/pages/weight.js:413:32
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v > 30 && v >= 300) { ws[dateStr] = v; count++; }

[NoCoverage] BlockStatement
src/pages/weight.js:413:41
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v > 30 && v < 300) {}

[NoCoverage] UpdateOperator
src/pages/weight.js:413:60
-       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count++; }
+       if (!isNaN(v) && v > 30 && v < 300) { ws[dateStr] = v; count--; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:419:7
-     if (window.renderDash) window.renderDash();
+     if (true) window.renderDash();

[NoCoverage] ConditionalExpression
src/pages/weight.js:419:7
-     if (window.renderDash) window.renderDash();
+     if (false) window.renderDash();

[NoCoverage] BlockStatement
src/pages/weight.js:422:35
-   async function importMFPZip(file) {
-     // ZIP import requires JSZip — not available, show informative message
-     toast('⚠ Import ZIP: folosește CSV individual din MFP Export', 'var(--accent2)');
-   }
+   async function importMFPZip(file) {}

[NoCoverage] BlockStatement
src/pages/weight.js:427:35
-   export function triggerMFPImport(){
-     const input = document.createElement('input');
-     input.type = 'file';
-     input.accept = '.zip,.csv';
-     input.onchange = async (e) => {
-       const file = e.target.files[0];
-       if(!file) return;
-       toast('⏳ Se procesează...', 'var(--accent)');
-       try {
-         if(file.name.endsWith('.zip')) {
-           await importMFPZip(file);
-         } else if(file.name.toLowerCase().includes('nutrition')) {
-           await importMFPNutritionCSV(await file.text());
-         } else if(file.name.toLowerCase().includes('measurement')) {
-           await importMFPMeasurementCSV(await file.text());
-         } else {
-           // Try as nutrition CSV generically
-           await importMFPNutritionCSV(await file.text());
-         }
-       } catch(err) {
-         toast('⚠ Eroare la import: ' + err.message, 'var(--accent2)');
-       }
-     };
-     input.click();
-   }
+   export function triggerMFPImport(){}

[NoCoverage] BlockStatement
src/pages/weight.js:431:33
-     input.onchange = async (e) => {
-       const file = e.target.files[0];
-       if(!file) return;
-       toast('⏳ Se procesează...', 'var(--accent)');
-       try {
-         if(file.name.endsWith('.zip')) {
-           await importMFPZip(file);
-         } else if(file.name.toLowerCase().includes('nutrition')) {
-           await importMFPNutritionCSV(await file.text());
-         } else if(file.name.toLowerCase().includes('measurement')) {
-           await importMFPMeasurementCSV(await file.text());
-         } else {
-           // Try as nutrition CSV generically
-           await importMFPNutritionCSV(await file.text());
-         }
-       } catch(err) {
-         toast('⚠ Eroare la import: ' + err.message, 'var(--accent2)');
-       }
-     };
+     input.onchange = async (e) => {};

[NoCoverage] BooleanLiteral
src/pages/weight.js:433:8
-       if(!file) return;
+       if(file) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:433:8
-       if(!file) return;
+       if(true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:433:8
-       if(!file) return;
+       if(false) return;

[NoCoverage] BlockStatement
src/pages/weight.js:435:9
-       try {
-         if(file.name.endsWith('.zip')) {
-           await importMFPZip(file);
-         } else if(file.name.toLowerCase().includes('nutrition')) {
-           await importMFPNutritionCSV(await file.text());
-         } else if(file.name.toLowerCase().includes('measurement')) {
-           await importMFPMeasurementCSV(await file.text());
-         } else {
-           // Try as nutrition CSV generically
-           await importMFPNutritionCSV(await file.text());
-         }
-       } catch(err) {
+       try {} catch(err) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:436:10
-         if(file.name.endsWith('.zip')) {
+         if(true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:436:10
-         if(file.name.endsWith('.zip')) {
+         if(false) {

[NoCoverage] MethodExpression
src/pages/weight.js:436:10
-         if(file.name.endsWith('.zip')) {
+         if(file.name.startsWith('.zip')) {

[NoCoverage] BlockStatement
src/pages/weight.js:436:38
-         if(file.name.endsWith('.zip')) {
-           await importMFPZip(file);
-         } else if(file.name.toLowerCase().includes('nutrition')) {
+         if(file.name.endsWith('.zip')) {} else if(file.name.toLowerCase().includes('nutrition')) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:438:17
-         } else if(file.name.toLowerCase().includes('nutrition')) {
+         } else if(true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:438:17
-         } else if(file.name.toLowerCase().includes('nutrition')) {
+         } else if(false) {

[NoCoverage] MethodExpression
src/pages/weight.js:438:17
-         } else if(file.name.toLowerCase().includes('nutrition')) {
+         } else if(file.name.toUpperCase().includes('nutrition')) {

[NoCoverage] BlockStatement
src/pages/weight.js:438:64
-         } else if(file.name.toLowerCase().includes('nutrition')) {
-           await importMFPNutritionCSV(await file.text());
-         } else if(file.name.toLowerCase().includes('measurement')) {
+         } else if(file.name.toLowerCase().includes('nutrition')) {} else if(file.name.toLowerCase().includes('measurement')) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:440:17
-         } else if(file.name.toLowerCase().includes('measurement')) {
+         } else if(true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:440:17
-         } else if(file.name.toLowerCase().includes('measurement')) {
+         } else if(false) {

[NoCoverage] MethodExpression
src/pages/weight.js:440:17
-         } else if(file.name.toLowerCase().includes('measurement')) {
+         } else if(file.name.toUpperCase().includes('measurement')) {

[NoCoverage] BlockStatement
src/pages/weight.js:440:66
-         } else if(file.name.toLowerCase().includes('measurement')) {
-           await importMFPMeasurementCSV(await file.text());
-         } else {
+         } else if(file.name.toLowerCase().includes('measurement')) {} else {

[NoCoverage] BlockStatement
src/pages/weight.js:442:14
-         } else {
-           // Try as nutrition CSV generically
-           await importMFPNutritionCSV(await file.text());
-         }
+         } else {}

[NoCoverage] BlockStatement
src/pages/weight.js:446:18
-       } catch(err) {
-         toast('⚠ Eroare la import: ' + err.message, 'var(--accent2)');
-       }
+       } catch(err) {}

[NoCoverage] BlockStatement
src/pages/weight.js:453:37
-   export function shiftLogDate(delta) {
-     const newOffset = state.logDateOffset + delta;
-     if (newOffset > 0) return; // can't log future
-     if (newOffset < -30) return; // max 30 days back
-     state.logDateOffset = newOffset;
-     syncLogDateUI();
-     renderWeight();
-   }
+   export function shiftLogDate(delta) {}

[NoCoverage] ArithmeticOperator
src/pages/weight.js:454:21
-     const newOffset = state.logDateOffset + delta;
+     const newOffset = state.logDateOffset - delta;

[NoCoverage] ConditionalExpression
src/pages/weight.js:455:7
-     if (newOffset > 0) return; // can't log future
+     if (true) return; // can't log future

[NoCoverage] ConditionalExpression
src/pages/weight.js:455:7
-     if (newOffset > 0) return; // can't log future
+     if (false) return; // can't log future

[NoCoverage] EqualityOperator
src/pages/weight.js:455:7
-     if (newOffset > 0) return; // can't log future
+     if (newOffset >= 0) return; // can't log future

[NoCoverage] EqualityOperator
src/pages/weight.js:455:7
-     if (newOffset > 0) return; // can't log future
+     if (newOffset <= 0) return; // can't log future

[NoCoverage] ConditionalExpression
src/pages/weight.js:456:7
-     if (newOffset < -30) return; // max 30 days back
+     if (true) return; // max 30 days back

[NoCoverage] ConditionalExpression
src/pages/weight.js:456:7
-     if (newOffset < -30) return; // max 30 days back
+     if (false) return; // max 30 days back

[NoCoverage] EqualityOperator
src/pages/weight.js:456:7
-     if (newOffset < -30) return; // max 30 days back
+     if (newOffset <= -30) return; // max 30 days back

[NoCoverage] EqualityOperator
src/pages/weight.js:456:7
-     if (newOffset < -30) return; // max 30 days back
+     if (newOffset >= -30) return; // max 30 days back

[NoCoverage] UnaryOperator
src/pages/weight.js:456:19
-     if (newOffset < -30) return; // max 30 days back
+     if (newOffset < +30) return; // max 30 days back

[NoCoverage] BlockStatement
src/pages/weight.js:462:33
-   export function syncLogDateUI() {
-     const lbl = $('log-date-display');
-     const fwdBtn = $('log-date-fwd');
-     if (lbl) {
-       lbl.textContent = getLogDateLabel();
-       lbl.style.color = state.logDateOffset === 0 ? 'var(--accent)' : 'var(--accent2)';
-     }
-     if (fwdBtn) {
-       fwdBtn.style.opacity = state.logDateOffset === 0 ? '0.3' : '1';
-       fwdBtn.style.pointerEvents = state.logDateOffset === 0 ? 'none' : 'auto';
-     }
-   }
+   export function syncLogDateUI() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:465:7
-     if (lbl) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:465:7
-     if (lbl) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:465:12
-     if (lbl) {
-       lbl.textContent = getLogDateLabel();
-       lbl.style.color = state.logDateOffset === 0 ? 'var(--accent)' : 'var(--accent2)';
-     }
+     if (lbl) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:467:23
-       lbl.style.color = state.logDateOffset === 0 ? 'var(--accent)' : 'var(--accent2)';
+       lbl.style.color = true ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:467:23
-       lbl.style.color = state.logDateOffset === 0 ? 'var(--accent)' : 'var(--accent2)';
+       lbl.style.color = false ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] EqualityOperator
src/pages/weight.js:467:23
-       lbl.style.color = state.logDateOffset === 0 ? 'var(--accent)' : 'var(--accent2)';
+       lbl.style.color = state.logDateOffset !== 0 ? 'var(--accent)' : 'var(--accent2)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:469:7
-     if (fwdBtn) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:469:7
-     if (fwdBtn) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:469:15
-     if (fwdBtn) {
-       fwdBtn.style.opacity = state.logDateOffset === 0 ? '0.3' : '1';
-       fwdBtn.style.pointerEvents = state.logDateOffset === 0 ? 'none' : 'auto';
-     }
+     if (fwdBtn) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:470:28
-       fwdBtn.style.opacity = state.logDateOffset === 0 ? '0.3' : '1';
+       fwdBtn.style.opacity = true ? '0.3' : '1';

[NoCoverage] ConditionalExpression
src/pages/weight.js:470:28
-       fwdBtn.style.opacity = state.logDateOffset === 0 ? '0.3' : '1';
+       fwdBtn.style.opacity = false ? '0.3' : '1';

[NoCoverage] EqualityOperator
src/pages/weight.js:470:28
-       fwdBtn.style.opacity = state.logDateOffset === 0 ? '0.3' : '1';
+       fwdBtn.style.opacity = state.logDateOffset !== 0 ? '0.3' : '1';

[NoCoverage] ConditionalExpression
src/pages/weight.js:471:34
-       fwdBtn.style.pointerEvents = state.logDateOffset === 0 ? 'none' : 'auto';
+       fwdBtn.style.pointerEvents = true ? 'none' : 'auto';

[NoCoverage] ConditionalExpression
src/pages/weight.js:471:34
-       fwdBtn.style.pointerEvents = state.logDateOffset === 0 ? 'none' : 'auto';
+       fwdBtn.style.pointerEvents = false ? 'none' : 'auto';

[NoCoverage] EqualityOperator
src/pages/weight.js:471:34
-       fwdBtn.style.pointerEvents = state.logDateOffset === 0 ? 'none' : 'auto';
+       fwdBtn.style.pointerEvents = state.logDateOffset !== 0 ? 'none' : 'auto';

[NoCoverage] BlockStatement
src/pages/weight.js:475:30
-   export function getLogDate() {
-     const d = new Date();
-     d.setDate(d.getDate() + state.logDateOffset);
-     return todDate(d);
-   }
+   export function getLogDate() {}

[NoCoverage] MethodExpression
src/pages/weight.js:477:3
-     d.setDate(d.getDate() + state.logDateOffset);
+     d.setTime(d.getDate() + state.logDateOffset);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:477:13
-     d.setDate(d.getDate() + state.logDateOffset);
+     d.setDate(d.getDate() - state.logDateOffset);

[NoCoverage] BlockStatement
src/pages/weight.js:481:35
-   export function getLogDateLabel() {
-     if (state.logDateOffset === 0) return 'AZI 📅';
-     if (state.logDateOffset === -1) return 'IERI 📅';
-     const d = new Date();
-     d.setDate(d.getDate() + state.logDateOffset);
-     return `${d.getDate()}/${d.getMonth()+1}`;
-   }
+   export function getLogDateLabel() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:482:7
-     if (state.logDateOffset === 0) return 'AZI 📅';
+     if (true) return 'AZI 📅';

[NoCoverage] ConditionalExpression
src/pages/weight.js:482:7
-     if (state.logDateOffset === 0) return 'AZI 📅';
+     if (false) return 'AZI 📅';

[NoCoverage] EqualityOperator
src/pages/weight.js:482:7
-     if (state.logDateOffset === 0) return 'AZI 📅';
+     if (state.logDateOffset !== 0) return 'AZI 📅';

[NoCoverage] ConditionalExpression
src/pages/weight.js:483:7
-     if (state.logDateOffset === -1) return 'IERI 📅';
+     if (true) return 'IERI 📅';

[NoCoverage] ConditionalExpression
src/pages/weight.js:483:7
-     if (state.logDateOffset === -1) return 'IERI 📅';
+     if (false) return 'IERI 📅';

[NoCoverage] EqualityOperator
src/pages/weight.js:483:7
-     if (state.logDateOffset === -1) return 'IERI 📅';
+     if (state.logDateOffset !== -1) return 'IERI 📅';

[NoCoverage] UnaryOperator
src/pages/weight.js:483:31
-     if (state.logDateOffset === -1) return 'IERI 📅';
+     if (state.logDateOffset === +1) return 'IERI 📅';

[NoCoverage] MethodExpression
src/pages/weight.js:485:3
-     d.setDate(d.getDate() + state.logDateOffset);
+     d.setTime(d.getDate() + state.logDateOffset);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:485:13
-     d.setDate(d.getDate() + state.logDateOffset);
+     d.setDate(d.getDate() - state.logDateOffset);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:486:28
-     return `${d.getDate()}/${d.getMonth()+1}`;
+     return `${d.getDate()}/${d.getMonth() - 1}`;

[NoCoverage] BlockStatement
src/pages/weight.js:489:36
-   export function toggleDatePicker() {
-     const wrap = $('date-picker-wrap');
-     if (!wrap) return;
-     const isVisible = wrap.style.display !== 'none';
-     wrap.style.display = isVisible ? 'none' : 'block';
-     if (!isVisible) {
-       // Set current date in picker
-       const input = $('date-picker-input');
-       if (input) {
-         input.value = getLogDate();
-         input.max = tod(); // can't select future
-         const minDate = new Date();
-         minDate.setDate(minDate.getDate() - 30);
-         input.min = todDate(minDate);
-       }
-     }
-   }
+   export function toggleDatePicker() {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:491:7
-     if (!wrap) return;
+     if (wrap) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:491:7
-     if (!wrap) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:491:7
-     if (!wrap) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:492:21
-     const isVisible = wrap.style.display !== 'none';
+     const isVisible = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:492:21
-     const isVisible = wrap.style.display !== 'none';
+     const isVisible = false;

[NoCoverage] EqualityOperator
src/pages/weight.js:492:21
-     const isVisible = wrap.style.display !== 'none';
+     const isVisible = wrap.style.display === 'none';

[NoCoverage] BooleanLiteral
src/pages/weight.js:494:7
-     if (!isVisible) {
+     if (isVisible) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:494:7
-     if (!isVisible) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:494:7
-     if (!isVisible) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:494:19
-     if (!isVisible) {
-       // Set current date in picker
-       const input = $('date-picker-input');
-       if (input) {
-         input.value = getLogDate();
-         input.max = tod(); // can't select future
-         const minDate = new Date();
-         minDate.setDate(minDate.getDate() - 30);
-         input.min = todDate(minDate);
-       }
-     }
+     if (!isVisible) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:497:9
-       if (input) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:497:9
-       if (input) {
+       if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:497:16
-       if (input) {
-         input.value = getLogDate();
-         input.max = tod(); // can't select future
-         const minDate = new Date();
-         minDate.setDate(minDate.getDate() - 30);
-         input.min = todDate(minDate);
-       }
+       if (input) {}

[NoCoverage] MethodExpression
src/pages/weight.js:501:7
-         minDate.setDate(minDate.getDate() - 30);
+         minDate.setTime(minDate.getDate() - 30);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:501:23
-         minDate.setDate(minDate.getDate() - 30);
+         minDate.setDate(minDate.getDate() + 30);

[NoCoverage] BlockStatement
src/pages/weight.js:507:24
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:50
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(true){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:50
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(false){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] LogicalOperator
src/pages/weight.js:507:50
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n) && n > 50 || n < 250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:50
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(true&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] LogicalOperator
src/pages/weight.js:507:50
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n) || n > 50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] BooleanLiteral
src/pages/weight.js:507:50
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:61
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&true&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] EqualityOperator
src/pages/weight.js:507:61
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n >= 50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] EqualityOperator
src/pages/weight.js:507:61
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n <= 50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:67
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&true){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] EqualityOperator
src/pages/weight.js:507:67
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n <= 250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] EqualityOperator
src/pages/weight.js:507:67
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n >= 250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}

[NoCoverage] BlockStatement
src/pages/weight.js:507:73
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){}}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:101
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(true)d.textContent=n.toFixed(1);}}

[NoCoverage] ConditionalExpression
src/pages/weight.js:507:101
-   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(d)d.textContent=n.toFixed(1);}}
+   export function onDI(v){const n=parseFloat(v);if(!isNaN(n)&&n>50&&n<250){curW=n;const d=$('wds');if(false)d.textContent=n.toFixed(1);}}

[NoCoverage] BlockStatement
src/pages/weight.js:509:28
-   export function adj(delta) {
-     curW = Math.round((curW + delta) * 10) / 10;
-     const d = $('wds');
-     if (d) d.textContent = curW.toFixed(1);
-   }
+   export function adj(delta) {}

[NoCoverage] ArithmeticOperator
src/pages/weight.js:510:10
-     curW = Math.round((curW + delta) * 10) / 10;
+     curW = Math.round((curW + delta) * 10) * 10;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:510:21
-     curW = Math.round((curW + delta) * 10) / 10;
+     curW = Math.round((curW + delta) / 10) / 10;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:510:22
-     curW = Math.round((curW + delta) * 10) / 10;
+     curW = Math.round((curW - delta) * 10) / 10;

[NoCoverage] ConditionalExpression
src/pages/weight.js:512:7
-     if (d) d.textContent = curW.toFixed(1);
+     if (true) d.textContent = curW.toFixed(1);

[NoCoverage] ConditionalExpression
src/pages/weight.js:512:7
-     if (d) d.textContent = curW.toFixed(1);
+     if (false) d.textContent = curW.toFixed(1);

[NoCoverage] BlockStatement
src/pages/weight.js:515:28
-   export function getTrend() {
-     const ws = DB.get('weights') || {};
-     const dates = Object.keys(ws).sort().slice(-8);
-     if (dates.length < 4) return null;
-     const vals = dates.map(d => ws[d]);
-     const n = vals.length;
-     const sumX = n*(n-1)/2;
-     const sumY = vals.reduce((a,b)=>a+b,0);
-     const sumXY = vals.reduce((s,v,i)=>s+i*v,0);
-     const sumX2 = vals.reduce((s,_,i)=>s+i*i,0);
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
-     return Math.round(slope * 7 * 100) / 100;
-   }
+   export function getTrend() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:516:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:516:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:516:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/weight.js:517:17
-     const dates = Object.keys(ws).sort().slice(-8);
+     const dates = Object.keys(ws).sort();

[NoCoverage] MethodExpression
src/pages/weight.js:517:17
-     const dates = Object.keys(ws).sort().slice(-8);
+     const dates = Object.keys(ws).slice(-8);

[NoCoverage] UnaryOperator
src/pages/weight.js:517:46
-     const dates = Object.keys(ws).sort().slice(-8);
+     const dates = Object.keys(ws).sort().slice(+8);

[NoCoverage] ConditionalExpression
src/pages/weight.js:518:7
-     if (dates.length < 4) return null;
+     if (true) return null;

[NoCoverage] ConditionalExpression
src/pages/weight.js:518:7
-     if (dates.length < 4) return null;
+     if (false) return null;

[NoCoverage] EqualityOperator
src/pages/weight.js:518:7
-     if (dates.length < 4) return null;
+     if (dates.length <= 4) return null;

[NoCoverage] EqualityOperator
src/pages/weight.js:518:7
-     if (dates.length < 4) return null;
+     if (dates.length >= 4) return null;

[NoCoverage] ArrowFunction
src/pages/weight.js:519:26
-     const vals = dates.map(d => ws[d]);
+     const vals = dates.map(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:521:16
-     const sumX = n*(n-1)/2;
+     const sumX = n * (n - 1) * 2;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:521:16
-     const sumX = n*(n-1)/2;
+     const sumX = n / (n - 1)/2;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:521:19
-     const sumX = n*(n-1)/2;
+     const sumX = n*(n + 1)/2;

[NoCoverage] ArrowFunction
src/pages/weight.js:522:28
-     const sumY = vals.reduce((a,b)=>a+b,0);
+     const sumY = vals.reduce(() => undefined,0);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:522:35
-     const sumY = vals.reduce((a,b)=>a+b,0);
+     const sumY = vals.reduce((a,b)=>a - b,0);

[NoCoverage] ArrowFunction
src/pages/weight.js:523:29
-     const sumXY = vals.reduce((s,v,i)=>s+i*v,0);
+     const sumXY = vals.reduce(() => undefined,0);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:523:38
-     const sumXY = vals.reduce((s,v,i)=>s+i*v,0);
+     const sumXY = vals.reduce((s,v,i)=>s - i * v,0);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:523:40
-     const sumXY = vals.reduce((s,v,i)=>s+i*v,0);
+     const sumXY = vals.reduce((s,v,i)=>s+i / v,0);

[NoCoverage] ArrowFunction
src/pages/weight.js:524:29
-     const sumX2 = vals.reduce((s,_,i)=>s+i*i,0);
+     const sumX2 = vals.reduce(() => undefined,0);
