[NoCoverage] ArithmeticOperator
src/pages/weight.js:524:38
-     const sumX2 = vals.reduce((s,_,i)=>s+i*i,0);
+     const sumX2 = vals.reduce((s,_,i)=>s - i * i,0);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:524:40
-     const sumX2 = vals.reduce((s,_,i)=>s+i*i,0);
+     const sumX2 = vals.reduce((s,_,i)=>s+i / i,0);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:17
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n * sumXY - sumX * sumY) * (n * sumX2 - sumX * sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:18
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n * sumXY + sumX * sumY) / (n*sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:18
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n / sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:28
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX / sumY) / (n*sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:42
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX*sumY) / (n * sumX2 + sumX * sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:42
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX*sumY) / (n / sumX2 - sumX*sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:525:52
-     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX*sumX);
+     const slope = (n*sumXY - sumX*sumY) / (n*sumX2 - sumX / sumX);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:526:10
-     return Math.round(slope * 7 * 100) / 100;
+     return Math.round(slope * 7 * 100) * 100;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:526:21
-     return Math.round(slope * 7 * 100) / 100;
+     return Math.round(slope * 7 / 100) / 100;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:526:21
-     return Math.round(slope * 7 * 100) / 100;
+     return Math.round(slope / 7 * 100) / 100;

[NoCoverage] BlockStatement
src/pages/weight.js:529:43
-   export function selectDateFromPicker(val) {
-     const today = new Date();
-     const selected = new Date(val + 'T00:00:00');
-     const diff = Math.round((selected - today) / 86400000);
-     if (diff <= 0 && diff >= -30) {
-       state.logDateOffset = diff;
-       toggleDatePicker();
-       renderWeight();
-     }
-   }
+   export function selectDateFromPicker(val) {}

[NoCoverage] ArithmeticOperator
src/pages/weight.js:532:27
-     const diff = Math.round((selected - today) / 86400000);
+     const diff = Math.round((selected - today) * 86400000);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:532:28
-     const diff = Math.round((selected - today) / 86400000);
+     const diff = Math.round((selected + today) / 86400000);

[NoCoverage] ConditionalExpression
src/pages/weight.js:533:7
-     if (diff <= 0 && diff >= -30) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:533:7
-     if (diff <= 0 && diff >= -30) {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/weight.js:533:7
-     if (diff <= 0 && diff >= -30) {
+     if (diff <= 0 || diff >= -30) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:533:7
-     if (diff <= 0 && diff >= -30) {
+     if (true && diff >= -30) {

[NoCoverage] EqualityOperator
src/pages/weight.js:533:7
-     if (diff <= 0 && diff >= -30) {
+     if (diff < 0 && diff >= -30) {

[NoCoverage] EqualityOperator
src/pages/weight.js:533:7
-     if (diff <= 0 && diff >= -30) {
+     if (diff > 0 && diff >= -30) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:533:20
-     if (diff <= 0 && diff >= -30) {
+     if (diff <= 0 && true) {

[NoCoverage] EqualityOperator
src/pages/weight.js:533:20
-     if (diff <= 0 && diff >= -30) {
+     if (diff <= 0 && diff > -30) {

[NoCoverage] EqualityOperator
src/pages/weight.js:533:20
-     if (diff <= 0 && diff >= -30) {
+     if (diff <= 0 && diff < -30) {

[NoCoverage] UnaryOperator
src/pages/weight.js:533:28
-     if (diff <= 0 && diff >= -30) {
+     if (diff <= 0 && diff >= +30) {

[NoCoverage] BlockStatement
src/pages/weight.js:533:33
-     if (diff <= 0 && diff >= -30) {
-       state.logDateOffset = diff;
-       toggleDatePicker();
-       renderWeight();
-     }
+     if (diff <= 0 && diff >= -30) {}

[NoCoverage] BlockStatement
src/pages/weight.js:542:42
-   export function setChartRange(days, btn) {
-     chartRange = days;
-     document.querySelectorAll('.chart-range-btn').forEach(b => { b.style.background='transparent'; b.style.color='var(--text3)'; b.style.borderColor='var(--border)'; });
-     if (btn) { btn.style.background='rgba(200,255,0,0.12)'; btn.style.color='var(--accent)'; btn.style.borderColor='var(--accent)'; }
-     renderChart();
-   }
+   export function setChartRange(days, btn) {}

[NoCoverage] BlockStatement
src/pages/weight.js:544:62
-     document.querySelectorAll('.chart-range-btn').forEach(b => { b.style.background='transparent'; b.style.color='var(--text3)'; b.style.borderColor='var(--border)'; });
+     document.querySelectorAll('.chart-range-btn').forEach(b => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:545:7
-     if (btn) { btn.style.background='rgba(200,255,0,0.12)'; btn.style.color='var(--accent)'; btn.style.borderColor='var(--accent)'; }
+     if (true) { btn.style.background='rgba(200,255,0,0.12)'; btn.style.color='var(--accent)'; btn.style.borderColor='var(--accent)'; }

[NoCoverage] ConditionalExpression
src/pages/weight.js:545:7
-     if (btn) { btn.style.background='rgba(200,255,0,0.12)'; btn.style.color='var(--accent)'; btn.style.borderColor='var(--accent)'; }
+     if (false) { btn.style.background='rgba(200,255,0,0.12)'; btn.style.color='var(--accent)'; btn.style.borderColor='var(--accent)'; }

[NoCoverage] BlockStatement
src/pages/weight.js:545:12
-     if (btn) { btn.style.background='rgba(200,255,0,0.12)'; btn.style.color='var(--accent)'; btn.style.borderColor='var(--accent)'; }
+     if (btn) {}

[NoCoverage] BlockStatement
src/pages/weight.js:549:34
-   export function savePhoto(input) {
-     const file = input.files[0]; if (!file) return;
-     const reader = new FileReader();
-     reader.onload = e => {
-       const photos = DB.get('photos') || [];
-       photos.unshift({ date: tod(), src: e.target.result });
-       DB.set('photos', photos.slice(0, 20));
-       toast('✓ Poză salvată', 'var(--green)');
-     };
-     reader.readAsDataURL(file);
-   }
+   export function savePhoto(input) {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:550:36
-     const file = input.files[0]; if (!file) return;
+     const file = input.files[0]; if (file) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:550:36
-     const file = input.files[0]; if (!file) return;
+     const file = input.files[0]; if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:550:36
-     const file = input.files[0]; if (!file) return;
+     const file = input.files[0]; if (false) return;

[NoCoverage] BlockStatement
src/pages/weight.js:552:24
-     reader.onload = e => {
-       const photos = DB.get('photos') || [];
-       photos.unshift({ date: tod(), src: e.target.result });
-       DB.set('photos', photos.slice(0, 20));
-       toast('✓ Poză salvată', 'var(--green)');
-     };
+     reader.onload = e => {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:553:20
-       const photos = DB.get('photos') || [];
+       const photos = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:553:20
-       const photos = DB.get('photos') || [];
+       const photos = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:553:20
-       const photos = DB.get('photos') || [];
+       const photos = DB.get('photos') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:553:40
-       const photos = DB.get('photos') || [];
+       const photos = DB.get('photos') || ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/pages/weight.js:554:20
-       photos.unshift({ date: tod(), src: e.target.result });
+       photos.unshift({});

[NoCoverage] MethodExpression
src/pages/weight.js:555:22
-       DB.set('photos', photos.slice(0, 20));
+       DB.set('photos', photos);

[NoCoverage] BlockStatement
src/pages/weight.js:561:33
-   export function setBFOverride() {
-     const v = parseFloat(document.getElementById('bf-override-input')?.value);
-     if (!isNaN(v) && v > 3 && v < 50) {
-       DB.set('bf-override', v);
-       window.dispatchEvent(new StorageEvent('storage', { key: 'bf-override', newValue: String(v) }));
-       toast('✓ BF% setat: ' + v + '%', 'var(--green)');
-     }
-   }
+   export function setBFOverride() {}

[NoCoverage] OptionalChaining
src/pages/weight.js:562:24
-     const v = parseFloat(document.getElementById('bf-override-input')?.value);
+     const v = parseFloat(document.getElementById('bf-override-input').value);

[NoCoverage] ConditionalExpression
src/pages/weight.js:563:7
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:563:7
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (false) {

[NoCoverage] LogicalOperator
src/pages/weight.js:563:7
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && v > 3 || v < 50) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:563:7
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (true && v < 50) {

[NoCoverage] LogicalOperator
src/pages/weight.js:563:7
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) || v > 3 && v < 50) {

[NoCoverage] BooleanLiteral
src/pages/weight.js:563:7
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (isNaN(v) && v > 3 && v < 50) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:563:20
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && true && v < 50) {

[NoCoverage] EqualityOperator
src/pages/weight.js:563:20
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && v >= 3 && v < 50) {

[NoCoverage] EqualityOperator
src/pages/weight.js:563:20
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && v <= 3 && v < 50) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:563:29
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && v > 3 && true) {

[NoCoverage] EqualityOperator
src/pages/weight.js:563:29
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && v > 3 && v <= 50) {

[NoCoverage] EqualityOperator
src/pages/weight.js:563:29
-     if (!isNaN(v) && v > 3 && v < 50) {
+     if (!isNaN(v) && v > 3 && v >= 50) {

[NoCoverage] BlockStatement
src/pages/weight.js:563:37
-     if (!isNaN(v) && v > 3 && v < 50) {
-       DB.set('bf-override', v);
-       window.dispatchEvent(new StorageEvent('storage', { key: 'bf-override', newValue: String(v) }));
-       toast('✓ BF% setat: ' + v + '%', 'var(--green)');
-     }
+     if (!isNaN(v) && v > 3 && v < 50) {}

[NoCoverage] ObjectLiteral
src/pages/weight.js:565:54
-       window.dispatchEvent(new StorageEvent('storage', { key: 'bf-override', newValue: String(v) }));
+       window.dispatchEvent(new StorageEvent('storage', {}));

[NoCoverage] BlockStatement
src/pages/weight.js:570:35
-   export function clearBFOverride() {
-     localStorage.removeItem('bf-override');
-     window.dispatchEvent(new StorageEvent('storage', { key: 'bf-override', newValue: null }));
-     toast('✓ BF override șters', 'var(--accent)');
-   }
+   export function clearBFOverride() {}

[NoCoverage] ObjectLiteral
src/pages/weight.js:572:52
-     window.dispatchEvent(new StorageEvent('storage', { key: 'bf-override', newValue: null }));
+     window.dispatchEvent(new StorageEvent('storage', {}));

[NoCoverage] BlockStatement
src/pages/weight.js:580:18
-   function syncW() {
-     // Populate weight input and display with current value if known
-     if (curW > 0) {
-       const wdEl = $('wds');
-       const wdi = $('wdi');
-       if (wdEl) wdEl.textContent = curW.toFixed(1);
-       if (wdi) wdi.value = curW.toFixed(1);
-     }
-   }
+   function syncW() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:582:7
-     if (curW > 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:582:7
-     if (curW > 0) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/weight.js:582:7
-     if (curW > 0) {
+     if (curW >= 0) {

[NoCoverage] EqualityOperator
src/pages/weight.js:582:7
-     if (curW > 0) {
+     if (curW <= 0) {

[NoCoverage] BlockStatement
src/pages/weight.js:582:17
-     if (curW > 0) {
-       const wdEl = $('wds');
-       const wdi = $('wdi');
-       if (wdEl) wdEl.textContent = curW.toFixed(1);
-       if (wdi) wdi.value = curW.toFixed(1);
-     }
+     if (curW > 0) {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:585:9
-       if (wdEl) wdEl.textContent = curW.toFixed(1);
+       if (true) wdEl.textContent = curW.toFixed(1);

[NoCoverage] ConditionalExpression
src/pages/weight.js:585:9
-       if (wdEl) wdEl.textContent = curW.toFixed(1);
+       if (false) wdEl.textContent = curW.toFixed(1);

[NoCoverage] ConditionalExpression
src/pages/weight.js:586:9
-       if (wdi) wdi.value = curW.toFixed(1);
+       if (true) wdi.value = curW.toFixed(1);

[NoCoverage] ConditionalExpression
src/pages/weight.js:586:9
-       if (wdi) wdi.value = curW.toFixed(1);
+       if (false) wdi.value = curW.toFixed(1);

[NoCoverage] BooleanLiteral
src/pages/weight.js:599:7
-     if (!canvas) return;
+     if (canvas) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:599:7
-     if (!canvas) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:599:7
-     if (!canvas) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:600:15
-     const dpr = window.devicePixelRatio || 1;
+     const dpr = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:600:15
-     const dpr = window.devicePixelRatio || 1;
+     const dpr = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:600:15
-     const dpr = window.devicePixelRatio || 1;
+     const dpr = window.devicePixelRatio && 1;

[NoCoverage] ConditionalExpression
src/pages/weight.js:601:13
-     const W = canvas.offsetWidth || 320;
+     const W = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:601:13
-     const W = canvas.offsetWidth || 320;
+     const W = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:601:13
-     const W = canvas.offsetWidth || 320;
+     const W = canvas.offsetWidth && 320;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:603:18
-     canvas.width = W * dpr;
+     canvas.width = W / dpr;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:604:19
-     canvas.height = H * dpr;
+     canvas.height = H / dpr;

[NoCoverage] ConditionalExpression
src/pages/weight.js:608:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:608:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:608:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/weight.js:609:15
-     let dates = Object.keys(ws).sort();
+     let dates = Object.keys(ws);

[NoCoverage] ConditionalExpression
src/pages/weight.js:610:7
-     if (chartRange > 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:610:7
-     if (chartRange > 0) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/weight.js:610:7
-     if (chartRange > 0) {
+     if (chartRange >= 0) {

[NoCoverage] EqualityOperator
src/pages/weight.js:610:7
-     if (chartRange > 0) {
+     if (chartRange <= 0) {

[NoCoverage] BlockStatement
src/pages/weight.js:610:23
-     if (chartRange > 0) {
-       const cutoff = new Date();
-       cutoff.setDate(cutoff.getDate() - chartRange);
-       const cutStr = todDate(cutoff);
-       dates = dates.filter(d => d >= cutStr);
-     }
+     if (chartRange > 0) {}

[NoCoverage] MethodExpression
src/pages/weight.js:612:5
-       cutoff.setDate(cutoff.getDate() - chartRange);
+       cutoff.setTime(cutoff.getDate() - chartRange);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:612:20
-       cutoff.setDate(cutoff.getDate() - chartRange);
+       cutoff.setDate(cutoff.getDate() + chartRange);

[NoCoverage] MethodExpression
src/pages/weight.js:614:13
-       dates = dates.filter(d => d >= cutStr);
+       dates = dates;

[NoCoverage] ArrowFunction
src/pages/weight.js:614:26
-       dates = dates.filter(d => d >= cutStr);
+       dates = dates.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:614:31
-       dates = dates.filter(d => d >= cutStr);
+       dates = dates.filter(d => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:614:31
-       dates = dates.filter(d => d >= cutStr);
+       dates = dates.filter(d => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:614:31
-       dates = dates.filter(d => d >= cutStr);
+       dates = dates.filter(d => d > cutStr);

[NoCoverage] EqualityOperator
src/pages/weight.js:614:31
-       dates = dates.filter(d => d >= cutStr);
+       dates = dates.filter(d => d < cutStr);

[NoCoverage] ConditionalExpression
src/pages/weight.js:616:7
-     if (dates.length < 2) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:616:7
-     if (dates.length < 2) {
+     if (false) {

[NoCoverage] EqualityOperator
src/pages/weight.js:616:7
-     if (dates.length < 2) {
+     if (dates.length <= 2) {

[NoCoverage] EqualityOperator
src/pages/weight.js:616:7
-     if (dates.length < 2) {
+     if (dates.length >= 2) {

[NoCoverage] BlockStatement
src/pages/weight.js:616:25
-     if (dates.length < 2) {
-       ctx.fillStyle = 'rgba(255,255,255,0.1)';
-       ctx.font = '12px DM Sans, sans-serif';
-       ctx.textAlign = 'center';
-       ctx.fillText('Adaugă cel puțin 2 zile de greutate', W / 2, H / 2);
-       return;
-     }
+     if (dates.length < 2) {}

[NoCoverage] ArithmeticOperator
src/pages/weight.js:620:57
-       ctx.fillText('Adaugă cel puțin 2 zile de greutate', W / 2, H / 2);
+       ctx.fillText('Adaugă cel puțin 2 zile de greutate', W * 2, H / 2);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:620:64
-       ctx.fillText('Adaugă cel puțin 2 zile de greutate', W / 2, H / 2);
+       ctx.fillText('Adaugă cel puțin 2 zile de greutate', W / 2, H * 2);

[NoCoverage] ArrowFunction
src/pages/weight.js:624:26
-     const vals = dates.map(d => ws[d]);
+     const vals = dates.map(() => undefined);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:625:16
-     const minV = Math.min(...vals) - 0.5;
+     const minV = Math.min(...vals) + 0.5;

[NoCoverage] MethodExpression
src/pages/weight.js:625:16
-     const minV = Math.min(...vals) - 0.5;
+     const minV = Math.max(...vals) - 0.5;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:626:16
-     const maxV = Math.max(...vals) + 0.5;
+     const maxV = Math.max(...vals) - 0.5;

[NoCoverage] MethodExpression
src/pages/weight.js:626:16
-     const maxV = Math.max(...vals) + 0.5;
+     const maxV = Math.min(...vals) + 0.5;

[NoCoverage] ConditionalExpression
src/pages/weight.js:627:17
-     const range = maxV - minV || 1;
+     const range = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:627:17
-     const range = maxV - minV || 1;
+     const range = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:627:17
-     const range = maxV - minV || 1;
+     const range = maxV - minV && 1;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:627:17
-     const range = maxV - minV || 1;
+     const range = maxV + minV || 1;

[NoCoverage] ObjectLiteral
src/pages/weight.js:629:15
-     const pad = { top: 16, bottom: 24, left: 4, right: 4 };
+     const pad = {};

[NoCoverage] ArithmeticOperator
src/pages/weight.js:630:14
-     const cw = W - pad.left - pad.right;
+     const cw = W - pad.left + pad.right;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:630:14
-     const cw = W - pad.left - pad.right;
+     const cw = W + pad.left - pad.right;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:631:14
-     const ch = H - pad.top - pad.bottom;
+     const ch = H - pad.top + pad.bottom;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:631:14
-     const ch = H - pad.top - pad.bottom;
+     const ch = H + pad.top - pad.bottom;

[NoCoverage] ArrowFunction
src/pages/weight.js:633:15
-     const toX = i => pad.left + (i / (dates.length - 1)) * cw;
+     const toX = () => undefined;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:633:20
-     const toX = i => pad.left + (i / (dates.length - 1)) * cw;
+     const toX = i => pad.left - i / (dates.length - 1) * cw;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:633:31
-     const toX = i => pad.left + (i / (dates.length - 1)) * cw;
+     const toX = i => pad.left + i / (dates.length - 1) / cw;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:633:32
-     const toX = i => pad.left + (i / (dates.length - 1)) * cw;
+     const toX = i => pad.left + (i * (dates.length - 1)) * cw;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:633:37
-     const toX = i => pad.left + (i / (dates.length - 1)) * cw;
+     const toX = i => pad.left + (i / (dates.length + 1)) * cw;

[NoCoverage] ArrowFunction
src/pages/weight.js:634:15
-     const toY = v => pad.top + (1 - (v - minV) / range) * ch;
+     const toY = () => undefined;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:634:20
-     const toY = v => pad.top + (1 - (v - minV) / range) * ch;
+     const toY = v => pad.top - (1 - (v - minV) / range) * ch;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:634:30
-     const toY = v => pad.top + (1 - (v - minV) / range) * ch;
+     const toY = v => pad.top + (1 - (v - minV) / range) / ch;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:634:31
-     const toY = v => pad.top + (1 - (v - minV) / range) * ch;
+     const toY = v => pad.top + (1 + (v - minV) / range) * ch;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:634:35
-     const toY = v => pad.top + (1 - (v - minV) / range) * ch;
+     const toY = v => pad.top + (1 - (v - minV) * range) * ch;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:634:36
-     const toY = v => pad.top + (1 - (v - minV) / range) * ch;
+     const toY = v => pad.top + (1 - (v + minV) / range) * ch;

[NoCoverage] ArithmeticOperator
src/pages/weight.js:637:56
-     const grad = ctx.createLinearGradient(0, pad.top, 0, pad.top + ch);
+     const grad = ctx.createLinearGradient(0, pad.top, 0, pad.top - ch);

[NoCoverage] ConditionalExpression
src/pages/weight.js:642:19
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; false; i++) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] EqualityOperator
src/pages/weight.js:642:19
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; i <= vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] EqualityOperator
src/pages/weight.js:642:19
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; i >= vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] UpdateOperator
src/pages/weight.js:642:36
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; i < vals.length; i--) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] ArithmeticOperator
src/pages/weight.js:643:18
-     ctx.lineTo(toX(vals.length - 1), H - pad.bottom);
+     ctx.lineTo(toX(vals.length + 1), H - pad.bottom);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:643:36
-     ctx.lineTo(toX(vals.length - 1), H - pad.bottom);
+     ctx.lineTo(toX(vals.length - 1), H + pad.bottom);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:644:22
-     ctx.lineTo(toX(0), H - pad.bottom);
+     ctx.lineTo(toX(0), H + pad.bottom);

[NoCoverage] ConditionalExpression
src/pages/weight.js:652:19
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; false; i++) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] EqualityOperator
src/pages/weight.js:652:19
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; i <= vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] EqualityOperator
src/pages/weight.js:652:19
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; i >= vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] UpdateOperator
src/pages/weight.js:652:36
-     for (let i = 1; i < vals.length; i++) ctx.lineTo(toX(i), toY(vals[i]));
+     for (let i = 1; i < vals.length; i--) ctx.lineTo(toX(i), toY(vals[i]));

[NoCoverage] ArrayDeclaration
src/pages/weight.js:659:3
-     [0, vals.length - 1].forEach(i => {
+     [].forEach(i => {

[NoCoverage] ArithmeticOperator
src/pages/weight.js:659:7
-     [0, vals.length - 1].forEach(i => {
+     [0, vals.length + 1].forEach(i => {

[NoCoverage] BlockStatement
src/pages/weight.js:659:37
-     [0, vals.length - 1].forEach(i => {
-       ctx.beginPath();
-       ctx.arc(toX(i), toY(vals[i]), 4, 0, Math.PI * 2);
-       ctx.fillStyle = 'rgb(200,255,0)';
-       ctx.fill();
-     });
+     [0, vals.length - 1].forEach(i => {});

[NoCoverage] ArithmeticOperator
src/pages/weight.js:661:41
-       ctx.arc(toX(i), toY(vals[i]), 4, 0, Math.PI * 2);
+       ctx.arc(toX(i), toY(vals[i]), 4, 0, Math.PI / 2);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:671:35
-     ctx.fillText(`${d0.getDate()}/${d0.getMonth() + 1}`, pad.left, H - 6);
+     ctx.fillText(`${d0.getDate()}/${d0.getMonth() - 1}`, pad.left, H - 6);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:671:66
-     ctx.fillText(`${d0.getDate()}/${d0.getMonth() + 1}`, pad.left, H - 6);
+     ctx.fillText(`${d0.getDate()}/${d0.getMonth() + 1}`, pad.left, H + 6);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:672:29
-     const dN = new Date(dates[dates.length - 1]);
+     const dN = new Date(dates[dates.length + 1]);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:674:35
-     ctx.fillText(`${dN.getDate()}/${dN.getMonth() + 1}`, W - pad.right, H - 6);
+     ctx.fillText(`${dN.getDate()}/${dN.getMonth() - 1}`, W - pad.right, H - 6);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:674:56
-     ctx.fillText(`${dN.getDate()}/${dN.getMonth() + 1}`, W - pad.right, H - 6);
+     ctx.fillText(`${dN.getDate()}/${dN.getMonth() + 1}`, W + pad.right, H - 6);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:674:71
-     ctx.fillText(`${dN.getDate()}/${dN.getMonth() + 1}`, W - pad.right, H - 6);
+     ctx.fillText(`${dN.getDate()}/${dN.getMonth() + 1}`, W - pad.right, H + 6);

[NoCoverage] ConditionalExpression
src/pages/weight.js:678:7
-     if (statsEl) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:678:7
-     if (statsEl) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:678:16
-     if (statsEl) {
-       const diff = vals[vals.length - 1] - vals[0];
-       const sign = diff > 0 ? '+' : '';
-       const col = diff > 0 ? 'var(--accent3)' : 'var(--green)';
-       statsEl.innerHTML = `
-         <span>${dates.length} zile</span>
-         <span style="color:${col};font-weight:700">${sign}${diff.toFixed(1)} kg</span>
-         <span>min: ${Math.min(...vals).toFixed(1)} kg</span>
-         <span>max: ${Math.max(...vals).toFixed(1)} kg</span>`;
-     }
+     if (statsEl) {}

[NoCoverage] ArithmeticOperator
src/pages/weight.js:679:18
-       const diff = vals[vals.length - 1] - vals[0];
+       const diff = vals[vals.length - 1] + vals[0];

[NoCoverage] ArithmeticOperator
src/pages/weight.js:679:23
-       const diff = vals[vals.length - 1] - vals[0];
+       const diff = vals[vals.length + 1] - vals[0];

[NoCoverage] ConditionalExpression
src/pages/weight.js:680:18
-       const sign = diff > 0 ? '+' : '';
+       const sign = true ? '+' : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:680:18
-       const sign = diff > 0 ? '+' : '';
+       const sign = false ? '+' : '';

[NoCoverage] EqualityOperator
src/pages/weight.js:680:18
-       const sign = diff > 0 ? '+' : '';
+       const sign = diff >= 0 ? '+' : '';

[NoCoverage] EqualityOperator
src/pages/weight.js:680:18
-       const sign = diff > 0 ? '+' : '';
+       const sign = diff <= 0 ? '+' : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:681:17
-       const col = diff > 0 ? 'var(--accent3)' : 'var(--green)';
+       const col = true ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:681:17
-       const col = diff > 0 ? 'var(--accent3)' : 'var(--green)';
+       const col = false ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:681:17
-       const col = diff > 0 ? 'var(--accent3)' : 'var(--green)';
+       const col = diff >= 0 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:681:17
-       const col = diff > 0 ? 'var(--accent3)' : 'var(--green)';
+       const col = diff <= 0 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] MethodExpression
src/pages/weight.js:685:20
-         <span>min: ${Math.min(...vals).toFixed(1)} kg</span>
+         <span>min: ${Math.max(...vals).toFixed(1)} kg</span>
