[NoCoverage] MethodExpression
src/pages/weight.js:686:20
-         <span>max: ${Math.max(...vals).toFixed(1)} kg</span>`;
+         <span>max: ${Math.min(...vals).toFixed(1)} kg</span>`;

[NoCoverage] BooleanLiteral
src/pages/weight.js:693:7
-     if (!el) return;
+     if (el) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:693:7
-     if (!el) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:693:7
-     if (!el) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:695:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:695:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:695:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:696:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:696:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:696:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:697:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:697:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:697:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/pages/weight.js:699:20
-     const allDates = [...new Set([
-       ...Object.keys(ws),
-       ...Object.keys(kcals),
-       ...Object.keys(prots)
-     ])].sort().reverse().slice(0, 30);
+     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].sort().reverse();

[NoCoverage] MethodExpression
src/pages/weight.js:699:20
-     const allDates = [...new Set([
-       ...Object.keys(ws),
-       ...Object.keys(kcals),
-       ...Object.keys(prots)
-     ])].sort().reverse().slice(0, 30);
+     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].sort().slice(0, 30);

[NoCoverage] MethodExpression
src/pages/weight.js:699:20
-     const allDates = [...new Set([
-       ...Object.keys(ws),
-       ...Object.keys(kcals),
-       ...Object.keys(prots)
-     ])].sort().reverse().slice(0, 30);
+     const allDates = [...new Set([...Object.keys(ws), ...Object.keys(kcals), ...Object.keys(prots)])].reverse().slice(0, 30);

[NoCoverage] ArrayDeclaration
src/pages/weight.js:699:20
-     const allDates = [...new Set([
-       ...Object.keys(ws),
-       ...Object.keys(kcals),
-       ...Object.keys(prots)
-     ])].sort().reverse().slice(0, 30);
+     const allDates = [].sort().reverse().slice(0, 30);

[NoCoverage] ArrayDeclaration
src/pages/weight.js:699:32
-     const allDates = [...new Set([
-       ...Object.keys(ws),
-       ...Object.keys(kcals),
-       ...Object.keys(prots)
-     ])].sort().reverse().slice(0, 30);
+     const allDates = [...new Set([])].sort().reverse().slice(0, 30);

[NoCoverage] BooleanLiteral
src/pages/weight.js:705:7
-     if (!allDates.length) {
+     if (allDates.length) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:705:7
-     if (!allDates.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:705:7
-     if (!allDates.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:705:25
-     if (!allDates.length) {
-       el.innerHTML = '<div style="padding:14px 16px;color:var(--text3);font-size:12px">Nicio înregistrare în ultimele 30 de zile.</div>';
-       return;
-     }
+     if (!allDates.length) {}

[NoCoverage] BlockStatement
src/pages/weight.js:713:27
-         ${allDates.map(d => {
-           const [, m, day] = d.split('-');
-           const isToday = d === tod();
-           return `<button onclick="showDayDetail('${d}')"
-             style="padding:6px 10px;border-radius:var(--rs);border:1px solid ${isToday ? 'var(--accent)' : 'var(--border)'};
-                    background:${isToday ? 'rgba(200,255,0,0.1)' : 'var(--bg3)'};
-                    color:${isToday ? 'var(--accent)' : 'var(--text2)'};
-                    font-size:11px;font-family:'JetBrains Mono',monospace;cursor:pointer">
-             ${day}.${m}${isToday ? ' ★' : ''}
-           </button>`;
-         }).join('')}
+         ${allDates.map(d => {}).join('')}

[NoCoverage] ConditionalExpression
src/pages/weight.js:715:25
-           const isToday = d === tod();
+           const isToday = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:715:25
-           const isToday = d === tod();
+           const isToday = false;

[NoCoverage] EqualityOperator
src/pages/weight.js:715:25
-           const isToday = d === tod();
+           const isToday = d !== tod();

[NoCoverage] BooleanLiteral
src/pages/weight.js:731:7
-     if (!panel) return;
+     if (panel) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:731:7
-     if (!panel) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:731:7
-     if (!panel) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:733:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:733:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:733:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:734:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:734:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:734:17
-     const kcals = DB.get('kcals') || {};
+     const kcals = DB.get('kcals') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:735:17
-     const prots = DB.get('prots') || {};
+     const prots = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:735:17
-     const prots = DB.get('prots') || {};
+     const prots = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:735:17
-     const prots = DB.get('prots') || {};
+     const prots = DB.get('prots') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:736:14
-     const wb = DB.get('wellbeing') || {};
+     const wb = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:736:14
-     const wb = DB.get('wellbeing') || {};
+     const wb = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:736:14
-     const wb = DB.get('wellbeing') || {};
+     const wb = DB.get('wellbeing') && {};

[NoCoverage] ConditionalExpression
src/pages/weight.js:741:16
-     const well = wb[date] || {};
+     const well = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:741:16
-     const well = wb[date] || {};
+     const well = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:741:16
-     const well = wb[date] || {};
+     const well = wb[date] && {};

[NoCoverage] ObjectLiteral
src/pages/weight.js:744:51
-     const dateLabel = d.toLocaleDateString('ro-RO', { weekday: 'long', day: 'numeric', month: 'long' });
+     const dateLabel = d.toLocaleDateString('ro-RO', {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:747:14
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = true ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:747:14
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = false ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:747:14
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k === undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:747:33
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (true ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:747:33
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (false ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:747:33
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k >= kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:747:33
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k <= kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ArithmeticOperator
src/pages/weight.js:747:37
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k > kcalTarget - 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:747:75
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : true ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:747:75
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : false ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:747:75
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k <= kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:747:75
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k >= kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ArithmeticOperator
src/pages/weight.js:747:79
-     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget - 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';
+     const kc = k !== undefined ? (k > kcalTarget + 200 ? 'var(--accent2)' : k < kcalTarget + 200 ? 'var(--accent3)' : 'var(--green)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:748:14
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = true ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:748:14
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = false ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:748:14
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = p === undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:748:33
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = p !== undefined ? (true ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:748:33
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = p !== undefined ? (false ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:748:33
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = p !== undefined ? (p > 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] EqualityOperator
src/pages/weight.js:748:33
-     const pc = p !== undefined ? (p >= 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';
+     const pc = p !== undefined ? (p < 150 ? 'var(--green)' : 'var(--accent2)') : 'var(--text3)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:750:20
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:750:20
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:750:20
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = well.sleep != null || well.sleep > 0;

[NoCoverage] ConditionalExpression
src/pages/weight.js:750:20
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = true && well.sleep > 0;

[NoCoverage] EqualityOperator
src/pages/weight.js:750:20
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = well.sleep == null && well.sleep > 0;

[NoCoverage] ConditionalExpression
src/pages/weight.js:750:42
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = well.sleep != null && true;

[NoCoverage] EqualityOperator
src/pages/weight.js:750:42
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = well.sleep != null && well.sleep >= 0;

[NoCoverage] EqualityOperator
src/pages/weight.js:750:42
-     const hasSleep = well.sleep != null && well.sleep > 0;
+     const hasSleep = well.sleep != null && well.sleep <= 0;

[NoCoverage] ConditionalExpression
src/pages/weight.js:751:21
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:751:21
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:751:21
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = well.energy != null || well.energy > 0;

[NoCoverage] ConditionalExpression
src/pages/weight.js:751:21
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = true && well.energy > 0;

[NoCoverage] EqualityOperator
src/pages/weight.js:751:21
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = well.energy == null && well.energy > 0;

[NoCoverage] ConditionalExpression
src/pages/weight.js:751:44
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = well.energy != null && true;

[NoCoverage] EqualityOperator
src/pages/weight.js:751:44
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = well.energy != null && well.energy >= 0;

[NoCoverage] EqualityOperator
src/pages/weight.js:751:44
-     const hasEnergy = well.energy != null && well.energy > 0;
+     const hasEnergy = well.energy != null && well.energy <= 0;

[NoCoverage] ConditionalExpression
src/pages/weight.js:752:24
-     const hasWellbeing = hasSleep || hasEnergy;
+     const hasWellbeing = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:752:24
-     const hasWellbeing = hasSleep || hasEnergy;
+     const hasWellbeing = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:752:24
-     const hasWellbeing = hasSleep || hasEnergy;
+     const hasWellbeing = hasSleep && hasEnergy;

[NoCoverage] ConditionalExpression
src/pages/weight.js:753:34
-     const sleepEmoji = hasSleep ? (['', '😴', '😐', '😊', '⚡', '🔥'][well.sleep] || '—') : '—';
+     const sleepEmoji = hasSleep ? (true) : '—';

[NoCoverage] ConditionalExpression
src/pages/weight.js:753:34
-     const sleepEmoji = hasSleep ? (['', '😴', '😐', '😊', '⚡', '🔥'][well.sleep] || '—') : '—';
+     const sleepEmoji = hasSleep ? (false) : '—';

[NoCoverage] LogicalOperator
src/pages/weight.js:753:34
-     const sleepEmoji = hasSleep ? (['', '😴', '😐', '😊', '⚡', '🔥'][well.sleep] || '—') : '—';
+     const sleepEmoji = hasSleep ? (['', '😴', '😐', '😊', '⚡', '🔥'][well.sleep] && '—') : '—';

[NoCoverage] ArrayDeclaration
src/pages/weight.js:753:34
-     const sleepEmoji = hasSleep ? (['', '😴', '😐', '😊', '⚡', '🔥'][well.sleep] || '—') : '—';
+     const sleepEmoji = hasSleep ? ([][well.sleep] || '—') : '—';

[NoCoverage] ConditionalExpression
src/pages/weight.js:754:36
-     const energyEmoji = hasEnergy ? (['', '😩', '😐', '🙂', '💪', '🔥'][well.energy] || '—') : '—';
+     const energyEmoji = hasEnergy ? (true) : '—';

[NoCoverage] ConditionalExpression
src/pages/weight.js:754:36
-     const energyEmoji = hasEnergy ? (['', '😩', '😐', '🙂', '💪', '🔥'][well.energy] || '—') : '—';
+     const energyEmoji = hasEnergy ? (false) : '—';

[NoCoverage] LogicalOperator
src/pages/weight.js:754:36
-     const energyEmoji = hasEnergy ? (['', '😩', '😐', '🙂', '💪', '🔥'][well.energy] || '—') : '—';
+     const energyEmoji = hasEnergy ? (['', '😩', '😐', '🙂', '💪', '🔥'][well.energy] && '—') : '—';

[NoCoverage] ArrayDeclaration
src/pages/weight.js:754:36
-     const energyEmoji = hasEnergy ? (['', '😩', '😐', '🙂', '💪', '🔥'][well.energy] || '—') : '—';
+     const energyEmoji = hasEnergy ? ([][well.energy] || '—') : '—';

[NoCoverage] ConditionalExpression
src/pages/weight.js:765:112
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:var(--text)">${w !== undefined ? w.toFixed(1) + ' kg' : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:var(--text)">${true ? w.toFixed(1) + ' kg' : '—'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:765:112
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:var(--text)">${w !== undefined ? w.toFixed(1) + ' kg' : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:var(--text)">${false ? w.toFixed(1) + ' kg' : '—'}</div>

[NoCoverage] EqualityOperator
src/pages/weight.js:765:112
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:var(--text)">${w !== undefined ? w.toFixed(1) + ' kg' : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:var(--text)">${w === undefined ? w.toFixed(1) + ' kg' : '—'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:769:106
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${kc}">${k !== undefined ? k : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${kc}">${true ? k : '—'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:769:106
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${kc}">${k !== undefined ? k : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${kc}">${false ? k : '—'}</div>

[NoCoverage] EqualityOperator
src/pages/weight.js:769:106
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${kc}">${k !== undefined ? k : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${kc}">${k === undefined ? k : '—'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:773:106
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${pc}">${p !== undefined ? p + 'g' : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${pc}">${true ? p + 'g' : '—'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:773:106
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${pc}">${p !== undefined ? p + 'g' : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${pc}">${false ? p + 'g' : '—'}</div>

[NoCoverage] EqualityOperator
src/pages/weight.js:773:106
-           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${pc}">${p !== undefined ? p + 'g' : '—'}</div>
+           <div style="font-family:'JetBrains Mono',monospace;font-size:22px;font-weight:700;color:${pc}">${p === undefined ? p + 'g' : '—'}</div>

[NoCoverage] BlockStatement
src/pages/weight.js:784:34
-   export function closeDayDetail() {
-     const panel = $('day-detail-panel');
-     if (panel) panel.style.display = 'none';
-   }
+   export function closeDayDetail() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:786:7
-     if (panel) panel.style.display = 'none';
+     if (true) panel.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:786:7
-     if (panel) panel.style.display = 'none';
+     if (false) panel.style.display = 'none';

[NoCoverage] BooleanLiteral
src/pages/weight.js:793:7
-     if (!el) return;
+     if (el) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:793:7
-     if (!el) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:793:7
-     if (!el) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:795:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:795:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:795:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:795:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/weight.js:796:17
-     const burns = DB.get('session-burns') || [];
+     const burns = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:796:17
-     const burns = DB.get('session-burns') || [];
+     const burns = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:796:17
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:796:44
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/weight.js:799:3
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.forEach(l => {

[NoCoverage] ArrowFunction
src/pages/weight.js:799:15
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.filter(() => undefined).forEach(l => {

[NoCoverage] BooleanLiteral
src/pages/weight.js:799:20
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.filter(l => l.baseline).forEach(l => {

[NoCoverage] BlockStatement
src/pages/weight.js:799:46
-     logs.filter(l => !l.baseline).forEach(l => {
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
-       if (!sessMap[key]) sessMap[key] = [];
-       sessMap[key].push(l);
-     });
+     logs.filter(l => !l.baseline).forEach(l => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:800:17
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
+       const key = true ? String(l.session) : ('date:' + l.date);

[NoCoverage] ConditionalExpression
src/pages/weight.js:800:17
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
+       const key = false ? String(l.session) : ('date:' + l.date);

[NoCoverage] EqualityOperator
src/pages/weight.js:800:17
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
+       const key = l.session == null ? String(l.session) : ('date:' + l.date);

[NoCoverage] BooleanLiteral
src/pages/weight.js:801:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (sessMap[key]) sessMap[key] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:801:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (true) sessMap[key] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:801:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (false) sessMap[key] = [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:801:39
-       if (!sessMap[key]) sessMap[key] = [];
+       if (!sessMap[key]) sessMap[key] = ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/weight.js:805:30
-     const cutoff = new Date(); cutoff.setDate(cutoff.getDate() - 14);
+     const cutoff = new Date(); cutoff.setTime(cutoff.getDate() - 14);

[NoCoverage] ArithmeticOperator
src/pages/weight.js:805:45
-     const cutoff = new Date(); cutoff.setDate(cutoff.getDate() - 14);
+     const cutoff = new Date(); cutoff.setDate(cutoff.getDate() + 14);

[NoCoverage] ArrayDeclaration
src/pages/weight.js:808:19
-     const PUSH_EX = ['bench press', 'overhead press', 'incline press', 'chest', 'tricep', 'shoulder', 'dip', 'pec'];
+     const PUSH_EX = [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:809:19
-     const PULL_EX = ['row', 'pull-up', 'pulldown', 'lat', 'bicep', 'curl', 'deadlift', 'back'];
+     const PULL_EX = [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:810:19
-     const LEG_EX  = ['squat', 'leg press', 'lunge', 'calf', 'hamstring', 'quad', 'glute', 'rdl', 'hip'];
+     const LEG_EX  = [];

[NoCoverage] BlockStatement
src/pages/weight.js:812:38
-     function detectWorkoutType(exList) {
-       const lower = exList.filter(Boolean).map(e => e.toLowerCase());
-       let push = 0, pull = 0, leg = 0;
-       lower.forEach(e => {
-         if (PUSH_EX.some(k => e.includes(k))) push++;
-         if (PULL_EX.some(k => e.includes(k))) pull++;
-         if (LEG_EX.some(k => e.includes(k))) leg++;
-       });
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
-       if (push > pull) return 'PUSH';
-       if (pull > push) return 'PULL';
-       if (push > 0 || pull > 0) return 'PPL';
-       return null;
-     }
+     function detectWorkoutType(exList) {}

[NoCoverage] MethodExpression
src/pages/weight.js:813:19
-       const lower = exList.filter(Boolean).map(e => e.toLowerCase());
+       const lower = exList.map(e => e.toLowerCase());

[NoCoverage] ArrowFunction
src/pages/weight.js:813:46
-       const lower = exList.filter(Boolean).map(e => e.toLowerCase());
+       const lower = exList.filter(Boolean).map(() => undefined);

[NoCoverage] MethodExpression
src/pages/weight.js:813:51
-       const lower = exList.filter(Boolean).map(e => e.toLowerCase());
+       const lower = exList.filter(Boolean).map(e => e.toUpperCase());

[NoCoverage] BlockStatement
src/pages/weight.js:815:24
-       lower.forEach(e => {
-         if (PUSH_EX.some(k => e.includes(k))) push++;
-         if (PULL_EX.some(k => e.includes(k))) pull++;
-         if (LEG_EX.some(k => e.includes(k))) leg++;
-       });
+       lower.forEach(e => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:816:11
-         if (PUSH_EX.some(k => e.includes(k))) push++;
+         if (true) push++;

[NoCoverage] ConditionalExpression
src/pages/weight.js:816:11
-         if (PUSH_EX.some(k => e.includes(k))) push++;
+         if (false) push++;

[NoCoverage] MethodExpression
src/pages/weight.js:816:11
-         if (PUSH_EX.some(k => e.includes(k))) push++;
+         if (PUSH_EX.every(k => e.includes(k))) push++;

[NoCoverage] ArrowFunction
src/pages/weight.js:816:24
-         if (PUSH_EX.some(k => e.includes(k))) push++;
+         if (PUSH_EX.some(() => undefined)) push++;
