[NoCoverage] UpdateOperator
src/pages/weight.js:816:45
-         if (PUSH_EX.some(k => e.includes(k))) push++;
+         if (PUSH_EX.some(k => e.includes(k))) push--;

[NoCoverage] ConditionalExpression
src/pages/weight.js:817:11
-         if (PULL_EX.some(k => e.includes(k))) pull++;
+         if (true) pull++;

[NoCoverage] ConditionalExpression
src/pages/weight.js:817:11
-         if (PULL_EX.some(k => e.includes(k))) pull++;
+         if (false) pull++;

[NoCoverage] MethodExpression
src/pages/weight.js:817:11
-         if (PULL_EX.some(k => e.includes(k))) pull++;
+         if (PULL_EX.every(k => e.includes(k))) pull++;

[NoCoverage] ArrowFunction
src/pages/weight.js:817:24
-         if (PULL_EX.some(k => e.includes(k))) pull++;
+         if (PULL_EX.some(() => undefined)) pull++;

[NoCoverage] UpdateOperator
src/pages/weight.js:817:45
-         if (PULL_EX.some(k => e.includes(k))) pull++;
+         if (PULL_EX.some(k => e.includes(k))) pull--;

[NoCoverage] ConditionalExpression
src/pages/weight.js:818:11
-         if (LEG_EX.some(k => e.includes(k))) leg++;
+         if (true) leg++;

[NoCoverage] ConditionalExpression
src/pages/weight.js:818:11
-         if (LEG_EX.some(k => e.includes(k))) leg++;
+         if (false) leg++;

[NoCoverage] MethodExpression
src/pages/weight.js:818:11
-         if (LEG_EX.some(k => e.includes(k))) leg++;
+         if (LEG_EX.every(k => e.includes(k))) leg++;

[NoCoverage] ArrowFunction
src/pages/weight.js:818:23
-         if (LEG_EX.some(k => e.includes(k))) leg++;
+         if (LEG_EX.some(() => undefined)) leg++;

[NoCoverage] UpdateOperator
src/pages/weight.js:818:44
-         if (LEG_EX.some(k => e.includes(k))) leg++;
+         if (LEG_EX.some(k => e.includes(k))) leg--;

[NoCoverage] ConditionalExpression
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (true) return 'LEG';

[NoCoverage] ConditionalExpression
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (false) return 'LEG';

[NoCoverage] LogicalOperator
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && leg >= pull || leg > 0) return 'LEG';

[NoCoverage] ConditionalExpression
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (true && leg > 0) return 'LEG';

[NoCoverage] LogicalOperator
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push || leg >= pull && leg > 0) return 'LEG';

[NoCoverage] ConditionalExpression
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (true && leg >= pull && leg > 0) return 'LEG';

[NoCoverage] EqualityOperator
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg > push && leg >= pull && leg > 0) return 'LEG';

[NoCoverage] EqualityOperator
src/pages/weight.js:820:9
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg < push && leg >= pull && leg > 0) return 'LEG';

[NoCoverage] ConditionalExpression
src/pages/weight.js:820:24
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && true && leg > 0) return 'LEG';

[NoCoverage] EqualityOperator
src/pages/weight.js:820:24
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && leg > pull && leg > 0) return 'LEG';

[NoCoverage] EqualityOperator
src/pages/weight.js:820:24
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && leg < pull && leg > 0) return 'LEG';

[NoCoverage] ConditionalExpression
src/pages/weight.js:820:39
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && leg >= pull && true) return 'LEG';

[NoCoverage] EqualityOperator
src/pages/weight.js:820:39
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && leg >= pull && leg >= 0) return 'LEG';

[NoCoverage] EqualityOperator
src/pages/weight.js:820:39
-       if (leg >= push && leg >= pull && leg > 0) return 'LEG';
+       if (leg >= push && leg >= pull && leg <= 0) return 'LEG';

[NoCoverage] ConditionalExpression
src/pages/weight.js:821:9
-       if (push > pull) return 'PUSH';
+       if (true) return 'PUSH';

[NoCoverage] ConditionalExpression
src/pages/weight.js:821:9
-       if (push > pull) return 'PUSH';
+       if (false) return 'PUSH';

[NoCoverage] EqualityOperator
src/pages/weight.js:821:9
-       if (push > pull) return 'PUSH';
+       if (push >= pull) return 'PUSH';

[NoCoverage] EqualityOperator
src/pages/weight.js:821:9
-       if (push > pull) return 'PUSH';
+       if (push <= pull) return 'PUSH';

[NoCoverage] ConditionalExpression
src/pages/weight.js:822:9
-       if (pull > push) return 'PULL';
+       if (true) return 'PULL';

[NoCoverage] ConditionalExpression
src/pages/weight.js:822:9
-       if (pull > push) return 'PULL';
+       if (false) return 'PULL';

[NoCoverage] EqualityOperator
src/pages/weight.js:822:9
-       if (pull > push) return 'PULL';
+       if (pull >= push) return 'PULL';

[NoCoverage] EqualityOperator
src/pages/weight.js:822:9
-       if (pull > push) return 'PULL';
+       if (pull <= push) return 'PULL';

[NoCoverage] ConditionalExpression
src/pages/weight.js:823:9
-       if (push > 0 || pull > 0) return 'PPL';
+       if (true) return 'PPL';

[NoCoverage] ConditionalExpression
src/pages/weight.js:823:9
-       if (push > 0 || pull > 0) return 'PPL';
+       if (false) return 'PPL';

[NoCoverage] LogicalOperator
src/pages/weight.js:823:9
-       if (push > 0 || pull > 0) return 'PPL';
+       if (push > 0 && pull > 0) return 'PPL';

[NoCoverage] ConditionalExpression
src/pages/weight.js:823:9
-       if (push > 0 || pull > 0) return 'PPL';
+       if (false || pull > 0) return 'PPL';

[NoCoverage] EqualityOperator
src/pages/weight.js:823:9
-       if (push > 0 || pull > 0) return 'PPL';
+       if (push >= 0 || pull > 0) return 'PPL';

[NoCoverage] EqualityOperator
src/pages/weight.js:823:9
-       if (push > 0 || pull > 0) return 'PPL';
+       if (push <= 0 || pull > 0) return 'PPL';

[NoCoverage] ConditionalExpression
src/pages/weight.js:823:21
-       if (push > 0 || pull > 0) return 'PPL';
+       if (push > 0 || false) return 'PPL';

[NoCoverage] EqualityOperator
src/pages/weight.js:823:21
-       if (push > 0 || pull > 0) return 'PPL';
+       if (push > 0 || pull >= 0) return 'PPL';

[NoCoverage] EqualityOperator
src/pages/weight.js:823:21
-       if (push > 0 || pull > 0) return 'PPL';
+       if (push > 0 || pull <= 0) return 'PPL';

[NoCoverage] MethodExpression
src/pages/weight.js:827:20
-     const sessions = Object.entries(sessMap)
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
-         const exCount = exNames.length;
-         const hasEarlyStop = sets.some(l => l.earlyStop);
-         const burn = burns.find(b => b.date === date);
-         const wType = detectWorkoutType(exNames);
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
-       })
-       .filter(s => s.date >= cutoffStr)
-       .sort((a, b) => b.ts - a.ts)
-       .slice(0, 14);
+     const sessions = Object.entries(sessMap).filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop)).map(([key, sets]) => {
+     const isDateKey = key.startsWith('date:');
+     const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
+     const date = sets[0].date;
+     const realSets = sets.filter(s => s.ex !== '__early_stop__');
+     const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))]

[NoCoverage] MethodExpression
src/pages/weight.js:827:20
-     const sessions = Object.entries(sessMap)
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
-         const exCount = exNames.length;
-         const hasEarlyStop = sets.some(l => l.earlyStop);
-         const burn = burns.find(b => b.date === date);
-         const wType = detectWorkoutType(exNames);
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
-       })
-       .filter(s => s.date >= cutoffStr)
-       .sort((a, b) => b.ts - a.ts)
+     const sessions = Object.entries(sessMap).filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop)).map(([key, sets]) => {
+     const isDateKey = key.startsWith('date:');
+     const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
+     const date = sets[0].date;
+     const realSets = sets.filter(s => s.ex !== '__early_stop__');
+     const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+     const exCount =

[NoCoverage] MethodExpression
src/pages/weight.js:827:20
-     const sessions = Object.entries(sessMap)
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
-         const exCount = exNames.length;
-         const hasEarlyStop = sets.some(l => l.earlyStop);
-         const burn = burns.find(b => b.date === date);
-         const wType = detectWorkoutType(exNames);
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
-       })
-       .filter(s => s.date >= cutoffStr)
+     const sessions = Object.entries(sessMap).filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop)).map(([key, sets]) => {
+     const isDateKey = key.startsWith('date:');
+     const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
+     const date = sets[0].date;
+     const realSets = sets.filter(s => s.ex !== '__early_stop__');
+     const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+     const exCount = exNames.length;
+     const hasEarlySt

[NoCoverage] MethodExpression
src/pages/weight.js:827:20
-     const sessions = Object.entries(sessMap)
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+     const sessions = Object.entries(sessMap)

[NoCoverage] ArrowFunction
src/pages/weight.js:828:13
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/pages/weight.js:828:27
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => true)

[NoCoverage] ConditionalExpression
src/pages/weight.js:828:27
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => false)

[NoCoverage] LogicalOperator
src/pages/weight.js:828:27
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => sets.length >= 1 && sets.some(l => l.earlyStop))

[NoCoverage] ConditionalExpression
src/pages/weight.js:828:27
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => false || sets.some(l => l.earlyStop))

[NoCoverage] EqualityOperator
src/pages/weight.js:828:27
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => sets.length > 1 || sets.some(l => l.earlyStop))

[NoCoverage] EqualityOperator
src/pages/weight.js:828:27
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => sets.length < 1 || sets.some(l => l.earlyStop))

[NoCoverage] MethodExpression
src/pages/weight.js:828:47
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => sets.length >= 1 || sets.every(l => l.earlyStop))

[NoCoverage] ArrowFunction
src/pages/weight.js:828:57
-       .filter(([, sets]) => sets.length >= 1 || sets.some(l => l.earlyStop))
+       .filter(([, sets]) => sets.length >= 1 || sets.some(() => undefined))

[NoCoverage] BlockStatement
src/pages/weight.js:829:27
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
-         const exCount = exNames.length;
-         const hasEarlyStop = sets.some(l => l.earlyStop);
-         const burn = burns.find(b => b.date === date);
-         const wType = detectWorkoutType(exNames);
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
-       })
+       .map(([key, sets]) => {})

[NoCoverage] MethodExpression
src/pages/weight.js:830:25
-         const isDateKey = key.startsWith('date:');
+         const isDateKey = key.endsWith('date:');

[NoCoverage] MethodExpression
src/pages/weight.js:833:24
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets;

[NoCoverage] ArrowFunction
src/pages/weight.js:833:36
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:833:41
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(s => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:833:41
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(s => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:833:41
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(s => s.ex === '__early_stop__');

[NoCoverage] ArrayDeclaration
src/pages/weight.js:834:23
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+         const exNames = [];

[NoCoverage] MethodExpression
src/pages/weight.js:834:35
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise))];

[NoCoverage] ArrowFunction
src/pages/weight.js:834:48
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+         const exNames = [...new Set(realSets.map(() => undefined).filter(Boolean))];

[NoCoverage] ConditionalExpression
src/pages/weight.js:834:53
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+         const exNames = [...new Set(realSets.map(s => true).filter(Boolean))];

[NoCoverage] ConditionalExpression
src/pages/weight.js:834:53
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+         const exNames = [...new Set(realSets.map(s => false).filter(Boolean))];

[NoCoverage] LogicalOperator
src/pages/weight.js:834:53
-         const exNames = [...new Set(realSets.map(s => s.ex || s.exercise).filter(Boolean))];
+         const exNames = [...new Set(realSets.map(s => s.ex && s.exercise).filter(Boolean))];

[NoCoverage] MethodExpression
src/pages/weight.js:836:28
-         const hasEarlyStop = sets.some(l => l.earlyStop);
+         const hasEarlyStop = sets.every(l => l.earlyStop);

[NoCoverage] ArrowFunction
src/pages/weight.js:836:38
-         const hasEarlyStop = sets.some(l => l.earlyStop);
+         const hasEarlyStop = sets.some(() => undefined);

[NoCoverage] ArrowFunction
src/pages/weight.js:837:31
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:837:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:837:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:837:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => b.date !== date);

[NoCoverage] ObjectLiteral
src/pages/weight.js:839:14
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
+         return {};

[NoCoverage] LogicalOperator
src/pages/weight.js:839:69
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
+         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins && null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };

[NoCoverage] OptionalChaining
src/pages/weight.js:839:69
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
+         return { key, ts, date, sets: realSets.length, exCount, mins: burn.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };

[NoCoverage] LogicalOperator
src/pages/weight.js:839:126
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
+         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day && null };

[NoCoverage] OptionalChaining
src/pages/weight.js:839:126
-         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn?.day ?? null };
+         return { key, ts, date, sets: realSets.length, exCount, mins: burn?.mins ?? null, earlyStop: hasEarlyStop, wType, day: burn.day ?? null };

[NoCoverage] ArrowFunction
src/pages/weight.js:841:13
-       .filter(s => s.date >= cutoffStr)
+       .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/pages/weight.js:841:18
-       .filter(s => s.date >= cutoffStr)
+       .filter(s => true)

[NoCoverage] ConditionalExpression
src/pages/weight.js:841:18
-       .filter(s => s.date >= cutoffStr)
+       .filter(s => false)

[NoCoverage] EqualityOperator
src/pages/weight.js:841:18
-       .filter(s => s.date >= cutoffStr)
+       .filter(s => s.date > cutoffStr)

[NoCoverage] EqualityOperator
src/pages/weight.js:841:18
-       .filter(s => s.date >= cutoffStr)
+       .filter(s => s.date < cutoffStr)

[NoCoverage] ArrowFunction
src/pages/weight.js:842:11
-       .sort((a, b) => b.ts - a.ts)
+       .sort(() => undefined)

[NoCoverage] ArithmeticOperator
src/pages/weight.js:842:21
-       .sort((a, b) => b.ts - a.ts)
+       .sort((a, b) => b.ts + a.ts)

[NoCoverage] BooleanLiteral
src/pages/weight.js:845:7
-     if (!sessions.length) {
+     if (sessions.length) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:845:7
-     if (!sessions.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:845:7
-     if (!sessions.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:845:25
-     if (!sessions.length) {
-       el.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:12px;padding:24px 20px;text-align:center;margin:4px 0">
-         <div style="font-size:32px;margin-bottom:10px">🏋️</div>
-         <div style="font-size:14px;font-weight:700;color:var(--text);margin-bottom:6px">Nicio sesiune în ultimele 14 zile</div>
-         <div style="font-size:12px;color:var(--text3);line-height:1.5">Completează primul antrenament pentru a vedea istoricul</div>
-       </div>`;
-       return;
-     }
+     if (!sessions.length) {}

[NoCoverage] ObjectLiteral
src/pages/weight.js:854:21
-     const typeColor = { PUSH: 'var(--accent)', PULL: 'var(--accent2)', LEG: 'var(--green)', PPL: 'var(--purple)' };
+     const typeColor = {};

[NoCoverage] ArithmeticOperator
src/pages/weight.js:857:39
-       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString().slice(2)}`;
+       const dateStr = `${d.getDate()}/${d.getMonth() - 1}/${d.getFullYear().toString().slice(2)}`;

[NoCoverage] MethodExpression
src/pages/weight.js:857:57
-       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString().slice(2)}`;
+       const dateStr = `${d.getDate()}/${d.getMonth()+1}/${d.getFullYear().toString()}`;

[NoCoverage] ConditionalExpression
src/pages/weight.js:858:21
-       const minsStr = s.mins !== null ? ` · ${s.mins} min` : '';
+       const minsStr = true ? ` · ${s.mins} min` : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:858:21
-       const minsStr = s.mins !== null ? ` · ${s.mins} min` : '';
+       const minsStr = false ? ` · ${s.mins} min` : '';

[NoCoverage] EqualityOperator
src/pages/weight.js:858:21
-       const minsStr = s.mins !== null ? ` · ${s.mins} min` : '';
+       const minsStr = s.mins === null ? ` · ${s.mins} min` : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:859:83
-       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';
+       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${true};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:859:83
-       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';
+       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${false};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';

[NoCoverage] LogicalOperator
src/pages/weight.js:859:83
-       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';
+       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType] && 'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:859:132
-       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';
+       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${true}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:859:132
-       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';
+       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${false}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';

[NoCoverage] LogicalOperator
src/pages/weight.js:859:132
-       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType]||'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';
+       const typeTag = s.wType ? `<span style="font-size:9px;font-weight:700;color:${typeColor[s.wType]||'var(--text3)'};background:${typeColor[s.wType] && 'var(--text3)'}18;padding:1px 5px;border-radius:3px;margin-left:4px">${s.wType}</span>` : '';

[NoCoverage] ConditionalExpression
src/pages/weight.js:863:16
-                ${i < sessions.length-1 ? 'border-bottom:1px solid var(--border)' : ''};
+                ${true ? 'border-bottom:1px solid var(--border)' : ''};

[NoCoverage] ConditionalExpression
src/pages/weight.js:863:16
-                ${i < sessions.length-1 ? 'border-bottom:1px solid var(--border)' : ''};
+                ${false ? 'border-bottom:1px solid var(--border)' : ''};

[NoCoverage] EqualityOperator
src/pages/weight.js:863:16
-                ${i < sessions.length-1 ? 'border-bottom:1px solid var(--border)' : ''};
+                ${i <= sessions.length - 1 ? 'border-bottom:1px solid var(--border)' : ''};

[NoCoverage] EqualityOperator
src/pages/weight.js:863:16
-                ${i < sessions.length-1 ? 'border-bottom:1px solid var(--border)' : ''};
+                ${i >= sessions.length - 1 ? 'border-bottom:1px solid var(--border)' : ''};

[NoCoverage] ArithmeticOperator
src/pages/weight.js:863:20
-                ${i < sessions.length-1 ? 'border-bottom:1px solid var(--border)' : ''};
+                ${i < sessions.length + 1 ? 'border-bottom:1px solid var(--border)' : ''};

[NoCoverage] ConditionalExpression
src/pages/weight.js:879:7
-     if (!listView || !detailView) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:879:7
-     if (!listView || !detailView) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/pages/weight.js:879:7
-     if (!listView || !detailView) return;
+     if (!listView && !detailView) return;

[NoCoverage] BooleanLiteral
src/pages/weight.js:879:7
-     if (!listView || !detailView) return;
+     if (listView || !detailView) return;

[NoCoverage] BooleanLiteral
src/pages/weight.js:879:20
-     if (!listView || !detailView) return;
+     if (!listView || detailView) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:881:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:881:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:881:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:881:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/weight.js:885:21
-     let sessionLogs = logs.filter(l => !l.baseline && (
-       l.session === tsNum || String(l.session) === String(tsNum)
-     ));
+     let sessionLogs = logs;

[NoCoverage] ArrowFunction
src/pages/weight.js:885:33
-     let sessionLogs = logs.filter(l => !l.baseline && (
-       l.session === tsNum || String(l.session) === String(tsNum)
-     ));
+     let sessionLogs = logs.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:885:38
-     let sessionLogs = logs.filter(l => !l.baseline && (
-       l.session === tsNum || String(l.session) === String(tsNum)
-     ));
+     let sessionLogs = logs.filter(l => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:885:38
-     let sessionLogs = logs.filter(l => !l.baseline && (
-       l.session === tsNum || String(l.session) === String(tsNum)
-     ));
+     let sessionLogs = logs.filter(l => false);

[NoCoverage] LogicalOperator
src/pages/weight.js:885:38
-     let sessionLogs = logs.filter(l => !l.baseline && (
-       l.session === tsNum || String(l.session) === String(tsNum)
-     ));
+     let sessionLogs = logs.filter(l => !l.baseline || l.session === tsNum || String(l.session) === String(tsNum));

[NoCoverage] BooleanLiteral
src/pages/weight.js:885:38
-     let sessionLogs = logs.filter(l => !l.baseline && (
+     let sessionLogs = logs.filter(l => l.baseline && (

[NoCoverage] ConditionalExpression
src/pages/weight.js:886:5
-       l.session === tsNum || String(l.session) === String(tsNum)
+       true
