[NoCoverage] LogicalOperator
src/pages/weight.js:886:5
-       l.session === tsNum || String(l.session) === String(tsNum)
+       l.session === tsNum && String(l.session) === String(tsNum)

[NoCoverage] ConditionalExpression
src/pages/weight.js:886:5
-       l.session === tsNum || String(l.session) === String(tsNum)
+       false || String(l.session) === String(tsNum)

[NoCoverage] EqualityOperator
src/pages/weight.js:886:5
-       l.session === tsNum || String(l.session) === String(tsNum)
+       l.session !== tsNum || String(l.session) === String(tsNum)

[NoCoverage] ConditionalExpression
src/pages/weight.js:886:28
-       l.session === tsNum || String(l.session) === String(tsNum)
+       l.session === tsNum || false

[NoCoverage] EqualityOperator
src/pages/weight.js:886:28
-       l.session === tsNum || String(l.session) === String(tsNum)
+       l.session === tsNum || String(l.session) !== String(tsNum)

[NoCoverage] BooleanLiteral
src/pages/weight.js:890:7
-     if (!sessionLogs.length) {
+     if (sessionLogs.length) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:890:7
-     if (!sessionLogs.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:890:7
-     if (!sessionLogs.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:890:28
-     if (!sessionLogs.length) {
-       // sessionTs might be a date-based timestamp — find date-keyed entries
-       const dateObj = new Date(tsNum);
-       const dateStr = todDate(dateObj);
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
-     }
+     if (!sessionLogs.length) {}

[NoCoverage] MethodExpression
src/pages/weight.js:894:19
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs;

[NoCoverage] ArrowFunction
src/pages/weight.js:894:31
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:894:36
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:894:36
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => false);

[NoCoverage] LogicalOperator
src/pages/weight.js:894:36
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr || l.session == null);

[NoCoverage] ConditionalExpression
src/pages/weight.js:894:36
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => true && l.session == null);

[NoCoverage] LogicalOperator
src/pages/weight.js:894:36
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => !l.baseline || l.date === dateStr && l.session == null);

[NoCoverage] BooleanLiteral
src/pages/weight.js:894:36
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => l.baseline && l.date === dateStr && l.session == null);

[NoCoverage] ConditionalExpression
src/pages/weight.js:894:51
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => !l.baseline && true && l.session == null);

[NoCoverage] EqualityOperator
src/pages/weight.js:894:51
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => !l.baseline && l.date !== dateStr && l.session == null);

[NoCoverage] ConditionalExpression
src/pages/weight.js:894:73
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && true);

[NoCoverage] EqualityOperator
src/pages/weight.js:894:73
-       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session == null);
+       sessionLogs = logs.filter(l => !l.baseline && l.date === dateStr && l.session != null);

[NoCoverage] BooleanLiteral
src/pages/weight.js:897:7
-     if (!sessionLogs.length) {
+     if (sessionLogs.length) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:897:7
-     if (!sessionLogs.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:897:7
-     if (!sessionLogs.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:897:28
-     if (!sessionLogs.length) {
-       detailView.innerHTML = '<div style="padding:14px 16px;color:var(--text3);font-size:12px">Nicio dată pentru această sesiune.</div>';
-     } else {
+     if (!sessionLogs.length) {} else {

[NoCoverage] ObjectLiteral
src/pages/weight.js:902:53
-       const dateLabel = d.toLocaleDateString('ro-RO', { weekday: 'long', day: 'numeric', month: 'long' });
+       const dateLabel = d.toLocaleDateString('ro-RO', {});

[NoCoverage] BlockStatement
src/pages/weight.js:904:30
-       sessionLogs.forEach(l => {
-         if (!exGroups[l.ex]) exGroups[l.ex] = [];
-         exGroups[l.ex].push(l);
-       });
+       sessionLogs.forEach(l => {});

[NoCoverage] BooleanLiteral
src/pages/weight.js:905:11
-         if (!exGroups[l.ex]) exGroups[l.ex] = [];
+         if (exGroups[l.ex]) exGroups[l.ex] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:905:11
-         if (!exGroups[l.ex]) exGroups[l.ex] = [];
+         if (true) exGroups[l.ex] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:905:11
-         if (!exGroups[l.ex]) exGroups[l.ex] = [];
+         if (false) exGroups[l.ex] = [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:905:45
-         if (!exGroups[l.ex]) exGroups[l.ex] = [];
+         if (!exGroups[l.ex]) exGroups[l.ex] = ["Stryker was here"];

[NoCoverage] ArrowFunction
src/pages/weight.js:909:51
-       const rowsHtml = Object.entries(exGroups).map(([ex, sets]) =>
-         sets.map((s, i) => {
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
-           return `<div style="display:flex;align-items:center;gap:12px;padding:9px 16px;border-bottom:1px solid var(--border)">
-             <div style="flex:1">
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
-               <div style="font-size:11px;color:var(--text3);font-family:'JetBrains Mono',monospace">Set ${i+1}</div>
-             </div>
-             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${s.w||'—'} kg</div>
-             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${s.reps||'—'}</div>
-             ${s.rpe ? `<div style="font-size:11px;font-weight:700;color:${rpeColor};min-width:32px;text-align:right">RPE ${s.rpe}</div>` : ''}
-           </div>`;
-         }).join('')
+       const rowsHtml = Object.entries(exGroups).map(() => undefined

[NoCoverage] BlockStatement
src/pages/weight.js:910:26
-         sets.map((s, i) => {
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
-           return `<div style="display:flex;align-items:center;gap:12px;padding:9px 16px;border-bottom:1px solid var(--border)">
-             <div style="flex:1">
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
-               <div style="font-size:11px;color:var(--text3);font-family:'JetBrains Mono',monospace">Set ${i+1}</div>
-             </div>
-             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${s.w||'—'} kg</div>
-             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${s.reps||'—'}</div>
-             ${s.rpe ? `<div style="font-size:11px;font-weight:700;color:${rpeColor};min-width:32px;text-align:right">RPE ${s.rpe}</div>` : ''}
-           </div>`;
-         }).join('')
+         sets.map((s, i) => {}).join('')

[NoCoverage] ConditionalExpression
src/pages/weight.js:911:26
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = true ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:911:26
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = false ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:911:26
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = s.rpe > 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:911:26
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = s.rpe < 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:911:54
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = s.rpe >= 9 ? 'var(--red)' : true ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:911:54
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = s.rpe >= 9 ? 'var(--red)' : false ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:911:54
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe < 6 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] EqualityOperator
src/pages/weight.js:911:54
-           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe <= 6 ? 'var(--accent3)' : 'var(--green)';
+           const rpeColor = s.rpe >= 9 ? 'var(--red)' : s.rpe > 6 ? 'var(--accent3)' : 'var(--green)';

[NoCoverage] ConditionalExpression
src/pages/weight.js:914:54
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${true?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:914:54
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${false?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>

[NoCoverage] EqualityOperator
src/pages/weight.js:914:54
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i !== 0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:914:81
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${true?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:914:81
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${false?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>

[NoCoverage] EqualityOperator
src/pages/weight.js:914:81
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i !== 0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:914:120
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${true?ex:'↳'}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:914:120
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${false?ex:'↳'}</div>

[NoCoverage] EqualityOperator
src/pages/weight.js:914:120
-               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i===0?ex:'↳'}</div>
+               <div style="font-size:12px;font-weight:${i===0?'700':'400'};color:${i===0?'var(--text)':'var(--text2)'}">${i !== 0?ex:'↳'}</div>

[NoCoverage] ArithmeticOperator
src/pages/weight.js:915:105
-               <div style="font-size:11px;color:var(--text3);font-family:'JetBrains Mono',monospace">Set ${i+1}</div>
+               <div style="font-size:11px;color:var(--text3);font-family:'JetBrains Mono',monospace">Set ${i - 1}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:917:116
-             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${s.w||'—'} kg</div>
+             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${true} kg</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:917:116
-             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${s.w||'—'} kg</div>
+             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${false} kg</div>

[NoCoverage] LogicalOperator
src/pages/weight.js:917:116
-             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${s.w||'—'} kg</div>
+             <div style="font-family:'JetBrains Mono',monospace;font-size:14px;font-weight:700;color:var(--accent)">${s.w && '—'} kg</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:918:93
-             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${s.reps||'—'}</div>
+             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${true}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:918:93
-             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${s.reps||'—'}</div>
+             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${false}</div>

[NoCoverage] LogicalOperator
src/pages/weight.js:918:93
-             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${s.reps||'—'}</div>
+             <div style="font-size:12px;color:var(--text2);min-width:36px;text-align:right">×${s.reps && '—'}</div>

[NoCoverage] BlockStatement
src/pages/weight.js:937:37
-   export function hideSessionDetail() {
-     const listView = $('sessions-list-view');
-     const detailView = $('session-detail-view');
-     if (listView) listView.style.display = 'block';
-     if (detailView) detailView.style.display = 'none';
-   }
+   export function hideSessionDetail() {}

[NoCoverage] ConditionalExpression
src/pages/weight.js:940:7
-     if (listView) listView.style.display = 'block';
+     if (true) listView.style.display = 'block';

[NoCoverage] ConditionalExpression
src/pages/weight.js:940:7
-     if (listView) listView.style.display = 'block';
+     if (false) listView.style.display = 'block';

[NoCoverage] ConditionalExpression
src/pages/weight.js:941:7
-     if (detailView) detailView.style.display = 'none';
+     if (true) detailView.style.display = 'none';

[NoCoverage] ConditionalExpression
src/pages/weight.js:941:7
-     if (detailView) detailView.style.display = 'none';
+     if (false) detailView.style.display = 'none';

[NoCoverage] BooleanLiteral
src/pages/weight.js:948:40
-     const el = $('session-history'); if (!el) return;
+     const el = $('session-history'); if (el) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:948:40
-     const el = $('session-history'); if (!el) return;
+     const el = $('session-history'); if (true) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:948:40
-     const el = $('session-history'); if (!el) return;
+     const el = $('session-history'); if (false) return;

[NoCoverage] ConditionalExpression
src/pages/weight.js:949:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:949:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:949:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:949:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/weight.js:950:17
-     const burns = DB.get('session-burns') || [];
+     const burns = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:950:17
-     const burns = DB.get('session-burns') || [];
+     const burns = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:950:17
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:950:44
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/pages/weight.js:951:19
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:951:19
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:951:19
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = DB.get('session-ratings') && [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:951:48
-     const ratings = DB.get('session-ratings') || [];
+     const ratings = DB.get('session-ratings') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/weight.js:955:3
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.forEach(l => {

[NoCoverage] ArrowFunction
src/pages/weight.js:955:15
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.filter(() => undefined).forEach(l => {

[NoCoverage] BooleanLiteral
src/pages/weight.js:955:20
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.filter(l => l.baseline).forEach(l => {

[NoCoverage] BlockStatement
src/pages/weight.js:955:46
-     logs.filter(l => !l.baseline).forEach(l => {
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
-       if (!sessMap[key]) sessMap[key] = [];
-       sessMap[key].push(l);
-     });
+     logs.filter(l => !l.baseline).forEach(l => {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:956:17
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
+       const key = true ? String(l.session) : ('date:' + l.date);

[NoCoverage] ConditionalExpression
src/pages/weight.js:956:17
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
+       const key = false ? String(l.session) : ('date:' + l.date);

[NoCoverage] EqualityOperator
src/pages/weight.js:956:17
-       const key = l.session != null ? String(l.session) : ('date:' + l.date);
+       const key = l.session == null ? String(l.session) : ('date:' + l.date);

[NoCoverage] BooleanLiteral
src/pages/weight.js:957:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (sessMap[key]) sessMap[key] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:957:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (true) sessMap[key] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:957:9
-       if (!sessMap[key]) sessMap[key] = [];
+       if (false) sessMap[key] = [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:957:39
-       if (!sessMap[key]) sessMap[key] = [];
+       if (!sessMap[key]) sessMap[key] = ["Stryker was here"];

[NoCoverage] MethodExpression
src/pages/weight.js:961:20
-     const sessions = Object.entries(sessMap)
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         // Group by exercise name for distinct exercise count + per-exercise details
-         const byExercise = {};
-         for (const log of realSets) {
-           const name = log.ex;
-           if (!name) continue;
-           if (!byExercise[name]) byExercise[name] = [];
-           byExercise[name].push(log);
-         }
-         const exCount = Object.keys(byExercise).length;
-         const setCount = realSets.length;
-         const burn = burns.find(b => b.date === date);
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
-         return { ts, date, sets: setCount, exCount, byExercise,
-           mins: burn?.mins ?? null,
-           day: burn?.day ?? null,
-           rating: rating?.rating ?? null };
-       })
-       .sort((a, b) => b.ts - a.ts)
-       .slice(0, 5);
+     const sessions = Object.entries(sessMap).map(([key, sets]) => {
+     const isDateKey = key.startsWith('date:');
+     const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);

[NoCoverage] MethodExpression
src/pages/weight.js:961:20
-     const sessions = Object.entries(sessMap)
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         // Group by exercise name for distinct exercise count + per-exercise details
-         const byExercise = {};
-         for (const log of realSets) {
-           const name = log.ex;
-           if (!name) continue;
-           if (!byExercise[name]) byExercise[name] = [];
-           byExercise[name].push(log);
-         }
-         const exCount = Object.keys(byExercise).length;
-         const setCount = realSets.length;
-         const burn = burns.find(b => b.date === date);
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
-         return { ts, date, sets: setCount, exCount, byExercise,
-           mins: burn?.mins ?? null,
-           day: burn?.day ?? null,
-           rating: rating?.rating ?? null };
-       })
-       .sort((a, b) => b.ts - a.ts)
+     const sessions = Object.entries(sessMap).map(([key, sets]) => {
+     const isDateKey = key.startsWith('date:');
+     const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
+     const date = sets[0].date;

[NoCoverage] BlockStatement
src/pages/weight.js:962:27
-       .map(([key, sets]) => {
-         const isDateKey = key.startsWith('date:');
-         const ts = isDateKey ? new Date(sets[0].date).getTime() : Number(key);
-         const date = sets[0].date;
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
-         // Group by exercise name for distinct exercise count + per-exercise details
-         const byExercise = {};
-         for (const log of realSets) {
-           const name = log.ex;
-           if (!name) continue;
-           if (!byExercise[name]) byExercise[name] = [];
-           byExercise[name].push(log);
-         }
-         const exCount = Object.keys(byExercise).length;
-         const setCount = realSets.length;
-         const burn = burns.find(b => b.date === date);
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
-         return { ts, date, sets: setCount, exCount, byExercise,
-           mins: burn?.mins ?? null,
-           day: burn?.day ?? null,
-           rating: rating?.rating ?? null };
-       })
+       .map(([key, sets]) => {})

[NoCoverage] MethodExpression
src/pages/weight.js:963:25
-         const isDateKey = key.startsWith('date:');
+         const isDateKey = key.endsWith('date:');

[NoCoverage] MethodExpression
src/pages/weight.js:966:24
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets;

[NoCoverage] ArrowFunction
src/pages/weight.js:966:36
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:966:41
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(s => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:966:41
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(s => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:966:41
-         const realSets = sets.filter(s => s.ex !== '__early_stop__');
+         const realSets = sets.filter(s => s.ex === '__early_stop__');

[NoCoverage] BlockStatement
src/pages/weight.js:969:35
-         for (const log of realSets) {
-           const name = log.ex;
-           if (!name) continue;
-           if (!byExercise[name]) byExercise[name] = [];
-           byExercise[name].push(log);
-         }
+         for (const log of realSets) {}

[NoCoverage] BooleanLiteral
src/pages/weight.js:971:13
-           if (!name) continue;
+           if (name) continue;

[NoCoverage] ConditionalExpression
src/pages/weight.js:971:13
-           if (!name) continue;
+           if (true) continue;

[NoCoverage] ConditionalExpression
src/pages/weight.js:971:13
-           if (!name) continue;
+           if (false) continue;

[NoCoverage] BooleanLiteral
src/pages/weight.js:972:13
-           if (!byExercise[name]) byExercise[name] = [];
+           if (byExercise[name]) byExercise[name] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:972:13
-           if (!byExercise[name]) byExercise[name] = [];
+           if (true) byExercise[name] = [];

[NoCoverage] ConditionalExpression
src/pages/weight.js:972:13
-           if (!byExercise[name]) byExercise[name] = [];
+           if (false) byExercise[name] = [];

[NoCoverage] ArrayDeclaration
src/pages/weight.js:972:51
-           if (!byExercise[name]) byExercise[name] = [];
+           if (!byExercise[name]) byExercise[name] = ["Stryker was here"];

[NoCoverage] ArrowFunction
src/pages/weight.js:977:31
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:977:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:977:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:977:36
-         const burn = burns.find(b => b.date === date);
+         const burn = burns.find(b => b.date !== date);

[NoCoverage] ArrowFunction
src/pages/weight.js:978:54
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
+         const rating = isDateKey ? null : ratings.find(() => undefined);

[NoCoverage] ConditionalExpression
src/pages/weight.js:978:59
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
+         const rating = isDateKey ? null : ratings.find(r => true);

[NoCoverage] ConditionalExpression
src/pages/weight.js:978:59
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
+         const rating = isDateKey ? null : ratings.find(r => false);

[NoCoverage] EqualityOperator
src/pages/weight.js:978:59
-         const rating = isDateKey ? null : ratings.find(r => r.session === Number(key));
+         const rating = isDateKey ? null : ratings.find(r => r.session !== Number(key));

[NoCoverage] ObjectLiteral
src/pages/weight.js:979:14
-         return { ts, date, sets: setCount, exCount, byExercise,
-           mins: burn?.mins ?? null,
-           day: burn?.day ?? null,
-           rating: rating?.rating ?? null };
+         return {};

[NoCoverage] LogicalOperator
src/pages/weight.js:980:15
-           mins: burn?.mins ?? null,
+           mins: burn?.mins && null,
