[NoCoverage] OptionalChaining
src/pages/weight.js:980:15
-           mins: burn?.mins ?? null,
+           mins: burn.mins ?? null,

[NoCoverage] LogicalOperator
src/pages/weight.js:981:14
-           day: burn?.day ?? null,
+           day: burn?.day && null,

[NoCoverage] OptionalChaining
src/pages/weight.js:981:14
-           day: burn?.day ?? null,
+           day: burn.day ?? null,

[NoCoverage] LogicalOperator
src/pages/weight.js:982:17
-           rating: rating?.rating ?? null };
+           rating: rating?.rating && null };

[NoCoverage] OptionalChaining
src/pages/weight.js:982:17
-           rating: rating?.rating ?? null };
+           rating: rating.rating ?? null };

[NoCoverage] ArrowFunction
src/pages/weight.js:984:11
-       .sort((a, b) => b.ts - a.ts)
+       .sort(() => undefined)

[NoCoverage] ArithmeticOperator
src/pages/weight.js:984:21
-       .sort((a, b) => b.ts - a.ts)
+       .sort((a, b) => b.ts + a.ts)

[NoCoverage] BooleanLiteral
src/pages/weight.js:987:7
-     if (!sessions.length) {
+     if (sessions.length) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:987:7
-     if (!sessions.length) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/pages/weight.js:987:7
-     if (!sessions.length) {
+     if (false) {

[NoCoverage] BlockStatement
src/pages/weight.js:987:25
-     if (!sessions.length) {
-       el.innerHTML = `<div style="background:var(--card);border:1px solid var(--border);border-radius:12px;padding:24px 20px;text-align:center;margin:4px 0">
-         <div style="font-size:32px;margin-bottom:10px">💪</div>
-         <div style="font-size:14px;font-weight:700;color:var(--text);margin-bottom:6px">Nicio sesiune înregistrată</div>
-         <div style="font-size:12px;color:var(--text3);line-height:1.5">Antrenamentele tale vor apărea aici după primul workout</div>
-       </div>`;
-       return;
-     }
+     if (!sessions.length) {}

[NoCoverage] ObjectLiteral
src/pages/weight.js:996:23
-     const ratingLabel = { easy: '⚡ Ușoară', normal: '👍 Normală', hard: '💀 Grea' };
+     const ratingLabel = {};

[NoCoverage] ObjectLiteral
src/pages/weight.js:997:23
-     const ratingColor = { easy: 'var(--green)', normal: 'var(--accent)', hard: 'var(--red)' };
+     const ratingColor = {};

[NoCoverage] ObjectLiteral
src/pages/weight.js:1001:51
-       const dateStr = d.toLocaleDateString('ro-RO', { weekday: 'short', day: 'numeric', month: 'short', year: '2-digit' });
+       const dateStr = d.toLocaleDateString('ro-RO', {});

[NoCoverage] ConditionalExpression
src/pages/weight.js:1002:21
-       const minsStr = s.mins !== null ? `${s.mins} min` : null;
+       const minsStr = true ? `${s.mins} min` : null;

[NoCoverage] ConditionalExpression
src/pages/weight.js:1002:21
-       const minsStr = s.mins !== null ? `${s.mins} min` : null;
+       const minsStr = false ? `${s.mins} min` : null;

[NoCoverage] EqualityOperator
src/pages/weight.js:1002:21
-       const minsStr = s.mins !== null ? `${s.mins} min` : null;
+       const minsStr = s.mins === null ? `${s.mins} min` : null;

[NoCoverage] BlockStatement
src/pages/weight.js:1009:76
-       const exDetails = Object.entries(s.byExercise).map(([name, exSets]) => {
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
-         const kg = best.w || best.kg || '?';
-         const reps = best.reps || best.r || '?';
-         return `<div style="display:flex;justify-content:space-between;font-size:11px;padding:3px 0;border-bottom:1px solid var(--border)">
-           <span style="color:var(--text2)">${name}</span>
-           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length>1?'uri':''})</span></span>
-         </div>`;
-       }).join('');
+       const exDetails = Object.entries(s.byExercise).map(([name, exSets]) => {}).join('');

[NoCoverage] ArrowFunction
src/pages/weight.js:1010:34
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce(() => undefined, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:49
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => true ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:49
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => false ? cur : best, exSets[0]);

[NoCoverage] EqualityOperator
src/pages/weight.js:1010:49
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) >= (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] EqualityOperator
src/pages/weight.js:1010:49
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) <= (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:50
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (true) > (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:50
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (false) > (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] LogicalOperator
src/pages/weight.js:1010:50
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => ((cur.w || cur.kg) && 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:50
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (false || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] LogicalOperator
src/pages/weight.js:1010:50
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w && cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:75
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (true) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:75
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (false) ? cur : best, exSets[0]);

[NoCoverage] LogicalOperator
src/pages/weight.js:1010:75
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > ((best.w || best.kg) && 0) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1010:75
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (false || 0) ? cur : best, exSets[0]);

[NoCoverage] LogicalOperator
src/pages/weight.js:1010:75
-         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w || best.kg || 0) ? cur : best, exSets[0]);
+         const best = exSets.reduce((best, cur) => (cur.w || cur.kg || 0) > (best.w && best.kg || 0) ? cur : best, exSets[0]);

[NoCoverage] ConditionalExpression
src/pages/weight.js:1011:18
-         const kg = best.w || best.kg || '?';
+         const kg = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:1011:18
-         const kg = best.w || best.kg || '?';
+         const kg = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:1011:18
-         const kg = best.w || best.kg || '?';
+         const kg = (best.w || best.kg) && '?';

[NoCoverage] ConditionalExpression
src/pages/weight.js:1011:18
-         const kg = best.w || best.kg || '?';
+         const kg = false || '?';

[NoCoverage] LogicalOperator
src/pages/weight.js:1011:18
-         const kg = best.w || best.kg || '?';
+         const kg = best.w && best.kg || '?';

[NoCoverage] ConditionalExpression
src/pages/weight.js:1012:20
-         const reps = best.reps || best.r || '?';
+         const reps = true;

[NoCoverage] ConditionalExpression
src/pages/weight.js:1012:20
-         const reps = best.reps || best.r || '?';
+         const reps = false;

[NoCoverage] LogicalOperator
src/pages/weight.js:1012:20
-         const reps = best.reps || best.r || '?';
+         const reps = (best.reps || best.r) && '?';

[NoCoverage] ConditionalExpression
src/pages/weight.js:1012:20
-         const reps = best.reps || best.r || '?';
+         const reps = false || '?';

[NoCoverage] LogicalOperator
src/pages/weight.js:1012:20
-         const reps = best.reps || best.r || '?';
+         const reps = best.reps && best.r || '?';

[NoCoverage] ConditionalExpression
src/pages/weight.js:1015:154
-           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length>1?'uri':''})</span></span>
+           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${true?'uri':''})</span></span>

[NoCoverage] ConditionalExpression
src/pages/weight.js:1015:154
-           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length>1?'uri':''})</span></span>
+           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${false?'uri':''})</span></span>

[NoCoverage] EqualityOperator
src/pages/weight.js:1015:154
-           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length>1?'uri':''})</span></span>
+           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length >= 1?'uri':''})</span></span>

[NoCoverage] EqualityOperator
src/pages/weight.js:1015:154
-           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length>1?'uri':''})</span></span>
+           <span style="font-family:'JetBrains Mono',monospace;color:var(--accent)">${kg}kg×${reps} <span style="color:var(--text3)">(${exSets.length} set${exSets.length <= 1?'uri':''})</span></span>

[NoCoverage] ConditionalExpression
src/pages/weight.js:1024:66
-         <div style="padding:8px 16px 12px;background:var(--bg2)">${exDetails || '<div style="font-size:11px;color:var(--text3)">Nicio exerciție înregistrată</div>'}</div>
+         <div style="padding:8px 16px 12px;background:var(--bg2)">${true}</div>

[NoCoverage] ConditionalExpression
src/pages/weight.js:1024:66
-         <div style="padding:8px 16px 12px;background:var(--bg2)">${exDetails || '<div style="font-size:11px;color:var(--text3)">Nicio exerciție înregistrată</div>'}</div>
+         <div style="padding:8px 16px 12px;background:var(--bg2)">${false}</div>

[NoCoverage] LogicalOperator
src/pages/weight.js:1024:66
-         <div style="padding:8px 16px 12px;background:var(--bg2)">${exDetails || '<div style="font-size:11px;color:var(--text3)">Nicio exerciție înregistrată</div>'}</div>
+         <div style="padding:8px 16px 12px;background:var(--bg2)">${exDetails && '<div style="font-size:11px;color:var(--text3)">Nicio exerciție înregistrată</div>'}</div>

[NoCoverage] ArrayDeclaration
src/schema/exerciseMetadata.js:117:51
-     if (!meta.equipment_alternatives.length) return [];
+     if (!meta.equipment_alternatives.length) return ["Stryker was here"];

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:100:29
-       equipment_alternatives: [],
+       equipment_alternatives: ["Stryker was here"],
Tests ran:
    Exercise Metadata Schema §36.36 unknown exercise returns conservative default

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:104:30
-       muscle_target_secondary: [],
+       muscle_target_secondary: ["Stryker was here"],
Tests ran:
    Exercise Metadata Schema §36.36 unknown exercise returns conservative default

[Survived] ConditionalExpression
src/schema/exerciseMetadata.js:117:7
-     if (!meta.equipment_alternatives.length) return [];
+     if (false) return [];
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
  and 3 more tests!

[Survived] ConditionalExpression
src/schema/exerciseMetadata.js:119:7
-     if (meta.tier === 1) {
+     if (false) {
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
  and 3 more tests!

[Survived] MethodExpression
src/schema/exerciseMetadata.js:120:12
-       return meta.equipment_alternatives.filter(altName => {
-         const altMeta = EXERCISE_METADATA[altName];
-         return altMeta && altMeta.force_demand === 'high';
-       });
+       return meta.equipment_alternatives;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high

[Survived] BlockStatement
src/schema/exerciseMetadata.js:119:24
-     if (meta.tier === 1) {
-       return meta.equipment_alternatives.filter(altName => {
-         const altMeta = EXERCISE_METADATA[altName];
-         return altMeta && altMeta.force_demand === 'high';
-       });
-     }
+     if (meta.tier === 1) {}
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high

[Survived] ConditionalExpression
src/schema/exerciseMetadata.js:122:14
-         return altMeta && altMeta.force_demand === 'high';
+         return true;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high

[Survived] LogicalOperator
src/schema/exerciseMetadata.js:122:14
-         return altMeta && altMeta.force_demand === 'high';
+         return altMeta || altMeta.force_demand === 'high';
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high

[Survived] ConditionalExpression
src/schema/exerciseMetadata.js:122:25
-         return altMeta && altMeta.force_demand === 'high';
+         return altMeta && true;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 1 forță (Lat Pulldown) → strict force_demand: high
    Exercise Metadata Schema §36.36 Tier 1 alternatives filtered by force_demand: high (Smart-Routing §36.37)
    Smart Routing §36.37 Tier 1 forță (Lat Pulldown) returns alternatives all force_demand: high

[Survived] MethodExpression
src/schema/exerciseMetadata.js:125:10
-     return meta.equipment_alternatives.filter(altName => {
-       const altMeta = EXERCISE_METADATA[altName];
-       return altMeta && altMeta.muscle_target_primary === meta.muscle_target_primary;
-     });
+     return meta.equipment_alternatives;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Exercise Metadata Schema §36.36 Tier 2 alternatives filter by muscle_target_primary match (flexibility)
    Smart Routing §36.37 Tier 2 isolation has alternatives ranked by similarity

[Survived] ConditionalExpression
src/schema/exerciseMetadata.js:127:12
-       return altMeta && altMeta.muscle_target_primary === meta.muscle_target_primary;
+       return true;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Exercise Metadata Schema §36.36 Tier 2 alternatives filter by muscle_target_primary match (flexibility)
    Smart Routing §36.37 Tier 2 isolation has alternatives ranked by similarity

[Survived] LogicalOperator
src/schema/exerciseMetadata.js:127:12
-       return altMeta && altMeta.muscle_target_primary === meta.muscle_target_primary;
+       return altMeta || altMeta.muscle_target_primary === meta.muscle_target_primary;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Exercise Metadata Schema §36.36 Tier 2 alternatives filter by muscle_target_primary match (flexibility)
    Smart Routing §36.37 Tier 2 isolation has alternatives ranked by similarity

[Survived] ConditionalExpression
src/schema/exerciseMetadata.js:127:23
-       return altMeta && altMeta.muscle_target_primary === meta.muscle_target_primary;
+       return altMeta && true;
Tests ran:
    Golden Master — Smart Routing Equipment (tier-aware filtering) Tier 2 isolation (Lateral Raises) → muscle_target match flexibility
    Exercise Metadata Schema §36.36 Tier 2 alternatives filter by muscle_target_primary match (flexibility)
    Smart Routing §36.37 Tier 2 isolation has alternatives ranked by similarity

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:35:30
-     'DB Shoulder Press':       { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press'],          force_demand: 'high',   tier: 1, muscle_target_primary: 'umeri',     muscle_target_secondary: ['triceps'] },
+     'DB Shoulder Press':       {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:35:84
-     'DB Shoulder Press':       { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press'],          force_demand: 'high',   tier: 1, muscle_target_primary: 'umeri',     muscle_target_secondary: ['triceps'] },
+     'DB Shoulder Press':       { equipment_type: 'dumbbell', equipment_alternatives: [],          force_demand: 'high',   tier: 1, muscle_target_primary: 'umeri',     muscle_target_secondary: ['triceps'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:35:209
-     'DB Shoulder Press':       { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press'],          force_demand: 'high',   tier: 1, muscle_target_primary: 'umeri',     muscle_target_secondary: ['triceps'] },
+     'DB Shoulder Press':       { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press'],          force_demand: 'high',   tier: 1, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:37:30
-     'Incline DB Press':        { equipment_type: 'dumbbell', equipment_alternatives: ['Flat DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['umeri', 'triceps'] },
+     'Incline DB Press':        {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:37:84
-     'Incline DB Press':        { equipment_type: 'dumbbell', equipment_alternatives: ['Flat DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['umeri', 'triceps'] },
+     'Incline DB Press':        { equipment_type: 'dumbbell', equipment_alternatives: [], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['umeri', 'triceps'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:37:215
-     'Incline DB Press':        { equipment_type: 'dumbbell', equipment_alternatives: ['Flat DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['umeri', 'triceps'] },
+     'Incline DB Press':        { equipment_type: 'dumbbell', equipment_alternatives: ['Flat DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:39:84
-     'Flat DB Press':           { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['triceps'] },
+     'Flat DB Press':           { equipment_type: 'dumbbell', equipment_alternatives: [], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['triceps'] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:39:30
-     'Flat DB Press':           { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['triceps'] },
+     'Flat DB Press':           {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:39:218
-     'Flat DB Press':           { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: ['triceps'] },
+     'Flat DB Press':           { equipment_type: 'dumbbell', equipment_alternatives: ['Incline DB Press', 'Pec Deck / Cable Fly'], force_demand: 'high', tier: 1, muscle_target_primary: 'piept', muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:41:30
-     'Flat Barbell Bench':      { equipment_type: 'barbell',  equipment_alternatives: ['Flat DB Press'],             force_demand: 'high',   tier: 1, muscle_target_primary: 'piept',     muscle_target_secondary: ['umeri', 'triceps'] },
+     'Flat Barbell Bench':      {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:41:84
-     'Flat Barbell Bench':      { equipment_type: 'barbell',  equipment_alternatives: ['Flat DB Press'],             force_demand: 'high',   tier: 1, muscle_target_primary: 'piept',     muscle_target_secondary: ['umeri', 'triceps'] },
+     'Flat Barbell Bench':      { equipment_type: 'barbell',  equipment_alternatives: [],             force_demand: 'high',   tier: 1, muscle_target_primary: 'piept',     muscle_target_secondary: ['umeri', 'triceps'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:41:209
-     'Flat Barbell Bench':      { equipment_type: 'barbell',  equipment_alternatives: ['Flat DB Press'],             force_demand: 'high',   tier: 1, muscle_target_primary: 'piept',     muscle_target_secondary: ['umeri', 'triceps'] },
+     'Flat Barbell Bench':      { equipment_type: 'barbell',  equipment_alternatives: ['Flat DB Press'],             force_demand: 'high',   tier: 1, muscle_target_primary: 'piept',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:43:210
-     'Lat Pulldown':            { equipment_type: 'cable',    equipment_alternatives: ['Cable Row'],                  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: ['biceps'] },
+     'Lat Pulldown':            { equipment_type: 'cable',    equipment_alternatives: ['Cable Row'],                  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:45:84
-     'Cable Row':               { equipment_type: 'cable',    equipment_alternatives: ['Lat Pulldown', 'Chest-Supported Row'], force_demand: 'high', tier: 1, muscle_target_primary: 'spate', muscle_target_secondary: ['biceps'] },
+     'Cable Row':               { equipment_type: 'cable',    equipment_alternatives: [], force_demand: 'high', tier: 1, muscle_target_primary: 'spate', muscle_target_secondary: ['biceps'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:45:213
-     'Cable Row':               { equipment_type: 'cable',    equipment_alternatives: ['Lat Pulldown', 'Chest-Supported Row'], force_demand: 'high', tier: 1, muscle_target_primary: 'spate', muscle_target_secondary: ['biceps'] },
+     'Cable Row':               { equipment_type: 'cable',    equipment_alternatives: ['Lat Pulldown', 'Chest-Supported Row'], force_demand: 'high', tier: 1, muscle_target_primary: 'spate', muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:47:30
-     'Chest-Supported Row':     { equipment_type: 'machine',  equipment_alternatives: ['Cable Row', 'Lat Pulldown'],  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: ['biceps'] },
+     'Chest-Supported Row':     {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:47:84
-     'Chest-Supported Row':     { equipment_type: 'machine',  equipment_alternatives: ['Cable Row', 'Lat Pulldown'],  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: ['biceps'] },
+     'Chest-Supported Row':     { equipment_type: 'machine',  equipment_alternatives: [],  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: ['biceps'] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:47:210
-     'Chest-Supported Row':     { equipment_type: 'machine',  equipment_alternatives: ['Cable Row', 'Lat Pulldown'],  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: ['biceps'] },
+     'Chest-Supported Row':     { equipment_type: 'machine',  equipment_alternatives: ['Cable Row', 'Lat Pulldown'],  force_demand: 'high',   tier: 1, muscle_target_primary: 'spate',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:49:30
-     'Romanian Deadlift':       { equipment_type: 'barbell',  equipment_alternatives: ['Leg Curl'],                   force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: ['spate'] },
+     'Romanian Deadlift':       {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:49:84
-     'Romanian Deadlift':       { equipment_type: 'barbell',  equipment_alternatives: ['Leg Curl'],                   force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: ['spate'] },
+     'Romanian Deadlift':       { equipment_type: 'barbell',  equipment_alternatives: [],                   force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: ['spate'] },
Ran all tests for this mutant.
