[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:49:210
-     'Romanian Deadlift':       { equipment_type: 'barbell',  equipment_alternatives: ['Leg Curl'],                   force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: ['spate'] },
+     'Romanian Deadlift':       { equipment_type: 'barbell',  equipment_alternatives: ['Leg Curl'],                   force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:51:30
-     'Leg Press':               { equipment_type: 'machine',  equipment_alternatives: ['Leg Extension'],              force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Press':               {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:51:84
-     'Leg Press':               { equipment_type: 'machine',  equipment_alternatives: ['Leg Extension'],              force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Press':               { equipment_type: 'machine',  equipment_alternatives: [],              force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:51:210
-     'Leg Press':               { equipment_type: 'machine',  equipment_alternatives: ['Leg Extension'],              force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Press':               { equipment_type: 'machine',  equipment_alternatives: ['Leg Extension'],              force_demand: 'high',   tier: 1, muscle_target_primary: 'picioare',  muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:55:210
-     'Lateral Raises':          { equipment_type: 'dumbbell', equipment_alternatives: ['Lateral Raises (cable)'],     force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Lateral Raises':          { equipment_type: 'dumbbell', equipment_alternatives: ['Lateral Raises (cable)'],     force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:57:84
-     'Lateral Raises (cable)':  { equipment_type: 'cable',    equipment_alternatives: ['Lateral Raises'],             force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Lateral Raises (cable)':  { equipment_type: 'cable',    equipment_alternatives: [],             force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:59:30
-     'Rear Delt Fly':           { equipment_type: 'machine',  equipment_alternatives: ['Face Pulls'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Rear Delt Fly':           {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:57:210
-     'Lateral Raises (cable)':  { equipment_type: 'cable',    equipment_alternatives: ['Lateral Raises'],             force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Lateral Raises (cable)':  { equipment_type: 'cable',    equipment_alternatives: ['Lateral Raises'],             force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:59:84
-     'Rear Delt Fly':           { equipment_type: 'machine',  equipment_alternatives: ['Face Pulls'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Rear Delt Fly':           { equipment_type: 'machine',  equipment_alternatives: [],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:59:210
-     'Rear Delt Fly':           { equipment_type: 'machine',  equipment_alternatives: ['Face Pulls'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Rear Delt Fly':           { equipment_type: 'machine',  equipment_alternatives: ['Face Pulls'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:61:30
-     'Rear Delt Cable':         { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Fly'],              force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Rear Delt Cable':         {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:61:84
-     'Rear Delt Cable':         { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Fly'],              force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Rear Delt Cable':         { equipment_type: 'cable',    equipment_alternatives: [],              force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:63:30
-     'Pec Deck / Cable Fly':    { equipment_type: 'machine',  equipment_alternatives: ['Cable Fly', 'Incline DB Press'], force_demand: 'medium', tier: 2, muscle_target_primary: 'piept', muscle_target_secondary: [] },
+     'Pec Deck / Cable Fly':    {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:61:210
-     'Rear Delt Cable':         { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Fly'],              force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Rear Delt Cable':         { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Fly'],              force_demand: 'medium', tier: 2, muscle_target_primary: 'umeri',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:63:84
-     'Pec Deck / Cable Fly':    { equipment_type: 'machine',  equipment_alternatives: ['Cable Fly', 'Incline DB Press'], force_demand: 'medium', tier: 2, muscle_target_primary: 'piept', muscle_target_secondary: [] },
+     'Pec Deck / Cable Fly':    { equipment_type: 'machine',  equipment_alternatives: [], force_demand: 'medium', tier: 2, muscle_target_primary: 'piept', muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:63:209
-     'Pec Deck / Cable Fly':    { equipment_type: 'machine',  equipment_alternatives: ['Cable Fly', 'Incline DB Press'], force_demand: 'medium', tier: 2, muscle_target_primary: 'piept', muscle_target_secondary: [] },
+     'Pec Deck / Cable Fly':    { equipment_type: 'machine',  equipment_alternatives: ['Cable Fly', 'Incline DB Press'], force_demand: 'medium', tier: 2, muscle_target_primary: 'piept', muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:65:30
-     'Cable Fly':               { equipment_type: 'cable',    equipment_alternatives: ['Pec Deck / Cable Fly'],       force_demand: 'medium', tier: 2, muscle_target_primary: 'piept',     muscle_target_secondary: [] },
+     'Cable Fly':               {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:65:84
-     'Cable Fly':               { equipment_type: 'cable',    equipment_alternatives: ['Pec Deck / Cable Fly'],       force_demand: 'medium', tier: 2, muscle_target_primary: 'piept',     muscle_target_secondary: [] },
+     'Cable Fly':               { equipment_type: 'cable',    equipment_alternatives: [],       force_demand: 'medium', tier: 2, muscle_target_primary: 'piept',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:67:30
-     'Incline DB Curl':         { equipment_type: 'dumbbell', equipment_alternatives: ['Bayesian Curl', 'Cable Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',    muscle_target_secondary: [] },
+     'Incline DB Curl':         {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:65:210
-     'Cable Fly':               { equipment_type: 'cable',    equipment_alternatives: ['Pec Deck / Cable Fly'],       force_demand: 'medium', tier: 2, muscle_target_primary: 'piept',     muscle_target_secondary: [] },
+     'Cable Fly':               { equipment_type: 'cable',    equipment_alternatives: ['Pec Deck / Cable Fly'],       force_demand: 'medium', tier: 2, muscle_target_primary: 'piept',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:67:84
-     'Incline DB Curl':         { equipment_type: 'dumbbell', equipment_alternatives: ['Bayesian Curl', 'Cable Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',    muscle_target_secondary: [] },
+     'Incline DB Curl':         { equipment_type: 'dumbbell', equipment_alternatives: [], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',    muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:67:210
-     'Incline DB Curl':         { equipment_type: 'dumbbell', equipment_alternatives: ['Bayesian Curl', 'Cable Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',    muscle_target_secondary: [] },
+     'Incline DB Curl':         { equipment_type: 'dumbbell', equipment_alternatives: ['Bayesian Curl', 'Cable Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',    muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:69:30
-     'Bayesian Curl':           { equipment_type: 'cable',    equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
+     'Bayesian Curl':           {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:69:84
-     'Bayesian Curl':           { equipment_type: 'cable',    equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
+     'Bayesian Curl':           { equipment_type: 'cable',    equipment_alternatives: [], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:69:210
-     'Bayesian Curl':           { equipment_type: 'cable',    equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
+     'Bayesian Curl':           { equipment_type: 'cable',    equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:71:30
-     'Cable Curl':              { equipment_type: 'cable',    equipment_alternatives: ['Bayesian Curl', 'Preacher Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate', muscle_target_secondary: [] },
+     'Cable Curl':              {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:71:84
-     'Cable Curl':              { equipment_type: 'cable',    equipment_alternatives: ['Bayesian Curl', 'Preacher Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate', muscle_target_secondary: [] },
+     'Cable Curl':              { equipment_type: 'cable',    equipment_alternatives: [], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate', muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:71:210
-     'Cable Curl':              { equipment_type: 'cable',    equipment_alternatives: ['Bayesian Curl', 'Preacher Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate', muscle_target_secondary: [] },
+     'Cable Curl':              { equipment_type: 'cable',    equipment_alternatives: ['Bayesian Curl', 'Preacher Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate', muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:73:30
-     'Preacher Curl':           { equipment_type: 'machine',  equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
+     'Preacher Curl':           {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:73:84
-     'Preacher Curl':           { equipment_type: 'machine',  equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
+     'Preacher Curl':           { equipment_type: 'machine',  equipment_alternatives: [], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:73:210
-     'Preacher Curl':           { equipment_type: 'machine',  equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: [] },
+     'Preacher Curl':           { equipment_type: 'machine',  equipment_alternatives: ['Cable Curl', 'Incline DB Curl'], force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',  muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:75:30
-     'Hammer Curl':             { equipment_type: 'dumbbell', equipment_alternatives: ['Cable Curl'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',     muscle_target_secondary: [] },
+     'Hammer Curl':             {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:75:84
-     'Hammer Curl':             { equipment_type: 'dumbbell', equipment_alternatives: ['Cable Curl'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',     muscle_target_secondary: [] },
+     'Hammer Curl':             { equipment_type: 'dumbbell', equipment_alternatives: [],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:75:210
-     'Hammer Curl':             { equipment_type: 'dumbbell', equipment_alternatives: ['Cable Curl'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',     muscle_target_secondary: [] },
+     'Hammer Curl':             { equipment_type: 'dumbbell', equipment_alternatives: ['Cable Curl'],                 force_demand: 'medium', tier: 2, muscle_target_primary: 'brate',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:77:30
-     'Overhead Triceps':        { equipment_type: 'cable',    equipment_alternatives: ['Pushdown'],                   force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
+     'Overhead Triceps':        {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:77:84
-     'Overhead Triceps':        { equipment_type: 'cable',    equipment_alternatives: ['Pushdown'],                   force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
+     'Overhead Triceps':        { equipment_type: 'cable',    equipment_alternatives: [],                   force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:77:210
-     'Overhead Triceps':        { equipment_type: 'cable',    equipment_alternatives: ['Pushdown'],                   force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
+     'Overhead Triceps':        { equipment_type: 'cable',    equipment_alternatives: ['Pushdown'],                   force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:79:30
-     'Pushdown':                { equipment_type: 'cable',    equipment_alternatives: ['Overhead Triceps'],           force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
+     'Pushdown':                {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:79:84
-     'Pushdown':                { equipment_type: 'cable',    equipment_alternatives: ['Overhead Triceps'],           force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
+     'Pushdown':                { equipment_type: 'cable',    equipment_alternatives: [],           force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:79:210
-     'Pushdown':                { equipment_type: 'cable',    equipment_alternatives: ['Overhead Triceps'],           force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: [] },
+     'Pushdown':                { equipment_type: 'cable',    equipment_alternatives: ['Overhead Triceps'],           force_demand: 'medium', tier: 2, muscle_target_primary: 'triceps',   muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:81:30
-     'Leg Curl':                { equipment_type: 'machine',  equipment_alternatives: ['Romanian Deadlift'],          force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Curl':                {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:81:84
-     'Leg Curl':                { equipment_type: 'machine',  equipment_alternatives: ['Romanian Deadlift'],          force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Curl':                { equipment_type: 'machine',  equipment_alternatives: [],          force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:81:210
-     'Leg Curl':                { equipment_type: 'machine',  equipment_alternatives: ['Romanian Deadlift'],          force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Curl':                { equipment_type: 'machine',  equipment_alternatives: ['Romanian Deadlift'],          force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:83:30
-     'Leg Extension':           { equipment_type: 'machine',  equipment_alternatives: ['Leg Press'],                  force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Extension':           {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:83:84
-     'Leg Extension':           { equipment_type: 'machine',  equipment_alternatives: ['Leg Press'],                  force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Extension':           { equipment_type: 'machine',  equipment_alternatives: [],                  force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:83:210
-     'Leg Extension':           { equipment_type: 'machine',  equipment_alternatives: ['Leg Press'],                  force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Leg Extension':           { equipment_type: 'machine',  equipment_alternatives: ['Leg Press'],                  force_demand: 'medium', tier: 2, muscle_target_primary: 'picioare',  muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:87:30
-     'Face Pulls':              { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Cable'],            force_demand: 'low',    tier: 3, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Face Pulls':              {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:87:84
-     'Face Pulls':              { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Cable'],            force_demand: 'low',    tier: 3, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Face Pulls':              { equipment_type: 'cable',    equipment_alternatives: [],            force_demand: 'low',    tier: 3, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:87:210
-     'Face Pulls':              { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Cable'],            force_demand: 'low',    tier: 3, muscle_target_primary: 'umeri',     muscle_target_secondary: [] },
+     'Face Pulls':              { equipment_type: 'cable',    equipment_alternatives: ['Rear Delt Cable'],            force_demand: 'low',    tier: 3, muscle_target_primary: 'umeri',     muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/schema/exerciseMetadata.js:89:30
-     'Calf Raises':             { equipment_type: 'machine',  equipment_alternatives: [],                              force_demand: 'low',    tier: 3, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Calf Raises':             {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:89:84
-     'Calf Raises':             { equipment_type: 'machine',  equipment_alternatives: [],                              force_demand: 'low',    tier: 3, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Calf Raises':             { equipment_type: 'machine',  equipment_alternatives: ["Stryker was here"],                              force_demand: 'low',    tier: 3, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/schema/exerciseMetadata.js:89:211
-     'Calf Raises':             { equipment_type: 'machine',  equipment_alternatives: [],                              force_demand: 'low',    tier: 3, muscle_target_primary: 'picioare',  muscle_target_secondary: [] },
+     'Calf Raises':             { equipment_type: 'machine',  equipment_alternatives: [],                              force_demand: 'low',    tier: 3, muscle_target_primary: 'picioare',  muscle_target_secondary: ["Stryker was here"] },
Ran all tests for this mutant.

[Survived] LogicalOperator
src/schema/pricing.js:46:15
-     const now = ctx.now ?? Date.now();
+     const now = ctx.now && Date.now();
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active
    Pricing Schema §36.50-§36.52 buildSubscription Founding requested but cap reached → auto-downgrade to standard
    Pricing Schema §36.50-§36.52 subscription_end null = active

[Survived] ConditionalExpression
src/schema/pricing.js:50:7
-     if (tier === 'founding' && ctx.currentFoundingCounter >= FOUNDING_CAP) {
+     if (true && ctx.currentFoundingCounter >= FOUNDING_CAP) {
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active
    Pricing Schema §36.50-§36.52 buildSubscription Founding requested but cap reached → auto-downgrade to standard
    Pricing Schema §36.50-§36.52 subscription_end null = active

[Survived] ConditionalExpression
src/schema/pricing.js:64:40
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? true : ctx.currentFoundingCounter >= FOUNDING_CAP,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active

[Survived] ConditionalExpression
src/schema/pricing.js:64:40
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? false : ctx.currentFoundingCounter >= FOUNDING_CAP,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active

[Survived] EqualityOperator
src/schema/pricing.js:64:40
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? ctx.currentFoundingCounter + 1 > FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active

[Survived] EqualityOperator
src/schema/pricing.js:64:40
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? ctx.currentFoundingCounter + 1 < FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active

[Survived] ArithmeticOperator
src/schema/pricing.js:64:41
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter - 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding (cap not reached) → tier founding, lock active

[Survived] ConditionalExpression
src/schema/pricing.js:64:91
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : true,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding requested but cap reached → auto-downgrade to standard
    Pricing Schema §36.50-§36.52 subscription_end null = active

[Survived] ConditionalExpression
src/schema/pricing.js:64:91
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : false,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding requested but cap reached → auto-downgrade to standard
    Pricing Schema §36.50-§36.52 subscription_end null = active

[Survived] EqualityOperator
src/schema/pricing.js:64:91
-       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter >= FOUNDING_CAP,
+       auto_close_triggered: isFounding ? (ctx.currentFoundingCounter + 1) >= FOUNDING_CAP : ctx.currentFoundingCounter > FOUNDING_CAP,
Tests ran:
    Pricing Schema §36.50-§36.52 buildSubscription Founding requested but cap reached → auto-downgrade to standard
    Pricing Schema §36.50-§36.52 subscription_end null = active
