[Survived] ConditionalExpression
src/simulator/flagging.js:80:13
-     if (ga && ga.fallback_template_240 === true) flags.push('engine_2_spec_gap');
+     if (ga && true) flags.push('engine_2_spec_gap');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    engine_2_spec_gap flag (§9 STUB workaround) fallback_template_240 flag → engine_2_spec_gap
  and 1 more test!

[Survived] ConditionalExpression
src/simulator/invariants.js:30:7
-     if (!exec || !Array.isArray(/** @type {any} */(exec).sets_reps_rir)) return SKIP;
+     if (false) return SKIP;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] LogicalOperator
src/simulator/invariants.js:30:7
-     if (!exec || !Array.isArray(/** @type {any} */(exec).sets_reps_rir)) return SKIP;
+     if (!exec && !Array.isArray(/** @type {any} */exec.sets_reps_rir)) return SKIP;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:32:38
-       .reduce((sum, e) => sum + Number(e?.sets || 0) * Number(e?.reps || 0), 0);
+       .reduce((sum, e) => sum + Number(true) * Number(e?.reps || 0), 0);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] OptionalChaining
src/simulator/invariants.js:32:38
-       .reduce((sum, e) => sum + Number(e?.sets || 0) * Number(e?.reps || 0), 0);
+       .reduce((sum, e) => sum + Number(e.sets || 0) * Number(e?.reps || 0), 0);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] OptionalChaining
src/simulator/invariants.js:32:61
-       .reduce((sum, e) => sum + Number(e?.sets || 0) * Number(e?.reps || 0), 0);
+       .reduce((sum, e) => sum + Number(e?.sets || 0) * Number(e.reps || 0), 0);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:34:19
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = true ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:34:19
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = false ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:34:19
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = c.persona.age > 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:34:51
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = c.persona.age >= 60 ? 'maria' : true ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:34:19
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = c.persona.age < 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:34:51
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = c.persona.age >= 60 ? 'maria' : false ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:34:51
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age > 40 ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:34:51
-     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age >= 40 ? 'gigica' : 'marius';
+     const persona = c.persona.age >= 60 ? 'maria' : c.persona.age < 40 ? 'gigica' : 'marius';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:35:22
-     const mrvCeiling = persona === 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
+     const mrvCeiling = true ? 80 : persona === 'gigica' ? 120 : 180;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:35:22
-     const mrvCeiling = persona === 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
+     const mrvCeiling = false ? 80 : persona === 'gigica' ? 120 : 180;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:35:22
-     const mrvCeiling = persona === 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
+     const mrvCeiling = persona !== 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:35:49
-     const mrvCeiling = persona === 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
+     const mrvCeiling = persona === 'maria' ? 80 : true ? 120 : 180;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:35:49
-     const mrvCeiling = persona === 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
+     const mrvCeiling = persona === 'maria' ? 80 : false ? 120 : 180;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:35:49
-     const mrvCeiling = persona === 'maria' ? 80 : persona === 'gigica' ? 120 : 180;
+     const mrvCeiling = persona === 'maria' ? 80 : persona !== 'gigica' ? 120 : 180;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] EqualityOperator
src/simulator/invariants.js:36:10
-     return total > mrvCeiling ? FAIL : PASS;
+     return total >= mrvCeiling ? FAIL : PASS;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:46:7
-     if (!exec || !Array.isArray(/** @type {any} */(exec).sets_reps_rir)) return SKIP;
+     if (false) return SKIP;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] LogicalOperator
src/simulator/invariants.js:46:7
-     if (!exec || !Array.isArray(/** @type {any} */(exec).sets_reps_rir)) return SKIP;
+     if (!exec && !Array.isArray(/** @type {any} */exec.sets_reps_rir)) return SKIP;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] OptionalChaining
src/simulator/invariants.js:49:16
-       if (Number(s?.rir) < 0) return FAIL; // negative RIR = nonsense
+       if (Number(s.rir) < 0) return FAIL; // negative RIR = nonsense
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] OptionalChaining
src/simulator/invariants.js:50:34
-       if (Number(s?.rir) === 0 && !s?.intentional_failure) return FAIL;
+       if (Number(s?.rir) === 0 && !s.intentional_failure) return FAIL;
Tests ran:
    I2 RIR > 0 RIR=0 fără intentional_failure → FAIL
    I2 RIR > 0 RIR=0 cu intentional_failure flag → PASS

[Survived] OptionalChaining
src/simulator/invariants.js:50:16
-       if (Number(s?.rir) === 0 && !s?.intentional_failure) return FAIL;
+       if (Number(s.rir) === 0 && !s?.intentional_failure) return FAIL;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 11 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:87:7
-     if (!flags.length) return PASS;
+     if (false) return PASS;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I1 volume under MRV moderate Marius volume → PASS
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/invariants.js:89:7
-     if (!exec || !Array.isArray(/** @type {any} */(exec).sets_reps_rir)) return SKIP;
+     if (false) return SKIP;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I5 medical safety contraindication respect knee_arthrosis + squat_deep selected → FAIL
  and 1 more test!

[Survived] LogicalOperator
src/simulator/invariants.js:89:7
-     if (!exec || !Array.isArray(/** @type {any} */(exec).sets_reps_rir)) return SKIP;
+     if (!exec && !Array.isArray(/** @type {any} */exec.sets_reps_rir)) return SKIP;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I5 medical safety contraindication respect knee_arthrosis + squat_deep selected → FAIL
  and 1 more test!

[Survived] OptionalChaining
src/simulator/invariants.js:90:78
-     const exercises = /** @type {any} */(exec).sets_reps_rir.map((e) => String(e?.exercise || '').toLowerCase());
+     const exercises = /** @type {any} */(exec).sets_reps_rir.map((e) => String(e.exercise || '').toLowerCase());
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I5 medical safety contraindication respect knee_arthrosis + squat_deep selected → FAIL
  and 1 more test!

[Survived] ArrayDeclaration
src/simulator/invariants.js:96:29
-       'shoulder_impingement': ['overhead_press', 'snatch', 'clean_jerk'],
+       'shoulder_impingement': [],
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I5 medical safety contraindication respect knee_arthrosis + squat_deep selected → FAIL
  and 1 more test!

[Survived] ArrayDeclaration
src/simulator/invariants.js:97:25
-       'lower_back_acute': ['deadlift', 'good_morning', 'bent_row'],
+       'lower_back_acute': [],
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    I5 medical safety contraindication respect knee_arthrosis + squat_deep selected → FAIL
  and 1 more test!

[Survived] ConditionalExpression
src/simulator/invariants.js:104:11
-         if (banned.some((b) => ex.includes(b))) return FAIL;
+         if (true) return FAIL;
Tests ran:
    I5 medical safety contraindication respect knee_arthrosis + squat_deep selected → FAIL
    I5 medical safety contraindication respect pregnant + supine_bench → FAIL

[NoCoverage] ConditionalExpression
src/simulator/pipeline.js:64:7
-       : c.recovery.pre_session_readiness === 'YELLOW' ? 0.92
+       : true ? 0.92

[NoCoverage] ConditionalExpression
src/simulator/pipeline.js:64:7
-       : c.recovery.pre_session_readiness === 'YELLOW' ? 0.92
+       : false ? 0.92

[NoCoverage] EqualityOperator
src/simulator/pipeline.js:64:7
-       : c.recovery.pre_session_readiness === 'YELLOW' ? 0.92
+       : c.recovery.pre_session_readiness !== 'YELLOW' ? 0.92

[NoCoverage] ConditionalExpression
src/simulator/pipeline.js:128:36
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+       && (c.goal.phase === 'BULK' || false);

[NoCoverage] EqualityOperator
src/simulator/pipeline.js:128:36
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+       && (c.goal.phase === 'BULK' || c.goal.phase !== 'RECOMP');

[Survived] ConditionalExpression
src/simulator/pipeline.js:29:20
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = true ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:29:20
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = false ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:29:20
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = c.persona.age > 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:29:20
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = c.persona.age < 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:29:49
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = c.persona.age >= 60 ? 0.50 : true ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:29:49
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = c.persona.age >= 60 ? 0.50 : false ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:29:49
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age > 40 ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:29:49
-     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age >= 40 ? 0.70 : 1.00;
+     const modifier = c.persona.age >= 60 ? 0.50 : c.persona.age < 40 ? 0.70 : 1.00;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArithmeticOperator
src/simulator/pipeline.js:30:26
-     const baselineVolume = 12 * modifier; // working sets / muscle / week baseline
+     const baselineVolume = 12 / modifier; // working sets / muscle / week baseline
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:31:10
-     return {
-       linear_block_week: 1,
-       volume_floor: Math.round(baselineVolume * 0.7),
-       volume_ceiling: Math.round(baselineVolume * 1.15),
-       phase: c.goal.phase.toLowerCase(),
-     };
+     return {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArithmeticOperator
src/simulator/pipeline.js:34:32
-       volume_ceiling: Math.round(baselineVolume * 1.15),
+       volume_ceiling: Math.round(baselineVolume / 1.15),
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArithmeticOperator
src/simulator/pipeline.js:33:30
-       volume_floor: Math.round(baselineVolume * 0.7),
+       volume_floor: Math.round(baselineVolume / 0.7),
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] MethodExpression
src/simulator/pipeline.js:35:12
-       phase: c.goal.phase.toLowerCase(),
+       phase: c.goal.phase.toUpperCase(),
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:44:22
-     const phaseDelta = c.goal.phase === 'CUT' ? -300
+     const phaseDelta = true ? -300
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:44:22
-     const phaseDelta = c.goal.phase === 'CUT' ? -300
+     const phaseDelta = false ? -300
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] UnaryOperator
src/simulator/pipeline.js:44:47
-     const phaseDelta = c.goal.phase === 'CUT' ? -300
+     const phaseDelta = c.goal.phase === 'CUT' ? +300
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] EqualityOperator
src/simulator/pipeline.js:44:22
-     const phaseDelta = c.goal.phase === 'CUT' ? -300
+     const phaseDelta = c.goal.phase !== 'CUT' ? -300
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:45:7
-       : c.goal.phase === 'BULK' ? +250
+       : true ? +250
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:45:7
-       : c.goal.phase === 'BULK' ? +250
+       : false ? +250
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:45:7
-       : c.goal.phase === 'BULK' ? +250
+       : c.goal.phase !== 'BULK' ? +250
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] UnaryOperator
src/simulator/pipeline.js:45:33
-       : c.goal.phase === 'BULK' ? +250
+       : c.goal.phase === 'BULK' ? -250
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ConditionalExpression
src/simulator/pipeline.js:46:7
-       : c.goal.phase === 'RECOMP' ? -100
+       : true ? -100
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:46:7
-       : c.goal.phase === 'RECOMP' ? -100
+       : false ? -100
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:46:7
-       : c.goal.phase === 'RECOMP' ? -100
+       : c.goal.phase !== 'RECOMP' ? -100
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] UnaryOperator
src/simulator/pipeline.js:46:35
-       : c.goal.phase === 'RECOMP' ? -100
+       : c.goal.phase === 'RECOMP' ? +100
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ArithmeticOperator
src/simulator/pipeline.js:52:18
-       kcal_target: 2000 + phaseDelta, // placeholder — real impl uses Mifflin-St Jeor + activity
+       kcal_target: 2000 - phaseDelta, // placeholder — real impl uses Mifflin-St Jeor + activity
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:53:18
-       macro_split: { P: 1.8, C: 2.0, F: 0.9 },
+       macro_split: {},
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
