[Survived] BlockStatement
src/simulator/pipeline.js:62:33
-   function runEnergyAdjustment(c) {
-     const factor = c.recovery.pre_session_readiness === 'GREEN' ? 1.00
-       : c.recovery.pre_session_readiness === 'YELLOW' ? 0.92
-       : 0.75;
-     return {
-       modulation_factor: factor,
-       yo_yo_stabilizer: false,
-     };
-   }
+   function runEnergyAdjustment(c) {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:63:18
-     const factor = c.recovery.pre_session_readiness === 'GREEN' ? 1.00
+     const factor = true ? 1.00
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:63:18
-     const factor = c.recovery.pre_session_readiness === 'GREEN' ? 1.00
+     const factor = false ? 1.00
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:63:18
-     const factor = c.recovery.pre_session_readiness === 'GREEN' ? 1.00
+     const factor = c.recovery.pre_session_readiness !== 'GREEN' ? 1.00
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:66:10
-     return {
-       modulation_factor: factor,
-       yo_yo_stabilizer: false,
-     };
+     return {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] BooleanLiteral
src/simulator/pipeline.js:68:23
-       yo_yo_stabilizer: false,
+       yo_yo_stabilizer: true,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:80:7
-     if (c.equipment.includes('barbell')) {
+     if (true) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:80:7
-     if (c.equipment.includes('barbell')) {
+     if (false) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrayDeclaration
src/simulator/pipeline.js:81:17
-       exercises = ['squat', 'bench', 'row', 'overhead_press'];
+       exercises = [];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ConditionalExpression
src/simulator/pipeline.js:82:14
-     } else if (c.equipment.includes('dumbbell')) {
+     } else if (true) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:82:14
-     } else if (c.equipment.includes('dumbbell')) {
+     } else if (false) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrayDeclaration
src/simulator/pipeline.js:83:17
-       exercises = ['db_squat', 'db_bench', 'db_row', 'db_press'];
+       exercises = [];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrayDeclaration
src/simulator/pipeline.js:85:17
-       exercises = ['bodyweight_squat', 'pushup', 'inverted_row', 'pike_pushup'];
+       exercises = [];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ArrayDeclaration
src/simulator/pipeline.js:89:28
-       substitutions_applied: [],
+       substitutions_applied: ["Stryker was here"],
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] BooleanLiteral
src/simulator/pipeline.js:90:20
-       fallback_used: false,
+       fallback_used: true,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] BlockStatement
src/simulator/pipeline.js:98:23
-   function runWarmUp(c) {
-     return {
-       protocol: c.persona.age >= 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
-       duration_min: c.persona.age >= 60 ? 8 : 5,
-     };
-   }
+   function runWarmUp(c) {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:99:10
-     return {
-       protocol: c.persona.age >= 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
-       duration_min: c.persona.age >= 60 ? 8 : 5,
-     };
+     return {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:100:15
-       protocol: c.persona.age >= 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
+       protocol: true ? 'joint_mobility_extended' : 'dynamic_warmup',
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:100:15
-       protocol: c.persona.age >= 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
+       protocol: false ? 'joint_mobility_extended' : 'dynamic_warmup',
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:100:15
-       protocol: c.persona.age >= 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
+       protocol: c.persona.age > 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:100:15
-       protocol: c.persona.age >= 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
+       protocol: c.persona.age < 60 ? 'joint_mobility_extended' : 'dynamic_warmup',
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:101:19
-       duration_min: c.persona.age >= 60 ? 8 : 5,
+       duration_min: true ? 8 : 5,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:101:19
-       duration_min: c.persona.age >= 60 ? 8 : 5,
+       duration_min: false ? 8 : 5,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:101:19
-       duration_min: c.persona.age >= 60 ? 8 : 5,
+       duration_min: c.persona.age > 60 ? 8 : 5,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:101:19
-       duration_min: c.persona.age >= 60 ? 8 : 5,
+       duration_min: c.persona.age < 60 ? 8 : 5,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] BlockStatement
src/simulator/pipeline.js:110:37
-   function runExecution(c, selection) {
-     const baseline = c.experience === 'beginner' ? { sets: 3, reps: 10, rir: 3 }
-       : c.experience === 'intermediate' ? { sets: 4, reps: 8, rir: 2 }
-       : { sets: 5, reps: 6, rir: 1 };
-     return {
-       sets_reps_rir: selection.exercises.map((ex) => ({ exercise: ex, ...baseline })),
-       rest_periods: { compound: 180, isolation: 90 },
-       tempo_overlay: 'controlled',
-     };
-   }
+   function runExecution(c, selection) {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:111:20
-     const baseline = c.experience === 'beginner' ? { sets: 3, reps: 10, rir: 3 }
+     const baseline = true ? { sets: 3, reps: 10, rir: 3 }
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:111:20
-     const baseline = c.experience === 'beginner' ? { sets: 3, reps: 10, rir: 3 }
+     const baseline = false ? { sets: 3, reps: 10, rir: 3 }
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:111:20
-     const baseline = c.experience === 'beginner' ? { sets: 3, reps: 10, rir: 3 }
+     const baseline = c.experience !== 'beginner' ? { sets: 3, reps: 10, rir: 3 }
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:111:50
-     const baseline = c.experience === 'beginner' ? { sets: 3, reps: 10, rir: 3 }
+     const baseline = c.experience === 'beginner' ? {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ConditionalExpression
src/simulator/pipeline.js:112:7
-       : c.experience === 'intermediate' ? { sets: 4, reps: 8, rir: 2 }
+       : true ? { sets: 4, reps: 8, rir: 2 }
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:112:7
-       : c.experience === 'intermediate' ? { sets: 4, reps: 8, rir: 2 }
+       : false ? { sets: 4, reps: 8, rir: 2 }
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:112:7
-       : c.experience === 'intermediate' ? { sets: 4, reps: 8, rir: 2 }
+       : c.experience !== 'intermediate' ? { sets: 4, reps: 8, rir: 2 }
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:112:41
-       : c.experience === 'intermediate' ? { sets: 4, reps: 8, rir: 2 }
+       : c.experience === 'intermediate' ? {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:113:7
-       : { sets: 5, reps: 6, rir: 1 };
+       : {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ObjectLiteral
src/simulator/pipeline.js:114:10
-     return {
-       sets_reps_rir: selection.exercises.map((ex) => ({ exercise: ex, ...baseline })),
-       rest_periods: { compound: 180, isolation: 90 },
-       tempo_overlay: 'controlled',
-     };
+     return {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrowFunction
src/simulator/pipeline.js:115:44
-       sets_reps_rir: selection.exercises.map((ex) => ({ exercise: ex, ...baseline })),
+       sets_reps_rir: selection.exercises.map(() => undefined),
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:115:53
-       sets_reps_rir: selection.exercises.map((ex) => ({ exercise: ex, ...baseline })),
+       sets_reps_rir: selection.exercises.map((ex) => ({})),
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:116:19
-       rest_periods: { compound: 180, isolation: 90 },
+       rest_periods: {},
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] BlockStatement
src/simulator/pipeline.js:125:31
-   function runSpecialization(c) {
-     // Per HANDOVER §45 Engine #7 LOCKED V1: Marius Advanced + Bulk/Recomp ONLY.
-     const eligible = c.experience === 'advanced'
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
-     return {
-       eligible,
-       reason: eligible ? 'advanced_bulk_eligible' : 'gate_blocked_per_engine_7_LOCK_V1',
-     };
-   }
+   function runSpecialization(c) {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:127:20
-     const eligible = c.experience === 'advanced'
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+     const eligible = true;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:127:20
-     const eligible = c.experience === 'advanced'
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+     const eligible = false;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] LogicalOperator
src/simulator/pipeline.js:127:20
-     const eligible = c.experience === 'advanced'
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+     const eligible = c.experience === 'advanced' || c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:127:20
-     const eligible = c.experience === 'advanced'
+     const eligible = true
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:127:20
-     const eligible = c.experience === 'advanced'
+     const eligible = c.experience !== 'advanced'
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:128:9
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+       && (true);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] LogicalOperator
src/simulator/pipeline.js:128:9
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+       && (c.goal.phase === 'BULK' && c.goal.phase === 'RECOMP');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ConditionalExpression
src/simulator/pipeline.js:128:9
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+       && (false || c.goal.phase === 'RECOMP');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] EqualityOperator
src/simulator/pipeline.js:128:9
-       && (c.goal.phase === 'BULK' || c.goal.phase === 'RECOMP');
+       && (c.goal.phase !== 'BULK' || c.goal.phase === 'RECOMP');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure

[Survived] ObjectLiteral
src/simulator/pipeline.js:129:10
-     return {
-       eligible,
-       reason: eligible ? 'advanced_bulk_eligible' : 'gate_blocked_per_engine_7_LOCK_V1',
-     };
+     return {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] BlockStatement
src/simulator/pipeline.js:140:38
-   function runDeload(c, periodization) {
-     // Mesocycle week 4 = deload. Placeholder triggers nothing intrasession.
-     return {
-       triggered: periodization.linear_block_week === 4,
-       depth: periodization.linear_block_week === 4 ? 0.45 : null,
-     };
-   }
+   function runDeload(c, periodization) {}
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:142:10
-     return {
-       triggered: periodization.linear_block_week === 4,
-       depth: periodization.linear_block_week === 4 ? 0.45 : null,
-     };
+     return {};
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:143:16
-       triggered: periodization.linear_block_week === 4,
+       triggered: true,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:143:16
-       triggered: periodization.linear_block_week === 4,
+       triggered: false,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:143:16
-       triggered: periodization.linear_block_week === 4,
+       triggered: periodization.linear_block_week !== 4,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:144:12
-       depth: periodization.linear_block_week === 4 ? 0.45 : null,
+       depth: true ? 0.45 : null,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/pipeline.js:144:12
-       depth: periodization.linear_block_week === 4 ? 0.45 : null,
+       depth: false ? 0.45 : null,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/pipeline.js:144:12
-       depth: periodization.linear_block_week === 4 ? 0.45 : null,
+       depth: periodization.linear_block_week !== 4 ? 0.45 : null,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ObjectLiteral
src/simulator/pipeline.js:173:30
-       final_session_blueprint: {
-         summary: 'placeholder — real aggregator deferred post Engines #1-#8 ADR canonical',
-         exercises_count: exercise_selection.exercises.length,
-       },
+       final_session_blueprint: {},
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[NoCoverage] ConditionalExpression
src/simulator/pruning.js:36:48
-     if (isPregnant && (c.goal.phase === 'CUT' || c.goal.phase === 'BULK')) {
+     if (isPregnant && (c.goal.phase === 'CUT' || false)) {

[NoCoverage] EqualityOperator
src/simulator/pruning.js:36:48
-     if (isPregnant && (c.goal.phase === 'CUT' || c.goal.phase === 'BULK')) {
+     if (isPregnant && (c.goal.phase === 'CUT' || c.goal.phase !== 'BULK')) {

[NoCoverage] ConditionalExpression
src/simulator/pruning.js:85:34
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (c.history.tier === 'T3' && true) {

[NoCoverage] EqualityOperator
src/simulator/pruning.js:85:34
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (c.history.tier === 'T3' && c.recovery.vitality_tier !== 'LOW') {

[NoCoverage] BlockStatement
src/simulator/pruning.js:85:70
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
-       // T3 chronic LOW = re-eval phase, but NOT pruned — flagged downstream
-       return null;
-     }
+     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {}

[Survived] EqualityOperator
src/simulator/pruning.js:27:7
-     if (c.persona.age >= 60 && c.goal.template === 'Forta') {
+     if (c.persona.age > 60 && c.goal.template === 'Forta') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning A — persona × goal biological Maria 65 + Forta → PRUNE_A
  and 12 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:31:29
-     if (c.persona.age > 75 && c.goal.template === 'Slabire' && c.goal.phase === 'CUT') {
+     if (c.persona.age > 75 && true && c.goal.phase === 'CUT') {
Tests ran:
    Pruning A — persona × goal biological 80yo + Slabire CUT → PRUNE_A

[Survived] ConditionalExpression
src/simulator/pruning.js:31:62
-     if (c.persona.age > 75 && c.goal.template === 'Slabire' && c.goal.phase === 'CUT') {
+     if (c.persona.age > 75 && c.goal.template === 'Slabire' && true) {
Tests ran:
    Pruning A — persona × goal biological 80yo + Slabire CUT → PRUNE_A

[Survived] EqualityOperator
src/simulator/pruning.js:31:7
-     if (c.persona.age > 75 && c.goal.template === 'Slabire' && c.goal.phase === 'CUT') {
+     if (c.persona.age >= 75 && c.goal.template === 'Slabire' && c.goal.phase === 'CUT') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning A — persona × goal biological 80yo + Slabire CUT → PRUNE_A
  and 11 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:36:22
-     if (isPregnant && (c.goal.phase === 'CUT' || c.goal.phase === 'BULK')) {
+     if (isPregnant && (true)) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    Pruning A — persona × goal biological Pregnant + CUT → TRIPWIRE Passive Mode
    pruneInvalidCombos batch partitions input into valid + pruned + tripwires

[Survived] LogicalOperator
src/simulator/pruning.js:49:28
-     const isBodyweightOnly = equipSet.has('bodyweight') && !equipSet.has('barbell') && !equipSet.has('dumbbell');
+     const isBodyweightOnly = equipSet.has('bodyweight') && !equipSet.has('barbell') || !equipSet.has('dumbbell');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy bodyweight only + Forta → PRUNE_B
  and 9 more tests!
