[Survived] ConditionalExpression
src/simulator/pruning.js:49:28
-     const isBodyweightOnly = equipSet.has('bodyweight') && !equipSet.has('barbell') && !equipSet.has('dumbbell');
+     const isBodyweightOnly = true && !equipSet.has('dumbbell');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy bodyweight only + Forta → PRUNE_B
  and 9 more tests!

[Survived] LogicalOperator
src/simulator/pruning.js:49:28
-     const isBodyweightOnly = equipSet.has('bodyweight') && !equipSet.has('barbell') && !equipSet.has('dumbbell');
+     const isBodyweightOnly = equipSet.has('bodyweight') || !equipSet.has('barbell') && !equipSet.has('dumbbell');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy bodyweight only + Forta → PRUNE_B
  and 9 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:54:21
-     const isFullGym = equipSet.has('barbell') && equipSet.has('dumbbell') && equipSet.has('machines');
+     const isFullGym = true;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)
  and 8 more tests!

[Survived] LogicalOperator
src/simulator/pruning.js:54:21
-     const isFullGym = equipSet.has('barbell') && equipSet.has('dumbbell') && equipSet.has('machines');
+     const isFullGym = equipSet.has('barbell') && equipSet.has('dumbbell') || equipSet.has('machines');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)
  and 8 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:54:21
-     const isFullGym = equipSet.has('barbell') && equipSet.has('dumbbell') && equipSet.has('machines');
+     const isFullGym = true && equipSet.has('machines');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)
  and 8 more tests!

[Survived] LogicalOperator
src/simulator/pruning.js:54:21
-     const isFullGym = equipSet.has('barbell') && equipSet.has('dumbbell') && equipSet.has('machines');
+     const isFullGym = equipSet.has('barbell') || equipSet.has('dumbbell') && equipSet.has('machines');
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)
  and 8 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:55:20
-     if (isFullGym && c.goal.template === 'Slabire' && c.experience === 'beginner') {
+     if (isFullGym && true && c.experience === 'beginner') {
Tests ran:
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)

[Survived] ConditionalExpression
src/simulator/pruning.js:55:53
-     if (isFullGym && c.goal.template === 'Slabire' && c.experience === 'beginner') {
+     if (isFullGym && c.goal.template === 'Slabire' && true) {
Tests ran:
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)

[Survived] LogicalOperator
src/simulator/pruning.js:55:7
-     if (isFullGym && c.goal.template === 'Slabire' && c.experience === 'beginner') {
+     if (isFullGym || c.goal.template === 'Slabire' && c.experience === 'beginner') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning B — equipment × goal redundancy full gym + Slabire + beginner → PRUNE_B (redundant cu Tonifiere)
  and 8 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:68:7
-     if (c.experience === 'beginner' && f >= 6) return PRUNE_VERDICTS.PRUNE_C;
+     if (true && f >= 6) return PRUNE_VERDICTS.PRUNE_C;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning C — experience × frequency biological beginner + 6x → PRUNE_C
  and 7 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:69:7
-     if (c.experience === 'advanced' && f <= 2) return PRUNE_VERDICTS.PRUNE_C;
+     if (true && f <= 2) return PRUNE_VERDICTS.PRUNE_C;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning C — experience × frequency biological advanced + 2x → PRUNE_C (sub-optimal MEV)
  and 6 more tests!

[Survived] MethodExpression
src/simulator/pruning.js:79:27
-     const hasSevereInjury = c.recovery.injury_flags.some((f) =>
-       /severe|<3luni|recent|acute/i.test(String(f)),
-     );
+     const hasSevereInjury = c.recovery.injury_flags.every(f => /severe|<3luni|recent|acute/i.test(String(f)));
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning D — history × recovery contradiction T0 + severe injury → TRIPWIRE medical referral
  and 5 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:82:7
-     if (c.history.tier === 'T0' && hasSevereInjury) {
+     if (true && hasSevereInjury) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning D — history × recovery contradiction T0 + severe injury → TRIPWIRE medical referral
  and 5 more tests!

[Survived] LogicalOperator
src/simulator/pruning.js:82:7
-     if (c.history.tier === 'T0' && hasSevereInjury) {
+     if (c.history.tier === 'T0' || hasSevereInjury) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning D — history × recovery contradiction T0 + severe injury → TRIPWIRE medical referral
  and 5 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:85:7
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (true) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning E — goal × phase invalid Forta + CUT → PRUNE_E
  and 4 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:85:7
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (false) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning E — goal × phase invalid Forta + CUT → PRUNE_E
  and 4 more tests!

[Survived] LogicalOperator
src/simulator/pruning.js:85:7
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (c.history.tier === 'T3' || c.recovery.vitality_tier === 'LOW') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning E — goal × phase invalid Forta + CUT → PRUNE_E
  and 4 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:85:7
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (true && c.recovery.vitality_tier === 'LOW') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning E — goal × phase invalid Forta + CUT → PRUNE_E
  and 4 more tests!

[Survived] EqualityOperator
src/simulator/pruning.js:85:7
-     if (c.history.tier === 'T3' && c.recovery.vitality_tier === 'LOW') {
+     if (c.history.tier !== 'T3' && c.recovery.vitality_tier === 'LOW') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning E — goal × phase invalid Forta + CUT → PRUNE_E
  and 4 more tests!

[Survived] ConditionalExpression
src/simulator/pruning.js:98:7
-     if (c.goal.template === 'Forta' && c.goal.phase === 'CUT') {
+     if (true && c.goal.phase === 'CUT') {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
    Pruning E — goal × phase invalid Forta + CUT → PRUNE_E
  and 4 more tests!

[Survived] EqualityOperator
src/simulator/pruning.js:143:16
-       } else if (verdict === PRUNE_VERDICTS.TRIPWIRE) {
+       } else if (verdict !== PRUNE_VERDICTS.TRIPWIRE) {
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    pruneInvalidCombos batch partitions input into valid + pruned + tripwires

[Survived] ObjectLiteral
src/simulator/pruning.js:146:19
-         pruned.push({ rule: String(rule), branch: c });
+         pruned.push({});
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    pruneInvalidCombos batch partitions input into valid + pruned + tripwires

[Survived] Regex
src/simulator/runner.js:17:67
-     const personaTag = String(c.persona.name).toLowerCase().replace(/[^a-z0-9]+/g, '');
+     const personaTag = String(c.persona.name).toLowerCase().replace(/[^a-z0-9]/g, '');
Tests ran:
    branchId deterministic generation same input → same id
    branchId deterministic generation contains persona + goal + experience + equipment + frequency + tier + recovery
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
  and 1 more test!

[Survived] ConditionalExpression
src/simulator/runner.js:19:20
-     const equipTag = c.equipment.length === 0 ? 'none' : c.equipment.map((e) => String(e).toLowerCase()).join('+');
+     const equipTag = false ? 'none' : c.equipment.map((e) => String(e).toLowerCase()).join('+');
Tests ran:
    branchId deterministic generation same input → same id
    branchId deterministic generation contains persona + goal + experience + equipment + frequency + tier + recovery
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
  and 1 more test!

[Survived] ConditionalExpression
src/simulator/runner.js:20:24
-     const recoveryTag = (c.recovery.injury_flags.length > 0 ? c.recovery.injury_flags.map((f) => String(f).toLowerCase()).join('+') : 'clean')
+     const recoveryTag = (true ? c.recovery.injury_flags.map((f) => String(f).toLowerCase()).join('+') : 'clean')
Tests ran:
    branchId deterministic generation same input → same id
    branchId deterministic generation contains persona + goal + experience + equipment + frequency + tier + recovery
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
  and 1 more test!

[Survived] EqualityOperator
src/simulator/runner.js:20:24
-     const recoveryTag = (c.recovery.injury_flags.length > 0 ? c.recovery.injury_flags.map((f) => String(f).toLowerCase()).join('+') : 'clean')
+     const recoveryTag = (c.recovery.injury_flags.length >= 0 ? c.recovery.injury_flags.map((f) => String(f).toLowerCase()).join('+') : 'clean')
Tests ran:
    branchId deterministic generation same input → same id
    branchId deterministic generation contains persona + goal + experience + equipment + frequency + tier + recovery
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
  and 1 more test!

[Survived] MethodExpression
src/simulator/runner.js:21:15
-       + `-vit-${c.recovery.vitality_tier.toLowerCase()}`;
+       + `-vit-${c.recovery.vitality_tier.toUpperCase()}`;
Tests ran:
    branchId deterministic generation same input → same id
    branchId deterministic generation contains persona + goal + experience + equipment + frequency + tier + recovery
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
  and 1 more test!

[Survived] ArrayDeclaration
src/simulator/runner.js:63:23
-     const perBranchMs = [];
+     const perBranchMs = ["Stryker was here"];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:66:17
-       const t0 = (typeof performance !== 'undefined' ? performance.now() : Date.now());
+       const t0 = (true ? performance.now() : Date.now());
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:66:17
-       const t0 = (typeof performance !== 'undefined' ? performance.now() : Date.now());
+       const t0 = (false ? performance.now() : Date.now());
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:66:17
-       const t0 = (typeof performance !== 'undefined' ? performance.now() : Date.now());
+       const t0 = (typeof performance === 'undefined' ? performance.now() : Date.now());
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:72:20
-       const status = flags.length > 0 ? 'FLAGGED' : 'AUTO_RESOLVED';
+       const status = true ? 'FLAGGED' : 'AUTO_RESOLVED';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:72:20
-       const status = flags.length > 0 ? 'FLAGGED' : 'AUTO_RESOLVED';
+       const status = false ? 'FLAGGED' : 'AUTO_RESOLVED';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:72:20
-       const status = flags.length > 0 ? 'FLAGGED' : 'AUTO_RESOLVED';
+       const status = flags.length >= 0 ? 'FLAGGED' : 'AUTO_RESOLVED';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:72:20
-       const status = flags.length > 0 ? 'FLAGGED' : 'AUTO_RESOLVED';
+       const status = flags.length <= 0 ? 'FLAGGED' : 'AUTO_RESOLVED';
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:85:17
-       const t1 = (typeof performance !== 'undefined' ? performance.now() : Date.now());
+       const t1 = (true ? performance.now() : Date.now());
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] MethodExpression
src/simulator/runner.js:89:25
-     const auto_resolved = branches.filter((b) => b.status === 'AUTO_RESOLVED').length;
+     const auto_resolved = branches.length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrowFunction
src/simulator/runner.js:89:41
-     const auto_resolved = branches.filter((b) => b.status === 'AUTO_RESOLVED').length;
+     const auto_resolved = branches.filter(() => undefined).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:89:48
-     const auto_resolved = branches.filter((b) => b.status === 'AUTO_RESOLVED').length;
+     const auto_resolved = branches.filter((b) => true).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:89:48
-     const auto_resolved = branches.filter((b) => b.status === 'AUTO_RESOLVED').length;
+     const auto_resolved = branches.filter((b) => false).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:89:48
-     const auto_resolved = branches.filter((b) => b.status === 'AUTO_RESOLVED').length;
+     const auto_resolved = branches.filter((b) => b.status !== 'AUTO_RESOLVED').length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] MethodExpression
src/simulator/runner.js:90:19
-     const flagged = branches.filter((b) => b.status === 'FLAGGED').length;
+     const flagged = branches.length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrowFunction
src/simulator/runner.js:90:35
-     const flagged = branches.filter((b) => b.status === 'FLAGGED').length;
+     const flagged = branches.filter(() => undefined).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:90:42
-     const flagged = branches.filter((b) => b.status === 'FLAGGED').length;
+     const flagged = branches.filter((b) => true).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:90:42
-     const flagged = branches.filter((b) => b.status === 'FLAGGED').length;
+     const flagged = branches.filter((b) => false).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:90:42
-     const flagged = branches.filter((b) => b.status === 'FLAGGED').length;
+     const flagged = branches.filter((b) => b.status !== 'FLAGGED').length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] MethodExpression
src/simulator/runner.js:91:32
-     const invariant_violations = branches.filter((b) => b.flags.includes('invariant_violation')).length;
+     const invariant_violations = branches.length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrowFunction
src/simulator/runner.js:91:48
-     const invariant_violations = branches.filter((b) => b.flags.includes('invariant_violation')).length;
+     const invariant_violations = branches.filter(() => undefined).length;
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] MethodExpression
src/simulator/runner.js:94:18
-     const sorted = [...perBranchMs].sort((a, b) => a - b);
+     const sorted = [...perBranchMs];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrayDeclaration
src/simulator/runner.js:94:18
-     const sorted = [...perBranchMs].sort((a, b) => a - b);
+     const sorted = [].sort((a, b) => a - b);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArrowFunction
src/simulator/runner.js:94:40
-     const sorted = [...perBranchMs].sort((a, b) => a - b);
+     const sorted = [...perBranchMs].sort(() => undefined);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArithmeticOperator
src/simulator/runner.js:94:50
-     const sorted = [...perBranchMs].sort((a, b) => a - b);
+     const sorted = [...perBranchMs].sort((a, b) => a + b);
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:95:21
-     const median_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length / 2)];
+     const median_ms = true ? 0 : sorted[Math.floor(sorted.length / 2)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:95:21
-     const median_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length / 2)];
+     const median_ms = false ? 0 : sorted[Math.floor(sorted.length / 2)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:95:21
-     const median_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length / 2)];
+     const median_ms = sorted.length !== 0 ? 0 : sorted[Math.floor(sorted.length / 2)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:96:18
-     const p95_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length * 0.95)];
+     const p95_ms = true ? 0 : sorted[Math.floor(sorted.length * 0.95)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:96:18
-     const p95_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length * 0.95)];
+     const p95_ms = false ? 0 : sorted[Math.floor(sorted.length * 0.95)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] EqualityOperator
src/simulator/runner.js:96:18
-     const p95_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length * 0.95)];
+     const p95_ms = sorted.length !== 0 ? 0 : sorted[Math.floor(sorted.length * 0.95)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ArithmeticOperator
src/simulator/runner.js:96:62
-     const p95_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length * 0.95)];
+     const p95_ms = sorted.length === 0 ? 0 : sorted[Math.floor(sorted.length / 0.95)];
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:114:19
-         budget_met: median_ms < 50 && p95_ms < 100,
+         budget_met: true,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning

[Survived] ConditionalExpression
src/simulator/runner.js:114:19
-         budget_met: median_ms < 50 && p95_ms < 100,
+         budget_met: false,
Tests ran:
    runFullSimulation end-to-end smoke (10 candidates) runs pipeline without throwing + produces summary structure
    runFullSimulation end-to-end smoke (10 candidates) filterFlaggedOnly returns only branches needing Claude reasoning
