[Survived] LogicalOperator
src/storage/tieringEngine.js:136:7
-     if (!entry || typeof entry !== 'object') return null;
+     if (!entry && typeof entry !== 'object') return null;
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 7 more tests!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:136:17
-     if (!entry || typeof entry !== 'object') return null;
+     if (!entry || false) return null;
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 7 more tests!

[Survived] LogicalOperator
src/storage/tieringEngine.js:137:7
-     if (typeof entry.ts === 'number' && Number.isFinite(entry.ts)) return entry.ts;
+     if (typeof entry.ts === 'number' || Number.isFinite(entry.ts)) return entry.ts;
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 7 more tests!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:137:7
-     if (typeof entry.ts === 'number' && Number.isFinite(entry.ts)) return entry.ts;
+     if (true && Number.isFinite(entry.ts)) return entry.ts;
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 7 more tests!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:138:7
-     if (typeof entry.date === 'string') {
+     if (true) {
Tests ran:
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing

[Survived] ConditionalExpression
src/storage/tieringEngine.js:140:9
-       if (Number.isFinite(parsed)) return parsed;
+       if (true) return parsed;
Tests ran:
    classifyByAge parses date field as fallback when ts missing

[Survived] LogicalOperator
src/storage/tieringEngine.js:168:22
-     const ageLimitMs = opts.ageLimitMs ?? TIER0_AGE_LIMIT_MS;
+     const ageLimitMs = opts.ageLimitMs && TIER0_AGE_LIMIT_MS;
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
  and 5 more tests!

[Survived] ArrayDeclaration
src/storage/tieringEngine.js:172:18
-     const perKey = [];
+     const perKey = ["Stryker was here"];
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
  and 5 more tests!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:184:9
-       if (!Array.isArray(entries) || entries.length === 0) {
+       if (false) {
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
  and 5 more tests!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:184:36
-       if (!Array.isArray(entries) || entries.length === 0) {
+       if (!Array.isArray(entries) || false) {
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
  and 3 more tests!

[Survived] BlockStatement
src/storage/tieringEngine.js:184:58
-       if (!Array.isArray(entries) || entries.length === 0) {
-         perKey.push({ key: tier0Key, store: storeName, rotated: 0 });
-         continue;
-       }
+       if (!Array.isArray(entries) || entries.length === 0) {}
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
  and 5 more tests!

[Survived] ObjectLiteral
src/storage/tieringEngine.js:185:19
-         perKey.push({ key: tier0Key, store: storeName, rotated: 0 });
+         perKey.push({});
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
  and 5 more tests!

[Survived] ObjectLiteral
src/storage/tieringEngine.js:191:19
-         perKey.push({ key: tier0Key, store: storeName, rotated: 0 });
+         perKey.push({});
Tests ran:
    rotateOnce returns zero rotation when all entries hot
    rotateOnce idempotent: re-run with no cold = no-op

[Survived] ObjectLiteral
src/storage/tieringEngine.js:213:17
-       perKey.push({ key: tier0Key, store: storeName, rotated: cold.length });
+       perKey.push({});
Tests ran:
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce continues with other keys when one fails
    rotateOnce audit logs success events (kind: rotation)

[Survived] EqualityOperator
src/storage/tieringEngine.js:242:25
-     for (let attempt = 0; attempt <= backoffMs.length; attempt++) {
+     for (let attempt = 0; attempt < backoffMs.length; attempt++) {
Tests ran:
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails
  and 1 more test!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:245:11
-         if (res?.written === entries.length) return { ok: true };
+         if (true) return { ok: true };
Tests ran:
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce continues with other keys when one fails
    rotateOnce audit logs success events (kind: rotation)

[Survived] OptionalChaining
src/storage/tieringEngine.js:245:11
-         if (res?.written === entries.length) return { ok: true };
+         if (res.written === entries.length) return { ok: true };
Tests ran:
    rotateOnce moves cold entries to Tier 1 + prunes Tier 0
    rotateOnce continues with other keys when one fails
    rotateOnce audit logs success events (kind: rotation)

[Survived] BlockStatement
src/storage/tieringEngine.js:247:19
-       } catch (err) {
-         lastErr = err;
-       }
+       } catch (err) {}
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:250:9
-       if (attempt < backoffMs.length) {
+       if (true) {
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:250:9
-       if (attempt < backoffMs.length) {
+       if (false) {
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] EqualityOperator
src/storage/tieringEngine.js:250:9
-       if (attempt < backoffMs.length) {
+       if (attempt >= backoffMs.length) {
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] EqualityOperator
src/storage/tieringEngine.js:250:9
-       if (attempt < backoffMs.length) {
+       if (attempt <= backoffMs.length) {
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] BlockStatement
src/storage/tieringEngine.js:250:37
-       if (attempt < backoffMs.length) {
-         await _sleep(backoffMs[attempt]);
-       }
+       if (attempt < backoffMs.length) {}
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ObjectLiteral
src/storage/tieringEngine.js:254:32
-     _safeSentry(sentry, lastErr, {
-       tags: { component: 'tieringEngine', op: 'tier1_write_persistent_fail', store: storeName },
-       extra: { entriesCount: entries.length },
-     });
+     _safeSentry(sentry, lastErr, {});
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ObjectLiteral
src/storage/tieringEngine.js:255:11
-       tags: { component: 'tieringEngine', op: 'tier1_write_persistent_fail', store: storeName },
+       tags: {},
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ObjectLiteral
src/storage/tieringEngine.js:256:12
-       extra: { entriesCount: entries.length },
+       extra: {},
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ObjectLiteral
src/storage/tieringEngine.js:258:10
-     return { ok: false, reason: _stringifyErr(lastErr) };
+     return {};
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] BlockStatement
src/storage/tieringEngine.js:261:21
-   function _sleep(ms) {
-     return new Promise(r => setTimeout(r, ms));
-   }
+   function _sleep(ms) {}
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:275:7
-     if (bytes < TIER0_SIZE_LIMIT_BYTES) {
+     if (true) {
Tests ran:
    ensureTier0Capacity returns no-op when localStorage under quota

[Survived] EqualityOperator
src/storage/tieringEngine.js:275:7
-     if (bytes < TIER0_SIZE_LIMIT_BYTES) {
+     if (bytes <= TIER0_SIZE_LIMIT_BYTES) {
Tests ran:
    ensureTier0Capacity returns no-op when localStorage under quota

[Survived] LogicalOperator
src/storage/tieringEngine.js:297:22
-     const intervalMs = opts.intervalMs ?? ROTATION_CHECK_INTERVAL_MS;
+     const intervalMs = opts.intervalMs && ROTATION_CHECK_INTERVAL_MS;
Tests ran:
    initAutoBackup runs initial pass + registers timer
    initAutoBackup skips initial run when runImmediately=false

[Survived] LogicalOperator
src/storage/tieringEngine.js:299:22
-     const rotateOpts = opts.rotateOpts ?? {};
+     const rotateOpts = opts.rotateOpts && {};
Tests ran:
    initAutoBackup runs initial pass + registers timer
    initAutoBackup skips initial run when runImmediately=false

[Survived] LogicalOperator
src/storage/tieringEngine.js:298:26
-     const runImmediately = opts.runImmediately ?? true;
+     const runImmediately = opts.runImmediately && true;
Tests ran:
    initAutoBackup runs initial pass + registers timer
    initAutoBackup skips initial run when runImmediately=false

[Survived] ConditionalExpression
src/storage/tieringEngine.js:304:7
-     if (runImmediately) {
+     if (false) {
Tests ran:
    initAutoBackup runs initial pass + registers timer
    initAutoBackup skips initial run when runImmediately=false

[Survived] BlockStatement
src/storage/tieringEngine.js:304:23
-     if (runImmediately) {
-       try {
-         initial = await rotateOnce(rotateOpts);
-       } catch {
-         initial = null; // Non-fatal — let timer retry next tick
-       }
-     }
+     if (runImmediately) {}
Tests ran:
    initAutoBackup runs initial pass + registers timer

[Survived] BlockStatement
src/storage/tieringEngine.js:305:9
-       try {
-         initial = await rotateOnce(rotateOpts);
-       } catch {
+       try {} catch {
Tests ran:
    initAutoBackup runs initial pass + registers timer

[Survived] ConditionalExpression
src/storage/tieringEngine.js:324:7
-     if (_checkTimer) {
+     if (true) {
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 20 more tests!

[Survived] BlockStatement
src/storage/tieringEngine.js:323:34
-   export function stopAutoBackup() {
-     if (_checkTimer) {
-       clearInterval(_checkTimer);
-       _checkTimer = null;
-     }
-   }
+   export function stopAutoBackup() {}
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 20 more tests!

[Survived] ConditionalExpression
src/storage/tieringEngine.js:324:7
-     if (_checkTimer) {
+     if (false) {
Tests ran:
    classifyByAge classifies entries with ts field by age
    classifyByAge treats entries without ts as hot (defensive)
    classifyByAge parses date field as fallback when ts missing
  and 20 more tests!

[Survived] BlockStatement
src/storage/tieringEngine.js:324:20
-     if (_checkTimer) {
-       clearInterval(_checkTimer);
-       _checkTimer = null;
-     }
+     if (_checkTimer) {}
Tests ran:
    initAutoBackup runs initial pass + registers timer
    initAutoBackup skips initial run when runImmediately=false

[Survived] ConditionalExpression
src/storage/tieringEngine.js:333:7
-     if (!sentry?.captureException) return;
+     if (false) return;
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] OptionalChaining
src/storage/tieringEngine.js:333:8
-     if (!sentry?.captureException) return;
+     if (!sentry.captureException) return;
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] BlockStatement
src/storage/tieringEngine.js:338:29
-   function _stringifyErr(err) {
-     if (!err) return 'unknown';
-     if (err instanceof Error) return err.message || err.toString();
-     return String(err);
-   }
+   function _stringifyErr(err) {}
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] BooleanLiteral
src/storage/tieringEngine.js:339:7
-     if (!err) return 'unknown';
+     if (err) return 'unknown';
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:339:7
-     if (!err) return 'unknown';
+     if (true) return 'unknown';
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:339:7
-     if (!err) return 'unknown';
+     if (false) return 'unknown';
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:340:7
-     if (err instanceof Error) return err.message || err.toString();
+     if (true) return err.message || err.toString();
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:340:7
-     if (err instanceof Error) return err.message || err.toString();
+     if (false) return err.message || err.toString();
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:340:36
-     if (err instanceof Error) return err.message || err.toString();
+     if (err instanceof Error) return true;
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] ConditionalExpression
src/storage/tieringEngine.js:340:36
-     if (err instanceof Error) return err.message || err.toString();
+     if (err instanceof Error) return false;
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[Survived] LogicalOperator
src/storage/tieringEngine.js:340:36
-     if (err instanceof Error) return err.message || err.toString();
+     if (err instanceof Error) return err.message && err.toString();
Tests ran:
    rotateOnce does NOT prune Tier 0 if Tier 1 write fails (zero info loss)
    rotateOnce continues with other keys when one fails

[NoCoverage] BlockStatement
src/themes/themeManager.js:5:37
-   export function applyTheme(themeId) {
-     const theme = themes[themeId] || themes.forge;
-     const root = document.documentElement;
-     root.removeAttribute('data-theme');
-     Object.entries(theme.vars).forEach(([k, v]) => root.style.setProperty(k, v));
-     localStorage.setItem('active-theme', theme.id);
-     loadGoogleFonts(theme);
-     injectThemeAnimations(theme.id);
-     root.setAttribute('data-theme', theme.id);
-     setTimeout(() => {
-       if (window.renderDash) window.renderDash();
-       if (window.renderCoachIdle) window.renderCoachIdle();
-     }, 0);
-   }
+   export function applyTheme(themeId) {}

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:6:17
-     const theme = themes[themeId] || themes.forge;
+     const theme = true;

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:6:17
-     const theme = themes[themeId] || themes.forge;
+     const theme = false;

[NoCoverage] LogicalOperator
src/themes/themeManager.js:6:17
-     const theme = themes[themeId] || themes.forge;
+     const theme = themes[themeId] && themes.forge;

[NoCoverage] ArrowFunction
src/themes/themeManager.js:9:38
-     Object.entries(theme.vars).forEach(([k, v]) => root.style.setProperty(k, v));
+     Object.entries(theme.vars).forEach(() => undefined);

[NoCoverage] BlockStatement
src/themes/themeManager.js:14:20
-     setTimeout(() => {
-       if (window.renderDash) window.renderDash();
-       if (window.renderCoachIdle) window.renderCoachIdle();
-     }, 0);
+     setTimeout(() => {}, 0);

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:15:9
-       if (window.renderDash) window.renderDash();
+       if (true) window.renderDash();

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:15:9
-       if (window.renderDash) window.renderDash();
+       if (false) window.renderDash();

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:16:9
-       if (window.renderCoachIdle) window.renderCoachIdle();
+       if (true) window.renderCoachIdle();

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:16:9
-       if (window.renderCoachIdle) window.renderCoachIdle();
+       if (false) window.renderCoachIdle();

[NoCoverage] BlockStatement
src/themes/themeManager.js:20:34
-   export function getActiveTheme() {
-     return localStorage.getItem('active-theme') || 'forge';
-   }
+   export function getActiveTheme() {}

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:21:10
-     return localStorage.getItem('active-theme') || 'forge';
+     return true;

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:21:10
-     return localStorage.getItem('active-theme') || 'forge';
+     return false;

[NoCoverage] LogicalOperator
src/themes/themeManager.js:21:10
-     return localStorage.getItem('active-theme') || 'forge';
+     return localStorage.getItem('active-theme') && 'forge';

[NoCoverage] BlockStatement
src/themes/themeManager.js:24:33
-   function loadGoogleFonts(theme) {
-     const existingLink = document.getElementById('theme-fonts');
-     if (existingLink) existingLink.remove();
-     const link = document.createElement('link');
-     link.id = 'theme-fonts';
-     link.rel = 'stylesheet';
-     link.href = `https://fonts.googleapis.com/css2?family=${theme.fonts}&display=swap`;
-     document.head.appendChild(link);
-   }
+   function loadGoogleFonts(theme) {}

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:26:7
-     if (existingLink) existingLink.remove();
+     if (true) existingLink.remove();

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:26:7
-     if (existingLink) existingLink.remove();
+     if (false) existingLink.remove();

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:36:7
-     if (existing) existing.remove();
+     if (true) existing.remove();

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:36:7
-     if (existing) existing.remove();
+     if (false) existing.remove();

[NoCoverage] ObjectLiteral
src/themes/themeManager.js:40:22
-     const animations = {
-       forge: `
-         @keyframes forgeGlow {
-           0%, 100% { box-shadow: 0 0 8px rgba(255,107,26,0.3), 0 0 20px rgba(255,170,0,0.15); }
-           50% { box-shadow: 0 0 18px rgba(255,107,26,0.6), 0 0 40px rgba(255,170,0,0.3); }
-         }
-         [data-theme="forge"] .hero-stats { animation: forgeGlow 3s ease-in-out infinite; }
-         [data-theme="forge"] .btn-start:focus, [data-theme="forge"] .btn-done:focus { animation: forgeGlow 2s ease-in-out infinite; }
-       `,
-       zen: `
-         @keyframes zenBreath {
-           0%, 100% { opacity: 1; }
-           50% { opacity: 0.82; }
-         }
-         [data-theme="zen"] .card { animation: zenBreath 4s ease-in-out infinite; }
-       `,
-       anime: `
-         @keyframes animeFlicker {
-           0%, 100% { box-shadow: 0 0 6px rgba(0,240,255,0.4), 0 0 14px rgba(0,240,255,0.2); }
-           33% { box-shadow: 0 0 12px rgba(0,240,255,0.7), 0 0 28px rgba(0,240,255,0.4); }
-           66% { box-shadow: 0 0 4px rgba(0,240,255,0.3), 0 0 10px rgba(0,240,255,0.15); }
-         }
-         [data-theme="anime"] .nb.active { animation: animeFlicker 1.8s ease-in-out infinite; }
-         [data-theme="anime"] .rpe-btn.sel { animation: animeFlicker 1.5s ease-in-out infinite; }
-       `,
-     };
+     const animations = {};

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:67:23
-     style.textContent = animations[themeId] || '';
+     style.textContent = true;

[NoCoverage] ConditionalExpression
src/themes/themeManager.js:67:23
-     style.textContent = animations[themeId] || '';
+     style.textContent = false;

[NoCoverage] LogicalOperator
src/themes/themeManager.js:67:23
-     style.textContent = animations[themeId] || '';
+     style.textContent = animations[themeId] && '';

[NoCoverage] ObjectLiteral
src/themes/themes.js:2:10
-     forge: {
-       id: 'forge', name: 'FORGE', emoji: '🔥',
-       fonts: 'Bebas+Neue&family=DM+Sans:wght@400;500;600;700&family=DM+Mono:wght@400;500',
-       vars: {
-         '--bg':       '#0f0c08',
-         '--bg2':      '#1a1510',
-         '--bg3':      '#231e18',
-         '--card':     '#1e1810',
-         '--border':   '#3a2e20',
-         '--accent':   '#ff6b1a',
-         '--accent2':  '#ffaa00',
-         '--accent3':  '#ffd060',
-         '--purple':   '#c084fc',
-         '--green':    '#6acd6a',
-         '--red':      '#ff4444',
-         '--yellow':   '#ffcc44',
-         '--text':     '#e8d4b0',
-         '--text2':    '#b09070',
-         '--text3':    '#aaa090',
-         '--r':        '10px',
-         '--rs':       '6px',
-       }
-     },
+     forge: {},

[NoCoverage] ObjectLiteral
src/themes/themes.js:5:11
-       vars: {
-         '--bg':       '#0f0c08',
-         '--bg2':      '#1a1510',
-         '--bg3':      '#231e18',
-         '--card':     '#1e1810',
-         '--border':   '#3a2e20',
-         '--accent':   '#ff6b1a',
-         '--accent2':  '#ffaa00',
-         '--accent3':  '#ffd060',
-         '--purple':   '#c084fc',
-         '--green':    '#6acd6a',
-         '--red':      '#ff4444',
-         '--yellow':   '#ffcc44',
-         '--text':     '#e8d4b0',
-         '--text2':    '#b09070',
-         '--text3':    '#aaa090',
-         '--r':        '10px',
-         '--rs':       '6px',
-       }
+       vars: {}

[NoCoverage] ObjectLiteral
src/themes/themes.js:25:8
-     zen: {
-       id: 'zen', name: 'ZEN', emoji: '🌿',
-       fonts: 'Playfair+Display:ital,wght@0,400;0,700;0,900;1,700&family=Jost:wght@300;400;500;600',
-       vars: {
-         '--bg':       '#080c08',
-         '--bg2':      '#0e160e',
-         '--bg3':      '#141e14',
-         '--card':     '#101810',
-         '--border':   '#1e301e',
-         '--accent':   '#6aab3f',
-         '--accent2':  '#8fbc6a',
-         '--accent3':  '#b8d498',
-         '--purple':   '#9b8ec4',
-         '--green':    '#4acd4a',
-         '--red':      '#e05050',
-         '--yellow':   '#d4b84a',
-         '--text':     '#c8dcc0',
-         '--text2':    '#8aaa80',
-         '--text3':    '#aabb9a',
-         '--r':        '12px',
-         '--rs':       '8px',
-       }
-     },
+     zen: {},

[NoCoverage] ObjectLiteral
src/themes/themes.js:28:11
-       vars: {
-         '--bg':       '#080c08',
-         '--bg2':      '#0e160e',
-         '--bg3':      '#141e14',
-         '--card':     '#101810',
-         '--border':   '#1e301e',
-         '--accent':   '#6aab3f',
-         '--accent2':  '#8fbc6a',
-         '--accent3':  '#b8d498',
-         '--purple':   '#9b8ec4',
-         '--green':    '#4acd4a',
-         '--red':      '#e05050',
-         '--yellow':   '#d4b84a',
-         '--text':     '#c8dcc0',
-         '--text2':    '#8aaa80',
-         '--text3':    '#aabb9a',
-         '--r':        '12px',
-         '--rs':       '8px',
-       }
+       vars: {}

[NoCoverage] ObjectLiteral
src/themes/themes.js:48:10
-     anime: {
-       id: 'anime', name: 'ANIME', emoji: '⚡',
-       fonts: 'Orbitron:wght@400;700;900&family=Rajdhani:wght@400;600;700&family=Share+Tech+Mono',
-       vars: {
-         '--bg':       '#05050f',
-         '--bg2':      '#0a0a1a',
-         '--bg3':      '#0f0f25',
-         '--card':     '#080820',
-         '--border':   '#1a1a40',
-         '--accent':   '#00f0ff',
-         '--accent2':  '#bf00ff',
-         '--accent3':  '#ffe600',
-         '--purple':   '#bf00ff',
-         '--green':    '#00ff88',
-         '--red':      '#ff0055',
-         '--yellow':   '#ffe600',
-         '--text':     '#b0c4ee',
-         '--text2':    '#7088bb',
-         '--text3':    '#8899bb',
-         '--r':        '4px',
-         '--rs':       '2px',
-       }
-     }
+     anime: {}

[NoCoverage] ObjectLiteral
src/themes/themes.js:51:11
-       vars: {
-         '--bg':       '#05050f',
-         '--bg2':      '#0a0a1a',
-         '--bg3':      '#0f0f25',
-         '--card':     '#080820',
-         '--border':   '#1a1a40',
-         '--accent':   '#00f0ff',
-         '--accent2':  '#bf00ff',
-         '--accent3':  '#ffe600',
-         '--purple':   '#bf00ff',
-         '--green':    '#00ff88',
-         '--red':      '#ff0055',
-         '--yellow':   '#ffe600',
-         '--text':     '#b0c4ee',
-         '--text2':    '#7088bb',
-         '--text3':    '#8899bb',
-         '--r':        '4px',
-         '--rs':       '2px',
-       }
+       vars: {}

[NoCoverage] ConditionalExpression
src/ui/nav.js:10:7
-     if (!pg || pg === current) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/ui/nav.js:10:7
-     if (!pg || pg === current) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/ui/nav.js:10:7
-     if (!pg || pg === current) return;
+     if (!pg && pg === current) return;

[NoCoverage] BooleanLiteral
src/ui/nav.js:10:7
-     if (!pg || pg === current) return;
+     if (pg || pg === current) return;

[NoCoverage] ConditionalExpression
src/ui/nav.js:10:14
-     if (!pg || pg === current) return;
+     if (!pg || false) return;

[NoCoverage] EqualityOperator
src/ui/nav.js:10:14
-     if (!pg || pg === current) return;
+     if (!pg || pg !== current) return;

[NoCoverage] BlockStatement
src/ui/nav.js:12:30
-     const doTransition = () => {
-       document.querySelectorAll('.page').forEach(p => p.classList.remove('active'));
-       document.querySelectorAll('.nb').forEach(b => b.classList.remove('active'));
-       pg.classList.add('active');
-       const idx = { coach: 0, dash: 1, weight: 2, prog: 3, plan: 4 }[page] || 0;
-       const nb = document.querySelectorAll('.nb')[idx];
-       if (nb) nb.classList.add('active');
-       const renders = {
-         coach: renderCoachIdle,
-         dash: renderDash,
-         weight: renderWeight,
-         prog: renderProg,
-         plan: renderPlan,
-       };
-       if (renders[page]) renders[page]();
-     };
+     const doTransition = () => {};

[NoCoverage] ArrowFunction
src/ui/nav.js:13:48
-       document.querySelectorAll('.page').forEach(p => p.classList.remove('active'));
+       document.querySelectorAll('.page').forEach(() => undefined);

[NoCoverage] ArrowFunction
src/ui/nav.js:14:46
-       document.querySelectorAll('.nb').forEach(b => b.classList.remove('active'));
+       document.querySelectorAll('.nb').forEach(() => undefined);

[NoCoverage] ConditionalExpression
src/ui/nav.js:16:17
-       const idx = { coach: 0, dash: 1, weight: 2, prog: 3, plan: 4 }[page] || 0;
+       const idx = true;
