[NoCoverage] ConditionalExpression
src/ui/nav.js:16:17
-       const idx = { coach: 0, dash: 1, weight: 2, prog: 3, plan: 4 }[page] || 0;
+       const idx = false;

[NoCoverage] LogicalOperator
src/ui/nav.js:16:17
-       const idx = { coach: 0, dash: 1, weight: 2, prog: 3, plan: 4 }[page] || 0;
+       const idx = {
+     coach: 0,
+     dash: 1,
+     weight: 2,
+     prog: 3,
+     plan: 4
+   }[page] && 0;

[NoCoverage] ObjectLiteral
src/ui/nav.js:16:17
-       const idx = { coach: 0, dash: 1, weight: 2, prog: 3, plan: 4 }[page] || 0;
+       const idx = {}[page] || 0;

[NoCoverage] ConditionalExpression
src/ui/nav.js:18:9
-       if (nb) nb.classList.add('active');
+       if (true) nb.classList.add('active');

[NoCoverage] ConditionalExpression
src/ui/nav.js:18:9
-       if (nb) nb.classList.add('active');
+       if (false) nb.classList.add('active');

[NoCoverage] ObjectLiteral
src/ui/nav.js:19:21
-       const renders = {
-         coach: renderCoachIdle,
-         dash: renderDash,
-         weight: renderWeight,
-         prog: renderProg,
-         plan: renderPlan,
-       };
+       const renders = {};

[NoCoverage] ConditionalExpression
src/ui/nav.js:26:9
-       if (renders[page]) renders[page]();
+       if (true) renders[page]();

[NoCoverage] ConditionalExpression
src/ui/nav.js:26:9
-       if (renders[page]) renders[page]();
+       if (false) renders[page]();

[NoCoverage] ConditionalExpression
src/ui/nav.js:29:7
-     if (current) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/ui/nav.js:29:7
-     if (current) {
+     if (false) {

[NoCoverage] BlockStatement
src/ui/nav.js:29:16
-     if (current) {
-       current.classList.add('page-exit');
-       setTimeout(() => {
-         current.classList.remove('page-exit');
-         doTransition();
-       }, 120);
-     } else {
+     if (current) {} else {

[NoCoverage] BlockStatement
src/ui/nav.js:31:22
-       setTimeout(() => {
-         current.classList.remove('page-exit');
-         doTransition();
-       }, 120);
+       setTimeout(() => {}, 120);

[NoCoverage] BlockStatement
src/ui/nav.js:35:10
-     } else {
-       doTransition();
-     }
+     } else {}

[NoCoverage] BlockStatement
src/ui/ui.js:6:53
-   export function toast(msg, color = 'var(--accent)') {
-     const t = $('toast'); if (!t) return;
-     t.textContent = msg;
-     t.style.background = color;
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
-     t.classList.add('show');
-     setTimeout(() => t.classList.remove('show'), 2600);
-   }
+   export function toast(msg, color = 'var(--accent)') {}

[NoCoverage] BooleanLiteral
src/ui/ui.js:7:29
-     const t = $('toast'); if (!t) return;
+     const t = $('toast'); if (t) return;

[NoCoverage] ConditionalExpression
src/ui/ui.js:7:29
-     const t = $('toast'); if (!t) return;
+     const t = $('toast'); if (true) return;

[NoCoverage] ConditionalExpression
src/ui/ui.js:7:29
-     const t = $('toast'); if (!t) return;
+     const t = $('toast'); if (false) return;

[NoCoverage] ConditionalExpression
src/ui/ui.js:10:20
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (true) ? '#000' : '#fff';

[NoCoverage] ConditionalExpression
src/ui/ui.js:10:20
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (false) ? '#000' : '#fff';

[NoCoverage] LogicalOperator
src/ui/ui.js:10:20
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (color === 'var(--accent)' && color === 'var(--green)') ? '#000' : '#fff';

[NoCoverage] ConditionalExpression
src/ui/ui.js:10:20
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (false || color === 'var(--green)') ? '#000' : '#fff';

[NoCoverage] EqualityOperator
src/ui/ui.js:10:20
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (color !== 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';

[NoCoverage] ConditionalExpression
src/ui/ui.js:10:49
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (color === 'var(--accent)' || false) ? '#000' : '#fff';

[NoCoverage] EqualityOperator
src/ui/ui.js:10:49
-     t.style.color = (color === 'var(--accent)' || color === 'var(--green)') ? '#000' : '#fff';
+     t.style.color = (color === 'var(--accent)' || color !== 'var(--green)') ? '#000' : '#fff';

[NoCoverage] ArrowFunction
src/ui/ui.js:12:14
-     setTimeout(() => t.classList.remove('show'), 2600);
+     setTimeout(() => undefined, 2600);

[NoCoverage] BlockStatement
src/ui/ui.js:17:27
-   function vibrate(pattern) { if (navigator.vibrate) navigator.vibrate(pattern); }
+   function vibrate(pattern) {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:17:33
-   function vibrate(pattern) { if (navigator.vibrate) navigator.vibrate(pattern); }
+   function vibrate(pattern) { if (true) navigator.vibrate(pattern); }

[NoCoverage] ConditionalExpression
src/ui/ui.js:17:33
-   function vibrate(pattern) { if (navigator.vibrate) navigator.vibrate(pattern); }
+   function vibrate(pattern) { if (false) navigator.vibrate(pattern); }

[NoCoverage] BlockStatement
src/ui/ui.js:19:57
-   export function beep(freq = 880, dur = 0.15, vol = 0.3) {
-     try {
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
-       const o = audioCtx.createOscillator(), g = audioCtx.createGain();
-       o.connect(g); g.connect(audioCtx.destination);
-       o.frequency.value = freq; o.type = 'sine';
-       g.gain.setValueAtTime(vol, audioCtx.currentTime);
-       g.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime + dur);
-       o.start(); o.stop(audioCtx.currentTime + dur);
-     } catch (e) {}
-   }
+   export function beep(freq = 880, dur = 0.15, vol = 0.3) {}

[NoCoverage] BlockStatement
src/ui/ui.js:20:7
-     try {
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
-       const o = audioCtx.createOscillator(), g = audioCtx.createGain();
-       o.connect(g); g.connect(audioCtx.destination);
-       o.frequency.value = freq; o.type = 'sine';
-       g.gain.setValueAtTime(vol, audioCtx.currentTime);
-       g.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime + dur);
-       o.start(); o.stop(audioCtx.currentTime + dur);
-     } catch (e) {}
+     try {} catch (e) {}

[NoCoverage] BooleanLiteral
src/ui/ui.js:21:9
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
+       if (audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();

[NoCoverage] ConditionalExpression
src/ui/ui.js:21:9
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
+       if (true) audioCtx = new (window.AudioContext || window.webkitAudioContext)();

[NoCoverage] ConditionalExpression
src/ui/ui.js:21:9
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
+       if (false) audioCtx = new (window.AudioContext || window.webkitAudioContext)();

[NoCoverage] ConditionalExpression
src/ui/ui.js:21:36
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
+       if (!audioCtx) audioCtx = new (true)();

[NoCoverage] ConditionalExpression
src/ui/ui.js:21:36
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
+       if (!audioCtx) audioCtx = new (false)();

[NoCoverage] LogicalOperator
src/ui/ui.js:21:36
-       if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
+       if (!audioCtx) audioCtx = new (window.AudioContext && window.webkitAudioContext)();

[NoCoverage] ArithmeticOperator
src/ui/ui.js:26:48
-       g.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime + dur);
+       g.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime - dur);

[NoCoverage] ArithmeticOperator
src/ui/ui.js:27:23
-       o.start(); o.stop(audioCtx.currentTime + dur);
+       o.start(); o.stop(audioCtx.currentTime - dur);

[NoCoverage] BlockStatement
src/ui/ui.js:31:28
-   export function beepDone() { beep(660, .1); setTimeout(() => beep(880, .2), 120); vibrate([50]); }
+   export function beepDone() {}

[NoCoverage] ArrowFunction
src/ui/ui.js:31:56
-   export function beepDone() { beep(660, .1); setTimeout(() => beep(880, .2), 120); vibrate([50]); }
+   export function beepDone() { beep(660, .1); setTimeout(() => undefined, 120); vibrate([50]); }

[NoCoverage] ArrayDeclaration
src/ui/ui.js:31:91
-   export function beepDone() { beep(660, .1); setTimeout(() => beep(880, .2), 120); vibrate([50]); }
+   export function beepDone() { beep(660, .1); setTimeout(() => beep(880, .2), 120); vibrate([]); }

[NoCoverage] BlockStatement
src/ui/ui.js:32:29
-   export function beepAlert() {
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
-   }
+   export function beepAlert() {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:33:19
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; false; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);

[NoCoverage] EqualityOperator
src/ui/ui.js:33:19
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; i <= 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);

[NoCoverage] EqualityOperator
src/ui/ui.js:33:19
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; i >= 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);

[NoCoverage] UpdateOperator
src/ui/ui.js:33:26
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; i < 3; i--) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);

[NoCoverage] BlockStatement
src/ui/ui.js:33:48
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; i < 3; i++) setTimeout(() => {}, i * 200);

[NoCoverage] ArrayDeclaration
src/ui/ui.js:33:79
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([]); }, i * 200);

[NoCoverage] ArithmeticOperator
src/ui/ui.js:33:90
-     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i * 200);
+     for (let i = 0; i < 3; i++) setTimeout(() => { beep(1100, .12, .5); vibrate([200]); }, i / 200);

[NoCoverage] BlockStatement
src/ui/ui.js:36:28
-   export function speak(txt) {
-     if (state.isMuted || !window.speechSynthesis) return;
-     window.speechSynthesis.cancel();
-     const u = new SpeechSynthesisUtterance(txt);
-     u.lang = 'ro-RO'; u.rate = 1.1; u.pitch = 1;
-     window.speechSynthesis.speak(u);
-   }
+   export function speak(txt) {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:37:7
-     if (state.isMuted || !window.speechSynthesis) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/ui/ui.js:37:7
-     if (state.isMuted || !window.speechSynthesis) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/ui/ui.js:37:7
-     if (state.isMuted || !window.speechSynthesis) return;
+     if (state.isMuted && !window.speechSynthesis) return;

[NoCoverage] BooleanLiteral
src/ui/ui.js:37:24
-     if (state.isMuted || !window.speechSynthesis) return;
+     if (state.isMuted || window.speechSynthesis) return;

[NoCoverage] BlockStatement
src/ui/ui.js:45:50
-   export function showCoachFlash(type, title, sub) {
-     const flash = $('flash'), ft = $('flash-title'), fs = $('flash-sub');
-     if (!flash) return;
-     const colors = { up: 'var(--green)', ok: 'var(--accent)', dn: 'var(--red)' };
-     const color = colors[type] || 'var(--accent)';
-     flash.style.display = 'block';
-     flash.style.borderColor = color;
-     flash.style.background = color + '15';
-     if (ft) { ft.style.color = color; ft.textContent = title; }
-     if (fs) { fs.style.color = 'var(--text2)'; fs.textContent = sub; }
-     setTimeout(() => { flash.style.display = 'none'; }, 2800);
-   }
+   export function showCoachFlash(type, title, sub) {}

[NoCoverage] BooleanLiteral
src/ui/ui.js:47:7
-     if (!flash) return;
+     if (flash) return;

[NoCoverage] ConditionalExpression
src/ui/ui.js:47:7
-     if (!flash) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/ui/ui.js:47:7
-     if (!flash) return;
+     if (false) return;

[NoCoverage] ObjectLiteral
src/ui/ui.js:48:18
-     const colors = { up: 'var(--green)', ok: 'var(--accent)', dn: 'var(--red)' };
+     const colors = {};

[NoCoverage] ConditionalExpression
src/ui/ui.js:49:17
-     const color = colors[type] || 'var(--accent)';
+     const color = true;

[NoCoverage] ConditionalExpression
src/ui/ui.js:49:17
-     const color = colors[type] || 'var(--accent)';
+     const color = false;

[NoCoverage] LogicalOperator
src/ui/ui.js:49:17
-     const color = colors[type] || 'var(--accent)';
+     const color = colors[type] && 'var(--accent)';

[NoCoverage] ConditionalExpression
src/ui/ui.js:53:7
-     if (ft) { ft.style.color = color; ft.textContent = title; }
+     if (true) { ft.style.color = color; ft.textContent = title; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:53:7
-     if (ft) { ft.style.color = color; ft.textContent = title; }
+     if (false) { ft.style.color = color; ft.textContent = title; }

[NoCoverage] BlockStatement
src/ui/ui.js:53:11
-     if (ft) { ft.style.color = color; ft.textContent = title; }
+     if (ft) {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:54:7
-     if (fs) { fs.style.color = 'var(--text2)'; fs.textContent = sub; }
+     if (true) { fs.style.color = 'var(--text2)'; fs.textContent = sub; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:54:7
-     if (fs) { fs.style.color = 'var(--text2)'; fs.textContent = sub; }
+     if (false) { fs.style.color = 'var(--text2)'; fs.textContent = sub; }

[NoCoverage] BlockStatement
src/ui/ui.js:54:11
-     if (fs) { fs.style.color = 'var(--text2)'; fs.textContent = sub; }
+     if (fs) {}

[NoCoverage] BlockStatement
src/ui/ui.js:55:20
-     setTimeout(() => { flash.style.display = 'none'; }, 2800);
+     setTimeout(() => {}, 2800);

[NoCoverage] BlockStatement
src/ui/ui.js:59:35
-   export function showPauseScreen() { const el = $('pause-screen'); if (el) el.style.display = 'flex'; }
+   export function showPauseScreen() {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:59:71
-   export function showPauseScreen() { const el = $('pause-screen'); if (el) el.style.display = 'flex'; }
+   export function showPauseScreen() { const el = $('pause-screen'); if (true) el.style.display = 'flex'; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:59:71
-   export function showPauseScreen() { const el = $('pause-screen'); if (el) el.style.display = 'flex'; }
+   export function showPauseScreen() { const el = $('pause-screen'); if (false) el.style.display = 'flex'; }

[NoCoverage] BlockStatement
src/ui/ui.js:60:35
-   export function hidePauseScreen() { const el = $('pause-screen'); if (el) el.style.display = 'none'; }
+   export function hidePauseScreen() {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:60:71
-   export function hidePauseScreen() { const el = $('pause-screen'); if (el) el.style.display = 'none'; }
+   export function hidePauseScreen() { const el = $('pause-screen'); if (true) el.style.display = 'none'; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:60:71
-   export function hidePauseScreen() { const el = $('pause-screen'); if (el) el.style.display = 'none'; }
+   export function hidePauseScreen() { const el = $('pause-screen'); if (false) el.style.display = 'none'; }

[NoCoverage] BlockStatement
src/ui/ui.js:65:52
-   export function showFlashFeedback(rpe, kg, ex, DP) {
-     if (!DP) return; // called without DP context — skip
-     const inc = DP.getIncrement(ex);
-     const nextUp = DP.roundToStep(kg + inc, ex);
-     const nextDn = DP.roundToStep(Math.max(1, kg - inc), ex);
-     let type, title, sub;
-     if (rpe <= 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }
-     else if (rpe <= 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }
-     else if (rpe === 9){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }
-     else               { type='dn'; title=`SCADE LA ${nextDn} KG`; sub='Prea greu — calitate înainte de kilograme'; }
-     showCoachFlash(type, title, sub);
-   }
+   export function showFlashFeedback(rpe, kg, ex, DP) {}

[NoCoverage] BooleanLiteral
src/ui/ui.js:66:7
-     if (!DP) return; // called without DP context — skip
+     if (DP) return; // called without DP context — skip

[NoCoverage] ConditionalExpression
src/ui/ui.js:66:7
-     if (!DP) return; // called without DP context — skip
+     if (true) return; // called without DP context — skip

[NoCoverage] ConditionalExpression
src/ui/ui.js:66:7
-     if (!DP) return; // called without DP context — skip
+     if (false) return; // called without DP context — skip

[NoCoverage] ArithmeticOperator
src/ui/ui.js:68:33
-     const nextUp = DP.roundToStep(kg + inc, ex);
+     const nextUp = DP.roundToStep(kg - inc, ex);

[NoCoverage] MethodExpression
src/ui/ui.js:69:33
-     const nextDn = DP.roundToStep(Math.max(1, kg - inc), ex);
+     const nextDn = DP.roundToStep(Math.min(1, kg - inc), ex);

[NoCoverage] ArithmeticOperator
src/ui/ui.js:69:45
-     const nextDn = DP.roundToStep(Math.max(1, kg - inc), ex);
+     const nextDn = DP.roundToStep(Math.max(1, kg + inc), ex);

[NoCoverage] ConditionalExpression
src/ui/ui.js:71:7
-     if (rpe <= 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }
+     if (true)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:71:7
-     if (rpe <= 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }
+     if (false)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }

[NoCoverage] EqualityOperator
src/ui/ui.js:71:7
-     if (rpe <= 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }
+     if (rpe < 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }

[NoCoverage] EqualityOperator
src/ui/ui.js:71:7
-     if (rpe <= 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }
+     if (rpe > 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }

[NoCoverage] BlockStatement
src/ui/ui.js:71:22
-     if (rpe <= 6)      { type='up'; title=`URMĂTOAREA: ${nextUp} KG`; sub='Prea ușor — crește greutatea'; }
+     if (rpe <= 6)      {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:72:12
-     else if (rpe <= 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }
+     else if (true) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:72:12
-     else if (rpe <= 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }
+     else if (false) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }

[NoCoverage] EqualityOperator
src/ui/ui.js:72:12
-     else if (rpe <= 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }
+     else if (rpe < 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }

[NoCoverage] EqualityOperator
src/ui/ui.js:72:12
-     else if (rpe <= 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }
+     else if (rpe > 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }

[NoCoverage] BlockStatement
src/ui/ui.js:72:22
-     else if (rpe <= 8) { type='ok'; title='ȚINE GREUTATEA'; sub=`Progres corect · RPE ${rpe}`; }
+     else if (rpe <= 8) {}

[NoCoverage] ConditionalExpression
src/ui/ui.js:73:12
-     else if (rpe === 9){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }
+     else if (true){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }

[NoCoverage] ConditionalExpression
src/ui/ui.js:73:12
-     else if (rpe === 9){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }
+     else if (false){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }

[NoCoverage] EqualityOperator
src/ui/ui.js:73:12
-     else if (rpe === 9){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }
+     else if (rpe !== 9){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }

[NoCoverage] BlockStatement
src/ui/ui.js:73:22
-     else if (rpe === 9){ type='ok'; title='MAI SCOATE REPS'; sub='La limită — nu crești încă'; }
+     else if (rpe === 9){}

[NoCoverage] BlockStatement
src/ui/ui.js:74:22
-     else               { type='dn'; title=`SCADE LA ${nextDn} KG`; sub='Prea greu — calitate înainte de kilograme'; }
+     else               {}

[Survived] EqualityOperator
src/util/adminCleanupHelpers.js:24:53
-     return typeof scheduledHardDelete === 'number' && scheduledHardDelete < now;
+     return typeof scheduledHardDelete === 'number' && scheduledHardDelete <= now;
Tests ran:
    §56.14.A admin-cleanup helpers — pure isPastHardDeleteSchedule — 30 zile soft delete cutoff scheduledHardDelete în trecut → past schedule
    §56.14.A admin-cleanup helpers — pure isPastHardDeleteSchedule — 30 zile soft delete cutoff scheduledHardDelete în viitor → NU past schedule

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:5:21
-     const kcalsData = {
-       '2026-04-15': 1957,
-       '2026-04-16': 1894,
-       '2026-04-17': 1521,
-       '2026-04-18': 1245,
-       '2026-04-19': 1770,
-       '2026-04-20': 1811,
-       '2026-04-21': 1787,
-       '2026-04-22': 1911,
-       '2026-04-23': 1297,
-     };
+     const kcalsData = {};

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:17:21
-     const protsData = {
-       '2026-04-15': 155,
-       '2026-04-16': 168,
-       '2026-04-17': 195,
-       '2026-04-18': 122,
-       '2026-04-19': 183,
-       '2026-04-20': 209,
-       '2026-04-21': 212,
-       '2026-04-22': 249,
-       '2026-04-23': 141,
-     };
+     const protsData = {};

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:29:23
-     const weightsData = {
-       '2026-04-15': 112.0,
-       '2026-04-16': 111.8,
-       '2026-04-17': 111.4,
-       '2026-04-18': 110.6,
-       '2026-04-19': 110.2,
-       '2026-04-22': 114.8,
-       '2026-04-23': 110.0,
-     };
+     const weightsData = {};

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:41:38
-     const existingKcals   = JSON.parse(localStorage.getItem('kcals')   || '{}');
+     const existingKcals   = JSON.parse(true);

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:41:38
-     const existingKcals   = JSON.parse(localStorage.getItem('kcals')   || '{}');
+     const existingKcals   = JSON.parse(false);

[NoCoverage] LogicalOperator
src/util/adminPrefill.js:41:38
-     const existingKcals   = JSON.parse(localStorage.getItem('kcals')   || '{}');
+     const existingKcals   = JSON.parse(localStorage.getItem('kcals') && '{}');

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:42:38
-     const existingProts   = JSON.parse(localStorage.getItem('prots')   || '{}');
+     const existingProts   = JSON.parse(true);

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:42:38
-     const existingProts   = JSON.parse(localStorage.getItem('prots')   || '{}');
+     const existingProts   = JSON.parse(false);

[NoCoverage] LogicalOperator
src/util/adminPrefill.js:42:38
-     const existingProts   = JSON.parse(localStorage.getItem('prots')   || '{}');
+     const existingProts   = JSON.parse(localStorage.getItem('prots') && '{}');

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:43:38
-     const existingWeights = JSON.parse(localStorage.getItem('weights') || '{}');
+     const existingWeights = JSON.parse(true);

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:43:38
-     const existingWeights = JSON.parse(localStorage.getItem('weights') || '{}');
+     const existingWeights = JSON.parse(false);

[NoCoverage] LogicalOperator
src/util/adminPrefill.js:43:38
-     const existingWeights = JSON.parse(localStorage.getItem('weights') || '{}');
+     const existingWeights = JSON.parse(localStorage.getItem('weights') && '{}');

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:46:50
-     localStorage.setItem('kcals',   JSON.stringify({ ...existingKcals,   ...kcalsData   }));
+     localStorage.setItem('kcals',   JSON.stringify({}));

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:47:50
-     localStorage.setItem('prots',   JSON.stringify({ ...existingProts,   ...protsData   }));
+     localStorage.setItem('prots',   JSON.stringify({}));

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:49:50
-     localStorage.setItem('weights', JSON.stringify({ ...weightsData, ...existingWeights }));
+     localStorage.setItem('weights', JSON.stringify({}));

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:51:7
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:51:7
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (false) {

[NoCoverage] LogicalOperator
src/util/adminPrefill.js:51:7
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (typeof window !== 'undefined' || typeof window.restoreRealLogs === 'function') {

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:51:7
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (true && typeof window.restoreRealLogs === 'function') {

[NoCoverage] EqualityOperator
src/util/adminPrefill.js:51:7
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (typeof window === 'undefined' && typeof window.restoreRealLogs === 'function') {

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:51:40
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (typeof window !== 'undefined' && true) {

[NoCoverage] EqualityOperator
src/util/adminPrefill.js:51:40
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
+     if (typeof window !== 'undefined' && typeof window.restoreRealLogs !== 'function') {

[NoCoverage] BlockStatement
src/util/adminPrefill.js:51:86
-     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {
-       window.restoreRealLogs({ merge: true });
-     }
+     if (typeof window !== 'undefined' && typeof window.restoreRealLogs === 'function') {}

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:52:28
-       window.restoreRealLogs({ merge: true });
+       window.restoreRealLogs({});

[NoCoverage] BooleanLiteral
src/util/adminPrefill.js:52:37
-       window.restoreRealLogs({ merge: true });
+       window.restoreRealLogs({ merge: false });

[NoCoverage] ObjectLiteral
src/util/adminPrefill.js:62:10
-     return {
-       kcalsDays:   Object.keys(kcalsData).length,
-       protsDays:   Object.keys(protsData).length,
-       weightsDays: Object.keys(weightsData).length,
-     };
+     return {};

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:69:5
-   if (typeof window !== 'undefined') {
+   if (true) {

[NoCoverage] ConditionalExpression
src/util/adminPrefill.js:69:5
-   if (typeof window !== 'undefined') {
+   if (false) {

[NoCoverage] EqualityOperator
src/util/adminPrefill.js:69:5
-   if (typeof window !== 'undefined') {
+   if (typeof window === 'undefined') {

[NoCoverage] BlockStatement
src/util/adminPrefill.js:69:36
-   if (typeof window !== 'undefined') {
-     window.adminPrefillAll = adminPrefillAll;
-   }
+   if (typeof window !== 'undefined') {}

[NoCoverage] BlockStatement
src/util/autoBackup.js:51:15
-     } catch (e) {
-       // Storage full — prune first then retry
-       pruneOldBackups();
-       try { localStorage.setItem(key, JSON.stringify(backup)); } catch { return null; }
-     }
+     } catch (e) {}

[NoCoverage] BlockStatement
src/util/autoBackup.js:54:9
-       try { localStorage.setItem(key, JSON.stringify(backup)); } catch { return null; }
+       try {} catch { return null; }

[NoCoverage] BlockStatement
src/util/autoBackup.js:54:70
-       try { localStorage.setItem(key, JSON.stringify(backup)); } catch { return null; }
+       try { localStorage.setItem(key, JSON.stringify(backup)); } catch {}

[NoCoverage] ArrayDeclaration
src/util/autoBackup.js:70:45
-     const index = DB.get(BACKUP_INDEX_KEY) ?? [];
+     const index = DB.get(BACKUP_INDEX_KEY) ?? ["Stryker was here"];
