[NoCoverage] MethodExpression
src/util/autoBackup.js:73:20
-     const toRemove = index.slice(0, index.length - MAX_BACKUPS);
+     const toRemove = index;

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:73:35
-     const toRemove = index.slice(0, index.length - MAX_BACKUPS);
+     const toRemove = index.slice(0, index.length + MAX_BACKUPS);

[NoCoverage] BlockStatement
src/util/autoBackup.js:74:33
-     for (const entry of toRemove) {
-       localStorage.removeItem(entry.key);
-     }
+     for (const entry of toRemove) {}

[NoCoverage] MethodExpression
src/util/autoBackup.js:78:28
-     DB.set(BACKUP_INDEX_KEY, index.slice(-MAX_BACKUPS));
+     DB.set(BACKUP_INDEX_KEY, index);

[NoCoverage] UnaryOperator
src/util/autoBackup.js:78:40
-     DB.set(BACKUP_INDEX_KEY, index.slice(-MAX_BACKUPS));
+     DB.set(BACKUP_INDEX_KEY, index.slice(+MAX_BACKUPS));

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:101:22
-       const targetTs = Date.now() - keyOrDaysAgo * 24 * 3600 * 1000;
+       const targetTs = Date.now() + keyOrDaysAgo * 24 * 3600 * 1000;

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:101:35
-       const targetTs = Date.now() - keyOrDaysAgo * 24 * 3600 * 1000;
+       const targetTs = Date.now() - keyOrDaysAgo * 24 * 3600 / 1000;

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:101:35
-       const targetTs = Date.now() - keyOrDaysAgo * 24 * 3600 * 1000;
+       const targetTs = Date.now() - keyOrDaysAgo * 24 / 3600 * 1000;

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:101:35
-       const targetTs = Date.now() - keyOrDaysAgo * 24 * 3600 * 1000;
+       const targetTs = Date.now() - keyOrDaysAgo / 24 * 3600 * 1000;

[NoCoverage] ArrowFunction
src/util/autoBackup.js:102:34
-       const closest = index.reduce((best, cur) =>
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+       const closest = index.reduce(() => undefined

[NoCoverage] ConditionalExpression
src/util/autoBackup.js:103:7
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+         true ? cur : best

[NoCoverage] ConditionalExpression
src/util/autoBackup.js:103:7
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+         false ? cur : best

[NoCoverage] EqualityOperator
src/util/autoBackup.js:103:7
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+         Math.abs(cur.timestamp - targetTs) <= Math.abs(best.timestamp - targetTs) ? cur : best

[NoCoverage] EqualityOperator
src/util/autoBackup.js:103:7
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+         Math.abs(cur.timestamp - targetTs) >= Math.abs(best.timestamp - targetTs) ? cur : best

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:103:16
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+         Math.abs(cur.timestamp + targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best

[NoCoverage] ArithmeticOperator
src/util/autoBackup.js:103:53
-         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp - targetTs) ? cur : best
+         Math.abs(cur.timestamp - targetTs) < Math.abs(best.timestamp + targetTs) ? cur : best

[NoCoverage] BlockStatement
src/util/autoBackup.js:116:57
-     if (!backup?.data || typeof backup.data !== 'object') {
-       return { restored: false, reason: 'invalid_format' };
-     }
+     if (!backup?.data || typeof backup.data !== 'object') {}

[NoCoverage] ObjectLiteral
src/util/autoBackup.js:117:12
-       return { restored: false, reason: 'invalid_format' };
+       return {};

[NoCoverage] BooleanLiteral
src/util/autoBackup.js:117:24
-       return { restored: false, reason: 'invalid_format' };
+       return { restored: true, reason: 'invalid_format' };

[NoCoverage] BlockStatement
src/util/autoBackup.js:148:67
-         if (tier2Result.errors.length || tier3Result.errors.length) {
-           console.warn('[CDL] Demotion completed with errors:', { tier2Result, tier3Result });
-         }
+         if (tier2Result.errors.length || tier3Result.errors.length) {}

[NoCoverage] ObjectLiteral
src/util/autoBackup.js:149:63
-           console.warn('[CDL] Demotion completed with errors:', { tier2Result, tier3Result });
+           console.warn('[CDL] Demotion completed with errors:', {});

[NoCoverage] BlockStatement
src/util/autoBackup.js:152:17
-     } catch (err) {
-       console.error('[CDL] Demote hook failed:', err);
-     }
+     } catch (err) {}

[Survived] ArrayDeclaration
src/util/autoBackup.js:25:45
-     const index = DB.get(BACKUP_INDEX_KEY) ?? [];
+     const index = DB.get(BACKUP_INDEX_KEY) ?? ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:26:7
-     if (index.length === 0) return true;
+     if (false) return true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] OptionalChaining
src/util/autoBackup.js:27:20
-     const lastDate = index[index.length - 1]?.date;
+     const lastDate = index[index.length - 1].date;
Tests ran:
    CoachDirector — CDL write (ADR 011) director calls writeProposed on each buildSession (idempotency is primitive responsibility)
    shouldCreateDailyBackup returns false when backup already done today
    shouldCreateDailyBackup returns true when last backup was yesterday

[Survived] BlockStatement
src/util/autoBackup.js:42:35
-     for (const k of USER_DATA_KEYS) {
-       const v = DB.get(k);
-       if (v !== null && v !== undefined) data[k] = v;
-     }
+     for (const k of USER_DATA_KEYS) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:44:9
-       if (v !== null && v !== undefined) data[k] = v;
+       if (true) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:44:9
-       if (v !== null && v !== undefined) data[k] = v;
+       if (false) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] LogicalOperator
src/util/autoBackup.js:44:9
-       if (v !== null && v !== undefined) data[k] = v;
+       if (v !== null || v !== undefined) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:44:23
-       if (v !== null && v !== undefined) data[k] = v;
+       if (v !== null && true) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/util/autoBackup.js:44:23
-       if (v !== null && v !== undefined) data[k] = v;
+       if (v !== null && v === undefined) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:44:9
-       if (v !== null && v !== undefined) data[k] = v;
+       if (true && v !== undefined) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] EqualityOperator
src/util/autoBackup.js:44:9
-       if (v !== null && v !== undefined) data[k] = v;
+       if (v === null && v !== undefined) data[k] = v;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ObjectLiteral
src/util/autoBackup.js:47:18
-     const backup = { key, date: today, timestamp: ts, version: 'daily-v1', data };
+     const backup = {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] BlockStatement
src/util/autoBackup.js:69:35
-   export function pruneOldBackups() {
-     const index = DB.get(BACKUP_INDEX_KEY) ?? [];
-     if (index.length <= MAX_BACKUPS) return;
-   
-     const toRemove = index.slice(0, index.length - MAX_BACKUPS);
-     for (const entry of toRemove) {
-       localStorage.removeItem(entry.key);
-     }
-   
-     DB.set(BACKUP_INDEX_KEY, index.slice(-MAX_BACKUPS));
-   }
+   export function pruneOldBackups() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] LogicalOperator
src/util/autoBackup.js:70:17
-     const index = DB.get(BACKUP_INDEX_KEY) ?? [];
+     const index = DB.get(BACKUP_INDEX_KEY) && [];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:71:7
-     if (index.length <= MAX_BACKUPS) return;
+     if (true) return;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:71:7
-     if (index.length <= MAX_BACKUPS) return;
+     if (false) return;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] EqualityOperator
src/util/autoBackup.js:71:7
-     if (index.length <= MAX_BACKUPS) return;
+     if (index.length < MAX_BACKUPS) return;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] EqualityOperator
src/util/autoBackup.js:71:7
-     if (index.length <= MAX_BACKUPS) return;
+     if (index.length > MAX_BACKUPS) return;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 26 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:100:9
-       if (index.length === 0) return { restored: false, reason: 'no_backups' };
+       if (true) return { restored: false, reason: 'no_backups' };
Tests ran:
    restoreFromBackup returns no_backups when restoring by days and none exist

[Survived] BlockStatement
src/util/autoBackup.js:114:43
-     try { backup = JSON.parse(raw); } catch { return { restored: false, reason: 'parse_error' }; }
+     try { backup = JSON.parse(raw); } catch {}
Tests ran:
    restoreFromBackup handles invalid JSON gracefully

[Survived] ConditionalExpression
src/util/autoBackup.js:116:7
-     if (!backup?.data || typeof backup.data !== 'object') {
+     if (false) {
Tests ran:
    restoreFromBackup restores data from valid backup

[Survived] LogicalOperator
src/util/autoBackup.js:116:7
-     if (!backup?.data || typeof backup.data !== 'object') {
+     if (!backup?.data && typeof backup.data !== 'object') {
Tests ran:
    restoreFromBackup restores data from valid backup

[Survived] OptionalChaining
src/util/autoBackup.js:116:8
-     if (!backup?.data || typeof backup.data !== 'object') {
+     if (!backup.data || typeof backup.data !== 'object') {
Tests ran:
    restoreFromBackup restores data from valid backup

[Survived] ConditionalExpression
src/util/autoBackup.js:116:24
-     if (!backup?.data || typeof backup.data !== 'object') {
+     if (!backup?.data || false) {
Tests ran:
    restoreFromBackup restores data from valid backup

[Survived] BlockStatement
src/util/autoBackup.js:129:33
-   function shouldDemoteCdlToday() {
-     const last = localStorage.getItem('cdl-last-demote-date');
-     const today = tod();
-     return last !== today;
-   }
+   function shouldDemoteCdlToday() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:132:10
-     return last !== today;
+     return true;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:132:10
-     return last !== today;
+     return false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/util/autoBackup.js:132:10
-     return last !== today;
+     return last === today;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/util/autoBackup.js:138:34
-   export function initAutoBackup() {
-     if (shouldCreateDailyBackup()) {
-       createDailyBackup();
-     }
-   
-     try {
-       if (shouldDemoteCdlToday()) {
-         const tier2Result = demoteToTier2();
-         const tier3Result = demoteToTier3();
-         localStorage.setItem('cdl-last-demote-date', tod());
-         if (tier2Result.errors.length || tier3Result.errors.length) {
-           console.warn('[CDL] Demotion completed with errors:', { tier2Result, tier3Result });
-         }
-       }
-     } catch (err) {
-       console.error('[CDL] Demote hook failed:', err);
-     }
-   }
+   export function initAutoBackup() {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:139:7
-     if (shouldCreateDailyBackup()) {
+     if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:139:7
-     if (shouldCreateDailyBackup()) {
+     if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/util/autoBackup.js:139:34
-     if (shouldCreateDailyBackup()) {
-       createDailyBackup();
-     }
+     if (shouldCreateDailyBackup()) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/util/autoBackup.js:143:7
-     try {
-       if (shouldDemoteCdlToday()) {
-         const tier2Result = demoteToTier2();
-         const tier3Result = demoteToTier3();
-         localStorage.setItem('cdl-last-demote-date', tod());
-         if (tier2Result.errors.length || tier3Result.errors.length) {
-           console.warn('[CDL] Demotion completed with errors:', { tier2Result, tier3Result });
-         }
-       }
-     } catch (err) {
+     try {} catch (err) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:144:9
-       if (shouldDemoteCdlToday()) {
+       if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:144:9
-       if (shouldDemoteCdlToday()) {
+       if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] BlockStatement
src/util/autoBackup.js:144:33
-       if (shouldDemoteCdlToday()) {
-         const tier2Result = demoteToTier2();
-         const tier3Result = demoteToTier3();
-         localStorage.setItem('cdl-last-demote-date', tod());
-         if (tier2Result.errors.length || tier3Result.errors.length) {
-           console.warn('[CDL] Demotion completed with errors:', { tier2Result, tier3Result });
-         }
-       }
+       if (shouldDemoteCdlToday()) {}
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:148:11
-         if (tier2Result.errors.length || tier3Result.errors.length) {
+         if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/autoBackup.js:148:11
-         if (tier2Result.errors.length || tier3Result.errors.length) {
+         if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] LogicalOperator
src/util/autoBackup.js:148:11
-         if (tier2Result.errors.length || tier3Result.errors.length) {
+         if (tier2Result.errors.length && tier3Result.errors.length) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrayDeclaration
src/util/autoBackup.js:12:24
-   const USER_DATA_KEYS = [
-     'logs', 'weights', 'kcals', 'prots', 'waters', 'pr-records',
-     'phase-log', 'phase-change-date', 'bf-override', 'readiness',
-     'session-burns', 'closed-days', 'wellbeing', 'suppl-list',
-     'active-theme', 'device-id', 'notif-enabled', 'muted', 'workout-skips',
-     'current-kcal', 'phase-override', 'onboarding-done',
-   ];
+   const USER_DATA_KEYS = [];
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/util/autoBackup.js:158:5
-   if (typeof window !== 'undefined') {
+   if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/util/autoBackup.js:158:5
-   if (typeof window !== 'undefined') {
+   if (false) {
Ran all tests for this mutant.

[Survived] EqualityOperator
src/util/autoBackup.js:158:5
-   if (typeof window !== 'undefined') {
+   if (typeof window === 'undefined') {
Ran all tests for this mutant.

[Survived] BlockStatement
src/util/autoBackup.js:158:36
-   if (typeof window !== 'undefined') {
-     window.listBackups = listBackups;
-     window.restoreFromBackup = restoreFromBackup;
-     window.createDailyBackup = createDailyBackup;
-   }
+   if (typeof window !== 'undefined') {}
Ran all tests for this mutant.

[NoCoverage] ArrayDeclaration
src/util/cdlBackfill.js:169:34
-     const logs = DB.get('logs') ?? [];
+     const logs = DB.get('logs') ?? ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/util/cdlBackfill.js:189:44
-       if (!log.ex || (log.w === undefined && log.reps === undefined)) {
+       if (!log.ex || (log.w === undefined && true)) {

[NoCoverage] EqualityOperator
src/util/cdlBackfill.js:189:44
-       if (!log.ex || (log.w === undefined && log.reps === undefined)) {
+       if (!log.ex || (log.w === undefined && log.reps !== undefined)) {

[NoCoverage] BlockStatement
src/util/cdlBackfill.js:203:33
-       if (exercises.length === 0) {
-         skipped.push({ sessionTs: ts, reason: 'no exercises' });
-         continue;
-       }
+       if (exercises.length === 0) {}

[NoCoverage] ObjectLiteral
src/util/cdlBackfill.js:204:20
-         skipped.push({ sessionTs: ts, reason: 'no exercises' });
+         skipped.push({});

[NoCoverage] BlockStatement
src/util/cdlBackfill.js:240:19
-       } catch (err) {
-         errors.push({ sessionTs: ts, error: err.message, stack: err.stack });
-       }
+       } catch (err) {}

[NoCoverage] ObjectLiteral
src/util/cdlBackfill.js:241:19
-         errors.push({ sessionTs: ts, error: err.message, stack: err.stack });
+         errors.push({});

[NoCoverage] ArrayDeclaration
src/util/cdlBackfill.js:256:34
-     const all = DB.get(CDL_KEY) ?? [];
+     const all = DB.get(CDL_KEY) ?? ["Stryker was here"];

[Survived] ConditionalExpression
src/util/cdlBackfill.js:34:9
-       if (LEGS_MUSCLES.has(muscle)) return 'LEGS';
+       if (true) return 'LEGS';
Tests ran:
    inferSessionType returns LEGS for quads/hamstrings/glutes exercises
    inferSessionType returns MIXED for cross-cutting upper + lower exercises
    runBackfill assigns correct sessionType to each session

[Survived] EqualityOperator
src/util/cdlBackfill.js:42:19
-     for (let i = 0; i < 4; i++) s += chars[Math.floor(Math.random() * chars.length)];
+     for (let i = 0; i <= 4; i++) s += chars[Math.floor(Math.random() * chars.length)];
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] LogicalOperator
src/util/cdlBackfill.js:54:7
-     if (!exercises || exercises.length === 0) return 'UNKNOWN';
+     if (!exercises && exercises.length === 0) return 'UNKNOWN';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 23 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:54:7
-     if (!exercises || exercises.length === 0) return 'UNKNOWN';
+     if (false) return 'UNKNOWN';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 23 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:54:21
-     if (!exercises || exercises.length === 0) return 'UNKNOWN';
+     if (!exercises || false) return 'UNKNOWN';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 23 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:66:7
-     if (known / exercises.length < 0.5) return 'MIXED';
+     if (false) return 'MIXED';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 20 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:66:7
-     if (known / exercises.length < 0.5) return 'MIXED';
+     if (known / exercises.length <= 0.5) return 'MIXED';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 20 more tests!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:66:7
-     if (known / exercises.length < 0.5) return 'MIXED';
+     if (known * exercises.length < 0.5) return 'MIXED';
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 20 more tests!

[Survived] MethodExpression
src/util/cdlBackfill.js:81:5
-       allLogs
-         .filter(l => (l.ts ?? 0) < sessionTs && l.session)
+       allLogs
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!
