[Survived] ConditionalExpression
src/util/cdlBackfill.js:82:20
-         .filter(l => (l.ts ?? 0) < sessionTs && l.session)
+         .filter(l => true)
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 9 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:68:61
-     const dominant = Object.entries(cats).find(([, count]) => count / known > 0.7);
+     const dominant = Object.entries(cats).find(([, count]) => count / known >= 0.7);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Readiness behavior should hold weight when readiness < 60
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
  and 20 more tests!

[Survived] LogicalOperator
src/util/cdlBackfill.js:82:20
-         .filter(l => (l.ts ?? 0) < sessionTs && l.session)
+         .filter(l => (l.ts ?? 0) < sessionTs || l.session)
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 9 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:82:20
-         .filter(l => (l.ts ?? 0) < sessionTs && l.session)
+         .filter(l => true && l.session)
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 9 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:82:20
-         .filter(l => (l.ts ?? 0) < sessionTs && l.session)
+         .filter(l => (l.ts ?? 0) <= sessionTs && l.session)
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 9 more tests!

[Survived] LogicalOperator
src/util/cdlBackfill.js:82:21
-         .filter(l => (l.ts ?? 0) < sessionTs && l.session)
+         .filter(l => (l.ts && 0) < sessionTs && l.session)
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 9 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:93:12
-     else if (sessionsCount < 6) calibrationLevel = 'INITIAL';
+     else if (sessionsCount <= 6) calibrationLevel = 'INITIAL';
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:94:12
-     else if (sessionsCount < 12) calibrationLevel = 'DEVELOPING';
+     else if (sessionsCount <= 12) calibrationLevel = 'DEVELOPING';
Tests ran:
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel PERSONALIZED with 40+ prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel PERSONALIZING with 12-39 prior sessions

[Survived] MethodExpression
src/util/cdlBackfill.js:98:25
-     const sortedPriorTs = [...priorSessionTs].sort((a, b) => a - b);
+     const sortedPriorTs = [...priorSessionTs];
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] ArrayDeclaration
src/util/cdlBackfill.js:98:25
-     const sortedPriorTs = [...priorSessionTs].sort((a, b) => a - b);
+     const sortedPriorTs = [].sort((a, b) => a - b);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] ArrowFunction
src/util/cdlBackfill.js:98:50
-     const sortedPriorTs = [...priorSessionTs].sort((a, b) => a - b);
+     const sortedPriorTs = [...priorSessionTs].sort(() => undefined);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:98:60
-     const sortedPriorTs = [...priorSessionTs].sort((a, b) => a - b);
+     const sortedPriorTs = [...priorSessionTs].sort((a, b) => a + b);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 4 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:99:25
-     const lastSessionTs = sortedPriorTs.length > 0
+     const lastSessionTs = true
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:99:25
-     const lastSessionTs = sortedPriorTs.length > 0
+     const lastSessionTs = sortedPriorTs.length >= 0
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:99:25
-     const lastSessionTs = sortedPriorTs.length > 0
+     const lastSessionTs = false
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:99:25
-     const lastSessionTs = sortedPriorTs.length > 0
+     const lastSessionTs = sortedPriorTs.length <= 0
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:100:21
-       ? sortedPriorTs[sortedPriorTs.length - 1]
+       ? sortedPriorTs[sortedPriorTs.length + 1]
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:104:7
-       ? (sessionTs - lastSessionTs) / 86400000
+       ? (sessionTs - lastSessionTs) * 86400000
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:104:8
-       ? (sessionTs - lastSessionTs) / 86400000
+       ? (sessionTs + lastSessionTs) / 86400000
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:108:7
-     if (lastSessionTs) {
+     if (false) {
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:108:7
-     if (lastSessionTs) {
+     if (true) {
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext always sets context.partial = true
  and 12 more tests!

[Survived] BlockStatement
src/util/cdlBackfill.js:108:22
-     if (lastSessionTs) {
-       const lastLogs = allLogs.filter(l => l.session === lastSessionTs);
-       const lastExercises = [...new Set(lastLogs.map(l => l.ex).filter(Boolean))];
-       lastSessionType = lastExercises.length > 0 ? inferSessionType(lastExercises) : null;
-     }
+     if (lastSessionTs) {}
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] MethodExpression
src/util/cdlBackfill.js:109:22
-       const lastLogs = allLogs.filter(l => l.session === lastSessionTs);
+       const lastLogs = allLogs;
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ArrowFunction
src/util/cdlBackfill.js:109:37
-       const lastLogs = allLogs.filter(l => l.session === lastSessionTs);
+       const lastLogs = allLogs.filter(() => undefined);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:109:42
-       const lastLogs = allLogs.filter(l => l.session === lastSessionTs);
+       const lastLogs = allLogs.filter(l => true);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:109:42
-       const lastLogs = allLogs.filter(l => l.session === lastSessionTs);
+       const lastLogs = allLogs.filter(l => false);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:109:42
-       const lastLogs = allLogs.filter(l => l.session === lastSessionTs);
+       const lastLogs = allLogs.filter(l => l.session !== lastSessionTs);
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ArrayDeclaration
src/util/cdlBackfill.js:110:27
-       const lastExercises = [...new Set(lastLogs.map(l => l.ex).filter(Boolean))];
+       const lastExercises = [];
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ArrowFunction
src/util/cdlBackfill.js:110:52
-       const lastExercises = [...new Set(lastLogs.map(l => l.ex).filter(Boolean))];
+       const lastExercises = [...new Set(lastLogs.map(() => undefined).filter(Boolean))];
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] MethodExpression
src/util/cdlBackfill.js:110:39
-       const lastExercises = [...new Set(lastLogs.map(l => l.ex).filter(Boolean))];
+       const lastExercises = [...new Set(lastLogs.map(l => l.ex))];
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:111:23
-       lastSessionType = lastExercises.length > 0 ? inferSessionType(lastExercises) : null;
+       lastSessionType = true ? inferSessionType(lastExercises) : null;
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:111:23
-       lastSessionType = lastExercises.length > 0 ? inferSessionType(lastExercises) : null;
+       lastSessionType = false ? inferSessionType(lastExercises) : null;
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:111:23
-       lastSessionType = lastExercises.length > 0 ? inferSessionType(lastExercises) : null;
+       lastSessionType = lastExercises.length >= 0 ? inferSessionType(lastExercises) : null;
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:111:23
-       lastSessionType = lastExercises.length > 0 ? inferSessionType(lastExercises) : null;
+       lastSessionType = lastExercises.length <= 0 ? inferSessionType(lastExercises) : null;
Tests ran:
    reconstructContext sets calibrationLevel to INITIAL with 5 prior sessions (post ADR 009 §AMENDMENT D1)
    reconstructContext sets calibrationLevel to DEVELOPING with 8 prior sessions
    reconstructContext sets calibrationLevel INITIAL with 2 prior sessions
  and 5 more tests!

[Survived] MethodExpression
src/util/cdlBackfill.js:134:33
-     const exercises = [...new Set(sessionLogs.map(l => l.ex).filter(Boolean))];
+     const exercises = [...new Set(sessionLogs.map(l => l.ex))];
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] MethodExpression
src/util/cdlBackfill.js:136:22
-     const timestamps = sessionLogs.map(l => l.ts ?? 0).filter(t => t > 0);
+     const timestamps = sessionLogs.map(l => l.ts ?? 0);
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:136:66
-     const timestamps = sessionLogs.map(l => l.ts ?? 0).filter(t => t > 0);
+     const timestamps = sessionLogs.map(l => l.ts ?? 0).filter(t => true);
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:136:66
-     const timestamps = sessionLogs.map(l => l.ts ?? 0).filter(t => t > 0);
+     const timestamps = sessionLogs.map(l => l.ts ?? 0).filter(t => t >= 0);
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:137:23
-     const completedAt = timestamps.length > 0 ? Math.max(...timestamps) : 0;
+     const completedAt = true ? Math.max(...timestamps) : 0;
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:137:23
-     const completedAt = timestamps.length > 0 ? Math.max(...timestamps) : 0;
+     const completedAt = timestamps.length >= 0 ? Math.max(...timestamps) : 0;
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:138:17
-     const minTs = timestamps.length > 0 ? Math.min(...timestamps) : 0;
+     const minTs = true ? Math.min(...timestamps) : 0;
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:138:17
-     const minTs = timestamps.length > 0 ? Math.min(...timestamps) : 0;
+     const minTs = timestamps.length >= 0 ? Math.min(...timestamps) : 0;
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] LogicalOperator
src/util/cdlBackfill.js:139:31
-     const actualDurationMins = (timestamps.length >= 2 && completedAt > minTs)
+     const actualDurationMins = (timestamps.length >= 2 || completedAt > minTs)
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:139:31
-     const actualDurationMins = (timestamps.length >= 2 && completedAt > minTs)
+     const actualDurationMins = (true && completedAt > minTs)
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 9 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:139:57
-     const actualDurationMins = (timestamps.length >= 2 && completedAt > minTs)
+     const actualDurationMins = (timestamps.length >= 2 && true)
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 8 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:139:57
-     const actualDurationMins = (timestamps.length >= 2 && completedAt > minTs)
+     const actualDurationMins = (timestamps.length >= 2 && completedAt >= minTs)
Tests ran:
    synthesizeOutcome derives counts correctly from session logs
    synthesizeOutcome infers actualSessionType from exercise list
    synthesizeOutcome sets completedAt to max ts in sessionLogs
  and 8 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:175:52
-     const syntheticExist = existingEntries.some(e => e.synthetic === true);
+     const syntheticExist = existingEntries.some(e => true);
Tests ran:
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
    runBackfill real entries are NEVER removed by force backfill

[Survived] ConditionalExpression
src/util/cdlBackfill.js:179:7
-     if (force) {
+     if (true) {
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:189:21
-       if (!log.ex || (log.w === undefined && log.reps === undefined)) {
+       if (!log.ex || (false)) {
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] LogicalOperator
src/util/cdlBackfill.js:189:21
-       if (!log.ex || (log.w === undefined && log.reps === undefined)) {
+       if (!log.ex || (log.w === undefined || log.reps === undefined)) {
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:189:21
-       if (!log.ex || (log.w === undefined && log.reps === undefined)) {
+       if (!log.ex || (true && log.reps === undefined)) {
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:189:21
-       if (!log.ex || (log.w === undefined && log.reps === undefined)) {
+       if (!log.ex || (log.w !== undefined && log.reps === undefined)) {
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ArrayDeclaration
src/util/cdlBackfill.js:193:56
-       bySession[log.session] = bySession[log.session] || [];
+       bySession[log.session] = bySession[log.session] || ["Stryker was here"];
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] MethodExpression
src/util/cdlBackfill.js:197:25
-     const sessionTsList = Object.keys(bySession).map(Number).sort((a, b) => a - b);
+     const sessionTsList = Object.keys(bySession).map(Number);
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ArrowFunction
src/util/cdlBackfill.js:197:65
-     const sessionTsList = Object.keys(bySession).map(Number).sort((a, b) => a - b);
+     const sessionTsList = Object.keys(bySession).map(Number).sort(() => undefined);
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:197:75
-     const sessionTsList = Object.keys(bySession).map(Number).sort((a, b) => a - b);
+     const sessionTsList = Object.keys(bySession).map(Number).sort((a, b) => a + b);
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill handles all 4 skipped reasons correctly
    runBackfill assigns correct sessionType to each session

[Survived] MethodExpression
src/util/cdlBackfill.js:201:35
-       const exercises = [...new Set(sessionLogs.map(l => l.ex).filter(Boolean))];
+       const exercises = [...new Set(sessionLogs.map(l => l.ex))];
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:203:9
-       if (exercises.length === 0) {
+       if (false) {
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ObjectLiteral
src/util/cdlBackfill.js:210:82
-         skipped.push({ sessionTs: ts, reason: 'unknown muscle group', sessionData: { exercises } });
+         skipped.push({ sessionTs: ts, reason: 'unknown muscle group', sessionData: {} });
Tests ran:
    runBackfill handles all 4 skipped reasons correctly

[Survived] ArrayDeclaration
src/util/cdlBackfill.js:229:90
-             rationale: { winnerId: 'SYNTHETIC_BACKFILL', winnerPriority: null, overridden: [] },
+             rationale: { winnerId: 'SYNTHETIC_BACKFILL', winnerPriority: null, overridden: ["Stryker was here"] },
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:238:11
-         if (!dryRun) existingEntries.push(syntheticEntry);
+         if (true) existingEntries.push(syntheticEntry);
Tests ran:
    runBackfill creates synthetic entries from 2 valid sessions (18 logs total)
    runBackfill throws on second call without force (idempotency)
    runBackfill succeeds with force: true after previous run, replacing synthetic entries
  and 4 more tests!

[Survived] EqualityOperator
src/util/cdlBackfill.js:260:32
-     for (let i = arr.length - 1; i > 0; i--) {
+     for (let i = arr.length - 1; i >= 0; i--) {
Tests ran:
    getValidationSamples returns requested count from synthetic entries
    getValidationSamples returns all entries when count exceeds pool size
    getValidationSamples only returns synthetic entries, not real ones
  and 1 more test!

[Survived] ArithmeticOperator
src/util/cdlBackfill.js:261:43
-       const j = Math.floor(Math.random() * (i + 1));
+       const j = Math.floor(Math.random() * (i - 1));
Tests ran:
    getValidationSamples returns requested count from synthetic entries
    getValidationSamples returns all entries when count exceeds pool size
    getValidationSamples only returns synthetic entries, not real ones
  and 1 more test!

[Survived] ConditionalExpression
src/util/cdlBackfill.js:267:5
-   if (typeof window !== 'undefined') {
+   if (false) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/util/cdlBackfill.js:267:5
-   if (typeof window !== 'undefined') {
+   if (true) {
Ran all tests for this mutant.

[Survived] EqualityOperator
src/util/cdlBackfill.js:267:5
-   if (typeof window !== 'undefined') {
+   if (typeof window === 'undefined') {
Ran all tests for this mutant.

[Survived] BlockStatement
src/util/cdlBackfill.js:267:36
-   if (typeof window !== 'undefined') {
-     window.runBackfill = runBackfill;
-     window.getValidationSamples = getValidationSamples;
-   }
+   if (typeof window !== 'undefined') {}
Ran all tests for this mutant.
