[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:45:51
-     const oldWeak = JSON.stringify((o.weakGroups ?? []).slice().sort());
+     const oldWeak = JSON.stringify((o.weakGroups ?? ["Stryker was here"]).slice().sort());

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:46:51
-     const newWeak = JSON.stringify((n.weakGroups ?? []).slice().sort());
+     const newWeak = JSON.stringify((n.weakGroups ?? ["Stryker was here"]).slice().sort());

[NoCoverage] BooleanLiteral
src/util/coachDecisionLog.js:49:39
-     if (o.isInCut !== n.isInCut) return true;
+     if (o.isInCut !== n.isInCut) return false;

[NoCoverage] BooleanLiteral
src/util/coachDecisionLog.js:50:57
-     const oldHighRisk = (o.predictionToday?.isHighRisk ?? false);
+     const oldHighRisk = (o.predictionToday?.isHighRisk ?? true);

[NoCoverage] BooleanLiteral
src/util/coachDecisionLog.js:51:57
-     const newHighRisk = (n.predictionToday?.isHighRisk ?? false);
+     const newHighRisk = (n.predictionToday?.isHighRisk ?? true);

[NoCoverage] BooleanLiteral
src/util/coachDecisionLog.js:52:43
-     if (oldHighRisk !== newHighRisk) return true;
+     if (oldHighRisk !== newHighRisk) return false;

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:69:26
-     if (setA.size === 0 && setB.size === 0) return 0;
+     if (setA.size === 0 && true) return 0;

[NoCoverage] EqualityOperator
src/util/coachDecisionLog.js:69:26
-     if (setA.size === 0 && setB.size === 0) return 0;
+     if (setA.size === 0 && setB.size !== 0) return 0;

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:89:5
-     ) {
-       throw new Error('writeProposed: invalid entry — date (YYYY-MM-DD), context (object), proposed (object) required');
-     }
+     ) {}

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:138:21
-       .sort((a, b) => b.ts - a.ts)[0];
+       .sort((a, b) => b.ts + a.ts)[0];

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:162:21
-       .sort((a, b) => b.ts - a.ts);
+       .sort((a, b) => b.ts + a.ts);

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:183:50
-     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? [];
+     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:189:22
-     if (!start) return [];
+     if (!start) return ["Stryker was here"];

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:205:76
-       if (e.supersedes && chainIds.has(e.supersedes) && !chainIds.has(e.id)) {
-         chain.push(e);
-         chainIds.add(e.id);
-       }
+       if (e.supersedes && chainIds.has(e.supersedes) && !chainIds.has(e.id)) {}

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:234:57
-     const exerciseOverlap = jaccard(proposed.exercises ?? [], actual.actualExercises ?? []);
+     const exerciseOverlap = jaccard(proposed.exercises ?? ["Stryker was here"], actual.actualExercises ?? []);

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:234:87
-     const exerciseOverlap = jaccard(proposed.exercises ?? [], actual.actualExercises ?? []);
+     const exerciseOverlap = jaccard(proposed.exercises ?? [], actual.actualExercises ?? ["Stryker was here"]);

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:274:17
-     } catch (err) {
-       DB.set(STORAGE_KEYS.TIER_1, entries);
-       return { demoted: 0, errors: [err.message] };
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/util/coachDecisionLog.js:276:12
-       return { demoted: 0, errors: [err.message] };
+       return {};

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:276:34
-       return { demoted: 0, errors: [err.message] };
+       return { demoted: 0, errors: [] };

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:316:21
-       if (tier3[key]) {
-         // Re-aggregate: combine with existing
-         const ex = tier3[key];
-         const totalCount = ex.count + count;
-         const newExecutedRate = (ex.executedRate * ex.count + executedCount) / totalCount;
-         const newDeviationRate = (ex.deviationRate * ex.count + deviationCount) / totalCount;
-         let newAvgMatchScore = null;
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
-           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) / totalCount;
-         } else if (avgMatchScore !== null) {
-           newAvgMatchScore = avgMatchScore;
-         } else {
-           newAvgMatchScore = ex.avgMatchScore;
-         }
-         tier3[key] = {
-           count: totalCount,
-           executedRate: newExecutedRate,
-           avgMatchScore: newAvgMatchScore,
-           deviationRate: newDeviationRate,
-         };
-       } else {
+       if (tier3[key]) {} else {

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:319:26
-         const totalCount = ex.count + count;
+         const totalCount = ex.count - count;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:320:31
-         const newExecutedRate = (ex.executedRate * ex.count + executedCount) / totalCount;
+         const newExecutedRate = (ex.executedRate * ex.count + executedCount) * totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:320:32
-         const newExecutedRate = (ex.executedRate * ex.count + executedCount) / totalCount;
+         const newExecutedRate = (ex.executedRate * ex.count - executedCount) / totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:320:32
-         const newExecutedRate = (ex.executedRate * ex.count + executedCount) / totalCount;
+         const newExecutedRate = (ex.executedRate / ex.count + executedCount) / totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:321:32
-         const newDeviationRate = (ex.deviationRate * ex.count + deviationCount) / totalCount;
+         const newDeviationRate = (ex.deviationRate * ex.count + deviationCount) * totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:321:33
-         const newDeviationRate = (ex.deviationRate * ex.count + deviationCount) / totalCount;
+         const newDeviationRate = (ex.deviationRate * ex.count - deviationCount) / totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:321:33
-         const newDeviationRate = (ex.deviationRate * ex.count + deviationCount) / totalCount;
+         const newDeviationRate = (ex.deviationRate / ex.count + deviationCount) / totalCount;

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:323:11
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:323:11
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (false) {

[NoCoverage] LogicalOperator
src/util/coachDecisionLog.js:323:11
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (ex.avgMatchScore !== null || avgMatchScore !== null) {

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:323:11
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (true && avgMatchScore !== null) {

[NoCoverage] EqualityOperator
src/util/coachDecisionLog.js:323:11
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (ex.avgMatchScore === null && avgMatchScore !== null) {

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:323:40
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (ex.avgMatchScore !== null && true) {

[NoCoverage] EqualityOperator
src/util/coachDecisionLog.js:323:40
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
+         if (ex.avgMatchScore !== null && avgMatchScore === null) {

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:323:64
-         if (ex.avgMatchScore !== null && avgMatchScore !== null) {
-           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) / totalCount;
-         } else if (avgMatchScore !== null) {
+         if (ex.avgMatchScore !== null && avgMatchScore !== null) {} else if (avgMatchScore !== null) {

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:324:28
-           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) / totalCount;
+           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) * totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:324:29
-           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) / totalCount;
+           newAvgMatchScore = (ex.avgMatchScore * ex.count - avgMatchScore * count) / totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:324:29
-           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) / totalCount;
+           newAvgMatchScore = (ex.avgMatchScore / ex.count + avgMatchScore * count) / totalCount;

[NoCoverage] ArithmeticOperator
src/util/coachDecisionLog.js:324:59
-           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore * count) / totalCount;
+           newAvgMatchScore = (ex.avgMatchScore * ex.count + avgMatchScore / count) / totalCount;

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:325:18
-         } else if (avgMatchScore !== null) {
+         } else if (true) {

[NoCoverage] ConditionalExpression
src/util/coachDecisionLog.js:325:18
-         } else if (avgMatchScore !== null) {
+         } else if (false) {

[NoCoverage] EqualityOperator
src/util/coachDecisionLog.js:325:18
-         } else if (avgMatchScore !== null) {
+         } else if (avgMatchScore === null) {

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:325:42
-         } else if (avgMatchScore !== null) {
-           newAvgMatchScore = avgMatchScore;
-         } else {
+         } else if (avgMatchScore !== null) {} else {

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:327:14
-         } else {
-           newAvgMatchScore = ex.avgMatchScore;
-         }
+         } else {}

[NoCoverage] ObjectLiteral
src/util/coachDecisionLog.js:330:20
-         tier3[key] = {
-           count: totalCount,
-           executedRate: newExecutedRate,
-           avgMatchScore: newAvgMatchScore,
-           deviationRate: newDeviationRate,
-         };
+         tier3[key] = {};

[NoCoverage] BlockStatement
src/util/coachDecisionLog.js:349:17
-     } catch (err) {
-       DB.set(STORAGE_KEYS.TIER_2, tier2);
-       return { demoted: 0, errors: [err.message] };
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/util/coachDecisionLog.js:351:12
-       return { demoted: 0, errors: [err.message] };
+       return {};

[NoCoverage] ArrayDeclaration
src/util/coachDecisionLog.js:351:34
-       return { demoted: 0, errors: [err.message] };
+       return { demoted: 0, errors: [] };

[Survived] EqualityOperator
src/util/coachDecisionLog.js:44:7
-     if (Math.abs((o.readinessScore ?? 0) - (n.readinessScore ?? 0)) > 20) return true;
+     if (Math.abs((o.readinessScore ?? 0) - (n.readinessScore ?? 0)) >= 20) return true;
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after readinessScore delta > 20 supersedes within 4h window
  and 7 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:34:10
-     return entry.superseded !== true;
+     return true;
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    writeProposed within 4h + same context returns existing (idempotent)
  and 16 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:45:34
-     const oldWeak = JSON.stringify((o.weakGroups ?? []).slice().sort());
+     const oldWeak = JSON.stringify((o.weakGroups ?? []).slice());
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after weakGroups change supersedes
  and 6 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:45:35
-     const oldWeak = JSON.stringify((o.weakGroups ?? []).slice().sort());
+     const oldWeak = JSON.stringify((o.weakGroups && []).slice().sort());
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after weakGroups change supersedes
  and 6 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:45:34
-     const oldWeak = JSON.stringify((o.weakGroups ?? []).slice().sort());
+     const oldWeak = JSON.stringify(o.weakGroups ?? [].sort());
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after weakGroups change supersedes
  and 6 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:46:34
-     const newWeak = JSON.stringify((n.weakGroups ?? []).slice().sort());
+     const newWeak = JSON.stringify((n.weakGroups ?? []).slice());
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after weakGroups change supersedes
  and 6 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:46:34
-     const newWeak = JSON.stringify((n.weakGroups ?? []).slice().sort());
+     const newWeak = JSON.stringify(n.weakGroups ?? [].sort());
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after weakGroups change supersedes
  and 6 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:49:7
-     if (o.isInCut !== n.isInCut) return true;
+     if (false) return true;
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    idempotency in quick succession two immediate calls produce one active entry

[Survived] LogicalOperator
src/util/coachDecisionLog.js:50:24
-     const oldHighRisk = (o.predictionToday?.isHighRisk ?? false);
+     const oldHighRisk = (o.predictionToday?.isHighRisk && false);
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    idempotency in quick succession two immediate calls produce one active entry

[Survived] OptionalChaining
src/util/coachDecisionLog.js:50:24
-     const oldHighRisk = (o.predictionToday?.isHighRisk ?? false);
+     const oldHighRisk = (o.predictionToday.isHighRisk ?? false);
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    idempotency in quick succession two immediate calls produce one active entry

[Survived] LogicalOperator
src/util/coachDecisionLog.js:51:24
-     const newHighRisk = (n.predictionToday?.isHighRisk ?? false);
+     const newHighRisk = (n.predictionToday?.isHighRisk && false);
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    idempotency in quick succession two immediate calls produce one active entry

[Survived] OptionalChaining
src/util/coachDecisionLog.js:51:24
-     const newHighRisk = (n.predictionToday?.isHighRisk ?? false);
+     const newHighRisk = (n.predictionToday.isHighRisk ?? false);
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    idempotency in quick succession two immediate calls produce one active entry

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:52:7
-     if (oldHighRisk !== newHighRisk) return true;
+     if (false) return true;
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    idempotency in quick succession two immediate calls produce one active entry

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:62:19
-     for (let i = 0; i < 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
+     for (let i = 0; false; i++) rand += chars[Math.floor(Math.random() * chars.length)];
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:62:19
-     for (let i = 0; i < 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
+     for (let i = 0; i >= 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:62:19
-     for (let i = 0; i < 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
+     for (let i = 0; i <= 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] AssignmentOperator
src/util/coachDecisionLog.js:62:31
-     for (let i = 0; i < 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
+     for (let i = 0; i < 4; i++) rand -= chars[Math.floor(Math.random() * chars.length)];
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ArithmeticOperator
src/util/coachDecisionLog.js:62:56
-     for (let i = 0; i < 4; i++) rand += chars[Math.floor(Math.random() * chars.length)];
+     for (let i = 0; i < 4; i++) rand += chars[Math.floor(Math.random() / chars.length)];
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:69:7
-     if (setA.size === 0 && setB.size === 0) return 0;
+     if (false) return 0;
Tests ran:
    computeMatchScore returns weighted result when sessionType matches
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 2 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:69:7
-     if (setA.size === 0 && setB.size === 0) return 0;
+     if (setA.size === 0 || setB.size === 0) return 0;
Tests ran:
    computeMatchScore returns weighted result when sessionType matches
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 2 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:69:7
-     if (setA.size === 0 && setB.size === 0) return 0;
+     if (true && setB.size === 0) return 0;
Tests ran:
    computeMatchScore returns weighted result when sessionType matches
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 2 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:69:7
-     if (setA.size === 0 && setB.size === 0) return 0;
+     if (setA.size !== 0 && setB.size === 0) return 0;
Tests ran:
    computeMatchScore returns weighted result when sessionType matches
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 2 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       false
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       (typeof entry?.date !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) || typeof entry?.context !== 'object' || entry.context === null || typeof entry?.proposed !== 'object') && entry.proposed === null
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       false || entry.proposed === null
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       (typeof entry?.date !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) || typeof entry?.context !== 'object' || entry.context === null) && typeof entry?.proposed !== 'object' || entry.proposed === null
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
+       false ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
+       (typeof entry?.date !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) || typeof entry?.context !== 'object') && entry.context === null ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
+       false || entry.context === null ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
-       typeof entry?.context !== 'object' || entry.context === null ||
+       (typeof entry?.date !== 'string' || !/^\d{4}-\d{2}-\d{2}$/.test(entry.date)) && typeof entry?.context !== 'object' || entry.context === null ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
+       false ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
+       typeof entry?.date !== 'string' && !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:85:5
-       typeof entry?.date !== 'string' ||
+       false ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] OptionalChaining
src/util/coachDecisionLog.js:85:12
-       typeof entry?.date !== 'string' ||
+       typeof entry.date !== 'string' ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] Regex
src/util/coachDecisionLog.js:86:6
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
+       !/\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] Regex
src/util/coachDecisionLog.js:86:6
-       !/^\d{4}-\d{2}-\d{2}$/.test(entry.date) ||
+       !/^\d{4}-\d{2}-\d{2}/.test(entry.date) ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:87:5
-       typeof entry?.context !== 'object' || entry.context === null ||
+       false || entry.context === null ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] OptionalChaining
src/util/coachDecisionLog.js:87:12
-       typeof entry?.context !== 'object' || entry.context === null ||
+       typeof entry.context !== 'object' || entry.context === null ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:87:43
-       typeof entry?.context !== 'object' || entry.context === null ||
+       typeof entry?.context !== 'object' || false ||
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:88:5
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       false || entry.proposed === null
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] OptionalChaining
src/util/coachDecisionLog.js:88:12
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       typeof entry.proposed !== 'object' || entry.proposed === null
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!
