[Survived] ConditionalExpression
src/util/coachDecisionLog.js:88:44
-       typeof entry?.proposed !== 'object' || entry.proposed === null
+       typeof entry?.proposed !== 'object' || false
Tests ran:
    writeProposed creates entry with valid schema
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
  and 15 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:94:34
-     const existing = all.find(e => e.date === entry.date && isActive(e));
+     const existing = all.find(e => true);
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after readinessScore delta > 20 supersedes within 4h window
  and 7 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:94:34
-     const existing = all.find(e => e.date === entry.date && isActive(e));
+     const existing = all.find(e => e.date === entry.date || isActive(e));
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after readinessScore delta > 20 supersedes within 4h window
  and 7 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:94:34
-     const existing = all.find(e => e.date === entry.date && isActive(e));
+     const existing = all.find(e => true && isActive(e));
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after readinessScore delta > 20 supersedes within 4h window
  and 7 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:99:26
-       const withinWindow = Date.now() - existing.ts < IDEMPOTENCY_WINDOW_MS;
+       const withinWindow = Date.now() - existing.ts <= IDEMPOTENCY_WINDOW_MS;
Tests ran:
    writeProposed within 4h + same context returns existing (idempotent)
    writeProposed after 4h+ returns new entry (window expired)
    writeProposed after readinessScore delta > 20 supersedes within 4h window
  and 7 more tests!

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:135:50
-     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? [];
+     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? ["Stryker was here"];
Tests ran:
    populateOutcome throws when no active entry for date

[Survived] MethodExpression
src/util/coachDecisionLog.js:136:18
-     const target = entries
-       .filter(e => e.date === date && isActive(e))
-       .sort((a, b) => b.ts - a.ts)[0];
+     const target = entries.filter(e => e.date === date && isActive(e))[0];
Tests ran:
    populateOutcome targets most recent non-superseded entry
    populateOutcome throws if outcome already set (immutability)
    populateOutcome throws when no active entry for date
  and 6 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:136:18
-     const target = entries
-       .filter(e => e.date === date && isActive(e))
+     const target = entries
Tests ran:
    populateOutcome targets most recent non-superseded entry
    populateOutcome throws if outcome already set (immutability)
    populateOutcome throws when no active entry for date
  and 6 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:137:18
-       .filter(e => e.date === date && isActive(e))
+       .filter(e => true)
Tests ran:
    populateOutcome targets most recent non-superseded entry
    populateOutcome throws if outcome already set (immutability)
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 5 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:137:18
-       .filter(e => e.date === date && isActive(e))
+       .filter(e => true && isActive(e))
Tests ran:
    populateOutcome targets most recent non-superseded entry
    populateOutcome throws if outcome already set (immutability)
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 5 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:137:18
-       .filter(e => e.date === date && isActive(e))
+       .filter(e => e.date === date || isActive(e))
Tests ran:
    populateOutcome targets most recent non-superseded entry
    populateOutcome throws if outcome already set (immutability)
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 5 more tests!

[Survived] ArrowFunction
src/util/coachDecisionLog.js:138:11
-       .sort((a, b) => b.ts - a.ts)[0];
+       .sort(() => undefined)[0];
Tests ran:
    populateOutcome targets most recent non-superseded entry
    populateOutcome throws if outcome already set (immutability)
    populateOutcome throws when no active entry for date
  and 6 more tests!

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:159:50
-     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? [];
+     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? ["Stryker was here"];
Tests ran:
    endSession — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null
    cancelWorkout — CDL outcome (ADR 011) skips populate and warns when cdlEntryId is null on cancel

[Survived] MethodExpression
src/util/coachDecisionLog.js:160:19
-     const matches = entries
-       .filter(e => e.date === date && isActive(e))
-       .sort((a, b) => b.ts - a.ts);
+     const matches = entries.filter(e => e.date === date && isActive(e));
Tests ran:
    readActiveForDate filters out superseded entries
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 7 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:160:19
-     const matches = entries
-       .filter(e => e.date === date && isActive(e))
+     const matches = entries
Tests ran:
    readActiveForDate filters out superseded entries
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 7 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:161:18
-       .filter(e => e.date === date && isActive(e))
+       .filter(e => true)
Tests ran:
    readActiveForDate filters out superseded entries
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 5 more tests!

[Survived] LogicalOperator
src/util/coachDecisionLog.js:161:18
-       .filter(e => e.date === date && isActive(e))
+       .filter(e => e.date === date || isActive(e))
Tests ran:
    readActiveForDate filters out superseded entries
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 5 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:161:18
-       .filter(e => e.date === date && isActive(e))
+       .filter(e => true && isActive(e))
Tests ran:
    readActiveForDate filters out superseded entries
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 5 more tests!

[Survived] ArrowFunction
src/util/coachDecisionLog.js:162:11
-       .sort((a, b) => b.ts - a.ts);
+       .sort(() => undefined);
Tests ran:
    readActiveForDate filters out superseded entries
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
  and 7 more tests!

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:172:50
-     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? [];
+     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 30 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:189:7
-     if (!start) return [];
+     if (false) return [];
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] MethodExpression
src/util/coachDecisionLog.js:173:18
-     const active = entries.filter(isActive);
+     const active = entries;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 37 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:174:21
-     return filterFn ? active.filter(filterFn) : active;
+     return filterFn ? active : active;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 37 more tests!

[Survived] ArrowFunction
src/util/coachDecisionLog.js:202:38
-     const chainIds = new Set(chain.map(e => e.id));
+     const chainIds = new Set(chain.map(() => undefined));
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] BlockStatement
src/util/coachDecisionLog.js:204:28
-     for (const e of entries) {
-       if (e.supersedes && chainIds.has(e.supersedes) && !chainIds.has(e.id)) {
-         chain.push(e);
-         chainIds.add(e.id);
-       }
-     }
+     for (const e of entries) {}
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:205:9
-       if (e.supersedes && chainIds.has(e.supersedes) && !chainIds.has(e.id)) {
+       if (false) {
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:205:9
-       if (e.supersedes && chainIds.has(e.supersedes) && !chainIds.has(e.id)) {
+       if (true && !chainIds.has(e.id)) {
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] LogicalOperator
src/util/coachDecisionLog.js:205:9
-       if (e.supersedes && chainIds.has(e.supersedes) && !chainIds.has(e.id)) {
+       if (e.supersedes || chainIds.has(e.supersedes) && !chainIds.has(e.id)) {
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] MethodExpression
src/util/coachDecisionLog.js:211:3
-     chain.sort((a, b) => a.ts - b.ts);
+     chain;
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] ArrowFunction
src/util/coachDecisionLog.js:211:14
-     chain.sort((a, b) => a.ts - b.ts);
+     chain.sort(() => undefined);
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] ArithmeticOperator
src/util/coachDecisionLog.js:211:24
-     chain.sort((a, b) => a.ts - b.ts);
+     chain.sort((a, b) => a.ts + b.ts);
Tests ran:
    readSupersedeChain returns full chain in chronological order
    supersede chain 3 entries within a day readActiveForDate returns 4th, readSupersedeChain returns 4 entries ascending

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:230:23
-     const volumeRatio = proposedSets > 0
+     const volumeRatio = true
Tests ran:
    computeMatchScore returns weighted result when sessionType matches
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 2 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:230:23
-     const volumeRatio = proposedSets > 0
+     const volumeRatio = proposedSets >= 0
Tests ran:
    computeMatchScore returns weighted result when sessionType matches
    endSession — CDL outcome (ADR 011) populates outcome on today's CDL entry (happy path)
    endSession — CDL outcome (ADR 011) sets executed=partial + earlyStop=true when earlyStopReason is set
  and 2 more tests!

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:246:50
-     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? [];
+     const entries = DB.get(STORAGE_KEYS.TIER_1) ?? ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 21 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:249:40
-     const toDemote = entries.filter(e => e.ts < cutoff);
+     const toDemote = entries.filter(e => e.ts <= cutoff);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] ObjectLiteral
src/util/coachDecisionLog.js:252:37
-     if (toDemote.length === 0) return { demoted: 0, errors: [] };
+     if (toDemote.length === 0) return {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] EqualityOperator
src/util/coachDecisionLog.js:250:41
-     const remaining = entries.filter(e => e.ts >= cutoff);
+     const remaining = entries.filter(e => e.ts > cutoff);
Tests ran:
    CoachDirector — Pattern learning real effect should reduce exercises when EARLY_END pattern detected via CDL
    CoachDirector — Week 1.5 fixes should apply EARLY_END pattern from CDL reducing exercises
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:252:59
-     if (toDemote.length === 0) return { demoted: 0, errors: [] };
+     if (toDemote.length === 0) return { demoted: 0, errors: ["Stryker was here"] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:252:7
-     if (toDemote.length === 0) return { demoted: 0, errors: [] };
+     if (false) return { demoted: 0, errors: [] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] OptionalChaining
src/util/coachDecisionLog.js:260:23
-       calibrationLevel: e.context?.calibrationLevel ?? null,
+       calibrationLevel: e.context.calibrationLevel ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] LogicalOperator
src/util/coachDecisionLog.js:261:14
-       isInCut: e.context?.isInCut ?? null,
+       isInCut: e.context?.isInCut && null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:261:14
-       isInCut: e.context?.isInCut ?? null,
+       isInCut: e.context.isInCut ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:262:18
-       sessionType: e.proposed?.sessionType ?? null,
+       sessionType: e.proposed.sessionType ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:263:15
-       winnerId: e.proposed?.rationale?.winnerId ?? null,
+       winnerId: e.proposed?.rationale.winnerId ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:263:15
-       winnerId: e.proposed?.rationale?.winnerId ?? null,
+       winnerId: e.proposed.rationale?.winnerId ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:264:15
-       executed: e.outcome?.executed ?? null,
+       executed: e.outcome.executed ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] LogicalOperator
src/util/coachDecisionLog.js:265:16
-       deviation: e.outcome?.deviation ?? null,
+       deviation: e.outcome?.deviation && null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:265:16
-       deviation: e.outcome?.deviation ?? null,
+       deviation: e.outcome.deviation ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] OptionalChaining
src/util/coachDecisionLog.js:266:17
-       matchScore: e.outcome?.matchScore ?? null,
+       matchScore: e.outcome.matchScore ?? null,
Tests ran:
    demoteToTier2 moves entries older than 180 days and drops fields

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:287:48
-     const tier2 = DB.get(STORAGE_KEYS.TIER_2) ?? [];
+     const tier2 = DB.get(STORAGE_KEYS.TIER_2) ?? ["Stryker was here"];
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:290:38
-     const toDemote = tier2.filter(e => e.ts < cutoff);
+     const toDemote = tier2.filter(e => true);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:290:38
-     const toDemote = tier2.filter(e => e.ts < cutoff);
+     const toDemote = tier2.filter(e => e.ts <= cutoff);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ArithmeticOperator
src/util/coachDecisionLog.js:288:18
-     const cutoff = Date.now() - TIER_2_WINDOW_MS;
+     const cutoff = Date.now() + TIER_2_WINDOW_MS;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] MethodExpression
src/util/coachDecisionLog.js:290:20
-     const toDemote = tier2.filter(e => e.ts < cutoff);
+     const toDemote = tier2;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:291:39
-     const remaining = tier2.filter(e => e.ts >= cutoff);
+     const remaining = tier2.filter(e => false);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:291:39
-     const remaining = tier2.filter(e => e.ts >= cutoff);
+     const remaining = tier2.filter(e => e.ts > cutoff);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ArrowFunction
src/util/coachDecisionLog.js:291:34
-     const remaining = tier2.filter(e => e.ts >= cutoff);
+     const remaining = tier2.filter(() => undefined);
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ObjectLiteral
src/util/coachDecisionLog.js:293:37
-     if (toDemote.length === 0) return { demoted: 0, errors: [] };
+     if (toDemote.length === 0) return {};
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrayDeclaration
src/util/coachDecisionLog.js:293:59
-     if (toDemote.length === 0) return { demoted: 0, errors: [] };
+     if (toDemote.length === 0) return { demoted: 0, errors: ["Stryker was here"] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:293:7
-     if (toDemote.length === 0) return { demoted: 0, errors: [] };
+     if (false) return { demoted: 0, errors: [] };
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 24 more tests!

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:309:75
-       const executedCount = groupEntries.filter(e => e.executed === true || e.executed === 'partial').length;
+       const executedCount = groupEntries.filter(e => e.executed === true || false).length;
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] MethodExpression
src/util/coachDecisionLog.js:311:23
-       const withScore = groupEntries.filter(e => typeof e.matchScore === 'number');
+       const withScore = groupEntries;
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ArrowFunction
src/util/coachDecisionLog.js:311:43
-       const withScore = groupEntries.filter(e => typeof e.matchScore === 'number');
+       const withScore = groupEntries.filter(() => undefined);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:311:48
-       const withScore = groupEntries.filter(e => typeof e.matchScore === 'number');
+       const withScore = groupEntries.filter(e => true);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:311:48
-       const withScore = groupEntries.filter(e => typeof e.matchScore === 'number');
+       const withScore = groupEntries.filter(e => false);
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:311:48
-       const withScore = groupEntries.filter(e => typeof e.matchScore === 'number');
+       const withScore = groupEntries.filter(e => typeof e.matchScore !== 'number');
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:312:27
-       const avgMatchScore = withScore.length > 0
+       const avgMatchScore = true
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:312:27
-       const avgMatchScore = withScore.length > 0
+       const avgMatchScore = false
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:312:27
-       const avgMatchScore = withScore.length > 0
+       const avgMatchScore = withScore.length >= 0
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:312:27
-       const avgMatchScore = withScore.length > 0
+       const avgMatchScore = withScore.length <= 0
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ArrowFunction
src/util/coachDecisionLog.js:313:26
-         ? withScore.reduce((sum, e) => sum + e.matchScore, 0) / withScore.length
+         ? withScore.reduce(() => undefined, 0) / withScore.length
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ArithmeticOperator
src/util/coachDecisionLog.js:313:9
-         ? withScore.reduce((sum, e) => sum + e.matchScore, 0) / withScore.length
+         ? withScore.reduce((sum, e) => sum + e.matchScore, 0) * withScore.length
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ArithmeticOperator
src/util/coachDecisionLog.js:313:38
-         ? withScore.reduce((sum, e) => sum + e.matchScore, 0) / withScore.length
+         ? withScore.reduce((sum, e) => sum - e.matchScore, 0) / withScore.length
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:316:9
-       if (tier3[key]) {
+       if (false) {
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:339:23
-           executedRate: count > 0 ? executedCount / count : 0,
+           executedRate: true ? executedCount / count : 0,
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:339:23
-           executedRate: count > 0 ? executedCount / count : 0,
+           executedRate: count >= 0 ? executedCount / count : 0,
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ConditionalExpression
src/util/coachDecisionLog.js:341:24
-           deviationRate: count > 0 ? deviationCount / count : 0,
+           deviationRate: true ? deviationCount / count : 0,
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] EqualityOperator
src/util/coachDecisionLog.js:341:24
-           deviationRate: count > 0 ? deviationCount / count : 0,
+           deviationRate: count >= 0 ? deviationCount / count : 0,
Tests ran:
    demoteToTier3 aggregates entries older than 1 year into monthly archive

[Survived] ObjectLiteral
src/util/coachDecisionLog.js:21:53
-   export const RESERVED_RATIONALE_IDS = Object.freeze({
-     SYNTHETIC_BACKFILL: 'SYNTHETIC_BACKFILL',
-     NO_PROPOSED: 'NO_PROPOSED',
-     NO_RULE_FIRED: 'NO_RULE_FIRED',
-   });
+   export const RESERVED_RATIONALE_IDS = Object.freeze({});
Ran all tests for this mutant.

[Survived] ArithmeticOperator
src/util/coachDecisionLog.js:29:26
-   const TIER_2_WINDOW_MS = 365 * 86400000;
+   const TIER_2_WINDOW_MS = 365 / 86400000;
Ran all tests for this mutant.

[NoCoverage] BlockStatement
src/util/dataCleanup.js:16:11
-     } catch { return; }
+     } catch {}

[NoCoverage] MethodExpression
src/util/dataCleanup.js:48:35
-       a.download = `andura-backup-${new Date().toISOString().slice(0,19).replace(/[T:]/g,'-')}.json`;
+       a.download = `andura-backup-${new Date().toISOString().replace(/[T:]/g,'-')}.json`;
