[NoCoverage] Regex
src/util/dataCleanup.js:48:80
-       a.download = `andura-backup-${new Date().toISOString().slice(0,19).replace(/[T:]/g,'-')}.json`;
+       a.download = `andura-backup-${new Date().toISOString().slice(0,19).replace(/[^T:]/g,'-')}.json`;

[NoCoverage] BlockStatement
src/util/dataCleanup.js:51:22
-       setTimeout(() => { document.body.removeChild(a); URL.revokeObjectURL(url); }, 1000);
+       setTimeout(() => {}, 1000);

[NoCoverage] BlockStatement
src/util/dataCleanup.js:59:15
-     } catch (e) {
-       console.warn('[DataCleanup] last-backup save failed (storage quota):', e.message);
-     }
+     } catch (e) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:67:47
-   export function restoreFromBackup(jsonString) {
-     let backup;
-     try {
-       backup = JSON.parse(jsonString);
-     } catch (e) {
-       alert('Fișierul nu este un JSON valid.');
-       return false;
-     }
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
-       alert('Structura backup-ului este invalidă (lipsă câmp "data").');
-       return false;
-     }
-   
-     window._suppressFirebaseSync = true;
-     localStorage.clear();
-     Object.entries(backup.data).forEach(([k, v]) => {
-       try { localStorage.setItem(k, v); } catch (e) { console.warn('[DataCleanup] restore key failed:', k, e.message); }
-     });
-     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', backup.timestamp || '');
-     setTimeout(() => { window.location.reload(); }, 500);
-     return true;
-   }
+   export function restoreFromBackup(jsonString) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:69:7
-     try {
-       backup = JSON.parse(jsonString);
-     } catch (e) {
+     try {} catch (e) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:71:15
-     } catch (e) {
-       alert('Fișierul nu este un JSON valid.');
-       return false;
-     }
+     } catch (e) {}

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:73:12
-       return false;
+       return true;

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:75:7
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:75:7
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (false) {

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:75:7
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if ((!backup || typeof backup.data !== 'object') && backup.data === null) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:75:7
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (false || backup.data === null) {

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:75:7
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (!backup && typeof backup.data !== 'object' || backup.data === null) {

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:75:7
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (backup || typeof backup.data !== 'object' || backup.data === null) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:75:18
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (!backup || false || backup.data === null) {

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:75:18
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (!backup || typeof backup.data === 'object' || backup.data === null) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:75:53
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (!backup || typeof backup.data !== 'object' || false) {

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:75:53
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
+     if (!backup || typeof backup.data !== 'object' || backup.data !== null) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:75:75
-     if (!backup || typeof backup.data !== 'object' || backup.data === null) {
-       alert('Structura backup-ului este invalidă (lipsă câmp "data").');
-       return false;
-     }
+     if (!backup || typeof backup.data !== 'object' || backup.data === null) {}

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:77:12
-       return false;
+       return true;

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:80:34
-     window._suppressFirebaseSync = true;
+     window._suppressFirebaseSync = false;

[NoCoverage] BlockStatement
src/util/dataCleanup.js:82:51
-     Object.entries(backup.data).forEach(([k, v]) => {
-       try { localStorage.setItem(k, v); } catch (e) { console.warn('[DataCleanup] restore key failed:', k, e.message); }
-     });
+     Object.entries(backup.data).forEach(([k, v]) => {});

[NoCoverage] BlockStatement
src/util/dataCleanup.js:83:9
-       try { localStorage.setItem(k, v); } catch (e) { console.warn('[DataCleanup] restore key failed:', k, e.message); }
+       try {} catch (e) { console.warn('[DataCleanup] restore key failed:', k, e.message); }

[NoCoverage] BlockStatement
src/util/dataCleanup.js:83:51
-       try { localStorage.setItem(k, v); } catch (e) { console.warn('[DataCleanup] restore key failed:', k, e.message); }
+       try { localStorage.setItem(k, v); } catch (e) {}

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:85:94
-     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', backup.timestamp || '');
+     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', true);

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:85:94
-     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', backup.timestamp || '');
+     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', false);

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:85:94
-     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', backup.timestamp || '');
+     console.log('[DataCleanup] Restored', Object.keys(backup.data).length, 'keys from backup', backup.timestamp && '');

[NoCoverage] BlockStatement
src/util/dataCleanup.js:86:20
-     setTimeout(() => { window.location.reload(); }, 500);
+     setTimeout(() => {}, 500);

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:87:10
-     return true;
+     return false;

[NoCoverage] BlockStatement
src/util/dataCleanup.js:90:37
-   export function restoreLastBackup() {
-     const raw = localStorage.getItem('last-backup');
-     if (!raw) {
-       alert('Nu există niciun auto-backup salvat local.');
-       return null;
-     }
-     return restoreFromBackup(raw);
-   }
+   export function restoreLastBackup() {}

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:92:7
-     if (!raw) {
+     if (raw) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:92:7
-     if (!raw) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:92:7
-     if (!raw) {
+     if (false) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:92:13
-     if (!raw) {
-       alert('Nu există niciun auto-backup salvat local.');
-       return null;
-     }
+     if (!raw) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:115:14
-         } else {
-           const getUrl = await buildAuthUrl(userPath);
-           const r = await fetch(getUrl, { cache: 'no-store' });
-           if (r.ok) {
-             const remote = await r.json();
-             if (remote && typeof remote === 'object') {
-               TEST_RESIDUE_KEYS.forEach(k => { delete remote[k]; });
-               const putUrl = await buildAuthUrl(userPath);
-               await fetch(putUrl, {
-                 method: 'PUT',
-                 body: JSON.stringify(remote),
-                 headers: { 'Content-Type': 'application/json' }
-               });
-               console.log('[DataCleanup] Firebase keys removed');
-             }
-           } else {
-             console.log('[DataCleanup] Firebase not reachable, local-only cleanup');
-           }
-         }
+         } else {}

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:117:39
-           const r = await fetch(getUrl, { cache: 'no-store' });
+           const r = await fetch(getUrl, {});

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:118:13
-           if (r.ok) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:118:13
-           if (r.ok) {
+           if (false) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:118:19
-           if (r.ok) {
-             const remote = await r.json();
-             if (remote && typeof remote === 'object') {
-               TEST_RESIDUE_KEYS.forEach(k => { delete remote[k]; });
-               const putUrl = await buildAuthUrl(userPath);
-               await fetch(putUrl, {
-                 method: 'PUT',
-                 body: JSON.stringify(remote),
-                 headers: { 'Content-Type': 'application/json' }
-               });
-               console.log('[DataCleanup] Firebase keys removed');
-             }
-           } else {
+           if (r.ok) {} else {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:120:15
-             if (remote && typeof remote === 'object') {
+             if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:120:15
-             if (remote && typeof remote === 'object') {
+             if (false) {

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:120:15
-             if (remote && typeof remote === 'object') {
+             if (remote || typeof remote === 'object') {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:120:25
-             if (remote && typeof remote === 'object') {
+             if (remote && true) {

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:120:25
-             if (remote && typeof remote === 'object') {
+             if (remote && typeof remote !== 'object') {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:120:53
-             if (remote && typeof remote === 'object') {
-               TEST_RESIDUE_KEYS.forEach(k => { delete remote[k]; });
-               const putUrl = await buildAuthUrl(userPath);
-               await fetch(putUrl, {
-                 method: 'PUT',
-                 body: JSON.stringify(remote),
-                 headers: { 'Content-Type': 'application/json' }
-               });
-               console.log('[DataCleanup] Firebase keys removed');
-             }
+             if (remote && typeof remote === 'object') {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:121:44
-               TEST_RESIDUE_KEYS.forEach(k => { delete remote[k]; });
+               TEST_RESIDUE_KEYS.forEach(k => {});

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:123:33
-               await fetch(putUrl, {
-                 method: 'PUT',
-                 body: JSON.stringify(remote),
-                 headers: { 'Content-Type': 'application/json' }
-               });
+               await fetch(putUrl, {});

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:126:24
-                 headers: { 'Content-Type': 'application/json' }
+                 headers: {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:130:16
-           } else {
-             console.log('[DataCleanup] Firebase not reachable, local-only cleanup');
-           }
+           } else {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:134:19
-       } catch (err) {
-         console.warn('[DataCleanup] Firebase cleanup failed:', err.message);
-       }
+       } catch (err) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:147:20
-     setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
+     setTimeout(() => {}, 3000);

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:147:53
-     setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
+     setTimeout(() => { window._suppressFirebaseSync = true; }, 3000);

[NoCoverage] BlockStatement
src/util/dataCleanup.js:150:22
-       setTimeout(() => { location.reload(); }, 500);
+       setTimeout(() => {}, 500);

[NoCoverage] BlockStatement
src/util/dataCleanup.js:164:17
-     } catch (err) {
-       console.warn('[DataCleanup] Auto-backup failed:', err.message);
-       if (!confirm('Backup a eșuat. Continui oricum cu Full Reset?')) return;
-     }
+     } catch (err) {}

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:166:9
-       if (!confirm('Backup a eșuat. Continui oricum cu Full Reset?')) return;
+       if (confirm('Backup a eșuat. Continui oricum cu Full Reset?')) return;

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:166:9
-       if (!confirm('Backup a eșuat. Continui oricum cu Full Reset?')) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:166:9
-       if (!confirm('Backup a eșuat. Continui oricum cu Full Reset?')) return;
+       if (false) return;

[NoCoverage] BlockStatement
src/util/dataCleanup.js:190:15
-     } catch (e) {
-       console.warn('[DataCleanup] sessionStorage clear failed:', e.message);
-     }
+     } catch (e) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:199:21
-         if (userPath) {
-           const url = await buildAuthUrl(userPath);
-           await fetch(url, {
-             method: 'PUT',
-             body: JSON.stringify(null),
-             headers: { 'Content-Type': 'application/json' }
-           });
-           console.log('[DataCleanup] Firebase data cleared');
-         } else {
+         if (userPath) {} else {

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:201:26
-           await fetch(url, {
-             method: 'PUT',
-             body: JSON.stringify(null),
-             headers: { 'Content-Type': 'application/json' }
-           });
+           await fetch(url, {});

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:204:20
-             headers: { 'Content-Type': 'application/json' }
+             headers: {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:210:19
-       } catch (err) {
-         console.warn('[DataCleanup] Firebase full reset failed:', err.message);
-       }
+       } catch (err) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:217:39
-       if ('serviceWorker' in navigator) {
-         const registrations = await navigator.serviceWorker.getRegistrations();
-         await Promise.all(registrations.map(r => r.unregister()));
-         console.log('[DataCleanup] Service workers unregistered:', registrations.length);
-       }
+       if ('serviceWorker' in navigator) {}

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:219:43
-         await Promise.all(registrations.map(r => r.unregister()));
+         await Promise.all(registrations.map(() => undefined));

[NoCoverage] BlockStatement
src/util/dataCleanup.js:222:15
-     } catch (e) {
-       console.warn('[DataCleanup] SW unregister failed:', e.message);
-     }
+     } catch (e) {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:228:29
-       if ('caches' in window) {
-         const cacheKeys = await caches.keys();
-         await Promise.all(cacheKeys.map(k => caches.delete(k)));
-         console.log('[DataCleanup] Cache API cleared:', cacheKeys.length, 'caches');
-       }
+       if ('caches' in window) {}

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:230:39
-         await Promise.all(cacheKeys.map(k => caches.delete(k)));
+         await Promise.all(cacheKeys.map(() => undefined));

[NoCoverage] BlockStatement
src/util/dataCleanup.js:233:15
-     } catch (e) {
-       console.warn('[DataCleanup] Cache clear failed:', e.message);
-     }
+     } catch (e) {}

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:239:22
-       if (indexedDB && typeof indexedDB.databases === 'function') {
+       if (indexedDB && true) {

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:239:22
-       if (indexedDB && typeof indexedDB.databases === 'function') {
+       if (indexedDB && typeof indexedDB.databases !== 'function') {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:239:65
-       if (indexedDB && typeof indexedDB.databases === 'function') {
-         const dbs = await indexedDB.databases();
-         await Promise.all(dbs.map(db => new Promise((res) => {
-           const req = indexedDB.deleteDatabase(db.name);
-           req.onsuccess = res;
-           req.onerror = res;
-           req.onblocked = res;
-         })));
-         console.log('[DataCleanup] IndexedDB cleared:', dbs.length, 'databases');
-       }
+       if (indexedDB && typeof indexedDB.databases === 'function') {}

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:241:33
-         await Promise.all(dbs.map(db => new Promise((res) => {
-           const req = indexedDB.deleteDatabase(db.name);
-           req.onsuccess = res;
-           req.onerror = res;
-           req.onblocked = res;
-         })));
+         await Promise.all(dbs.map(() => undefined));

[NoCoverage] BlockStatement
src/util/dataCleanup.js:241:60
-         await Promise.all(dbs.map(db => new Promise((res) => {
-           const req = indexedDB.deleteDatabase(db.name);
-           req.onsuccess = res;
-           req.onerror = res;
-           req.onblocked = res;
-         })));
+         await Promise.all(dbs.map(db => new Promise((res) => {})));

[NoCoverage] BlockStatement
src/util/dataCleanup.js:258:22
-       setTimeout(() => {
-         window.location.href = base + '?nocache=' + Date.now();
-       }, 500);
+       setTimeout(() => {}, 500);

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:266:54
-   export async function resetButKeepRealLogs(options = { reload: true }) {
+   export async function resetButKeepRealLogs(options = {}) {

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:266:64
-   export async function resetButKeepRealLogs(options = { reload: true }) {
+   export async function resetButKeepRealLogs(options = { reload: false }) {

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:268:34
-     window._suppressFirebaseSync = true;
+     window._suppressFirebaseSync = false;

[NoCoverage] ArrayDeclaration
src/util/dataCleanup.js:270:21
-     const KEEP_KEYS = [
-       'logs', 'weights', 'kcals', 'prots', 'waters', 'pr-records',
-       'phase-log', 'phase-change-date', 'bf-override', 'readiness',
-       'session-burns', 'closed-days', 'wellbeing', 'suppl-list',
-       'active-theme', 'device-id', 'notif-enabled', 'muted', 'workout-skips',
-       'current-kcal', 'phase-override', 'onboarding-done'
-     ];
+     const KEEP_KEYS = [];

[NoCoverage] BlockStatement
src/util/dataCleanup.js:279:26
-     KEEP_KEYS.forEach(k => {
-       const v = localStorage.getItem(k);
-       if (v !== null) preserved[k] = v;
-     });
+     KEEP_KEYS.forEach(k => {});

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:281:9
-       if (v !== null) preserved[k] = v;
+       if (true) preserved[k] = v;

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:281:9
-       if (v !== null) preserved[k] = v;
+       if (false) preserved[k] = v;

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:281:9
-       if (v !== null) preserved[k] = v;
+       if (v === null) preserved[k] = v;

[NoCoverage] BlockStatement
src/util/dataCleanup.js:285:7
-     try { sessionStorage.clear(); } catch (e) { /* ignore */ }
+     try {} catch (e) { /* ignore */ }

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:287:37
-     Object.entries(preserved).forEach(([k, v]) => localStorage.setItem(k, v));
+     Object.entries(preserved).forEach(() => undefined);

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:291:7
-     if (options.reload) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:291:7
-     if (options.reload) {
+     if (false) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:291:23
-     if (options.reload) {
-       localStorage.setItem('__suppressFirebaseSyncUntil', String(Date.now() + 10000));
-       setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
-       setTimeout(() => window.location.reload(), 500);
-     } else {
+     if (options.reload) {} else {

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:292:64
-       localStorage.setItem('__suppressFirebaseSyncUntil', String(Date.now() + 10000));
+       localStorage.setItem('__suppressFirebaseSyncUntil', String(Date.now() - 10000));

[NoCoverage] BlockStatement
src/util/dataCleanup.js:293:22
-       setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
+       setTimeout(() => {}, 3000);

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:293:55
-       setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
+       setTimeout(() => { window._suppressFirebaseSync = true; }, 3000);

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:294:16
-       setTimeout(() => window.location.reload(), 500);
+       setTimeout(() => undefined, 500);

[NoCoverage] BlockStatement
src/util/dataCleanup.js:295:10
-     } else {
-       setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
-     }
+     } else {}

[NoCoverage] BlockStatement
src/util/dataCleanup.js:296:22
-       setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
+       setTimeout(() => {}, 3000);

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:296:55
-       setTimeout(() => { window._suppressFirebaseSync = false; }, 3000);
+       setTimeout(() => { window._suppressFirebaseSync = true; }, 3000);

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:299:10
-     return { preserved: Object.keys(preserved).length, cleared: TEST_RESIDUE_KEYS.length };
+     return {};

[NoCoverage] BlockStatement
src/util/dataCleanup.js:302:34
-   export function inspectStorage() {
-     const report = { userData: {}, testResidue: {}, unknown: {} };
-   
-     for (let i = 0; i < localStorage.length; i++) {
-       const key = localStorage.key(i);
-       const value = localStorage.getItem(key);
-       const size = value ? value.length : 0;
-   
-       if (USER_DATA_KEYS.includes(key)) {
-         report.userData[key] = size + ' bytes';
-       } else if (TEST_RESIDUE_KEYS.includes(key)) {
-         report.testResidue[key] = size + ' bytes';
-       } else {
-         report.unknown[key] = size + ' bytes';
-       }
-     }
-   
-     console.table(report.userData);
-     console.table(report.testResidue);
-     console.table(report.unknown);
-     return report;
-   }
+   export function inspectStorage() {}

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:303:18
-     const report = { userData: {}, testResidue: {}, unknown: {} };
+     const report = {};

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:305:19
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:305:19
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; i <= localStorage.length; i++) {

[NoCoverage] EqualityOperator
src/util/dataCleanup.js:305:19
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; i >= localStorage.length; i++) {

[NoCoverage] UpdateOperator
src/util/dataCleanup.js:305:44
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; i < localStorage.length; i--) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:305:49
-     for (let i = 0; i < localStorage.length; i++) {
-       const key = localStorage.key(i);
-       const value = localStorage.getItem(key);
-       const size = value ? value.length : 0;
-   
-       if (USER_DATA_KEYS.includes(key)) {
-         report.userData[key] = size + ' bytes';
-       } else if (TEST_RESIDUE_KEYS.includes(key)) {
-         report.testResidue[key] = size + ' bytes';
-       } else {
-         report.unknown[key] = size + ' bytes';
-       }
-     }
+     for (let i = 0; i < localStorage.length; i++) {}

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:310:9
-       if (USER_DATA_KEYS.includes(key)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:310:9
-       if (USER_DATA_KEYS.includes(key)) {
+       if (false) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:310:39
-       if (USER_DATA_KEYS.includes(key)) {
-         report.userData[key] = size + ' bytes';
-       } else if (TEST_RESIDUE_KEYS.includes(key)) {
+       if (USER_DATA_KEYS.includes(key)) {} else if (TEST_RESIDUE_KEYS.includes(key)) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:312:16
-       } else if (TEST_RESIDUE_KEYS.includes(key)) {
+       } else if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:312:16
-       } else if (TEST_RESIDUE_KEYS.includes(key)) {
+       } else if (false) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:312:49
-       } else if (TEST_RESIDUE_KEYS.includes(key)) {
-         report.testResidue[key] = size + ' bytes';
-       } else {
+       } else if (TEST_RESIDUE_KEYS.includes(key)) {} else {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:314:12
-       } else {
-         report.unknown[key] = size + ' bytes';
-       }
+       } else {}

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:329:43
-   export function restoreRealLogs({ merge = true } = {}) {
+   export function restoreRealLogs({ merge = false } = {}) {

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:335:5
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 1000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:335:59
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 1000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS - 1000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:335:140
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 1000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 1000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:336:5
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 2000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:336:59
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 2000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS - 2000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:336:140
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 2000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 2000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:337:5
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 8, ts: PULL_SESSION_TS + 3000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:337:59
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 8, ts: PULL_SESSION_TS + 3000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 8, ts: PULL_SESSION_TS - 3000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:337:140
-       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 8, ts: PULL_SESSION_TS + 3000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Lat Pulldown',   w: 64,  reps: 8,  rpe: 8, ts: PULL_SESSION_TS + 3000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:338:5
-       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 4000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:338:59
-       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 4000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS - 4000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:338:140
-       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 4000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 4000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },
