[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:339:5
-       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 5000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:339:59
-       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 5000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS - 5000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:339:140
-       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 5000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Cable Row',      w: 72,  reps: 8,  rpe: 7, ts: PULL_SESSION_TS + 5000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:340:5
-       { ex: 'Cable Row',      w: 72,  reps: 7,  rpe: 8, ts: PULL_SESSION_TS + 6000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:340:59
-       { ex: 'Cable Row',      w: 72,  reps: 7,  rpe: 8, ts: PULL_SESSION_TS + 6000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Cable Row',      w: 72,  reps: 7,  rpe: 8, ts: PULL_SESSION_TS - 6000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:340:140
-       { ex: 'Cable Row',      w: 72,  reps: 7,  rpe: 8, ts: PULL_SESSION_TS + 6000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Cable Row',      w: 72,  reps: 7,  rpe: 8, ts: PULL_SESSION_TS + 6000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:341:5
-       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 7000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:341:59
-       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 7000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS - 7000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:341:140
-       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 7000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 7000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:342:5
-       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 8000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:342:59
-       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 8000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS - 8000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:342:140
-       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 8000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Face Pulls',     w: 17,  reps: 15, rpe: 6, ts: PULL_SESSION_TS + 8000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:343:5
-       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 9000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:343:59
-       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 9000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS - 9000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:343:140
-       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 9000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 9000,  session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:344:5
-       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 10000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:344:59
-       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 10000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS - 10000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:344:140
-       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 10000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Bayesian Curl',  w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 10000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:345:5
-       { ex: 'Incline DB Curl',w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 11000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:345:59
-       { ex: 'Incline DB Curl',w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 11000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Incline DB Curl',w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS - 11000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:345:140
-       { ex: 'Incline DB Curl',w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 11000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Incline DB Curl',w: 10,  reps: 12, rpe: 7, ts: PULL_SESSION_TS + 11000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:346:5
-       { ex: 'Incline DB Curl',w: 10,  reps: 10, rpe: 8, ts: PULL_SESSION_TS + 12000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:346:59
-       { ex: 'Incline DB Curl',w: 10,  reps: 10, rpe: 8, ts: PULL_SESSION_TS + 12000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Incline DB Curl',w: 10,  reps: 10, rpe: 8, ts: PULL_SESSION_TS - 12000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:346:140
-       { ex: 'Incline DB Curl',w: 10,  reps: 10, rpe: 8, ts: PULL_SESSION_TS + 12000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: false },
+       { ex: 'Incline DB Curl',w: 10,  reps: 10, rpe: 8, ts: PULL_SESSION_TS + 12000, session: PULL_SESSION_TS, date: '2026-04-21', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:349:5
-       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 1000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:349:62
-       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 1000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS - 1000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:349:143
-       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 1000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 1000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:350:5
-       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 2000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:350:62
-       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 2000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS - 2000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:350:143
-       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 2000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Incline DB Press',   w: 32, reps: 10, rpe: 7, ts: PUSH_SESSION_TS + 2000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:351:5
-       { ex: 'Incline DB Press',   w: 32, reps: 9,  rpe: 8, ts: PUSH_SESSION_TS + 3000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:351:62
-       { ex: 'Incline DB Press',   w: 32, reps: 9,  rpe: 8, ts: PUSH_SESSION_TS + 3000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Incline DB Press',   w: 32, reps: 9,  rpe: 8, ts: PUSH_SESSION_TS - 3000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:351:143
-       { ex: 'Incline DB Press',   w: 32, reps: 9,  rpe: 8, ts: PUSH_SESSION_TS + 3000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Incline DB Press',   w: 32, reps: 9,  rpe: 8, ts: PUSH_SESSION_TS + 3000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:352:5
-       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 4000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:352:64
-       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 4000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 4000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:352:145
-       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 4000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 4000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:353:5
-       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 5000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:353:64
-       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 5000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 5000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:353:145
-       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 5000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pec Deck / Cable Fly', w: 55, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 5000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:354:5
-       { ex: 'Pec Deck / Cable Fly', w: 57, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 6000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:354:64
-       { ex: 'Pec Deck / Cable Fly', w: 57, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 6000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pec Deck / Cable Fly', w: 57, reps: 10, rpe: 8, ts: PUSH_SESSION_TS - 6000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:354:145
-       { ex: 'Pec Deck / Cable Fly', w: 57, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 6000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pec Deck / Cable Fly', w: 57, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 6000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:355:5
-       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 7000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:355:62
-       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 7000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 7000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:355:143
-       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 7000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 7000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:356:5
-       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 8000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:356:62
-       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 8000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 8000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:356:143
-       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 8000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'DB Shoulder Press',  w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 8000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:357:5
-       { ex: 'DB Shoulder Press',  w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 9000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:357:62
-       { ex: 'DB Shoulder Press',  w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 9000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'DB Shoulder Press',  w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS - 9000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:357:143
-       { ex: 'DB Shoulder Press',  w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 9000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'DB Shoulder Press',  w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 9000,  session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:358:5
-       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 10000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:358:62
-       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 10000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS - 10000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:358:143
-       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 10000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 10000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:359:5
-       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 11000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:359:62
-       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 11000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS - 11000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:359:143
-       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 11000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Lateral Raises',     w: 10, reps: 15, rpe: 7, ts: PUSH_SESSION_TS + 11000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:360:5
-       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 12000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:360:62
-       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 12000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 12000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:360:143
-       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 12000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 12000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:361:5
-       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 13000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:361:62
-       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 13000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 13000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:361:143
-       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 13000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Pushdown',           w: 25, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 13000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:362:5
-       { ex: 'Overhead Triceps',   w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 14000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:362:62
-       { ex: 'Overhead Triceps',   w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 14000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Overhead Triceps',   w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS - 14000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:362:143
-       { ex: 'Overhead Triceps',   w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 14000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Overhead Triceps',   w: 20, reps: 12, rpe: 7, ts: PUSH_SESSION_TS + 14000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:363:5
-       { ex: 'Overhead Triceps',   w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 15000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       {},

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:363:62
-       { ex: 'Overhead Triceps',   w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 15000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Overhead Triceps',   w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS - 15000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:363:143
-       { ex: 'Overhead Triceps',   w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 15000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: false },
+       { ex: 'Overhead Triceps',   w: 20, reps: 10, rpe: 8, ts: PUSH_SESSION_TS + 15000, session: PUSH_SESSION_TS, date: '2026-04-22', baseline: true },

[NoCoverage] BlockStatement
src/util/dataCleanup.js:366:7
-     try {
-       const existing = JSON.parse(localStorage.getItem('logs') ?? '[]');
-       let finalLogs;
-   
-       if (merge) {
-         const existingTs = new Set(existing.map(l => l.ts));
-         const newEntries = REAL_LOGS.filter(l => !existingTs.has(l.ts));
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
-       } else {
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
-       }
-   
-       localStorage.setItem('logs', JSON.stringify(finalLogs));
-   
-       scheduleInvalidation();
-   
-       console.log(`[DataCleanup] restoreRealLogs: ${REAL_LOGS.length} entries restored (merge=${merge}). Total logs: ${finalLogs.length}`);
-       return { restored: REAL_LOGS.length, total: finalLogs.length, merge };
-     } catch (e) {
+     try {} catch (e) {

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:367:33
-       const existing = JSON.parse(localStorage.getItem('logs') ?? '[]');
+       const existing = JSON.parse(localStorage.getItem('logs') && '[]');

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:370:9
-       if (merge) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:370:9
-       if (merge) {
+       if (false) {

[NoCoverage] BlockStatement
src/util/dataCleanup.js:370:16
-       if (merge) {
-         const existingTs = new Set(existing.map(l => l.ts));
-         const newEntries = REAL_LOGS.filter(l => !existingTs.has(l.ts));
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
-       } else {
+       if (merge) {} else {

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:371:47
-         const existingTs = new Set(existing.map(l => l.ts));
+         const existingTs = new Set(existing.map(() => undefined));

[NoCoverage] MethodExpression
src/util/dataCleanup.js:372:26
-         const newEntries = REAL_LOGS.filter(l => !existingTs.has(l.ts));
+         const newEntries = REAL_LOGS;

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:372:43
-         const newEntries = REAL_LOGS.filter(l => !existingTs.has(l.ts));
+         const newEntries = REAL_LOGS.filter(() => undefined);

[NoCoverage] BooleanLiteral
src/util/dataCleanup.js:372:48
-         const newEntries = REAL_LOGS.filter(l => !existingTs.has(l.ts));
+         const newEntries = REAL_LOGS.filter(l => existingTs.has(l.ts));

[NoCoverage] MethodExpression
src/util/dataCleanup.js:373:19
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries];

[NoCoverage] ArrayDeclaration
src/util/dataCleanup.js:373:19
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [].sort((a, b) => (b.ts || 0) - (a.ts || 0));

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:373:53
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:373:63
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) + (a.ts || 0));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:373:64
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (true) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:373:64
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (false) - (a.ts || 0));

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:373:64
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts && 0) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:373:78
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (true));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:373:78
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (false));

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:373:78
-         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...existing, ...newEntries].sort((a, b) => (b.ts || 0) - (a.ts && 0));

[NoCoverage] BlockStatement
src/util/dataCleanup.js:374:12
-       } else {
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
-       }
+       } else {}

[NoCoverage] MethodExpression
src/util/dataCleanup.js:375:19
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS];

[NoCoverage] ArrayDeclaration
src/util/dataCleanup.js:375:19
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [].sort((a, b) => (b.ts || 0) - (a.ts || 0));

[NoCoverage] ArrowFunction
src/util/dataCleanup.js:375:39
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/util/dataCleanup.js:375:49
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) + (a.ts || 0));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:375:50
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (true) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:375:50
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (false) - (a.ts || 0));

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:375:50
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts && 0) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:375:64
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (true));

[NoCoverage] ConditionalExpression
src/util/dataCleanup.js:375:64
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (false));

[NoCoverage] LogicalOperator
src/util/dataCleanup.js:375:64
-         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts || 0));
+         finalLogs = [...REAL_LOGS].sort((a, b) => (b.ts || 0) - (a.ts && 0));

[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:383:12
-       return { restored: REAL_LOGS.length, total: finalLogs.length, merge };
+       return {};

[NoCoverage] BlockStatement
src/util/dataCleanup.js:384:15
-     } catch (e) {
-       console.error('[DataCleanup] restoreRealLogs failed:', e.message);
-       return { restored: 0, error: e.message };
-     }
+     } catch (e) {}
