[NoCoverage] ObjectLiteral
src/util/dataCleanup.js:386:12
-       return { restored: 0, error: e.message };
+       return {};

[Survived] ConditionalExpression
src/util/dataCleanup.js:26:7
-     if (clean.length < logs.length) {
+     if (true) {
Tests ran:
    cleanDuplicateLogs keeps all logs when timestamps are different (same ex/w/reps)
    cleanDuplicateLogs removes duplicate when two logs share the same timestamp
    cleanDuplicateLogs keeps logs with no ts field intact
  and 4 more tests!

[Survived] EqualityOperator
src/util/dataCleanup.js:26:7
-     if (clean.length < logs.length) {
+     if (clean.length <= logs.length) {
Tests ran:
    cleanDuplicateLogs keeps all logs when timestamps are different (same ex/w/reps)
    cleanDuplicateLogs removes duplicate when two logs share the same timestamp
    cleanDuplicateLogs keeps logs with no ts field intact
  and 4 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:35:19
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; false; i++) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] EqualityOperator
src/util/dataCleanup.js:35:19
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; i <= localStorage.length; i++) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:35:49
-     for (let i = 0; i < localStorage.length; i++) {
-       const k = localStorage.key(i);
-       data[k] = localStorage.getItem(k);
-     }
+     for (let i = 0; i < localStorage.length; i++) {}
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 2 more tests!

[Survived] ObjectLiteral
src/util/dataCleanup.js:39:18
-     const backup = { timestamp: new Date().toISOString(), version: 'auto-full-reset', data };
+     const backup = {};
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ArrayDeclaration
src/util/dataCleanup.js:44:27
-       const blob = new Blob([json], { type: 'application/json' });
+       const blob = new Blob([], { type: 'application/json' });
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:43:7
-     try {
-       const blob = new Blob([json], { type: 'application/json' });
-       const url = URL.createObjectURL(blob);
-       const a = document.createElement('a');
-       a.href = url;
-       a.download = `andura-backup-${new Date().toISOString().slice(0,19).replace(/[T:]/g,'-')}.json`;
-       document.body.appendChild(a);
-       a.click();
-       setTimeout(() => { document.body.removeChild(a); URL.revokeObjectURL(url); }, 1000);
-     } catch (e) {
+     try {} catch (e) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ObjectLiteral
src/util/dataCleanup.js:44:35
-       const blob = new Blob([json], { type: 'application/json' });
+       const blob = new Blob([json], {});
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:52:15
-     } catch (e) {
-       console.warn('[DataCleanup] Download failed:', e.message);
-     }
+     } catch (e) {}
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:57:7
-     try {
-       localStorage.setItem('last-backup', json);
-     } catch (e) {
+     try {} catch (e) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BooleanLiteral
src/util/dataCleanup.js:100:42
-     const { clearFirebase = true, reload = true } = options;
+     const { clearFirebase = true, reload = false } = options;
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] BooleanLiteral
src/util/dataCleanup.js:100:27
-     const { clearFirebase = true, reload = true } = options;
+     const { clearFirebase = false, reload = true } = options;
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] BlockStatement
src/util/dataCleanup.js:111:9
-       try {
-         const userPath = getUserPath();
-         if (!userPath) {
-           console.log('[DataCleanup] No user path resolvable, skipping Firebase cleanup');
-         } else {
-           const getUrl = await buildAuthUrl(userPath);
-           const r = await fetch(getUrl, { cache: 'no-store' });
-           if (r.ok) {
-             const remote = await r.json();
-             if (remote && typeof remote === 'object') {
-               TEST_RESIDUE_KEYS.forEach(k => { delete remote[k]; });
-               const putUrl = await buildAuthUrl(userPath);
-               await fetch(putUrl, {
-                 method: 'PUT',
-                 body: JSON.stringify(remote),
-                 headers: { 'Content-Type': 'application/json' }
-               });
-               console.log('[DataCleanup] Firebase keys removed');
-             }
-           } else {
-             console.log('[DataCleanup] Firebase not reachable, local-only cleanup');
-           }
-         }
-       } catch (err) {
+       try {} catch (err) {
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] BooleanLiteral
src/util/dataCleanup.js:113:11
-         if (!userPath) {
+         if (userPath) {
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] ConditionalExpression
src/util/dataCleanup.js:113:11
-         if (!userPath) {
+         if (true) {
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] ConditionalExpression
src/util/dataCleanup.js:110:7
-     if (clearFirebase) {
+     if (true) {
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:110:7
-     if (clearFirebase) {
+     if (false) {
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:113:22
-         if (!userPath) {
-           console.log('[DataCleanup] No user path resolvable, skipping Firebase cleanup');
-         } else {
+         if (!userPath) {} else {
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] ConditionalExpression
src/util/dataCleanup.js:113:11
-         if (!userPath) {
+         if (false) {
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] BlockStatement
src/util/dataCleanup.js:143:15
-     if (reload) {
-       localStorage.setItem('__suppressFirebaseSyncUntil', String(Date.now() + 10000));
-     }
+     if (reload) {}
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] ArithmeticOperator
src/util/dataCleanup.js:144:64
-       localStorage.setItem('__suppressFirebaseSyncUntil', String(Date.now() + 10000));
+       localStorage.setItem('__suppressFirebaseSyncUntil', String(Date.now() - 10000));
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] ConditionalExpression
src/util/dataCleanup.js:143:7
-     if (reload) {
+     if (true) {
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:143:7
-     if (reload) {
+     if (false) {
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:149:15
-     if (reload) {
-       setTimeout(() => { location.reload(); }, 500);
-     }
+     if (reload) {}
Tests ran:
    Data Cleanup should clear test residue keys only

[Survived] ConditionalExpression
src/util/dataCleanup.js:149:7
-     if (reload) {
+     if (false) {
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:149:7
-     if (reload) {
+     if (true) {
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] BooleanLiteral
src/util/dataCleanup.js:157:27
-     const { clearFirebase = true, reload = true } = options;
+     const { clearFirebase = false, reload = true } = options;
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] BooleanLiteral
src/util/dataCleanup.js:157:42
-     const { clearFirebase = true, reload = true } = options;
+     const { clearFirebase = true, reload = false } = options;
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] ObjectLiteral
src/util/dataCleanup.js:153:10
-     return { cleared: TEST_RESIDUE_KEYS.length, firebase: clearFirebase };
+     return {};
Tests ran:
    Data Cleanup should clear test residue keys only
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:162:7
-     try {
-       createAutoBackup();
-     } catch (err) {
+     try {} catch (err) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BooleanLiteral
src/util/dataCleanup.js:169:34
-     window._suppressFirebaseSync = true;
+     window._suppressFirebaseSync = false;
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:176:9
-       if (v !== null) preserved[k] = v;
+       if (true) preserved[k] = v;
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:196:22
-     if (clearFirebase) {
-       try {
-         const userPath = getUserPath();
-         if (userPath) {
-           const url = await buildAuthUrl(userPath);
-           await fetch(url, {
-             method: 'PUT',
-             body: JSON.stringify(null),
-             headers: { 'Content-Type': 'application/json' }
-           });
-           console.log('[DataCleanup] Firebase data cleared');
-         } else {
-           console.log('[DataCleanup] No user path, skipping Firebase reset');
-         }
-       } catch (err) {
-         console.warn('[DataCleanup] Firebase full reset failed:', err.message);
-       }
-     }
+     if (clearFirebase) {}
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] BlockStatement
src/util/dataCleanup.js:197:9
-       try {
-         const userPath = getUserPath();
-         if (userPath) {
-           const url = await buildAuthUrl(userPath);
-           await fetch(url, {
-             method: 'PUT',
-             body: JSON.stringify(null),
-             headers: { 'Content-Type': 'application/json' }
-           });
-           console.log('[DataCleanup] Firebase data cleared');
-         } else {
-           console.log('[DataCleanup] No user path, skipping Firebase reset');
-         }
-       } catch (err) {
+       try {} catch (err) {
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] ConditionalExpression
src/util/dataCleanup.js:199:11
-         if (userPath) {
+         if (true) {
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] BlockStatement
src/util/dataCleanup.js:187:7
-     try {
-       sessionStorage.clear();
-       console.log('[DataCleanup] sessionStorage cleared');
-     } catch (e) {
+     try {} catch (e) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:196:7
-     if (clearFirebase) {
+     if (false) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:196:7
-     if (clearFirebase) {
+     if (true) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:199:11
-         if (userPath) {
+         if (false) {
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] BlockStatement
src/util/dataCleanup.js:207:14
-         } else {
-           console.log('[DataCleanup] No user path, skipping Firebase reset');
-         }
+         } else {}
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] BlockStatement
src/util/dataCleanup.js:216:7
-     try {
-       if ('serviceWorker' in navigator) {
-         const registrations = await navigator.serviceWorker.getRegistrations();
-         await Promise.all(registrations.map(r => r.unregister()));
-         console.log('[DataCleanup] Service workers unregistered:', registrations.length);
-       }
-     } catch (e) {
+     try {} catch (e) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:217:9
-       if ('serviceWorker' in navigator) {
+       if (true) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:227:7
-     try {
-       if ('caches' in window) {
-         const cacheKeys = await caches.keys();
-         await Promise.all(cacheKeys.map(k => caches.delete(k)));
-         console.log('[DataCleanup] Cache API cleared:', cacheKeys.length, 'caches');
-       }
-     } catch (e) {
+     try {} catch (e) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:217:9
-       if ('serviceWorker' in navigator) {
+       if (false) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:228:9
-       if ('caches' in window) {
+       if (true) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:228:9
-       if ('caches' in window) {
+       if (false) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:238:7
-     try {
-       if (indexedDB && typeof indexedDB.databases === 'function') {
-         const dbs = await indexedDB.databases();
-         await Promise.all(dbs.map(db => new Promise((res) => {
-           const req = indexedDB.deleteDatabase(db.name);
-           req.onsuccess = res;
-           req.onerror = res;
-           req.onblocked = res;
-         })));
-         console.log('[DataCleanup] IndexedDB cleared:', dbs.length, 'databases');
-       }
-     } catch (e) {
+     try {} catch (e) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:239:9
-       if (indexedDB && typeof indexedDB.databases === 'function') {
+       if (true) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:239:9
-       if (indexedDB && typeof indexedDB.databases === 'function') {
+       if (false) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] LogicalOperator
src/util/dataCleanup.js:239:9
-       if (indexedDB && typeof indexedDB.databases === 'function') {
+       if (indexedDB || typeof indexedDB.databases === 'function') {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:249:15
-     } catch (e) {
-       console.warn('[DataCleanup] IndexedDB clear failed:', e.message);
-     }
+     } catch (e) {}
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:256:7
-     if (reload) {
+     if (true) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] BlockStatement
src/util/dataCleanup.js:256:15
-     if (reload) {
-       const base = window.location.href.split('?')[0];
-       setTimeout(() => {
-         window.location.href = base + '?nocache=' + Date.now();
-       }, 500);
-     }
+     if (reload) {}
Tests ran:
    Data Cleanup fullReset should clear everything

[Survived] ConditionalExpression
src/util/dataCleanup.js:256:7
-     if (reload) {
+     if (false) {
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ObjectLiteral
src/util/dataCleanup.js:263:10
-     return { cleared: 'all', firebase: clearFirebase };
+     return {};
Tests ran:
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware fullReset wipes CDL_KEYS (fresh history for clean coaching)
    DataCleanup — Firebase aware fullReset should remove user data and test keys
  and 3 more tests!

[Survived] ConditionalExpression
src/util/dataCleanup.js:390:5
-   if (typeof window !== 'undefined') {
+   if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/util/dataCleanup.js:390:5
-   if (typeof window !== 'undefined') {
+   if (false) {
Ran all tests for this mutant.

[Survived] EqualityOperator
src/util/dataCleanup.js:390:5
-   if (typeof window !== 'undefined') {
+   if (typeof window === 'undefined') {
Ran all tests for this mutant.

[Survived] BlockStatement
src/util/dataCleanup.js:390:36
-   if (typeof window !== 'undefined') {
-     window.resetTestData = resetTestData;
-     window.fullReset = fullReset;
-     window.inspectStorage = inspectStorage;
-     window.resetButKeepRealLogs = resetButKeepRealLogs;
-     window.createAutoBackup = createAutoBackup;
-     window.restoreFromBackup = restoreFromBackup;
-     window.restoreLastBackup = restoreLastBackup;
-     window.restoreRealLogs = restoreRealLogs;
-   }
+   if (typeof window !== 'undefined') {}
Ran all tests for this mutant.

[Survived] EqualityOperator
src/util/dataRegistry.js:58:19
-     for (let i = 0; i < localStorage.length; i++) {
+     for (let i = 0; i <= localStorage.length; i++) {
Tests ran:
    getAllDynamicKeys returns empty array when no dynamic keys are stored
    getAllDynamicKeys detects ex-extra-sets-* keys
    getAllDynamicKeys detects muscle-extra-* keys
  and 4 more tests!

[NoCoverage] BlockStatement
src/util/featureFlags.js:79:11
-     } catch {
-       return null;
-     }
+     } catch {}

[NoCoverage] BlockStatement
src/util/featureFlags.js:93:9
-     catch { return null; }
+     catch {}

[NoCoverage] ConditionalExpression
src/util/featureFlags.js:145:10
-     return flag.default === true;
+     return true;

[NoCoverage] ConditionalExpression
src/util/featureFlags.js:145:10
-     return flag.default === true;
+     return false;

[NoCoverage] EqualityOperator
src/util/featureFlags.js:145:10
-     return flag.default === true;
+     return flag.default !== true;

[NoCoverage] BooleanLiteral
src/util/featureFlags.js:145:27
-     return flag.default === true;
+     return flag.default === false;

[Survived] ArithmeticOperator
src/util/featureFlags.js:60:12
-       hash = ((hash << 5) + hash) + str.charCodeAt(i); // hash * 33 + c
+       hash = (hash << 5) + hash - str.charCodeAt(i); // hash * 33 + c
Tests ran:
    featureFlags — hashStringDjb2 returns deterministic hash for same input
    featureFlags — hashStringDjb2 returns different hashes for different inputs
    featureFlags — hashStringDjb2 returns 32-bit unsigned integer
  and 5 more tests!

[Survived] ArithmeticOperator
src/util/featureFlags.js:60:13
-       hash = ((hash << 5) + hash) + str.charCodeAt(i); // hash * 33 + c
+       hash = ((hash << 5) - hash) + str.charCodeAt(i); // hash * 33 + c
Tests ran:
    featureFlags — hashStringDjb2 returns deterministic hash for same input
    featureFlags — hashStringDjb2 returns different hashes for different inputs
    featureFlags — hashStringDjb2 returns 32-bit unsigned integer
  and 5 more tests!

[Survived] ConditionalExpression
src/util/featureFlags.js:94:7
-     if (!raw) return null;
+     if (false) return null;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 47 more tests!

[Survived] ConditionalExpression
src/util/featureFlags.js:135:7
-     if (typeof flag.rollout === 'number') {
+     if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 33 more tests!

[Survived] ConditionalExpression
src/util/featureFlags.js:136:9
-       if (flag.rollout <= 0) return false;
+       if (false) return false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 33 more tests!

[Survived] ConditionalExpression
src/util/featureFlags.js:137:9
-       if (flag.rollout >= 1) return true;
+       if (false) return true;
Tests ran:
    featureFlags — isEnabled, rollout 0 / 1 rollout 1 → always true (regardless of default)
    featureFlags — isEnabled, hash bucketing distribution rollout 0.5 distributes ~50/50 across 1000 random userIds
    featureFlags — isEnabled, hash bucketing distribution rollout 0.10 distributes ~10% across 1000 userIds
  and 5 more tests!

[Survived] EqualityOperator
src/util/featureFlags.js:136:9
-       if (flag.rollout <= 0) return false;
+       if (flag.rollout < 0) return false;
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 33 more tests!

[Survived] EqualityOperator
src/util/featureFlags.js:137:9
-       if (flag.rollout >= 1) return true;
+       if (flag.rollout > 1) return true;
Tests ran:
    featureFlags — isEnabled, rollout 0 / 1 rollout 1 → always true (regardless of default)
    featureFlags — isEnabled, hash bucketing distribution rollout 0.5 distributes ~50/50 across 1000 random userIds
    featureFlags — isEnabled, hash bucketing distribution rollout 0.10 distributes ~10% across 1000 userIds
  and 5 more tests!

[Survived] EqualityOperator
src/util/featureFlags.js:141:12
-       return bucket < flag.rollout * 100;
+       return bucket <= flag.rollout * 100;
Tests ran:
    featureFlags — isEnabled, hash bucketing distribution rollout 0.5 distributes ~50/50 across 1000 random userIds
    featureFlags — isEnabled, hash bucketing distribution rollout 0.10 distributes ~10% across 1000 userIds
    featureFlags — isEnabled, hash bucketing distribution same userId + flagId yields deterministic result across calls
  and 2 more tests!

[Survived] ConditionalExpression
src/util/isoWeek.js:11:24
-     if (date === null || date === undefined) throw new Error(`isoWeek: invalid date input: ${date}`);
+     if (date === null || false) throw new Error(`isoWeek: invalid date input: ${date}`);
Tests ran:
    weeklyProgression groups logs by week and calculates avg1RM
    weeklyProgression is case-insensitive for exercise name matching
    detectStagnation returns 0 stagnation weeks for insufficient data
  and 16 more tests!
