[Survived] MethodExpression
src/util/logFilter.js:7:3
-     logs.filter(l => !l.baseline).forEach(l => {
+     logs.forEach(l => {
Tests ran:
    filterValidLogs — Bug 1 regression (number session key) preserves a session with >=2 sets when session key is a Number
    filterValidLogs — Bug 1 regression (number session key) removes a singleton session (1 set, no earlyStop)
    filterValidLogs — Bug 1 regression (number session key) preserves a singleton session that has earlyStop=true
  and 4 more tests!

[Survived] MethodExpression
src/util/logFilter.js:14:49
-         .filter(([, sets]) => sets.length >= 2 || sets.some(l => l.earlyStop))
+         .filter(([, sets]) => sets.length >= 2 || sets.every(l => l.earlyStop))
Tests ran:
    filterValidLogs — Bug 1 regression (number session key) removes a singleton session (1 set, no earlyStop)
    filterValidLogs — Bug 1 regression (number session key) preserves a singleton session that has earlyStop=true
    filterValidLogs — Bug 1 regression (number session key) preserves baseline logs unconditionally

[NoCoverage] BlockStatement
src/util/logsMigration.js:46:39
-         if (entry.date !== correctDate) {
-           cdlModified++;
-           return { ...entry, date: correctDate };
-         }
+         if (entry.date !== correctDate) {}

[NoCoverage] UpdateOperator
src/util/logsMigration.js:47:9
-           cdlModified++;
+           cdlModified--;

[NoCoverage] ObjectLiteral
src/util/logsMigration.js:48:16
-           return { ...entry, date: correctDate };
+           return {};

[Survived] BlockStatement
src/util/logsMigration.js:22:42
-       const migratedLogs = logs.map(log => {
-         if (!log.ts) return log;
-         const correctDate = todTs(log.ts);
-         if (log.date !== correctDate) {
-           modified++;
-           return { ...log, date: correctDate };
-         }
-         return log;
-       });
+       const migratedLogs = logs.map(log => {});
Tests ran:
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
    migrateLogsUtcToLocal logs already with correct date are not modified (modified count = 0)
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] BooleanLiteral
src/util/logsMigration.js:23:11
-         if (!log.ts) return log;
+         if (log.ts) return log;
Tests ran:
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
    migrateLogsUtcToLocal logs already with correct date are not modified (modified count = 0)
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] ConditionalExpression
src/util/logsMigration.js:23:11
-         if (!log.ts) return log;
+         if (true) return log;
Tests ran:
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
    migrateLogsUtcToLocal logs already with correct date are not modified (modified count = 0)
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] ConditionalExpression
src/util/logsMigration.js:23:11
-         if (!log.ts) return log;
+         if (false) return log;
Tests ran:
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
    migrateLogsUtcToLocal logs already with correct date are not modified (modified count = 0)
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] ConditionalExpression
src/util/logsMigration.js:25:11
-         if (log.date !== correctDate) {
+         if (false) {
Tests ran:
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
    migrateLogsUtcToLocal logs already with correct date are not modified (modified count = 0)
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] BlockStatement
src/util/logsMigration.js:25:37
-         if (log.date !== correctDate) {
-           modified++;
-           return { ...log, date: correctDate };
-         }
+         if (log.date !== correctDate) {}
Tests ran:
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] UpdateOperator
src/util/logsMigration.js:26:9
-           modified++;
+           modified--;
Tests ran:
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] ObjectLiteral
src/util/logsMigration.js:27:16
-           return { ...log, date: correctDate };
+           return {};
Tests ran:
    migrateLogsUtcToLocal creates backup keys in localStorage before migrating logs

[Survived] ConditionalExpression
src/util/logsMigration.js:39:7
-     if (cdl.length > 0) {
+     if (false) {
Tests ran:
    migrateLogsUtcToLocal runs once, sets migration flag, returns correct stats shape
    migrateLogsUtcToLocal handles empty logs and empty CDL — sets flag, returns zeros
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
  and 3 more tests!

[Survived] BlockStatement
src/util/logsMigration.js:39:23
-     if (cdl.length > 0) {
-       cdlBackupKey = `cdl-backup-pre-utc-migration-${Date.now()}`;
-       localStorage.setItem(cdlBackupKey, JSON.stringify(cdl));
-       const migratedCdl = cdl.map(entry => {
-         if (!entry.ts) return entry;
-         const correctDate = todTs(entry.ts);
-         if (entry.date !== correctDate) {
-           cdlModified++;
-           return { ...entry, date: correctDate };
-         }
-         return entry;
-       });
-       DB.set('coach-decisions', migratedCdl);
-     }
+     if (cdl.length > 0) {}
Tests ran:
    migrateLogsUtcToLocal also migrates CDL entries alongside logs

[Survived] BlockStatement
src/util/logsMigration.js:43:42
-       const migratedCdl = cdl.map(entry => {
-         if (!entry.ts) return entry;
-         const correctDate = todTs(entry.ts);
-         if (entry.date !== correctDate) {
-           cdlModified++;
-           return { ...entry, date: correctDate };
-         }
-         return entry;
-       });
+       const migratedCdl = cdl.map(entry => {});
Tests ran:
    migrateLogsUtcToLocal also migrates CDL entries alongside logs

[Survived] BooleanLiteral
src/util/logsMigration.js:44:11
-         if (!entry.ts) return entry;
+         if (entry.ts) return entry;
Tests ran:
    migrateLogsUtcToLocal also migrates CDL entries alongside logs

[Survived] ConditionalExpression
src/util/logsMigration.js:44:11
-         if (!entry.ts) return entry;
+         if (true) return entry;
Tests ran:
    migrateLogsUtcToLocal also migrates CDL entries alongside logs

[Survived] ConditionalExpression
src/util/logsMigration.js:44:11
-         if (!entry.ts) return entry;
+         if (false) return entry;
Tests ran:
    migrateLogsUtcToLocal also migrates CDL entries alongside logs

[Survived] ConditionalExpression
src/util/logsMigration.js:46:11
-         if (entry.date !== correctDate) {
+         if (false) {
Tests ran:
    migrateLogsUtcToLocal also migrates CDL entries alongside logs

[Survived] ObjectLiteral
src/util/logsMigration.js:57:40
-     console.log('[Migration UTC→Local]', {
-       logsModified: modified,
-       cdlModified,
-       totalLogs: logs.length,
-       totalCdl: cdl.length,
-       backupKey,
-       cdlBackupKey
-     });
+     console.log('[Migration UTC→Local]', {});
Tests ran:
    migrateLogsUtcToLocal runs once, sets migration flag, returns correct stats shape
    migrateLogsUtcToLocal handles empty logs and empty CDL — sets flag, returns zeros
    migrateLogsUtcToLocal migrates log with mismatched UTC date to local date
  and 3 more tests!

[NoCoverage] ConditionalExpression
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
-       && !hostname.includes('127.0.0.1')
-       && import.meta.env?.MODE !== 'test';
+     const isProduction = true;

[NoCoverage] ConditionalExpression
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
-       && !hostname.includes('127.0.0.1')
-       && import.meta.env?.MODE !== 'test';
+     const isProduction = false;

[NoCoverage] LogicalOperator
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
-       && !hostname.includes('127.0.0.1')
-       && import.meta.env?.MODE !== 'test';
+     const isProduction = hostname !== 'localhost' && !hostname.includes('127.0.0.1') || import.meta.env?.MODE !== 'test';

[NoCoverage] ConditionalExpression
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
-       && !hostname.includes('127.0.0.1')
+     const isProduction = true

[NoCoverage] LogicalOperator
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
-       && !hostname.includes('127.0.0.1')
+     const isProduction = hostname !== 'localhost' || !hostname.includes('127.0.0.1')

[NoCoverage] ConditionalExpression
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
+     const isProduction = true

[NoCoverage] EqualityOperator
src/util/sentry.js:11:24
-     const isProduction = hostname !== 'localhost'
+     const isProduction = hostname === 'localhost'

[NoCoverage] BooleanLiteral
src/util/sentry.js:12:8
-       && !hostname.includes('127.0.0.1')
+       && hostname.includes('127.0.0.1')

[NoCoverage] ConditionalExpression
src/util/sentry.js:13:8
-       && import.meta.env?.MODE !== 'test';
+       && true;

[NoCoverage] EqualityOperator
src/util/sentry.js:13:8
-       && import.meta.env?.MODE !== 'test';
+       && import.meta.env?.MODE === 'test';

[NoCoverage] OptionalChaining
src/util/sentry.js:13:8
-       && import.meta.env?.MODE !== 'test';
+       && import.meta.env.MODE !== 'test';

[NoCoverage] BooleanLiteral
src/util/sentry.js:15:7
-     if (!isProduction) {
+     if (isProduction) {

[NoCoverage] ConditionalExpression
src/util/sentry.js:15:7
-     if (!isProduction) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/util/sentry.js:15:7
-     if (!isProduction) {
+     if (false) {

[NoCoverage] BlockStatement
src/util/sentry.js:15:22
-     if (!isProduction) {
-       console.log('[Sentry] Skipped — not production (hostname:', hostname, ')');
-       return;
-     }
+     if (!isProduction) {}

[NoCoverage] ConditionalExpression
src/util/sentry.js:19:7
-     if (_initialized) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/util/sentry.js:19:7
-     if (_initialized) return;
+     if (false) return;

[NoCoverage] ObjectLiteral
src/util/sentry.js:23:18
-       _Sentry.init({
-         dsn: SENTRY_DSN,
-         environment: 'production',
-         release: `andura@${import.meta.env?.VITE_APP_VERSION ?? '2.0.0'}`,
-         tracesSampleRate: 0.1,
-         beforeSend(event) {
-           const msg = event.exception?.values?.[0]?.value ?? '';
-           // Log every event before filtering so we can debug
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
-           if (msg.includes('ResizeObserver loop')) return null;
-           if (msg.includes('Non-Error promise rejection')) return null;
-           if (msg.includes('Script error.')) return null;
-           if (msg.includes('NetworkError') || msg.includes('Failed to fetch')) return null;
-           if (msg.includes('Firebase') || msg.includes('firebasedatabase')) return null;
-           return event;
-         },
-       });
+       _Sentry.init({});

[NoCoverage] LogicalOperator
src/util/sentry.js:26:26
-         release: `andura@${import.meta.env?.VITE_APP_VERSION ?? '2.0.0'}`,
+         release: `andura@${import.meta.env?.VITE_APP_VERSION && '2.0.0'}`,

[NoCoverage] OptionalChaining
src/util/sentry.js:26:26
-         release: `andura@${import.meta.env?.VITE_APP_VERSION ?? '2.0.0'}`,
+         release: `andura@${import.meta.env.VITE_APP_VERSION ?? '2.0.0'}`,

[NoCoverage] BlockStatement
src/util/sentry.js:28:25
-         beforeSend(event) {
-           const msg = event.exception?.values?.[0]?.value ?? '';
-           // Log every event before filtering so we can debug
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
-           if (msg.includes('ResizeObserver loop')) return null;
-           if (msg.includes('Non-Error promise rejection')) return null;
-           if (msg.includes('Script error.')) return null;
-           if (msg.includes('NetworkError') || msg.includes('Failed to fetch')) return null;
-           if (msg.includes('Firebase') || msg.includes('firebasedatabase')) return null;
-           return event;
-         },
+         beforeSend(event) {},

[NoCoverage] LogicalOperator
src/util/sentry.js:29:21
-           const msg = event.exception?.values?.[0]?.value ?? '';
+           const msg = event.exception?.values?.[0]?.value && '';

[NoCoverage] OptionalChaining
src/util/sentry.js:29:21
-           const msg = event.exception?.values?.[0]?.value ?? '';
+           const msg = event.exception?.values?.[0].value ?? '';

[NoCoverage] OptionalChaining
src/util/sentry.js:29:21
-           const msg = event.exception?.values?.[0]?.value ?? '';
+           const msg = event.exception?.values[0]?.value ?? '';

[NoCoverage] OptionalChaining
src/util/sentry.js:29:21
-           const msg = event.exception?.values?.[0]?.value ?? '';
+           const msg = event.exception.values?.[0]?.value ?? '';

[NoCoverage] ConditionalExpression
src/util/sentry.js:31:45
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
+           console.log('[Sentry] beforeSend:', true);

[NoCoverage] ConditionalExpression
src/util/sentry.js:31:45
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
+           console.log('[Sentry] beforeSend:', false);

[NoCoverage] LogicalOperator
src/util/sentry.js:31:45
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
+           console.log('[Sentry] beforeSend:', (msg || event.message) && '(no message)');

[NoCoverage] ConditionalExpression
src/util/sentry.js:31:45
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
+           console.log('[Sentry] beforeSend:', false || '(no message)');

[NoCoverage] LogicalOperator
src/util/sentry.js:31:45
-           console.log('[Sentry] beforeSend:', msg || event.message || '(no message)');
+           console.log('[Sentry] beforeSend:', msg && event.message || '(no message)');

[NoCoverage] ConditionalExpression
src/util/sentry.js:32:13
-           if (msg.includes('ResizeObserver loop')) return null;
+           if (true) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:32:13
-           if (msg.includes('ResizeObserver loop')) return null;
+           if (false) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:33:13
-           if (msg.includes('Non-Error promise rejection')) return null;
+           if (true) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:33:13
-           if (msg.includes('Non-Error promise rejection')) return null;
+           if (false) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:34:13
-           if (msg.includes('Script error.')) return null;
+           if (true) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:34:13
-           if (msg.includes('Script error.')) return null;
+           if (false) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:35:13
-           if (msg.includes('NetworkError') || msg.includes('Failed to fetch')) return null;
+           if (true) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:35:13
-           if (msg.includes('NetworkError') || msg.includes('Failed to fetch')) return null;
+           if (false) return null;

[NoCoverage] LogicalOperator
src/util/sentry.js:35:13
-           if (msg.includes('NetworkError') || msg.includes('Failed to fetch')) return null;
+           if (msg.includes('NetworkError') && msg.includes('Failed to fetch')) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:36:13
-           if (msg.includes('Firebase') || msg.includes('firebasedatabase')) return null;
+           if (true) return null;

[NoCoverage] ConditionalExpression
src/util/sentry.js:36:13
-           if (msg.includes('Firebase') || msg.includes('firebasedatabase')) return null;
+           if (false) return null;

[NoCoverage] LogicalOperator
src/util/sentry.js:36:13
-           if (msg.includes('Firebase') || msg.includes('firebasedatabase')) return null;
+           if (msg.includes('Firebase') && msg.includes('firebasedatabase')) return null;

[NoCoverage] BooleanLiteral
src/util/sentry.js:40:20
-       _initialized = true;
+       _initialized = false;

[NoCoverage] BlockStatement
src/util/sentry.js:47:70
-       window.testSentry = (msg = 'Manual test from Andura console') => {
-         if (!_initialized) { console.warn('[Sentry] Not initialized'); return; }
-         _Sentry.captureMessage(msg, 'info');
-         console.log('[Sentry] testSentry() sent:', msg);
-       };
+       window.testSentry = (msg = 'Manual test from Andura console') => {};

[NoCoverage] BooleanLiteral
src/util/sentry.js:48:11
-         if (!_initialized) { console.warn('[Sentry] Not initialized'); return; }
+         if (_initialized) { console.warn('[Sentry] Not initialized'); return; }

[NoCoverage] ConditionalExpression
src/util/sentry.js:48:11
-         if (!_initialized) { console.warn('[Sentry] Not initialized'); return; }
+         if (true) { console.warn('[Sentry] Not initialized'); return; }

[NoCoverage] ConditionalExpression
src/util/sentry.js:48:11
-         if (!_initialized) { console.warn('[Sentry] Not initialized'); return; }
+         if (false) { console.warn('[Sentry] Not initialized'); return; }

[NoCoverage] BlockStatement
src/util/sentry.js:48:26
-         if (!_initialized) { console.warn('[Sentry] Not initialized'); return; }
+         if (!_initialized) {}

[NoCoverage] BlockStatement
src/util/sentry.js:52:15
-     } catch (e) {
-       console.warn('[Sentry] Init failed:', e.message);
-     }
+     } catch (e) {}

[NoCoverage] BlockStatement
src/util/sentry.js:60:55
-   export function captureException(error, context = {}) {
-     if (!_initialized || !_Sentry) return;
-     _Sentry.withScope(scope => {
-       if (context.tags && typeof context.tags === 'object') {
-         for (const [k, v] of Object.entries(context.tags)) scope.setTag(k, String(v));
-       }
-       if (context.extra && typeof context.extra === 'object') {
-         for (const [k, v] of Object.entries(context.extra)) scope.setExtra(k, v);
-       }
-       for (const [k, v] of Object.entries(context)) {
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
-       }
-       _Sentry.captureException(error);
-     });
-   }
+   export function captureException(error, context = {}) {}

[NoCoverage] ConditionalExpression
src/util/sentry.js:61:7
-     if (!_initialized || !_Sentry) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/util/sentry.js:61:7
-     if (!_initialized || !_Sentry) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/util/sentry.js:61:7
-     if (!_initialized || !_Sentry) return;
+     if (!_initialized && !_Sentry) return;

[NoCoverage] BooleanLiteral
src/util/sentry.js:61:7
-     if (!_initialized || !_Sentry) return;
+     if (_initialized || !_Sentry) return;

[NoCoverage] BooleanLiteral
src/util/sentry.js:61:24
-     if (!_initialized || !_Sentry) return;
+     if (!_initialized || _Sentry) return;

[NoCoverage] BlockStatement
src/util/sentry.js:62:30
-     _Sentry.withScope(scope => {
-       if (context.tags && typeof context.tags === 'object') {
-         for (const [k, v] of Object.entries(context.tags)) scope.setTag(k, String(v));
-       }
-       if (context.extra && typeof context.extra === 'object') {
-         for (const [k, v] of Object.entries(context.extra)) scope.setExtra(k, v);
-       }
-       for (const [k, v] of Object.entries(context)) {
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
-       }
-       _Sentry.captureException(error);
-     });
+     _Sentry.withScope(scope => {});

[NoCoverage] ConditionalExpression
src/util/sentry.js:63:9
-       if (context.tags && typeof context.tags === 'object') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/util/sentry.js:63:9
-       if (context.tags && typeof context.tags === 'object') {
+       if (false) {

[NoCoverage] LogicalOperator
src/util/sentry.js:63:9
-       if (context.tags && typeof context.tags === 'object') {
+       if (context.tags || typeof context.tags === 'object') {

[NoCoverage] ConditionalExpression
src/util/sentry.js:63:25
-       if (context.tags && typeof context.tags === 'object') {
+       if (context.tags && true) {

[NoCoverage] EqualityOperator
src/util/sentry.js:63:25
-       if (context.tags && typeof context.tags === 'object') {
+       if (context.tags && typeof context.tags !== 'object') {

[NoCoverage] BlockStatement
src/util/sentry.js:63:59
-       if (context.tags && typeof context.tags === 'object') {
-         for (const [k, v] of Object.entries(context.tags)) scope.setTag(k, String(v));
-       }
+       if (context.tags && typeof context.tags === 'object') {}

[NoCoverage] ConditionalExpression
src/util/sentry.js:66:9
-       if (context.extra && typeof context.extra === 'object') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/util/sentry.js:66:9
-       if (context.extra && typeof context.extra === 'object') {
+       if (false) {

[NoCoverage] LogicalOperator
src/util/sentry.js:66:9
-       if (context.extra && typeof context.extra === 'object') {
+       if (context.extra || typeof context.extra === 'object') {

[NoCoverage] ConditionalExpression
src/util/sentry.js:66:26
-       if (context.extra && typeof context.extra === 'object') {
+       if (context.extra && true) {

[NoCoverage] EqualityOperator
src/util/sentry.js:66:26
-       if (context.extra && typeof context.extra === 'object') {
+       if (context.extra && typeof context.extra !== 'object') {

[NoCoverage] BlockStatement
src/util/sentry.js:66:61
-       if (context.extra && typeof context.extra === 'object') {
-         for (const [k, v] of Object.entries(context.extra)) scope.setExtra(k, v);
-       }
+       if (context.extra && typeof context.extra === 'object') {}

[NoCoverage] BlockStatement
src/util/sentry.js:69:51
-       for (const [k, v] of Object.entries(context)) {
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
-       }
+       for (const [k, v] of Object.entries(context)) {}

[NoCoverage] ConditionalExpression
src/util/sentry.js:70:11
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (true) scope.setExtra(k, v);

[NoCoverage] ConditionalExpression
src/util/sentry.js:70:11
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (false) scope.setExtra(k, v);

[NoCoverage] LogicalOperator
src/util/sentry.js:70:11
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (k !== 'tags' || k !== 'extra') scope.setExtra(k, v);

[NoCoverage] ConditionalExpression
src/util/sentry.js:70:11
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (true && k !== 'extra') scope.setExtra(k, v);

[NoCoverage] EqualityOperator
src/util/sentry.js:70:11
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (k === 'tags' && k !== 'extra') scope.setExtra(k, v);

[NoCoverage] ConditionalExpression
src/util/sentry.js:70:27
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (k !== 'tags' && true) scope.setExtra(k, v);

[NoCoverage] EqualityOperator
src/util/sentry.js:70:27
-         if (k !== 'tags' && k !== 'extra') scope.setExtra(k, v);
+         if (k !== 'tags' && k === 'extra') scope.setExtra(k, v);

[Survived] BooleanLiteral
src/util/sentry.js:6:20
-   let _initialized = false;
+   let _initialized = true;
Ran all tests for this mutant.

[NoCoverage] ObjectLiteral
src/util/telemetry.js:108:12
-       return { ok: true };
+       return {};

[NoCoverage] BooleanLiteral
src/util/telemetry.js:108:18
-       return { ok: true };
+       return { ok: false };

[NoCoverage] BlockStatement
src/util/telemetry.js:109:17
-     } catch (err) {
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}:`, err);
-       return { ok: false, error: err?.message || 'network_error' };
-     }
+     } catch (err) {}

[NoCoverage] ConditionalExpression
src/util/telemetry.js:110:9
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}:`, err);
+       if (true) console.warn(`[telemetry] Failed to track ${eventName}:`, err);

[NoCoverage] ConditionalExpression
src/util/telemetry.js:110:9
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}:`, err);
+       if (false) console.warn(`[telemetry] Failed to track ${eventName}:`, err);

[NoCoverage] EqualityOperator
src/util/telemetry.js:110:9
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}:`, err);
+       if (typeof console === 'undefined') console.warn(`[telemetry] Failed to track ${eventName}:`, err);

[NoCoverage] ObjectLiteral
src/util/telemetry.js:111:12
-       return { ok: false, error: err?.message || 'network_error' };
+       return {};

[NoCoverage] BooleanLiteral
src/util/telemetry.js:111:18
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: true, error: err?.message || 'network_error' };

[NoCoverage] ConditionalExpression
src/util/telemetry.js:111:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/util/telemetry.js:111:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/util/telemetry.js:111:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err?.message && 'network_error' };

[NoCoverage] OptionalChaining
src/util/telemetry.js:111:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err.message || 'network_error' };

[Survived] ConditionalExpression
src/util/telemetry.js:77:16
-     fetchImpl = (typeof fetch !== 'undefined' ? fetch : null),
+     fetchImpl = (true ? fetch : null),
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) unknown event returns ok=false NU throws

[Survived] ConditionalExpression
src/util/telemetry.js:77:16
-     fetchImpl = (typeof fetch !== 'undefined' ? fetch : null),
+     fetchImpl = (false ? fetch : null),
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) unknown event returns ok=false NU throws

[Survived] EqualityOperator
src/util/telemetry.js:77:16
-     fetchImpl = (typeof fetch !== 'undefined' ? fetch : null),
+     fetchImpl = (typeof fetch === 'undefined' ? fetch : null),
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) unknown event returns ok=false NU throws

[Survived] ConditionalExpression
src/util/telemetry.js:80:9
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Unknown event: ${eventName}`);
+       if (true) console.warn(`[telemetry] Unknown event: ${eventName}`);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) unknown event returns ok=false NU throws

[Survived] ConditionalExpression
src/util/telemetry.js:80:9
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Unknown event: ${eventName}`);
+       if (false) console.warn(`[telemetry] Unknown event: ${eventName}`);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) unknown event returns ok=false NU throws

[Survived] EqualityOperator
src/util/telemetry.js:80:9
-       if (typeof console !== 'undefined') console.warn(`[telemetry] Unknown event: ${eventName}`);
+       if (typeof console === 'undefined') console.warn(`[telemetry] Unknown event: ${eventName}`);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) unknown event returns ok=false NU throws

[Survived] ConditionalExpression
src/util/telemetry.js:83:7
-     if (!fetchImpl) return { ok: false, error: 'no_fetch' };
+     if (false) return { ok: false, error: 'no_fetch' };
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) no fetch impl → returns ok=false
    trackEvent — silent fail (telemetry MUST NOT block app flow) network fail → returns ok=false NU throws
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] ArrowFunction
src/util/telemetry.js:86:46
-       const idToken = await getIdToken().catch(() => null);
+       const idToken = await getIdToken().catch(() => undefined);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) network fail → returns ok=false NU throws
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent
