[Survived] ObjectLiteral
src/util/telemetry.js:89:21
-       const payload = {
-         fields: {},
-         // Firestore REST API uses `writes[].transform.fieldTransforms` shape;
-         // standard PATCH path with updateMask.fieldPaths increments via
-         // dedicated commit endpoint — kept simple here cu fieldTransforms
-         // documented în payload helper. Server-side rules validate keys.
-       };
+       const payload = {};
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] ObjectLiteral
src/util/telemetry.js:96:36
-       const r = await fetchImpl(url, {
-         method: 'PATCH',
-         headers: {
-           'Content-Type': 'application/json',
-           'Authorization': `Bearer ${idToken}`,
-         },
-         body: JSON.stringify(payload),
-       });
+       const r = await fetchImpl(url, {});
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] ObjectLiteral
src/util/telemetry.js:98:16
-         headers: {
-           'Content-Type': 'application/json',
-           'Authorization': `Bearer ${idToken}`,
-         },
+         headers: {},
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] ConditionalExpression
src/util/telemetry.js:104:9
-       if (!r.ok) {
+       if (true) {
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] ConditionalExpression
src/util/telemetry.js:105:11
-         if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}: http_${r.status}`);
+         if (true) console.warn(`[telemetry] Failed to track ${eventName}: http_${r.status}`);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] ConditionalExpression
src/util/telemetry.js:105:11
-         if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}: http_${r.status}`);
+         if (false) console.warn(`[telemetry] Failed to track ${eventName}: http_${r.status}`);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[Survived] EqualityOperator
src/util/telemetry.js:105:11
-         if (typeof console !== 'undefined') console.warn(`[telemetry] Failed to track ${eventName}: http_${r.status}`);
+         if (typeof console === 'undefined') console.warn(`[telemetry] Failed to track ${eventName}: http_${r.status}`);
Tests ran:
    trackEvent — silent fail (telemetry MUST NOT block app flow) non-ok HTTP response → ok=false silent

[NoCoverage] ArrayDeclaration
src/util/tierStorage.js:41:29
-     for (const log of logs ?? []) {
+     for (const log of logs ?? ["Stryker was here"]) {

[NoCoverage] ArrayDeclaration
src/util/tierStorage.js:59:29
-     for (const log of logs ?? []) {
+     for (const log of logs ?? ["Stryker was here"]) {

[NoCoverage] ArrayDeclaration
src/util/tierStorage.js:88:29
-     for (const log of logs ?? []) {
+     for (const log of logs ?? ["Stryker was here"]) {

[NoCoverage] BlockStatement
src/util/tierStorage.js:124:33
-   export function saveTiers(logs) {
-     const { live, aggregate, archive } = classifyLogs(logs);
-     DB.set(TIER_KEYS.live, live);
-     DB.set(TIER_KEYS.aggregate, aggregateLogs(aggregate));
-     DB.set(TIER_KEYS.archive, archiveLogs(archive));
-   }
+   export function saveTiers(logs) {}

[NoCoverage] BlockStatement
src/util/tierStorage.js:135:31
-   export function getLiveLogs() {
-     return DB.get(TIER_KEYS.live) ?? [];
-   }
+   export function getLiveLogs() {}

[NoCoverage] LogicalOperator
src/util/tierStorage.js:136:10
-     return DB.get(TIER_KEYS.live) ?? [];
+     return DB.get(TIER_KEYS.live) && [];

[NoCoverage] ArrayDeclaration
src/util/tierStorage.js:136:36
-     return DB.get(TIER_KEYS.live) ?? [];
+     return DB.get(TIER_KEYS.live) ?? ["Stryker was here"];

[NoCoverage] BlockStatement
src/util/tierStorage.js:143:36
-   export function getAggregateData() {
-     return DB.get(TIER_KEYS.aggregate) ?? {};
-   }
+   export function getAggregateData() {}

[NoCoverage] LogicalOperator
src/util/tierStorage.js:144:10
-     return DB.get(TIER_KEYS.aggregate) ?? {};
+     return DB.get(TIER_KEYS.aggregate) && {};

[NoCoverage] BlockStatement
src/util/tierStorage.js:151:34
-   export function getArchiveData() {
-     return DB.get(TIER_KEYS.archive) ?? {};
-   }
+   export function getArchiveData() {}

[NoCoverage] LogicalOperator
src/util/tierStorage.js:152:10
-     return DB.get(TIER_KEYS.archive) ?? {};
+     return DB.get(TIER_KEYS.archive) && {};

[Survived] EqualityOperator
src/util/tierStorage.js:44:9
-       if (ts >= liveCutoff.getTime()) live.push(log);
+       if (ts > liveCutoff.getTime()) live.push(log);
Tests ran:
    classifyLogs places recent logs in live tier
    classifyLogs places 6-month-old logs in aggregate tier
    classifyLogs places 2-year-old logs in archive tier

[Survived] EqualityOperator
src/util/tierStorage.js:45:14
-       else if (ts >= aggregateCutoff.getTime()) aggregate.push(log);
+       else if (ts > aggregateCutoff.getTime()) aggregate.push(log);
Tests ran:
    classifyLogs places 6-month-old logs in aggregate tier
    classifyLogs places 2-year-old logs in archive tier

[Survived] ConditionalExpression
src/util/tierStorage.js:61:9
-       if (!ts) continue;
+       if (false) continue;
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] AssignmentOperator
src/util/tierStorage.js:65:5
-       byDay[day].totalWeight += Number(log.w ?? 0);
+       byDay[day].totalWeight -= Number(log.w ?? 0);
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] LogicalOperator
src/util/tierStorage.js:65:38
-       byDay[day].totalWeight += Number(log.w ?? 0);
+       byDay[day].totalWeight += Number(log.w && 0);
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] LogicalOperator
src/util/tierStorage.js:66:30
-       byDay[day].exercises.add(log.ex ?? '');
+       byDay[day].exercises.add(log.ex && '');
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] ConditionalExpression
src/util/tierStorage.js:72:18
-         avgWeight: data.sets > 0 ? Math.round(data.totalWeight / data.sets) : 0,
+         avgWeight: true ? Math.round(data.totalWeight / data.sets) : 0,
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] ConditionalExpression
src/util/tierStorage.js:72:18
-         avgWeight: data.sets > 0 ? Math.round(data.totalWeight / data.sets) : 0,
+         avgWeight: false ? Math.round(data.totalWeight / data.sets) : 0,
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] EqualityOperator
src/util/tierStorage.js:72:18
-         avgWeight: data.sets > 0 ? Math.round(data.totalWeight / data.sets) : 0,
+         avgWeight: data.sets >= 0 ? Math.round(data.totalWeight / data.sets) : 0,
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] EqualityOperator
src/util/tierStorage.js:72:18
-         avgWeight: data.sets > 0 ? Math.round(data.totalWeight / data.sets) : 0,
+         avgWeight: data.sets <= 0 ? Math.round(data.totalWeight / data.sets) : 0,
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] ArithmeticOperator
src/util/tierStorage.js:72:45
-         avgWeight: data.sets > 0 ? Math.round(data.totalWeight / data.sets) : 0,
+         avgWeight: data.sets > 0 ? Math.round(data.totalWeight * data.sets) : 0,
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] MethodExpression
src/util/tierStorage.js:73:18
-         exercises: [...data.exercises].filter(Boolean),
+         exercises: [...data.exercises],
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] ArrayDeclaration
src/util/tierStorage.js:73:18
-         exercises: [...data.exercises].filter(Boolean),
+         exercises: [].filter(Boolean),
Tests ran:
    aggregateLogs groups by day
    aggregateLogs counts sets per day

[Survived] ConditionalExpression
src/util/tierStorage.js:90:9
-       if (!ts) continue;
+       if (false) continue;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ArithmeticOperator
src/util/tierStorage.js:92:48
-       const month = `${d.getFullYear()}-${String(d.getMonth() + 1).padStart(2, '0')}`;
+       const month = `${d.getFullYear()}-${String(d.getMonth() - 1).padStart(2, '0')}`;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ConditionalExpression
src/util/tierStorage.js:95:9
-       if (!byMonth[month]) byMonth[month] = { totalSets: 0, exercises: {} };
+       if (true) byMonth[month] = { totalSets: 0, exercises: {} };
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ConditionalExpression
src/util/tierStorage.js:96:9
-       if (!sessionsByMonth[month]) sessionsByMonth[month] = new Set();
+       if (true) sessionsByMonth[month] = new Set();
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] UpdateOperator
src/util/tierStorage.js:98:5
-       byMonth[month].totalSets++;
+       byMonth[month].totalSets--;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] LogicalOperator
src/util/tierStorage.js:101:16
-       const ex = log.ex ?? '';
+       const ex = log.ex && '';
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ConditionalExpression
src/util/tierStorage.js:102:9
-       if (ex) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) + 1;
+       if (true) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) + 1;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ConditionalExpression
src/util/tierStorage.js:102:9
-       if (ex) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) + 1;
+       if (false) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) + 1;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ArithmeticOperator
src/util/tierStorage.js:102:44
-       if (ex) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) + 1;
+       if (ex) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) - 1;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] LogicalOperator
src/util/tierStorage.js:102:45
-       if (ex) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] ?? 0) + 1;
+       if (ex) byMonth[month].exercises[ex] = (byMonth[month].exercises[ex] && 0) + 1;
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] MethodExpression
src/util/tierStorage.js:107:26
-       const topExercises = Object.entries(data.exercises)
-         .sort((a, b) => b[1] - a[1])
-         .slice(0, 5)
+       const topExercises = Object.entries(data.exercises).sort((a, b) => b[1] - a[1])
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] MethodExpression
src/util/tierStorage.js:107:26
-       const topExercises = Object.entries(data.exercises)
-         .sort((a, b) => b[1] - a[1])
+       const topExercises = Object.entries(data.exercises)
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ArrowFunction
src/util/tierStorage.js:108:13
-         .sort((a, b) => b[1] - a[1])
+         .sort(() => undefined)
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ArithmeticOperator
src/util/tierStorage.js:108:23
-         .sort((a, b) => b[1] - a[1])
+         .sort((a, b) => b[1] + a[1])
Tests ran:
    archiveLogs counts sessions per month

[Survived] ArrowFunction
src/util/tierStorage.js:110:12
-         .map(([ex]) => ex);
+         .map(() => undefined);
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] OptionalChaining
src/util/tierStorage.js:112:17
-         sessions: sessionsByMonth[month]?.size ?? 0,
+         sessions: sessionsByMonth[month].size ?? 0,
Tests ran:
    archiveLogs groups by month
    archiveLogs counts sessions per month
    archiveLogs stores topExercises

[Survived] ObjectLiteral
src/util/tierStorage.js:8:19
-   const TIER_KEYS = {
-     live: 'tier-live',
-     aggregate: 'tier-aggregate',
-     archive: 'tier-archive',
-   };
+   const TIER_KEYS = {};
Ran all tests for this mutant.

[Survived] ArrowFunction
src/util/tierStorage.js:14:13
-   const NOW = () => new Date();
+   const NOW = () => undefined;
Ran all tests for this mutant.

[NoCoverage] BooleanLiteral
src/util/tombstones.js:103:31
-     if (entryId == null) return false;
+     if (entryId == null) return true;

[NoCoverage] BooleanLiteral
src/util/tombstones.js:106:22
-     if (!entry) return false;
+     if (!entry) return true;

[NoCoverage] BooleanLiteral
src/util/tombstones.js:126:45
-       if (!e || typeof e !== 'object') return true;
+       if (!e || typeof e !== 'object') return false;

[NoCoverage] ObjectLiteral
src/util/tombstones.js:146:18
-     if (!s) return { filtered: 0, keysTouched: [] };
+     if (!s) return {};

[NoCoverage] ArrayDeclaration
src/util/tombstones.js:146:46
-     if (!s) return { filtered: 0, keysTouched: [] };
+     if (!s) return { filtered: 0, keysTouched: ["Stryker was here"] };

[NoCoverage] BlockStatement
src/util/tombstones.js:158:13
-       } catch { return; }
+       } catch {}

[NoCoverage] BooleanLiteral
src/util/tombstones.js:185:18
-     if (!s) return false;
+     if (!s) return true;

[NoCoverage] BlockStatement
src/util/tombstones.js:198:11
-     } catch {
-       markTombstone(entryId, key, opts);
-       return true;
-     }
+     } catch {}

[NoCoverage] BooleanLiteral
src/util/tombstones.js:200:12
-       return true;
+       return false;

[NoCoverage] BlockStatement
src/util/tombstones.js:202:28
-     if (!Array.isArray(arr)) {
-       markTombstone(entryId, key, opts);
-       return true;
-     }
+     if (!Array.isArray(arr)) {}

[NoCoverage] BooleanLiteral
src/util/tombstones.js:204:12
-       return true;
+       return false;

[NoCoverage] ConditionalExpression
src/util/tombstones.js:210:48
-       const id = e?.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
+       const id = e?.ts != null ? String(e.ts) : (true ? String(e.id) : null);

[NoCoverage] ConditionalExpression
src/util/tombstones.js:210:48
-       const id = e?.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
+       const id = e?.ts != null ? String(e.ts) : (false ? String(e.id) : null);

[NoCoverage] EqualityOperator
src/util/tombstones.js:210:48
-       const id = e?.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
+       const id = e?.ts != null ? String(e.ts) : (e?.id == null ? String(e.id) : null);

[NoCoverage] OptionalChaining
src/util/tombstones.js:210:48
-       const id = e?.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
+       const id = e?.ts != null ? String(e.ts) : (e.id != null ? String(e.id) : null);

[NoCoverage] BlockStatement
src/util/tombstones.js:254:9
-     catch { return null; }
+     catch {}

[Survived] ConditionalExpression
src/util/tombstones.js:45:7
-     if (!s) return {};
+     if (false) return {};
Tests ran:
    tombstones — basic CRUD returns empty map when storage empty
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
  and 17 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:48:9
-       if (!raw) return {};
+       if (false) return {};
Tests ran:
    tombstones — basic CRUD returns empty map when storage empty
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
  and 17 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:50:13
-       return (parsed && typeof parsed === 'object') ? parsed : {};
+       return (true) ? parsed : {};
Tests ran:
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
    tombstones — basic CRUD isTombstoned respects retention window
  and 13 more tests!

[Survived] LogicalOperator
src/util/tombstones.js:50:13
-       return (parsed && typeof parsed === 'object') ? parsed : {};
+       return (parsed || typeof parsed === 'object') ? parsed : {};
Tests ran:
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
    tombstones — basic CRUD isTombstoned respects retention window
  and 13 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:50:23
-       return (parsed && typeof parsed === 'object') ? parsed : {};
+       return (parsed && true) ? parsed : {};
Tests ran:
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
    tombstones — basic CRUD isTombstoned respects retention window
  and 13 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:66:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
    tombstones — basic CRUD isTombstoned respects retention window
  and 13 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:86:7
-     if (!s) return;
+     if (false) return;
Tests ran:
    tombstones — basic CRUD removes tombstone

[Survived] ConditionalExpression
src/util/tombstones.js:87:7
-     if (entryId == null) return;
+     if (false) return;
Tests ran:
    tombstones — basic CRUD removes tombstone

[Survived] ConditionalExpression
src/util/tombstones.js:89:7
-     if (!(String(entryId) in map)) return;
+     if (false) return;
Tests ran:
    tombstones — basic CRUD removes tombstone

[Survived] ConditionalExpression
src/util/tombstones.js:103:7
-     if (entryId == null) return false;
+     if (false) return false;
Tests ran:
    tombstones — basic CRUD isTombstoned respects retention window

[Survived] ConditionalExpression
src/util/tombstones.js:106:7
-     if (!entry) return false;
+     if (false) return false;
Tests ran:
    tombstones — basic CRUD isTombstoned respects retention window

[Survived] ConditionalExpression
src/util/tombstones.js:107:13
-     const t = typeof now === 'number' ? now : Date.now();
+     const t = true ? now : Date.now();
Tests ran:
    tombstones — basic CRUD isTombstoned respects retention window

[Survived] EqualityOperator
src/util/tombstones.js:108:10
-     return (t - entry.deletedAt) <= TOMBSTONE_RETENTION_MS;
+     return t - entry.deletedAt < TOMBSTONE_RETENTION_MS;
Tests ran:
    tombstones — basic CRUD isTombstoned respects retention window

[Survived] ArithmeticOperator
src/util/tombstones.js:108:11
-     return (t - entry.deletedAt) <= TOMBSTONE_RETENTION_MS;
+     return (t + entry.deletedAt) <= TOMBSTONE_RETENTION_MS;
Tests ran:
    tombstones — basic CRUD isTombstoned respects retention window

[Survived] ConditionalExpression
src/util/tombstones.js:121:34
-     if (!Array.isArray(entries) || entries.length === 0) return entries || [];
+     if (!Array.isArray(entries) || false) return entries || [];
Tests ran:
    tombstones — array filter passes through empty arrays
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
  and 4 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:123:7
-     if (Object.keys(map).length === 0) return entries;
+     if (false) return entries;
Tests ran:
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
    tombstones — array filter skips entries without id or ts
  and 3 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:126:9
-       if (!e || typeof e !== 'object') return true;
+       if (false) return true;
Tests ran:
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
    tombstones — array filter skips entries without id or ts
  and 3 more tests!

[Survived] LogicalOperator
src/util/tombstones.js:126:9
-       if (!e || typeof e !== 'object') return true;
+       if (!e && typeof e !== 'object') return true;
Tests ran:
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
    tombstones — array filter skips entries without id or ts
  and 3 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:126:15
-       if (!e || typeof e !== 'object') return true;
+       if (!e || false) return true;
Tests ran:
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
    tombstones — array filter skips entries without id or ts
  and 3 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:127:47
-       const id = e.ts != null ? String(e.ts) : (e.id != null ? String(e.id) : null);
+       const id = e.ts != null ? String(e.ts) : (true ? String(e.id) : null);
Tests ran:
    tombstones — array filter filters by id when ts absent
    tombstones — array filter skips entries without id or ts

[Survived] ConditionalExpression
src/util/tombstones.js:128:9
-       if (!id) return true;
+       if (false) return true;
Tests ran:
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
    tombstones — array filter skips entries without id or ts
  and 3 more tests!

[Survived] EqualityOperator
src/util/tombstones.js:132:12
-       return (now - ts.deletedAt) > TOMBSTONE_RETENTION_MS;
+       return now - ts.deletedAt >= TOMBSTONE_RETENTION_MS;
Tests ran:
    tombstones — array filter filters by ts
    tombstones — array filter filters by id when ts absent
    tombstones — array filter expired tombstones do not block entries
  and 2 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:146:7
-     if (!s) return { filtered: 0, keysTouched: [] };
+     if (false) return { filtered: 0, keysTouched: [] };
Tests ran:
    tombstones — applyTombstoneFilterToAll rewrites every ts-indexed key
    tombstones — applyTombstoneFilterToAll no-op when no tombstones
    tombstones — applyTombstoneFilterToAll handles missing keys
  and 1 more test!

[Survived] ConditionalExpression
src/util/tombstones.js:148:7
-     if (Object.keys(map).length === 0) return { filtered: 0, keysTouched: [] };
+     if (false) return { filtered: 0, keysTouched: [] };
Tests ran:
    tombstones — applyTombstoneFilterToAll rewrites every ts-indexed key
    tombstones — applyTombstoneFilterToAll no-op when no tombstones
    tombstones — applyTombstoneFilterToAll handles missing keys
  and 1 more test!

[Survived] ArrayDeclaration
src/util/tombstones.js:151:23
-     const keysTouched = [];
+     const keysTouched = ["Stryker was here"];
Tests ran:
    tombstones — applyTombstoneFilterToAll rewrites every ts-indexed key
    tombstones — applyTombstoneFilterToAll handles missing keys
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] ArrayDeclaration
src/util/tombstones.js:148:73
-     if (Object.keys(map).length === 0) return { filtered: 0, keysTouched: [] };
+     if (Object.keys(map).length === 0) return { filtered: 0, keysTouched: ["Stryker was here"] };
Tests ran:
    tombstones — applyTombstoneFilterToAll no-op when no tombstones

[Survived] ConditionalExpression
src/util/tombstones.js:156:11
-         if (!raw) return;
+         if (false) return;
Tests ran:
    tombstones — applyTombstoneFilterToAll rewrites every ts-indexed key
    tombstones — applyTombstoneFilterToAll handles missing keys
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] ConditionalExpression
src/util/tombstones.js:159:9
-       if (!Array.isArray(arr)) return;
+       if (false) return;
Tests ran:
    tombstones — applyTombstoneFilterToAll rewrites every ts-indexed key
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] ConditionalExpression
src/util/tombstones.js:162:9
-       if (filtered.length !== before) {
+       if (true) {
Tests ran:
    tombstones — applyTombstoneFilterToAll rewrites every ts-indexed key
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] ConditionalExpression
src/util/tombstones.js:185:7
-     if (!s) return false;
+     if (false) return false;
Tests ran:
    tombstones — deleteEntry wrapper removes entry from logs and writes tombstone
    tombstones — deleteEntry wrapper still writes tombstone when entry not found
    tombstones — deleteEntry wrapper writes tombstone when key missing entirely
  and 2 more tests!

[Survived] ConditionalExpression
src/util/tombstones.js:191:9
-       if (!raw) {
+       if (false) {
Tests ran:
    tombstones — deleteEntry wrapper removes entry from logs and writes tombstone
    tombstones — deleteEntry wrapper still writes tombstone when entry not found
    tombstones — deleteEntry wrapper writes tombstone when key missing entirely
  and 1 more test!

[Survived] BlockStatement
src/util/tombstones.js:191:15
-       if (!raw) {
-         // Nothing to delete locally, but still mark the tombstone — Firebase
-         // pull may resurrect the entry, and we want to filter it.
-         markTombstone(entryId, key, opts);
-         return true;
-       }
+       if (!raw) {}
Tests ran:
    tombstones — deleteEntry wrapper writes tombstone when key missing entirely

[Survived] BooleanLiteral
src/util/tombstones.js:195:14
-         return true;
+         return false;
Tests ran:
    tombstones — deleteEntry wrapper writes tombstone when key missing entirely

[Survived] ConditionalExpression
src/util/tombstones.js:202:7
-     if (!Array.isArray(arr)) {
+     if (false) {
Tests ran:
    tombstones — deleteEntry wrapper removes entry from logs and writes tombstone
    tombstones — deleteEntry wrapper still writes tombstone when entry not found
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] ConditionalExpression
src/util/tombstones.js:210:16
-       const id = e?.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
+       const id = true ? String(e.ts) : (e?.id != null ? String(e.id) : null);
Tests ran:
    tombstones — deleteEntry wrapper removes entry from logs and writes tombstone
    tombstones — deleteEntry wrapper still writes tombstone when entry not found
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] OptionalChaining
src/util/tombstones.js:210:16
-       const id = e?.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
+       const id = e.ts != null ? String(e.ts) : (e?.id != null ? String(e.id) : null);
Tests ran:
    tombstones — deleteEntry wrapper removes entry from logs and writes tombstone
    tombstones — deleteEntry wrapper still writes tombstone when entry not found
    tombstones — Memory Paradox regression delete + Firebase resurrect → tombstone scrubs

[Survived] ConditionalExpression
src/util/tombstones.js:229:7
-     if (!s) return 0;
+     if (false) return 0;
Tests ran:
    tombstones — GC drops expired tombstones
    tombstones — GC drops malformed entries
    tombstones — GC returns 0 when nothing expired

[Survived] ConditionalExpression
src/util/tombstones.js:231:13
-     const t = typeof now === 'number' ? now : Date.now();
+     const t = false ? now : Date.now();
Tests ran:
    tombstones — GC drops expired tombstones
    tombstones — GC drops malformed entries
    tombstones — GC returns 0 when nothing expired

[Survived] EqualityOperator
src/util/tombstones.js:240:9
-       if ((t - entry.deletedAt) > TOMBSTONE_RETENTION_MS) {
+       if (t - entry.deletedAt >= TOMBSTONE_RETENTION_MS) {
Tests ran:
    tombstones — GC drops expired tombstones
    tombstones — GC returns 0 when nothing expired

[Survived] ConditionalExpression
src/util/tombstones.js:245:7
-     if (removed > 0) {
+     if (true) {
Tests ran:
    tombstones — GC drops expired tombstones
    tombstones — GC drops malformed entries
    tombstones — GC returns 0 when nothing expired

[Survived] EqualityOperator
src/util/tombstones.js:245:7
-     if (removed > 0) {
+     if (removed >= 0) {
Tests ran:
    tombstones — GC drops expired tombstones
    tombstones — GC drops malformed entries
    tombstones — GC returns 0 when nothing expired

[Survived] ConditionalExpression
src/util/tombstones.js:252:7
-     if (override) return override;
+     if (false) return override;
Tests ran:
    tombstones — basic CRUD returns empty map when storage empty
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
  and 18 more tests!
