[Survived] ConditionalExpression
src/util/tombstones.js:253:16
-     try { return typeof localStorage !== 'undefined' ? localStorage : null; }
+     try { return true ? localStorage : null; }
Tests ran:
    tombstones — basic CRUD returns empty map when storage empty
    tombstones — basic CRUD marks + reads tombstone
    tombstones — basic CRUD removes tombstone
  and 18 more tests!

[Survived] ArithmeticOperator
src/util/tombstones.js:28:39
-   export const TOMBSTONE_RETENTION_MS = 90 * 24 * 60 * 60 * 1000; // 90 days
+   export const TOMBSTONE_RETENTION_MS = 90 * 24 * 60 * 60 / 1000; // 90 days
Ran all tests for this mutant.

[Survived] ArithmeticOperator
src/util/tombstones.js:28:39
-   export const TOMBSTONE_RETENTION_MS = 90 * 24 * 60 * 60 * 1000; // 90 days
+   export const TOMBSTONE_RETENTION_MS = 90 * 24 / 60 * 60 * 1000; // 90 days
Ran all tests for this mutant.

[Survived] ArithmeticOperator
src/util/tombstones.js:28:39
-   export const TOMBSTONE_RETENTION_MS = 90 * 24 * 60 * 60 * 1000; // 90 days
+   export const TOMBSTONE_RETENTION_MS = 90 * 24 * 60 / 60 * 1000; // 90 days
Ran all tests for this mutant.

[Survived] ArithmeticOperator
src/util/tombstones.js:28:39
-   export const TOMBSTONE_RETENTION_MS = 90 * 24 * 60 * 60 * 1000; // 90 days
+   export const TOMBSTONE_RETENTION_MS = 90 / 24 * 60 * 60 * 1000; // 90 days
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/util/tombstones.js:257:5
-   if (typeof window !== 'undefined') {
+   if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/util/tombstones.js:257:5
-   if (typeof window !== 'undefined') {
+   if (false) {
Ran all tests for this mutant.

[Survived] EqualityOperator
src/util/tombstones.js:257:5
-   if (typeof window !== 'undefined') {
+   if (typeof window === 'undefined') {
Ran all tests for this mutant.

[Survived] BlockStatement
src/util/tombstones.js:257:36
-   if (typeof window !== 'undefined') {
-     window.gcTombstones = gcTombstones;
-   }
+   if (typeof window !== 'undefined') {}
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/validation/matchMetric.js:57:7
-     if (sa.size === 0 && sb.size === 0) return 1;
+     if (false) return 1;
Tests ran:
    jaccard identical sets → 1
    jaccard disjoint → 0
    jaccard partial overlap
  and 11 more tests!

[Survived] LogicalOperator
src/validation/matchMetric.js:57:7
-     if (sa.size === 0 && sb.size === 0) return 1;
+     if (sa.size === 0 || sb.size === 0) return 1;
Tests ran:
    jaccard identical sets → 1
    jaccard disjoint → 0
    jaccard partial overlap
  and 11 more tests!

[Survived] ConditionalExpression
src/validation/matchMetric.js:57:7
-     if (sa.size === 0 && sb.size === 0) return 1;
+     if (true && sb.size === 0) return 1;
Tests ran:
    jaccard identical sets → 1
    jaccard disjoint → 0
    jaccard partial overlap
  and 11 more tests!

[Survived] EqualityOperator
src/validation/matchMetric.js:57:7
-     if (sa.size === 0 && sb.size === 0) return 1;
+     if (sa.size !== 0 && sb.size === 0) return 1;
Tests ran:
    jaccard identical sets → 1
    jaccard disjoint → 0
    jaccard partial overlap
  and 11 more tests!

[Survived] ConditionalExpression
src/validation/matchMetric.js:57:24
-     if (sa.size === 0 && sb.size === 0) return 1;
+     if (sa.size === 0 && true) return 1;
Tests ran:
    jaccard both empty → 1 (degenerate match)

[Survived] EqualityOperator
src/validation/matchMetric.js:57:24
-     if (sa.size === 0 && sb.size === 0) return 1;
+     if (sa.size === 0 && sb.size !== 0) return 1;
Tests ran:
    jaccard both empty → 1 (degenerate match)

[Survived] ConditionalExpression
src/validation/matchMetric.js:61:10
-     return union === 0 ? 1 : intersection / union;
+     return false ? 1 : intersection / union;
Tests ran:
    jaccard identical sets → 1
    jaccard disjoint → 0
    jaccard partial overlap
  and 10 more tests!

[Survived] EqualityOperator
src/validation/matchMetric.js:73:7
-     if (j >= 0.70) return 1.0;
+     if (j > 0.70) return 1.0;
Tests ran:
    scoreExerciseOverlap identical → 1.0 (Jaccard 1.0 ≥0.70)
    scoreExerciseOverlap Jaccard ≥0.70 → 1.0
    scoreExerciseOverlap Jaccard <0.50 → 0
  and 5 more tests!

[Survived] EqualityOperator
src/validation/matchMetric.js:74:7
-     if (j >= 0.50) return (j - 0.50) / 0.20; // linear ramp 0..1 in [0.50, 0.70]
+     if (j > 0.50) return (j - 0.50) / 0.20; // linear ramp 0..1 in [0.50, 0.70]
Tests ran:
    scoreExerciseOverlap Jaccard <0.50 → 0
    scoreExerciseOverlap Jaccard 0.50 → 0 (boundary, linear ramp begins)
    scoreExerciseOverlap Jaccard 0.60 → ~0.5 partial credit
  and 1 more test!

[Survived] ConditionalExpression
src/validation/matchMetric.js:96:22
-       const setsBand = Math.abs(a.sets - c.sets) <= Math.max(1, Math.ceil(c.sets * 0.20));
+       const setsBand = true;
Tests ran:
    scoreSetsRepsRir exact match → 1.0
    scoreSetsRepsRir within band ±20% sets / ±2 reps / ±1 RIR → 1.0
    scoreSetsRepsRir reps over ±2 → fail
  and 4 more tests!

[Survived] MethodExpression
src/validation/matchMetric.js:96:51
-       const setsBand = Math.abs(a.sets - c.sets) <= Math.max(1, Math.ceil(c.sets * 0.20));
+       const setsBand = Math.abs(a.sets - c.sets) <= Math.min(1, Math.ceil(c.sets * 0.20));
Tests ran:
    scoreSetsRepsRir exact match → 1.0
    scoreSetsRepsRir within band ±20% sets / ±2 reps / ±1 RIR → 1.0
    scoreSetsRepsRir reps over ±2 → fail
  and 4 more tests!

[Survived] ArithmeticOperator
src/validation/matchMetric.js:96:73
-       const setsBand = Math.abs(a.sets - c.sets) <= Math.max(1, Math.ceil(c.sets * 0.20));
+       const setsBand = Math.abs(a.sets - c.sets) <= Math.max(1, Math.ceil(c.sets / 0.20));
Tests ran:
    scoreSetsRepsRir exact match → 1.0
    scoreSetsRepsRir within band ±20% sets / ±2 reps / ±1 RIR → 1.0
    scoreSetsRepsRir reps over ±2 → fail
  and 4 more tests!

[Survived] ArithmeticOperator
src/validation/matchMetric.js:181:7
-       + WEIGHTS.setsRepsRir * dimensions.setsRepsRir
+       + WEIGHTS.setsRepsRir / dimensions.setsRepsRir
Tests ran:
    computeMatchScore — universal Safety 0.35 dominant perfect match → score 1.0, verdict MATCH, flagged_uncertain false
    computeMatchScore — universal Safety 0.35 dominant safety mismatch dominates score (Maria 65 senerio — Andura skips safety flag)
    computeMatchScore — universal Safety 0.35 dominant partial Exercise + perfect Safety → PARTIAL verdict

[Survived] ArithmeticOperator
src/validation/matchMetric.js:182:7
-       + WEIGHTS.keyPrinciples * dimensions.keyPrinciples;
+       + WEIGHTS.keyPrinciples / dimensions.keyPrinciples;
Tests ran:
    computeMatchScore — universal Safety 0.35 dominant perfect match → score 1.0, verdict MATCH, flagged_uncertain false
    computeMatchScore — universal Safety 0.35 dominant safety mismatch dominates score (Maria 65 senerio — Andura skips safety flag)
    computeMatchScore — universal Safety 0.35 dominant partial Exercise + perfect Safety → PARTIAL verdict

[Survived] EqualityOperator
src/validation/matchMetric.js:186:7
-     if (score >= VERDICT_THRESHOLDS.MATCH) verdict = 'MATCH';
+     if (score > VERDICT_THRESHOLDS.MATCH) verdict = 'MATCH';
Tests ran:
    computeMatchScore — universal Safety 0.35 dominant perfect match → score 1.0, verdict MATCH, flagged_uncertain false
    computeMatchScore — universal Safety 0.35 dominant safety mismatch dominates score (Maria 65 senerio — Andura skips safety flag)
    computeMatchScore — universal Safety 0.35 dominant partial Exercise + perfect Safety → PARTIAL verdict

[Survived] EqualityOperator
src/validation/matchMetric.js:187:12
-     else if (score >= VERDICT_THRESHOLDS.PARTIAL) verdict = 'PARTIAL';
+     else if (score > VERDICT_THRESHOLDS.PARTIAL) verdict = 'PARTIAL';
Tests ran:
    computeMatchScore — universal Safety 0.35 dominant safety mismatch dominates score (Maria 65 senerio — Andura skips safety flag)
    computeMatchScore — universal Safety 0.35 dominant partial Exercise + perfect Safety → PARTIAL verdict

[Survived] ObjectLiteral
src/validation/matchMetric.js:217:23
-         verdict_counts: { MATCH: 0, PARTIAL: 0, MISS: 0 },
+         verdict_counts: {},
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 empty corpus → safe defaults, no Gate pass

[Survived] ObjectLiteral
src/validation/matchMetric.js:218:28
-         dimension_breakdown: { safety: 0, exercise: 0, setsRepsRir: 0, keyPrinciples: 0 },
+         dimension_breakdown: {},
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 empty corpus → safe defaults, no Gate pass

[Survived] ObjectLiteral
src/validation/matchMetric.js:224:18
-     const dimSum = { safety: 0, exercise: 0, setsRepsRir: 0, keyPrinciples: 0 };
+     const dimSum = {};
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] AssignmentOperator
src/validation/matchMetric.js:229:5
-       dimSum.safety += r.dimensions.safety;
+       dimSum.safety -= r.dimensions.safety;
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] AssignmentOperator
src/validation/matchMetric.js:230:5
-       dimSum.exercise += r.dimensions.exercise;
+       dimSum.exercise -= r.dimensions.exercise;
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] AssignmentOperator
src/validation/matchMetric.js:231:5
-       dimSum.setsRepsRir += r.dimensions.setsRepsRir;
+       dimSum.setsRepsRir -= r.dimensions.setsRepsRir;
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] AssignmentOperator
src/validation/matchMetric.js:232:5
-       dimSum.keyPrinciples += r.dimensions.keyPrinciples;
+       dimSum.keyPrinciples -= r.dimensions.keyPrinciples;
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] ObjectLiteral
src/validation/matchMetric.js:244:26
-       dimension_breakdown: {
-         safety: dimSum.safety / total,
-         exercise: dimSum.exercise / total,
-         setsRepsRir: dimSum.setsRepsRir / total,
-         keyPrinciples: dimSum.keyPrinciples / total,
-       },
+       dimension_breakdown: {},
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] ArithmeticOperator
src/validation/matchMetric.js:245:15
-         safety: dimSum.safety / total,
+         safety: dimSum.safety * total,
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] ArithmeticOperator
src/validation/matchMetric.js:246:17
-         exercise: dimSum.exercise / total,
+         exercise: dimSum.exercise * total,
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] ArithmeticOperator
src/validation/matchMetric.js:247:20
-         setsRepsRir: dimSum.setsRepsRir / total,
+         setsRepsRir: dimSum.setsRepsRir * total,
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[Survived] ArithmeticOperator
src/validation/matchMetric.js:248:22
-         keyPrinciples: dimSum.keyPrinciples / total,
+         keyPrinciples: dimSum.keyPrinciples * total,
Tests ran:
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 100% MATCH → Gate 1 PASS
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 95% MATCH → Gate 1 PASS exact threshold
    aggregateCorpusResults — Pre-Beta Gate 1 ≥95% LOCKED V1 94% MATCH → Gate 1 FAIL

[NoCoverage] BlockStatement
src/auth.js:111:33
-       if (!r.ok || !data.idToken) {
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
-       }
+       if (!r.ok || !data.idToken) {}

[NoCoverage] ObjectLiteral
src/auth.js:112:14
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return {};

[NoCoverage] BooleanLiteral
src/auth.js:112:20
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: true, error: data?.error?.message || `http_${r.status}` };

[NoCoverage] ConditionalExpression
src/auth.js:112:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/auth.js:112:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/auth.js:112:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data?.error?.message && `http_${r.status}` };

[NoCoverage] OptionalChaining
src/auth.js:112:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data?.error.message || `http_${r.status}` };

[NoCoverage] OptionalChaining
src/auth.js:112:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data.error?.message || `http_${r.status}` };

[NoCoverage] BlockStatement
src/auth.js:117:17
-     } catch (err) {
-       return { ok: false, error: err?.message || 'network_error' };
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/auth.js:118:12
-       return { ok: false, error: err?.message || 'network_error' };
+       return {};

[NoCoverage] BooleanLiteral
src/auth.js:118:18
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: true, error: err?.message || 'network_error' };

[NoCoverage] ConditionalExpression
src/auth.js:118:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/auth.js:118:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/auth.js:118:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err?.message && 'network_error' };

[NoCoverage] OptionalChaining
src/auth.js:118:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err.message || 'network_error' };

[NoCoverage] BlockStatement
src/auth.js:135:11
-     } catch {
-       return { oobCode: null, email: null };
-     }
+     } catch {}

[NoCoverage] ObjectLiteral
src/auth.js:136:12
-       return { oobCode: null, email: null };
+       return {};

[NoCoverage] BlockStatement
src/auth.js:189:33
-       if (!r.ok || !data.idToken) {
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
-       }
+       if (!r.ok || !data.idToken) {}

[NoCoverage] ObjectLiteral
src/auth.js:190:14
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return {};

[NoCoverage] BooleanLiteral
src/auth.js:190:20
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: true, error: data?.error?.message || `http_${r.status}` };

[NoCoverage] ConditionalExpression
src/auth.js:190:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/auth.js:190:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/auth.js:190:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data?.error?.message && `http_${r.status}` };

[NoCoverage] OptionalChaining
src/auth.js:190:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data?.error.message || `http_${r.status}` };

[NoCoverage] OptionalChaining
src/auth.js:190:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data.error?.message || `http_${r.status}` };

[NoCoverage] BlockStatement
src/auth.js:194:17
-     } catch (err) {
-       return { ok: false, error: err?.message || 'network_error' };
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/auth.js:195:12
-       return { ok: false, error: err?.message || 'network_error' };
+       return {};

[NoCoverage] BooleanLiteral
src/auth.js:195:18
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: true, error: err?.message || 'network_error' };

[NoCoverage] ConditionalExpression
src/auth.js:195:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/auth.js:195:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/auth.js:195:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err?.message && 'network_error' };

[NoCoverage] OptionalChaining
src/auth.js:195:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err.message || 'network_error' };

[NoCoverage] BlockStatement
src/auth.js:248:34
-       if (!r.ok || !data.id_token) {
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
-       }
+       if (!r.ok || !data.id_token) {}

[NoCoverage] ObjectLiteral
src/auth.js:249:14
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return {};

[NoCoverage] BooleanLiteral
src/auth.js:249:20
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: true, error: data?.error?.message || `http_${r.status}` };

[NoCoverage] ConditionalExpression
src/auth.js:249:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/auth.js:249:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/auth.js:249:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data?.error?.message && `http_${r.status}` };

[NoCoverage] OptionalChaining
src/auth.js:249:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data?.error.message || `http_${r.status}` };

[NoCoverage] OptionalChaining
src/auth.js:249:34
-         return { ok: false, error: data?.error?.message || `http_${r.status}` };
+         return { ok: false, error: data.error?.message || `http_${r.status}` };

[NoCoverage] BlockStatement
src/auth.js:259:17
-     } catch (err) {
-       return { ok: false, error: err?.message || 'network_error' };
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/auth.js:260:12
-       return { ok: false, error: err?.message || 'network_error' };
+       return {};

[NoCoverage] BooleanLiteral
src/auth.js:260:18
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: true, error: err?.message || 'network_error' };

[NoCoverage] ConditionalExpression
src/auth.js:260:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: true };

[NoCoverage] ConditionalExpression
src/auth.js:260:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: false };

[NoCoverage] LogicalOperator
src/auth.js:260:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err?.message && 'network_error' };

[NoCoverage] OptionalChaining
src/auth.js:260:32
-       return { ok: false, error: err?.message || 'network_error' };
+       return { ok: false, error: err.message || 'network_error' };

[NoCoverage] BooleanLiteral
src/auth.js:304:37
-     if (typeof s !== 'string') return false;
+     if (typeof s !== 'string') return true;

[NoCoverage] BlockStatement
src/auth.js:317:9
-     catch { return null; }
+     catch {}

[Survived] ObjectLiteral
src/auth.js:52:16
-     const body = {
-       requestType: 'EMAIL_SIGNIN',
-       email,
-       continueUrl: continueUrl || `${_origin()}/auth-callback`,
-       canHandleCodeInApp: true,
-     };
+     const body = {};
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] ConditionalExpression
src/auth.js:55:18
-       continueUrl: continueUrl || `${_origin()}/auth-callback`,
+       continueUrl: true,
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] ConditionalExpression
src/auth.js:55:18
-       continueUrl: continueUrl || `${_origin()}/auth-callback`,
+       continueUrl: false,
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] LogicalOperator
src/auth.js:55:18
-       continueUrl: continueUrl || `${_origin()}/auth-callback`,
+       continueUrl: continueUrl && `${_origin()}/auth-callback`,
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] BooleanLiteral
src/auth.js:56:25
-       canHandleCodeInApp: true,
+       canHandleCodeInApp: false,
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] ArrayDeclaration
src/auth.js:63:22
-     const BACKOFF_MS = [250, 500];
+     const BACKOFF_MS = [];
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] ObjectLiteral
src/auth.js:68:34
-         const r = await fetch(url, {
-           method: 'POST',
-           headers: { 'Content-Type': 'application/json' },
-           body: JSON.stringify(body),
-         });
+         const r = await fetch(url, {});
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] ObjectLiteral
src/auth.js:70:18
-           headers: { 'Content-Type': 'application/json' },
+           headers: {},
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 4 more tests!

[Survived] ArrowFunction
src/auth.js:79:41
-         const data = await r.json().catch(() => ({}));
+         const data = await r.json().catch(() => undefined);
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x does NOT retry on HTTP 4xx (deterministic failure)
    auth — magic link flow returns error on send failure

[Survived] OptionalChaining
src/auth.js:80:19
-         lastError = data?.error?.message || `http_${r.status}`;
+         lastError = data?.error.message || `http_${r.status}`;
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x does NOT retry on HTTP 4xx (deterministic failure)
    auth — magic link flow returns error on send failure

[Survived] OptionalChaining
src/auth.js:80:19
-         lastError = data?.error?.message || `http_${r.status}`;
+         lastError = data.error?.message || `http_${r.status}`;
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x does NOT retry on HTTP 4xx (deterministic failure)
    auth — magic link flow returns error on send failure

[Survived] EqualityOperator
src/auth.js:81:11
-         if (r.status < 500) return { ok: false, error: lastError };
+         if (r.status <= 500) return { ok: false, error: lastError };
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x does NOT retry on HTTP 4xx (deterministic failure)
    auth — magic link flow returns error on send failure

[Survived] BlockStatement
src/auth.js:82:19
-       } catch (err) {
-         lastError = err?.message || 'network_error';
-       }
+       } catch (err) {}
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] ConditionalExpression
src/auth.js:85:9
-       if (attempt < MAX_ATTEMPTS - 1) {
+       if (false) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] LogicalOperator
src/auth.js:83:19
-         lastError = err?.message || 'network_error';
+         lastError = err?.message && 'network_error';
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] OptionalChaining
src/auth.js:83:19
-         lastError = err?.message || 'network_error';
+         lastError = err.message || 'network_error';
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] EqualityOperator
src/auth.js:85:9
-       if (attempt < MAX_ATTEMPTS - 1) {
+       if (attempt >= MAX_ATTEMPTS - 1) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures
