[Survived] BlockStatement
src/auth.js:85:37
-       if (attempt < MAX_ATTEMPTS - 1) {
-         await new Promise(resolve => setTimeout(resolve, BACKOFF_MS[attempt]));
-       }
+       if (attempt < MAX_ATTEMPTS - 1) {}
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] ConditionalExpression
src/auth.js:85:9
-       if (attempt < MAX_ATTEMPTS - 1) {
+       if (true) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] EqualityOperator
src/auth.js:85:9
-       if (attempt < MAX_ATTEMPTS - 1) {
+       if (attempt <= MAX_ATTEMPTS - 1) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] ArithmeticOperator
src/auth.js:85:19
-       if (attempt < MAX_ATTEMPTS - 1) {
+       if (attempt < MAX_ATTEMPTS + 1) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures

[Survived] ConditionalExpression
src/auth.js:102:7
-     if (!email || !oobCode) return { ok: false, error: 'missing_input' };
+     if (false) return { ok: false, error: 'missing_input' };
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens
    auth — magic link flow verifyMagicLink fails on missing input

[Survived] LogicalOperator
src/auth.js:102:7
-     if (!email || !oobCode) return { ok: false, error: 'missing_input' };
+     if (!email && !oobCode) return { ok: false, error: 'missing_input' };
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens
    auth — magic link flow verifyMagicLink fails on missing input

[Survived] ObjectLiteral
src/auth.js:105:32
-       const r = await fetch(url, {
-         method: 'POST',
-         headers: { 'Content-Type': 'application/json' },
-         body: JSON.stringify({ email, oobCode }),
-       });
+       const r = await fetch(url, {});
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens

[Survived] ObjectLiteral
src/auth.js:107:16
-         headers: { 'Content-Type': 'application/json' },
+         headers: {},
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens

[Survived] ObjectLiteral
src/auth.js:108:28
-         body: JSON.stringify({ email, oobCode }),
+         body: JSON.stringify({}),
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens

[Survived] ArrowFunction
src/auth.js:110:39
-       const data = await r.json().catch(() => ({}));
+       const data = await r.json().catch(() => undefined);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens

[Survived] ConditionalExpression
src/auth.js:111:9
-       if (!r.ok || !data.idToken) {
+       if (false) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens

[Survived] LogicalOperator
src/auth.js:111:9
-       if (!r.ok || !data.idToken) {
+       if (!r.ok && !data.idToken) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens

[Survived] ConditionalExpression
src/auth.js:130:52
-     const q = typeof search === 'string' ? search : (typeof window !== 'undefined' ? window.location.search : '');
+     const q = typeof search === 'string' ? search : (true ? window.location.search : '');
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment

[Survived] ConditionalExpression
src/auth.js:131:7
-     if (!q) return { oobCode: null, email: null };
+     if (false) return { oobCode: null, email: null };
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
  and 1 more test!

[Survived] MethodExpression
src/auth.js:133:40
-       const params = new URLSearchParams(q.startsWith('?') ? q.slice(1) : q);
+       const params = new URLSearchParams(q.endsWith('?') ? q.slice(1) : q);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow parseMagicLinkUrl extracts oobCode + email

[Survived] MethodExpression
src/auth.js:133:60
-       const params = new URLSearchParams(q.startsWith('?') ? q.slice(1) : q);
+       const params = new URLSearchParams(q.startsWith('?') ? q : q);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection returns missing_email error when /auth-callback hit without email
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow parseMagicLinkUrl extracts oobCode + email

[Survived] ConditionalExpression
src/auth.js:156:20
-     const redirect = continueUrl || `${_origin()}/auth-callback`;
+     const redirect = true;
Tests ran:
    auth — Google OAuth (signInWithIdp) builds a Google OAuth URL with required params

[Survived] ConditionalExpression
src/auth.js:156:20
-     const redirect = continueUrl || `${_origin()}/auth-callback`;
+     const redirect = false;
Tests ran:
    auth — Google OAuth (signInWithIdp) builds a Google OAuth URL with required params

[Survived] LogicalOperator
src/auth.js:156:20
-     const redirect = continueUrl || `${_origin()}/auth-callback`;
+     const redirect = continueUrl && `${_origin()}/auth-callback`;
Tests ran:
    auth — Google OAuth (signInWithIdp) builds a Google OAuth URL with required params

[Survived] MethodExpression
src/auth.js:162:12
-       nonce: Math.random().toString(36).slice(2),
+       nonce: Math.random().toString(36),
Tests ran:
    auth — Google OAuth (signInWithIdp) builds a Google OAuth URL with required params

[Survived] ObjectLiteral
src/auth.js:180:16
-         headers: { 'Content-Type': 'application/json' },
+         headers: {},
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] ObjectLiteral
src/auth.js:178:32
-       const r = await fetch(url, {
-         method: 'POST',
-         headers: { 'Content-Type': 'application/json' },
-         body: JSON.stringify({
-           postBody: `id_token=${encodeURIComponent(googleIdToken)}&providerId=google.com`,
-           requestUri: _origin(),
-           returnIdpCredential: true,
-           returnSecureToken: true,
-         }),
-       });
+       const r = await fetch(url, {});
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] ObjectLiteral
src/auth.js:181:28
-         body: JSON.stringify({
-           postBody: `id_token=${encodeURIComponent(googleIdToken)}&providerId=google.com`,
-           requestUri: _origin(),
-           returnIdpCredential: true,
-           returnSecureToken: true,
-         }),
+         body: JSON.stringify({}),
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] BooleanLiteral
src/auth.js:184:30
-           returnIdpCredential: true,
+           returnIdpCredential: false,
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] BooleanLiteral
src/auth.js:185:28
-           returnSecureToken: true,
+           returnSecureToken: false,
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] ArrowFunction
src/auth.js:188:39
-       const data = await r.json().catch(() => ({}));
+       const data = await r.json().catch(() => undefined);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] ConditionalExpression
src/auth.js:189:9
-       if (!r.ok || !data.idToken) {
+       if (false) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] LogicalOperator
src/auth.js:189:9
-       if (!r.ok || !data.idToken) {
+       if (!r.ok && !data.idToken) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — Google OAuth (signInWithIdp) exchanges Google id_token for Firebase tokens

[Survived] LogicalOperator
src/auth.js:210:7
-     if (!uid || !idToken) return null;
+     if (!uid && !idToken) return null;
Tests ran:
    Data Cleanup should clear test residue keys only
    Data Cleanup fullReset should clear everything
    storage/db — namespace resolution returns sanitized default namespace pre-Auth
  and 39 more tests!

[Survived] ConditionalExpression
src/auth.js:224:7
-     if (!auth) return null;
+     if (false) return null;
Tests ran:
    auth — token state + refresh getIdToken returns current token when fresh
    auth — token state + refresh getIdToken triggers refresh when stale
    auth-path-migration — happy path migrates source → dest when dest empty
  and 9 more tests!

[Survived] EqualityOperator
src/auth.js:226:22
-     if (auth.expiry && (auth.expiry - now) > skewMs) return auth.idToken;
+     if (auth.expiry && auth.expiry - now >= skewMs) return auth.idToken;
Tests ran:
    auth — token state + refresh getIdToken returns current token when fresh
    auth — token state + refresh getIdToken triggers refresh when stale
    auth-path-migration — happy path migrates source → dest when dest empty
  and 8 more tests!

[Survived] ObjectLiteral
src/auth.js:242:32
-       const r = await fetch(url, {
-         method: 'POST',
-         headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
-         body: `grant_type=refresh_token&refresh_token=${encodeURIComponent(refreshToken)}`,
-       });
+       const r = await fetch(url, {});
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] ObjectLiteral
src/auth.js:244:16
-         headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
+         headers: {},
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] ArrowFunction
src/auth.js:247:39
-       const data = await r.json().catch(() => ({}));
+       const data = await r.json().catch(() => undefined);
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] ConditionalExpression
src/auth.js:248:9
-       if (!r.ok || !data.id_token) {
+       if (false) {
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] LogicalOperator
src/auth.js:248:9
-       if (!r.ok || !data.id_token) {
+       if (!r.ok && !data.id_token) {
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] ConditionalExpression
src/auth.js:255:16
-         localId: data.user_id || _getItem(AUTH_STORAGE_KEYS.uid),
+         localId: true,
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] ConditionalExpression
src/auth.js:255:16
-         localId: data.user_id || _getItem(AUTH_STORAGE_KEYS.uid),
+         localId: false,
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] LogicalOperator
src/auth.js:255:16
-         localId: data.user_id || _getItem(AUTH_STORAGE_KEYS.uid),
+         localId: data.user_id && _getItem(AUTH_STORAGE_KEYS.uid),
Tests ran:
    auth — token state + refresh getIdToken triggers refresh when stale

[Survived] ConditionalExpression
src/auth.js:274:7
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (true) {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] ConditionalExpression
src/auth.js:274:7
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (false) {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] LogicalOperator
src/auth.js:274:7
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (typeof window !== 'undefined' || typeof window.dispatchEvent === 'function') {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] ConditionalExpression
src/auth.js:274:7
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (true && typeof window.dispatchEvent === 'function') {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] EqualityOperator
src/auth.js:274:7
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (typeof window === 'undefined' && typeof window.dispatchEvent === 'function') {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] ConditionalExpression
src/auth.js:274:40
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (typeof window !== 'undefined' && true) {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] EqualityOperator
src/auth.js:274:40
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
+     if (typeof window !== 'undefined' && typeof window.dispatchEvent !== 'function') {
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] BlockStatement
src/auth.js:274:84
-     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {
-       try { window.dispatchEvent(new Event('andura:signedout')); } catch {}
-     }
+     if (typeof window !== 'undefined' && typeof window.dispatchEvent === 'function') {}
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] BlockStatement
src/auth.js:275:9
-       try { window.dispatchEvent(new Event('andura:signedout')); } catch {}
+       try {} catch {}
Tests ran:
    auth — token state + refresh signOut clears all auth state

[Survived] ConditionalExpression
src/auth.js:294:7
-     if (data.idToken) _setItem(AUTH_STORAGE_KEYS.idToken, data.idToken);
+     if (true) _setItem(AUTH_STORAGE_KEYS.idToken, data.idToken);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] ConditionalExpression
src/auth.js:295:7
-     if (data.refreshToken) _setItem(AUTH_STORAGE_KEYS.refreshToken, data.refreshToken);
+     if (true) _setItem(AUTH_STORAGE_KEYS.refreshToken, data.refreshToken);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] ConditionalExpression
src/auth.js:296:7
-     if (data.localId) _setItem(AUTH_STORAGE_KEYS.uid, data.localId);
+     if (true) _setItem(AUTH_STORAGE_KEYS.uid, data.localId);
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] ConditionalExpression
src/auth.js:298:7
-     if (Number.isFinite(expiresInSec) && expiresInSec > 0) {
+     if (true) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] LogicalOperator
src/auth.js:298:7
-     if (Number.isFinite(expiresInSec) && expiresInSec > 0) {
+     if (Number.isFinite(expiresInSec) || expiresInSec > 0) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] ConditionalExpression
src/auth.js:298:40
-     if (Number.isFinite(expiresInSec) && expiresInSec > 0) {
+     if (Number.isFinite(expiresInSec) && true) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] EqualityOperator
src/auth.js:298:40
-     if (Number.isFinite(expiresInSec) && expiresInSec > 0) {
+     if (Number.isFinite(expiresInSec) && expiresInSec >= 0) {
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] ArithmeticOperator
src/auth.js:299:60
-       _setItem(AUTH_STORAGE_KEYS.expiry, String(Date.now() + expiresInSec * 1000));
+       _setItem(AUTH_STORAGE_KEYS.expiry, String(Date.now() + expiresInSec / 1000));
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    handleAuthCallbackRoute — §56.10.1 callback detection processes Google id_token from URL fragment
    auth — magic link flow verifies magic link and persists tokens
  and 2 more tests!

[Survived] ConditionalExpression
src/auth.js:304:7
-     if (typeof s !== 'string') return false;
+     if (false) return false;
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 5 more tests!

[Survived] Regex
src/auth.js:305:10
-     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(s.trim());
+     return /[^\s@]+@[^\s@]+\.[^\s@]+$/.test(s.trim());
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 5 more tests!

[Survived] Regex
src/auth.js:305:10
-     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(s.trim());
+     return /^[^\s@]+@[^\s@]+\.[^\s@]+/.test(s.trim());
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 5 more tests!

[Survived] MethodExpression
src/auth.js:305:44
-     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(s.trim());
+     return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(s);
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 5 more tests!

[Survived] BlockStatement
src/auth.js:308:20
-   function _origin() {
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
-       return window.location.origin;
-     }
-     return 'https://andura.local';
-   }
+   function _origin() {}
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] ConditionalExpression
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (true) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] ConditionalExpression
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (false) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] LogicalOperator
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (typeof window !== 'undefined' && window.location || window.location.origin) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] ConditionalExpression
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (true && window.location.origin) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] LogicalOperator
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (typeof window !== 'undefined' || window.location && window.location.origin) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] ConditionalExpression
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (true && window.location && window.location.origin) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] EqualityOperator
src/auth.js:309:7
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
+     if (typeof window === 'undefined' && window.location && window.location.origin) {
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 7 more tests!

[Survived] BlockStatement
src/auth.js:309:83
-     if (typeof window !== 'undefined' && window.location && window.location.origin) {
-       return window.location.origin;
-     }
+     if (typeof window !== 'undefined' && window.location && window.location.origin) {}
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x retries up to 3x on network error then surfaces failure
    sendMagicLink — §56.13.1 auto-retry 3x retries on HTTP 5xx then surfaces last error
  and 6 more tests!

[Survived] ConditionalExpression
src/auth.js:321:13
-     try { if (typeof localStorage !== 'undefined') localStorage.setItem(k, v); }
+     try { if (true) localStorage.setItem(k, v); }
Tests ran:
    sendMagicLink — §56.13.1 auto-retry 3x succeeds on first attempt without retry
    sendMagicLink — §56.13.1 auto-retry 3x eventually succeeds on retry attempt 3 after transient failures
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
  and 5 more tests!

[Survived] ConditionalExpression
src/auth.js:326:13
-     try { if (typeof localStorage !== 'undefined') localStorage.removeItem(k); }
+     try { if (true) localStorage.removeItem(k); }
Tests ran:
    handleAuthCallbackRoute — §56.10.1 callback detection processes Magic Link callback with email + oobCode in URL
    auth — magic link flow verifies magic link and persists tokens
    auth — token state + refresh signOut clears all auth state

[Survived] ConditionalExpression
src/auth.js:316:16
-     try { return typeof localStorage !== 'undefined' ? localStorage.getItem(k) : null; }
+     try { return true ? localStorage.getItem(k) : null; }
Tests ran:
    Data Cleanup should clear test residue keys only
    Data Cleanup fullReset should clear everything
    storage/db — namespace resolution returns sanitized default namespace pre-Auth
  and 40 more tests!

[Survived] ConditionalExpression
src/auth.js:349:10
-     return errorCode === 'USER_DISABLED' || errorCode.startsWith('USER_DISABLED');
+     return false || errorCode.startsWith('USER_DISABLED');
Tests ran:
    §56.5.3 USER_DISABLED — wording + detector isUserDisabledError matches "USER_DISABLED" exact
    §56.5.3 USER_DISABLED — wording + detector isUserDisabledError matches "USER_DISABLED" prefix (suffix tolerated)
    §56.5.3 USER_DISABLED — wording + detector isUserDisabledError NU matches other codes

[Survived] ConditionalExpression
src/auth.js:379:7
-     if (typeof probe !== 'function') return false;
+     if (false) return false;
Tests ran:
    §56.7 detect helpers — pure functions cu probe injection detectAnonymousLocalData(probe true) → true
    §56.7 detect helpers — pure functions cu probe injection detectAnonymousLocalData(probe false) → false
    §56.7 detect helpers — pure functions cu probe injection detectAnonymousLocalData defensive: probe throws → false
  and 1 more test!

[Survived] ConditionalExpression
src/auth.js:391:7
-     if (typeof probe !== 'function') return false;
+     if (false) return false;
Tests ran:
    §56.7 detect helpers — pure functions cu probe injection detectCloudUserData same pattern as anonymous detect
