[Survived] ConditionalExpression
src/auth.js:23:33
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
-     || 'PLACEHOLDER_WEB_API_KEY';
+   export const FIREBASE_API_KEY = true;
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/auth.js:23:33
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
-     || 'PLACEHOLDER_WEB_API_KEY';
+   export const FIREBASE_API_KEY = false;
Ran all tests for this mutant.

[Survived] LogicalOperator
src/auth.js:23:33
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
-     || 'PLACEHOLDER_WEB_API_KEY';
+   export const FIREBASE_API_KEY = typeof window !== 'undefined' && window.__FIREBASE_API_KEY && 'PLACEHOLDER_WEB_API_KEY';
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/auth.js:23:34
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
+   export const FIREBASE_API_KEY = (false)
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/auth.js:23:34
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
+   export const FIREBASE_API_KEY = (true && window.__FIREBASE_API_KEY)
Ran all tests for this mutant.

[Survived] LogicalOperator
src/auth.js:23:34
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
+   export const FIREBASE_API_KEY = (typeof window !== 'undefined' || window.__FIREBASE_API_KEY)
Ran all tests for this mutant.

[Survived] EqualityOperator
src/auth.js:23:34
-   export const FIREBASE_API_KEY = (typeof window !== 'undefined' && window.__FIREBASE_API_KEY)
+   export const FIREBASE_API_KEY = (typeof window === 'undefined' && window.__FIREBASE_API_KEY)
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/bootstrap.js:24:9
-       if (result?.totalEntriesMigrated > 0) {
+       if (true) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] EqualityOperator
src/bootstrap.js:24:9
-       if (result?.totalEntriesMigrated > 0) {
+       if (result?.totalEntriesMigrated >= 0) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] OptionalChaining
src/bootstrap.js:24:9
-       if (result?.totalEntriesMigrated > 0) {
+       if (result.totalEntriesMigrated > 0) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] ConditionalExpression
src/bootstrap.js:27:9
-       if (result?.errors?.length > 0) {
+       if (true) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] EqualityOperator
src/bootstrap.js:27:9
-       if (result?.errors?.length > 0) {
+       if (result?.errors?.length >= 0) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] OptionalChaining
src/bootstrap.js:27:9
-       if (result?.errors?.length > 0) {
+       if (result?.errors.length > 0) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] OptionalChaining
src/bootstrap.js:27:9
-       if (result?.errors?.length > 0) {
+       if (result.errors?.length > 0) {
Tests ran:
    runBootMigrations calls runMigrations + returns result on success
    runBootMigrations logs summary when entries migrated
    runBootMigrations warns on errors but still returns result
  and 2 more tests!

[Survived] OptionalChaining
src/bootstrap.js:48:21
-       const rotated = result?.initial?.rotated;
+       const rotated = result?.initial.rotated;
Tests ran:
    startTierRotation calls initAutoBackup + returns result on success
    startTierRotation forwards opts to initAutoBackup (testing override)
    startTierRotation logs summary when initial rotation rotated entries
  and 1 more test!

[Survived] OptionalChaining
src/bootstrap.js:48:21
-       const rotated = result?.initial?.rotated;
+       const rotated = result.initial?.rotated;
Tests ran:
    startTierRotation calls initAutoBackup + returns result on success
    startTierRotation forwards opts to initAutoBackup (testing override)
    startTierRotation logs summary when initial rotation rotated entries
  and 1 more test!

[Survived] ConditionalExpression
src/bootstrap.js:49:9
-       if (rotated > 0) {
+       if (true) {
Tests ran:
    startTierRotation calls initAutoBackup + returns result on success
    startTierRotation forwards opts to initAutoBackup (testing override)
    startTierRotation logs summary when initial rotation rotated entries
  and 1 more test!

[Survived] EqualityOperator
src/bootstrap.js:49:9
-       if (rotated > 0) {
+       if (rotated >= 0) {
Tests ran:
    startTierRotation calls initAutoBackup + returns result on success
    startTierRotation forwards opts to initAutoBackup (testing override)
    startTierRotation logs summary when initial rotation rotated entries
  and 1 more test!

[Survived] ConditionalExpression
src/bootstrap.js:67:7
-     if (typeof window === 'undefined') return;
+     if (false) return;
Tests ran:
    exposeForceRotationHelper sets window.__forceRotation when window defined
    exposeForceRotationHelper window.__forceRotation invokes rotateOnce on call
    exposeForceRotationHelper idempotent — re-calling overwrites existing helper

[Survived] ArithmeticOperator
src/constants.js:6:32
-   export const DTOT = Math.round((TARGET_DATE - START_DATE) / 86400000);
+   export const DTOT = Math.round((TARGET_DATE - START_DATE) * 86400000);
Ran all tests for this mutant.

[Survived] ArithmeticOperator
src/constants.js:6:33
-   export const DTOT = Math.round((TARGET_DATE - START_DATE) / 86400000);
+   export const DTOT = Math.round((TARGET_DATE + START_DATE) / 86400000);
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:16:24
-   export const EX_SETS = {
-     'DB Shoulder Press':4,'Incline DB Press':4,'Flat DB Press':3,'Lat Pulldown':4,
-     'Cable Row':3,'Chest-Supported Row':2,'Romanian Deadlift':3,'Leg Press':3,
-     'Lateral Raises':4,'Rear Delt Fly':4,'Face Pulls':3,'Incline DB Curl':3,
-     'Bayesian Curl':3,'Cable Curl':3,'Preacher Curl':3,'Overhead Triceps':3,
-     'Pushdown':3,'Pec Deck / Cable Fly':3,'Leg Curl':3,'Leg Extension':3,'Calf Raises':4
-   };
+   export const EX_SETS = {};
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:27:24
-   export const EX_REPS = {
-     'DB Shoulder Press':'6–10','Incline DB Press':'6–10','Flat DB Press':'8–12',
-     'Lat Pulldown':'8–12','Cable Row':'8–12','Chest-Supported Row':'10–12',
-     'Romanian Deadlift':'8–12','Leg Press':'15–20','Lateral Raises':'12–15',
-     'Rear Delt Fly':'12–15','Face Pulls':'15–20','Incline DB Curl':'10–12',
-     'Bayesian Curl':'10–12','Cable Curl':'10–12','Preacher Curl':'10–12',
-     'Overhead Triceps':'10–12','Pushdown':'10–12','Pec Deck / Cable Fly':'12–15',
-     'Leg Curl':'15–20','Leg Extension':'15–20','Calf Raises':'15–20'
-   };
+   export const EX_REPS = {};
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:38:43
-     {day:'Luni',t:'off',lb:'OFF',tm:null,ex:[]},
+     {day:'Luni',t:'off',lb:'OFF',tm:null,ex:["Stryker was here"]},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:39:3
-     {day:'Marți',t:'free',lb:'PULL · Spate + Biceps',tm:'~75 min',ex:[
-       {n:'Lat Pulldown',s:'4×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
-       {n:'Face Pulls',s:'3×15–20',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
-       {n:'Bayesian Curl',s:'3×10–12',g:'brate'}
-     ]},
+     {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:39:68
-     {day:'Marți',t:'free',lb:'PULL · Spate + Biceps',tm:'~75 min',ex:[
-       {n:'Lat Pulldown',s:'4×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
-       {n:'Face Pulls',s:'3×15–20',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
-       {n:'Bayesian Curl',s:'3×10–12',g:'brate'}
-     ]},
+     {day:'Marți',t:'free',lb:'PULL · Spate + Biceps',tm:'~75 min',ex:[]},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:40:5
-       {n:'Lat Pulldown',s:'4×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
+       {},{n:'Cable Row',s:'3×8–12',g:'spate'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:40:45
-       {n:'Lat Pulldown',s:'4×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
+       {n:'Lat Pulldown',s:'4×8–12',g:'spate'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:41:5
-       {n:'Face Pulls',s:'3×15–20',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
+       {},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:41:44
-       {n:'Face Pulls',s:'3×15–20',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
+       {n:'Face Pulls',s:'3×15–20',g:'umeri'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:42:5
-       {n:'Bayesian Curl',s:'3×10–12',g:'brate'}
+       {}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:44:3
-     {day:'Miercuri',t:'lim',lb:'PUSH · Umeri + Piept',tm:'MAX 65 MIN',ex:[
-       {n:'DB Shoulder Press',s:'3×6–10',g:'umeri'},{n:'Incline DB Press',s:'4×6–10',g:'piept'},
-       {n:'Pec Deck / Cable Fly',s:'3×12–15',g:'piept'},{n:'Lateral Raises (cable)',s:'3×12–15',g:'umeri'},
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'3×12',g:'triceps'}
-     ]},
+     {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:44:72
-     {day:'Miercuri',t:'lim',lb:'PUSH · Umeri + Piept',tm:'MAX 65 MIN',ex:[
-       {n:'DB Shoulder Press',s:'3×6–10',g:'umeri'},{n:'Incline DB Press',s:'4×6–10',g:'piept'},
-       {n:'Pec Deck / Cable Fly',s:'3×12–15',g:'piept'},{n:'Lateral Raises (cable)',s:'3×12–15',g:'umeri'},
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'3×12',g:'triceps'}
-     ]},
+     {day:'Miercuri',t:'lim',lb:'PUSH · Umeri + Piept',tm:'MAX 65 MIN',ex:[]},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:45:5
-       {n:'DB Shoulder Press',s:'3×6–10',g:'umeri'},{n:'Incline DB Press',s:'4×6–10',g:'piept'},
+       {},{n:'Incline DB Press',s:'4×6–10',g:'piept'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:45:50
-       {n:'DB Shoulder Press',s:'3×6–10',g:'umeri'},{n:'Incline DB Press',s:'4×6–10',g:'piept'},
+       {n:'DB Shoulder Press',s:'3×6–10',g:'umeri'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:46:5
-       {n:'Pec Deck / Cable Fly',s:'3×12–15',g:'piept'},{n:'Lateral Raises (cable)',s:'3×12–15',g:'umeri'},
+       {},{n:'Lateral Raises (cable)',s:'3×12–15',g:'umeri'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:46:54
-       {n:'Pec Deck / Cable Fly',s:'3×12–15',g:'piept'},{n:'Lateral Raises (cable)',s:'3×12–15',g:'umeri'},
+       {n:'Pec Deck / Cable Fly',s:'3×12–15',g:'piept'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:47:5
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'3×12',g:'triceps'}
+       {},{n:'Pushdown',s:'3×12',g:'triceps'}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:47:52
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'3×12',g:'triceps'}
+       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:49:3
-     {day:'Joi',t:'lim',lb:'UMERI COMPLET + BRAȚE',tm:'MAX 65 MIN',ex:[
-       {n:'Lateral Raises',s:'4×12–15',g:'umeri'},{n:'Rear Delt Fly',s:'4×12–15',g:'umeri'},
-       {n:'Cable Curl',s:'3×10–12',g:'brate'},{n:'Preacher Curl',s:'3×10–12',g:'brate'},
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'2×12',g:'triceps'}
-     ]},
+     {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:49:68
-     {day:'Joi',t:'lim',lb:'UMERI COMPLET + BRAȚE',tm:'MAX 65 MIN',ex:[
-       {n:'Lateral Raises',s:'4×12–15',g:'umeri'},{n:'Rear Delt Fly',s:'4×12–15',g:'umeri'},
-       {n:'Cable Curl',s:'3×10–12',g:'brate'},{n:'Preacher Curl',s:'3×10–12',g:'brate'},
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'2×12',g:'triceps'}
-     ]},
+     {day:'Joi',t:'lim',lb:'UMERI COMPLET + BRAȚE',tm:'MAX 65 MIN',ex:[]},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:50:5
-       {n:'Lateral Raises',s:'4×12–15',g:'umeri'},{n:'Rear Delt Fly',s:'4×12–15',g:'umeri'},
+       {},{n:'Rear Delt Fly',s:'4×12–15',g:'umeri'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:50:48
-       {n:'Lateral Raises',s:'4×12–15',g:'umeri'},{n:'Rear Delt Fly',s:'4×12–15',g:'umeri'},
+       {n:'Lateral Raises',s:'4×12–15',g:'umeri'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:51:5
-       {n:'Cable Curl',s:'3×10–12',g:'brate'},{n:'Preacher Curl',s:'3×10–12',g:'brate'},
+       {},{n:'Preacher Curl',s:'3×10–12',g:'brate'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:51:44
-       {n:'Cable Curl',s:'3×10–12',g:'brate'},{n:'Preacher Curl',s:'3×10–12',g:'brate'},
+       {n:'Cable Curl',s:'3×10–12',g:'brate'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:52:5
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'2×12',g:'triceps'}
+       {},{n:'Pushdown',s:'2×12',g:'triceps'}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:52:52
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{n:'Pushdown',s:'2×12',g:'triceps'}
+       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'},{}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:54:3
-     {day:'Vineri',t:'free',lb:'UPPER PUMP + PICIOARE',tm:'~90 min',ex:[
-       {n:'Incline DB Press pump',s:'3×12–15',g:'piept'},{n:'Cable Fly',s:'2×15',g:'piept'},
-       {n:'Lateral Raises',s:'4×15–20',g:'umeri'},{n:'Rear Delt Cable',s:'2×15–20',g:'umeri'},
-       {n:'Leg Press',s:'3×15–20',g:'picioare'},{n:'Romanian Deadlift',s:'3×12–15',g:'picioare'},
-       {n:'Leg Curl',s:'3×15–20',g:'picioare'},{n:'Leg Extension',s:'3×15–20',g:'picioare'},
-       {n:'Calf Raises',s:'4×15–20',g:'picioare'}
-     ]},
+     {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:54:69
-     {day:'Vineri',t:'free',lb:'UPPER PUMP + PICIOARE',tm:'~90 min',ex:[
-       {n:'Incline DB Press pump',s:'3×12–15',g:'piept'},{n:'Cable Fly',s:'2×15',g:'piept'},
-       {n:'Lateral Raises',s:'4×15–20',g:'umeri'},{n:'Rear Delt Cable',s:'2×15–20',g:'umeri'},
-       {n:'Leg Press',s:'3×15–20',g:'picioare'},{n:'Romanian Deadlift',s:'3×12–15',g:'picioare'},
-       {n:'Leg Curl',s:'3×15–20',g:'picioare'},{n:'Leg Extension',s:'3×15–20',g:'picioare'},
-       {n:'Calf Raises',s:'4×15–20',g:'picioare'}
-     ]},
+     {day:'Vineri',t:'free',lb:'UPPER PUMP + PICIOARE',tm:'~90 min',ex:[]},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:55:5
-       {n:'Incline DB Press pump',s:'3×12–15',g:'piept'},{n:'Cable Fly',s:'2×15',g:'piept'},
+       {},{n:'Cable Fly',s:'2×15',g:'piept'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:55:55
-       {n:'Incline DB Press pump',s:'3×12–15',g:'piept'},{n:'Cable Fly',s:'2×15',g:'piept'},
+       {n:'Incline DB Press pump',s:'3×12–15',g:'piept'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:56:5
-       {n:'Lateral Raises',s:'4×15–20',g:'umeri'},{n:'Rear Delt Cable',s:'2×15–20',g:'umeri'},
+       {},{n:'Rear Delt Cable',s:'2×15–20',g:'umeri'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:56:48
-       {n:'Lateral Raises',s:'4×15–20',g:'umeri'},{n:'Rear Delt Cable',s:'2×15–20',g:'umeri'},
+       {n:'Lateral Raises',s:'4×15–20',g:'umeri'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:57:5
-       {n:'Leg Press',s:'3×15–20',g:'picioare'},{n:'Romanian Deadlift',s:'3×12–15',g:'picioare'},
+       {},{n:'Romanian Deadlift',s:'3×12–15',g:'picioare'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:57:46
-       {n:'Leg Press',s:'3×15–20',g:'picioare'},{n:'Romanian Deadlift',s:'3×12–15',g:'picioare'},
+       {n:'Leg Press',s:'3×15–20',g:'picioare'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:58:5
-       {n:'Leg Curl',s:'3×15–20',g:'picioare'},{n:'Leg Extension',s:'3×15–20',g:'picioare'},
+       {},{n:'Leg Extension',s:'3×15–20',g:'picioare'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:58:45
-       {n:'Leg Curl',s:'3×15–20',g:'picioare'},{n:'Leg Extension',s:'3×15–20',g:'picioare'},
+       {n:'Leg Curl',s:'3×15–20',g:'picioare'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:59:5
-       {n:'Calf Raises',s:'4×15–20',g:'picioare'}
+       {}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:61:3
-     {day:'Sâmbătă',t:'free',lb:'FULL UPPER',tm:'~110 min',ex:[
-       {n:'DB Shoulder Press',s:'4×6–10',g:'umeri'},{n:'Incline DB Press',s:'3×6–10',g:'piept'},
-       {n:'Flat DB Press',s:'3×8–12',g:'piept'},{n:'Pec Deck / Cable Fly',s:'2×12–15',g:'piept'},
-       {n:'Lat Pulldown',s:'3×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
-       {n:'Chest-Supported Row',s:'2×10–12',g:'spate'},{n:'Lateral Raises (cable)',s:'4×12–15+drop',g:'umeri'},
-       {n:'Rear Delt Fly',s:'3×12–15',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'}
-     ]},
+     {},
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:61:60
-     {day:'Sâmbătă',t:'free',lb:'FULL UPPER',tm:'~110 min',ex:[
-       {n:'DB Shoulder Press',s:'4×6–10',g:'umeri'},{n:'Incline DB Press',s:'3×6–10',g:'piept'},
-       {n:'Flat DB Press',s:'3×8–12',g:'piept'},{n:'Pec Deck / Cable Fly',s:'2×12–15',g:'piept'},
-       {n:'Lat Pulldown',s:'3×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
-       {n:'Chest-Supported Row',s:'2×10–12',g:'spate'},{n:'Lateral Raises (cable)',s:'4×12–15+drop',g:'umeri'},
-       {n:'Rear Delt Fly',s:'3×12–15',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'}
-     ]},
+     {day:'Sâmbătă',t:'free',lb:'FULL UPPER',tm:'~110 min',ex:[]},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:62:5
-       {n:'DB Shoulder Press',s:'4×6–10',g:'umeri'},{n:'Incline DB Press',s:'3×6–10',g:'piept'},
+       {},{n:'Incline DB Press',s:'3×6–10',g:'piept'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:62:50
-       {n:'DB Shoulder Press',s:'4×6–10',g:'umeri'},{n:'Incline DB Press',s:'3×6–10',g:'piept'},
+       {n:'DB Shoulder Press',s:'4×6–10',g:'umeri'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:63:5
-       {n:'Flat DB Press',s:'3×8–12',g:'piept'},{n:'Pec Deck / Cable Fly',s:'2×12–15',g:'piept'},
+       {},{n:'Pec Deck / Cable Fly',s:'2×12–15',g:'piept'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:63:46
-       {n:'Flat DB Press',s:'3×8–12',g:'piept'},{n:'Pec Deck / Cable Fly',s:'2×12–15',g:'piept'},
+       {n:'Flat DB Press',s:'3×8–12',g:'piept'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:64:5
-       {n:'Lat Pulldown',s:'3×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
+       {},{n:'Cable Row',s:'3×8–12',g:'spate'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:64:45
-       {n:'Lat Pulldown',s:'3×8–12',g:'spate'},{n:'Cable Row',s:'3×8–12',g:'spate'},
+       {n:'Lat Pulldown',s:'3×8–12',g:'spate'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:65:5
-       {n:'Chest-Supported Row',s:'2×10–12',g:'spate'},{n:'Lateral Raises (cable)',s:'4×12–15+drop',g:'umeri'},
+       {},{n:'Lateral Raises (cable)',s:'4×12–15+drop',g:'umeri'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:65:53
-       {n:'Chest-Supported Row',s:'2×10–12',g:'spate'},{n:'Lateral Raises (cable)',s:'4×12–15+drop',g:'umeri'},
+       {n:'Chest-Supported Row',s:'2×10–12',g:'spate'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:66:5
-       {n:'Rear Delt Fly',s:'3×12–15',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
+       {},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:66:47
-       {n:'Rear Delt Fly',s:'3×12–15',g:'umeri'},{n:'Incline DB Curl',s:'3×10–12',g:'brate'},
+       {n:'Rear Delt Fly',s:'3×12–15',g:'umeri'},{},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:67:5
-       {n:'Overhead Triceps',s:'3×10–12',g:'triceps'}
+       {}
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/constants.js:69:3
-     {day:'Duminică',t:'off',lb:'OFF COMPLET',tm:null,ex:[]}
+     {}
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/constants.js:69:55
-     {day:'Duminică',t:'off',lb:'OFF COMPLET',tm:null,ex:[]}
+     {day:'Duminică',t:'off',lb:'OFF COMPLET',tm:null,ex:["Stryker was here"]}
Ran all tests for this mutant.

[NoCoverage] ObjectLiteral
src/db.js:21:65
-   export const fmt = s => new Date(s).toLocaleDateString('ro-RO', { day: '2-digit', month: 'short' });
+   export const fmt = s => new Date(s).toLocaleDateString('ro-RO', {});

[NoCoverage] MethodExpression
src/db.js:22:29
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '');

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*/i, '').trim();

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\S*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s*[^-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s*[-–]\s(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s*[-–]\S*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();

[NoCoverage] Regex
src/db.js:22:39
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).$/i, '').trim();

[Survived] BlockStatement
src/db.js:4:82
-     get: k => { try { return JSON.parse(localStorage.getItem(k) || 'null') } catch { return null } },
+     get: k => { try { return JSON.parse(localStorage.getItem(k) || 'null') } catch {} },
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 23 more tests!

[Survived] ArrowFunction
src/db.js:8:18
-   export const $ = id => document.getElementById(id);
+   export const $ = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/db.js:21:20
-   export const fmt = s => new Date(s).toLocaleDateString('ro-RO', { day: '2-digit', month: 'short' });
+   export const fmt = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/db.js:22:24
-   export const cleanEx = n => n.replace(/\s*[-–]\s*(wide|neutral|rope|cable|drop|pump).*$/i, '').trim();
+   export const cleanEx = () => undefined;
Ran all tests for this mutant.

[NoCoverage] BlockStatement
src/firebase.js:53:24
-   function getDeviceId() {
-     let id = localStorage.getItem('device-id');
-     if (!id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }
-     return id;
-   }
+   function getDeviceId() {}

[NoCoverage] BooleanLiteral
src/firebase.js:55:7
-     if (!id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }
+     if (id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }

[NoCoverage] ConditionalExpression
src/firebase.js:55:7
-     if (!id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }
+     if (true) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }

[NoCoverage] ConditionalExpression
src/firebase.js:55:7
-     if (!id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }
+     if (false) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }

[NoCoverage] BlockStatement
src/firebase.js:55:12
-     if (!id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }
+     if (!id) {}

[NoCoverage] MethodExpression
src/firebase.js:55:28
-     if (!id) { id = 'dev-' + Math.random().toString(36).slice(2,10); localStorage.setItem('device-id', id); }
+     if (!id) { id = 'dev-' + Math.random().toString(36); localStorage.setItem('device-id', id); }

[NoCoverage] BlockStatement
src/firebase.js:69:28
-   async function fbGet(path) {
-     try {
-       const url = await _buildUrl(path);
-       const r = await fetch(url, { cache: 'no-store' });
-       if (!r.ok) return null;
-       return await r.json();
-     } catch { return null; }
-   }
+   async function fbGet(path) {}

[NoCoverage] BlockStatement
src/firebase.js:70:7
-     try {
-       const url = await _buildUrl(path);
-       const r = await fetch(url, { cache: 'no-store' });
-       if (!r.ok) return null;
-       return await r.json();
-     } catch { return null; }
+     try {} catch { return null; }

[NoCoverage] ObjectLiteral
src/firebase.js:72:32
-       const r = await fetch(url, { cache: 'no-store' });
+       const r = await fetch(url, {});

[NoCoverage] BooleanLiteral
src/firebase.js:73:9
-       if (!r.ok) return null;
+       if (r.ok) return null;

[NoCoverage] ConditionalExpression
src/firebase.js:73:9
-       if (!r.ok) return null;
+       if (true) return null;

[NoCoverage] ConditionalExpression
src/firebase.js:73:9
-       if (!r.ok) return null;
+       if (false) return null;

[NoCoverage] BlockStatement
src/firebase.js:75:11
-     } catch { return null; }
+     } catch {}

[NoCoverage] BlockStatement
src/firebase.js:78:34
-   async function fbSet(path, data) {
-     try {
-       const url = await _buildUrl(path);
-       const r = await fetch(url, {
-         method: 'PUT',
-         body: JSON.stringify(data),
-         headers: { 'Content-Type': 'application/json' }
-       });
-       return r.ok;
-     } catch { return false; }
-   }
+   async function fbSet(path, data) {}

[NoCoverage] BlockStatement
src/firebase.js:79:7
-     try {
-       const url = await _buildUrl(path);
-       const r = await fetch(url, {
-         method: 'PUT',
-         body: JSON.stringify(data),
-         headers: { 'Content-Type': 'application/json' }
-       });
-       return r.ok;
-     } catch { return false; }
+     try {} catch { return false; }

[NoCoverage] ObjectLiteral
src/firebase.js:81:32
-       const r = await fetch(url, {
-         method: 'PUT',
-         body: JSON.stringify(data),
-         headers: { 'Content-Type': 'application/json' }
-       });
+       const r = await fetch(url, {});

[NoCoverage] ObjectLiteral
src/firebase.js:84:16
-         headers: { 'Content-Type': 'application/json' }
+         headers: {}
