[NoCoverage] BlockStatement
src/firebase.js:87:11
-     } catch { return false; }
+     } catch {}

[NoCoverage] BooleanLiteral
src/firebase.js:87:20
-     } catch { return false; }
+     } catch { return true; }

[NoCoverage] BlockStatement
src/firebase.js:90:31
-   async function fbRemove(path) {
-     try {
-       const url = await _buildUrl(path);
-       const r = await fetch(url, { method: 'DELETE' });
-       return r.ok;
-     } catch { return false; }
-   }
+   async function fbRemove(path) {}

[NoCoverage] BlockStatement
src/firebase.js:91:7
-     try {
-       const url = await _buildUrl(path);
-       const r = await fetch(url, { method: 'DELETE' });
-       return r.ok;
-     } catch { return false; }
+     try {} catch { return false; }

[NoCoverage] ObjectLiteral
src/firebase.js:93:32
-       const r = await fetch(url, { method: 'DELETE' });
+       const r = await fetch(url, {});

[NoCoverage] BlockStatement
src/firebase.js:95:11
-     } catch { return false; }
+     } catch {}

[NoCoverage] BooleanLiteral
src/firebase.js:95:20
-     } catch { return false; }
+     } catch { return true; }

[NoCoverage] BlockStatement
src/firebase.js:104:47
-   export async function clearFirebaseKeys(keys) {
-     if (!keys || keys.length === 0) return;
-     const userPath = getUserPath();
-     if (!userPath) return;
-     const results = await Promise.allSettled(
-       keys.map(async key => {
-         const ok = await fbRemove(`${userPath}/${key}`);
-         if (ok) console.log(`[Firebase] Removed key: ${key}`);
-         else console.warn(`[Firebase] Failed to remove key: ${key}`);
-         return ok;
-       })
-     );
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
-     console.log(`[Firebase] clearFirebaseKeys: ${succeeded}/${keys.length} removed`);
-   }
+   export async function clearFirebaseKeys(keys) {}

[NoCoverage] ConditionalExpression
src/firebase.js:105:7
-     if (!keys || keys.length === 0) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/firebase.js:105:7
-     if (!keys || keys.length === 0) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/firebase.js:105:7
-     if (!keys || keys.length === 0) return;
+     if (!keys && keys.length === 0) return;

[NoCoverage] BooleanLiteral
src/firebase.js:105:7
-     if (!keys || keys.length === 0) return;
+     if (keys || keys.length === 0) return;

[NoCoverage] ConditionalExpression
src/firebase.js:105:16
-     if (!keys || keys.length === 0) return;
+     if (!keys || false) return;

[NoCoverage] EqualityOperator
src/firebase.js:105:16
-     if (!keys || keys.length === 0) return;
+     if (!keys || keys.length !== 0) return;

[NoCoverage] BooleanLiteral
src/firebase.js:107:7
-     if (!userPath) return;
+     if (userPath) return;

[NoCoverage] ConditionalExpression
src/firebase.js:107:7
-     if (!userPath) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/firebase.js:107:7
-     if (!userPath) return;
+     if (false) return;

[NoCoverage] BlockStatement
src/firebase.js:109:27
-       keys.map(async key => {
-         const ok = await fbRemove(`${userPath}/${key}`);
-         if (ok) console.log(`[Firebase] Removed key: ${key}`);
-         else console.warn(`[Firebase] Failed to remove key: ${key}`);
-         return ok;
-       })
+       keys.map(async key => {})

[NoCoverage] ConditionalExpression
src/firebase.js:111:11
-         if (ok) console.log(`[Firebase] Removed key: ${key}`);
+         if (true) console.log(`[Firebase] Removed key: ${key}`);

[NoCoverage] ConditionalExpression
src/firebase.js:111:11
-         if (ok) console.log(`[Firebase] Removed key: ${key}`);
+         if (false) console.log(`[Firebase] Removed key: ${key}`);

[NoCoverage] MethodExpression
src/firebase.js:116:21
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.length;

[NoCoverage] ArrowFunction
src/firebase.js:116:36
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.filter(() => undefined).length;

[NoCoverage] ConditionalExpression
src/firebase.js:116:41
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.filter(r => true).length;

[NoCoverage] ConditionalExpression
src/firebase.js:116:41
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.filter(r => false).length;

[NoCoverage] LogicalOperator
src/firebase.js:116:41
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.filter(r => r.status === 'fulfilled' || r.value).length;

[NoCoverage] ConditionalExpression
src/firebase.js:116:41
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.filter(r => true && r.value).length;

[NoCoverage] EqualityOperator
src/firebase.js:116:41
-     const succeeded = results.filter(r => r.status === 'fulfilled' && r.value).length;
+     const succeeded = results.filter(r => r.status !== 'fulfilled' && r.value).length;

[NoCoverage] BlockStatement
src/firebase.js:120:40
-   export async function syncToFirebase() {
-     try {
-       const userPath = getUserPath();
-       if (!userPath) {
-         console.log('[Firebase] syncToFirebase: no auth + no fallback, skipping');
-         return false;
-       }
-       const payload = {};
-       SYNC_KEYS.forEach(k => {
-         const v = DB.get(k);
-         if (v == null) return;
-         payload[k] = v;
-       });
-       payload['_device'] = getDeviceId();
-       payload['_ts'] = Date.now();
-       const ok = await fbSet(userPath, payload);
-       return ok;
-     } catch (e) { console.warn('Firebase sync failed:', e); return false; }
-   }
+   export async function syncToFirebase() {}

[NoCoverage] BlockStatement
src/firebase.js:121:7
-     try {
-       const userPath = getUserPath();
-       if (!userPath) {
-         console.log('[Firebase] syncToFirebase: no auth + no fallback, skipping');
-         return false;
-       }
-       const payload = {};
-       SYNC_KEYS.forEach(k => {
-         const v = DB.get(k);
-         if (v == null) return;
-         payload[k] = v;
-       });
-       payload['_device'] = getDeviceId();
-       payload['_ts'] = Date.now();
-       const ok = await fbSet(userPath, payload);
-       return ok;
-     } catch (e) { console.warn('Firebase sync failed:', e); return false; }
+     try {} catch (e) { console.warn('Firebase sync failed:', e); return false; }

[NoCoverage] BooleanLiteral
src/firebase.js:123:9
-       if (!userPath) {
+       if (userPath) {

[NoCoverage] ConditionalExpression
src/firebase.js:123:9
-       if (!userPath) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:123:9
-       if (!userPath) {
+       if (false) {

[NoCoverage] BlockStatement
src/firebase.js:123:20
-       if (!userPath) {
-         console.log('[Firebase] syncToFirebase: no auth + no fallback, skipping');
-         return false;
-       }
+       if (!userPath) {}

[NoCoverage] BooleanLiteral
src/firebase.js:125:14
-         return false;
+         return true;

[NoCoverage] BlockStatement
src/firebase.js:128:28
-       SYNC_KEYS.forEach(k => {
-         const v = DB.get(k);
-         if (v == null) return;
-         payload[k] = v;
-       });
+       SYNC_KEYS.forEach(k => {});

[NoCoverage] ConditionalExpression
src/firebase.js:130:11
-         if (v == null) return;
+         if (true) return;

[NoCoverage] ConditionalExpression
src/firebase.js:130:11
-         if (v == null) return;
+         if (false) return;

[NoCoverage] EqualityOperator
src/firebase.js:130:11
-         if (v == null) return;
+         if (v != null) return;

[NoCoverage] BlockStatement
src/firebase.js:137:15
-     } catch (e) { console.warn('Firebase sync failed:', e); return false; }
+     } catch (e) {}

[NoCoverage] BooleanLiteral
src/firebase.js:137:66
-     } catch (e) { console.warn('Firebase sync failed:', e); return false; }
+     } catch (e) { console.warn('Firebase sync failed:', e); return true; }

[NoCoverage] ConditionalExpression
src/firebase.js:141:7
-     if (window._suppressFirebaseSync) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:141:7
-     if (window._suppressFirebaseSync) {
+     if (false) {

[NoCoverage] BlockStatement
src/firebase.js:141:37
-     if (window._suppressFirebaseSync) {
-       console.log('[Firebase] Sync suppressed, skipping restore');
-       return false;
-     }
+     if (window._suppressFirebaseSync) {}

[NoCoverage] BooleanLiteral
src/firebase.js:143:12
-       return false;
+       return true;

[NoCoverage] ConditionalExpression
src/firebase.js:146:7
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:146:7
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
+     if (false) {

[NoCoverage] LogicalOperator
src/firebase.js:146:7
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
+     if (suppressUntil || Date.now() < Number(suppressUntil)) {

[NoCoverage] ConditionalExpression
src/firebase.js:146:24
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
+     if (suppressUntil && true) {

[NoCoverage] EqualityOperator
src/firebase.js:146:24
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
+     if (suppressUntil && Date.now() <= Number(suppressUntil)) {

[NoCoverage] EqualityOperator
src/firebase.js:146:24
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
+     if (suppressUntil && Date.now() >= Number(suppressUntil)) {

[NoCoverage] BlockStatement
src/firebase.js:146:60
-     if (suppressUntil && Date.now() < Number(suppressUntil)) {
-       console.log('[Firebase] Sync suppressed post-reset until', new Date(Number(suppressUntil)).toISOString());
-       return false;
-     }
+     if (suppressUntil && Date.now() < Number(suppressUntil)) {}

[NoCoverage] BooleanLiteral
src/firebase.js:148:12
-       return false;
+       return true;

[NoCoverage] BooleanLiteral
src/firebase.js:152:9
-       if (!userPath) {
+       if (userPath) {

[NoCoverage] ConditionalExpression
src/firebase.js:152:9
-       if (!userPath) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:152:9
-       if (!userPath) {
+       if (false) {

[NoCoverage] BlockStatement
src/firebase.js:152:20
-       if (!userPath) {
-         console.log('[Firebase] syncFromFirebase: no auth + no fallback, skipping');
-         return false;
-       }
+       if (!userPath) {}

[NoCoverage] BooleanLiteral
src/firebase.js:154:14
-         return false;
+         return true;

[NoCoverage] BooleanLiteral
src/firebase.js:157:9
-       if (!remote) return false;
+       if (remote) return false;

[NoCoverage] ConditionalExpression
src/firebase.js:157:9
-       if (!remote) return false;
+       if (true) return false;

[NoCoverage] ConditionalExpression
src/firebase.js:157:9
-       if (!remote) return false;
+       if (false) return false;

[NoCoverage] BooleanLiteral
src/firebase.js:157:25
-       if (!remote) return false;
+       if (!remote) return true;

[NoCoverage] BlockStatement
src/firebase.js:160:33
-       suppressInvalidations(() => {
-         SYNC_KEYS.forEach(k => {
-           if (remote[k] == null) return;
-           const local = DB.get(k);
-           if (local == null) { DB.set(k, remote[k]); return; }
-           // Merge objects (weights, kcals, prots, etc.).
-           // Strategy: union of remote + local, with local taking priority on conflicts.
-           // KNOWN LIMITATION: if the same date was edited on two devices, local always wins
-           // regardless of which edit was more recent. Proper last-write-wins requires
-           // per-entry timestamps — deferred until multi-device use becomes a real concern.
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
-             DB.set(k, Object.assign({}, remote[k], local));
-           } else if (Array.isArray(remote[k])) {
-             // For arrays (logs), merge by timestamp uniqueness
-             const localArr = Array.isArray(local) ? local : [];
-             const remoteArr = remote[k];
-             const tsSet = new Set(localArr.map(e => e.ts));
-             const merged = [...localArr];
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
-             DB.set(k, merged.slice(0, 5000));
-           } else {
-             // Scalar — keep local
-           }
-         });
-       });
+       suppressInvalidations(() => {})

[NoCoverage] BlockStatement
src/firebase.js:161:30
-         SYNC_KEYS.forEach(k => {
-           if (remote[k] == null) return;
-           const local = DB.get(k);
-           if (local == null) { DB.set(k, remote[k]); return; }
-           // Merge objects (weights, kcals, prots, etc.).
-           // Strategy: union of remote + local, with local taking priority on conflicts.
-           // KNOWN LIMITATION: if the same date was edited on two devices, local always wins
-           // regardless of which edit was more recent. Proper last-write-wins requires
-           // per-entry timestamps — deferred until multi-device use becomes a real concern.
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
-             DB.set(k, Object.assign({}, remote[k], local));
-           } else if (Array.isArray(remote[k])) {
-             // For arrays (logs), merge by timestamp uniqueness
-             const localArr = Array.isArray(local) ? local : [];
-             const remoteArr = remote[k];
-             const tsSet = new Set(localArr.map(e => e.ts));
-             const merged = [...localArr];
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
-             DB.set(k, merged.slice(0, 5000));
-           } else {
-             // Scalar — keep local
-           }
-         });
+         SYNC_KEYS.forEach(k => {});

[NoCoverage] ConditionalExpression
src/firebase.js:162:13
-           if (remote[k] == null) return;
+           if (true) return;

[NoCoverage] ConditionalExpression
src/firebase.js:162:13
-           if (remote[k] == null) return;
+           if (false) return;

[NoCoverage] EqualityOperator
src/firebase.js:162:13
-           if (remote[k] == null) return;
+           if (remote[k] != null) return;

[NoCoverage] ConditionalExpression
src/firebase.js:164:13
-           if (local == null) { DB.set(k, remote[k]); return; }
+           if (true) { DB.set(k, remote[k]); return; }

[NoCoverage] ConditionalExpression
src/firebase.js:164:13
-           if (local == null) { DB.set(k, remote[k]); return; }
+           if (false) { DB.set(k, remote[k]); return; }

[NoCoverage] EqualityOperator
src/firebase.js:164:13
-           if (local == null) { DB.set(k, remote[k]); return; }
+           if (local != null) { DB.set(k, remote[k]); return; }

[NoCoverage] BlockStatement
src/firebase.js:164:28
-           if (local == null) { DB.set(k, remote[k]); return; }
+           if (local == null) {}

[NoCoverage] ConditionalExpression
src/firebase.js:171:13
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:171:13
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
+           if (false) {

[NoCoverage] LogicalOperator
src/firebase.js:171:13
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
+           if (typeof remote[k] === 'object' || !Array.isArray(remote[k])) {

[NoCoverage] ConditionalExpression
src/firebase.js:171:13
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
+           if (true && !Array.isArray(remote[k])) {

[NoCoverage] EqualityOperator
src/firebase.js:171:13
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
+           if (typeof remote[k] !== 'object' && !Array.isArray(remote[k])) {

[NoCoverage] BooleanLiteral
src/firebase.js:171:46
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
+           if (typeof remote[k] === 'object' && Array.isArray(remote[k])) {

[NoCoverage] BlockStatement
src/firebase.js:171:73
-           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {
-             DB.set(k, Object.assign({}, remote[k], local));
-           } else if (Array.isArray(remote[k])) {
+           if (typeof remote[k] === 'object' && !Array.isArray(remote[k])) {} else if (Array.isArray(remote[k])) {

[NoCoverage] ConditionalExpression
src/firebase.js:173:20
-           } else if (Array.isArray(remote[k])) {
+           } else if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:173:20
-           } else if (Array.isArray(remote[k])) {
+           } else if (false) {

[NoCoverage] BlockStatement
src/firebase.js:173:46
-           } else if (Array.isArray(remote[k])) {
-             // For arrays (logs), merge by timestamp uniqueness
-             const localArr = Array.isArray(local) ? local : [];
-             const remoteArr = remote[k];
-             const tsSet = new Set(localArr.map(e => e.ts));
-             const merged = [...localArr];
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
-             DB.set(k, merged.slice(0, 5000));
-           } else {
+           } else if (Array.isArray(remote[k])) {} else {

[NoCoverage] ArrayDeclaration
src/firebase.js:175:59
-             const localArr = Array.isArray(local) ? local : [];
+             const localArr = Array.isArray(local) ? local : ["Stryker was here"];

[NoCoverage] ArrowFunction
src/firebase.js:177:46
-             const tsSet = new Set(localArr.map(e => e.ts));
+             const tsSet = new Set(localArr.map(() => undefined));

[NoCoverage] ArrayDeclaration
src/firebase.js:178:26
-             const merged = [...localArr];
+             const merged = [];

[NoCoverage] BlockStatement
src/firebase.js:179:34
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
+             remoteArr.forEach(e => {});

[NoCoverage] BooleanLiteral
src/firebase.js:179:40
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
+             remoteArr.forEach(e => { if (tsSet.has(e.ts)) merged.push(e); });

[NoCoverage] ConditionalExpression
src/firebase.js:179:40
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
+             remoteArr.forEach(e => { if (true) merged.push(e); });

[NoCoverage] ConditionalExpression
src/firebase.js:179:40
-             remoteArr.forEach(e => { if (!tsSet.has(e.ts)) merged.push(e); });
+             remoteArr.forEach(e => { if (false) merged.push(e); });

[NoCoverage] MethodExpression
src/firebase.js:180:11
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged;

[NoCoverage] ArrowFunction
src/firebase.js:180:23
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort(() => undefined);

[NoCoverage] ArithmeticOperator
src/firebase.js:180:33
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (b.ts || 0) + (a.ts || 0));

[NoCoverage] ConditionalExpression
src/firebase.js:180:34
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (true) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/firebase.js:180:34
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (false) - (a.ts || 0));

[NoCoverage] LogicalOperator
src/firebase.js:180:34
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (b.ts && 0) - (a.ts || 0));

[NoCoverage] ConditionalExpression
src/firebase.js:180:48
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (b.ts || 0) - (true));

[NoCoverage] ConditionalExpression
src/firebase.js:180:48
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (b.ts || 0) - (false));

[NoCoverage] LogicalOperator
src/firebase.js:180:48
-             merged.sort((a, b) => (b.ts || 0) - (a.ts || 0));
+             merged.sort((a, b) => (b.ts || 0) - (a.ts && 0));

[NoCoverage] MethodExpression
src/firebase.js:181:21
-             DB.set(k, merged.slice(0, 5000));
+             DB.set(k, merged);

[NoCoverage] BlockStatement
src/firebase.js:190:9
-       try {
-         const { applyTombstoneFilterToAll } = await import('./util/tombstones.js');
-         applyTombstoneFilterToAll();
-       } catch (e) {
+       try {} catch (e) {

[NoCoverage] BlockStatement
src/firebase.js:193:17
-       } catch (e) {
-         // Tombstones module is optional during transition — non-fatal.
-         console.warn('[Firebase] tombstone filter skipped:', e?.message);
-       }
+       } catch (e) {}

[NoCoverage] OptionalChaining
src/firebase.js:195:60
-         console.warn('[Firebase] tombstone filter skipped:', e?.message);
+         console.warn('[Firebase] tombstone filter skipped:', e.message);

[NoCoverage] MethodExpression
src/firebase.js:199:24
-       const remoteKeys = Object.keys(remote).filter(k => !k.startsWith('_'));
+       const remoteKeys = Object.keys(remote);

[NoCoverage] ArrowFunction
src/firebase.js:199:51
-       const remoteKeys = Object.keys(remote).filter(k => !k.startsWith('_'));
+       const remoteKeys = Object.keys(remote).filter(() => undefined);

[NoCoverage] BooleanLiteral
src/firebase.js:199:56
-       const remoteKeys = Object.keys(remote).filter(k => !k.startsWith('_'));
+       const remoteKeys = Object.keys(remote).filter(k => k.startsWith('_'));

[NoCoverage] MethodExpression
src/firebase.js:199:57
-       const remoteKeys = Object.keys(remote).filter(k => !k.startsWith('_'));
+       const remoteKeys = Object.keys(remote).filter(k => !k.endsWith('_'));

[NoCoverage] MethodExpression
src/firebase.js:200:25
-       const unknownKeys = remoteKeys.filter(k => !SYNC_KEYS.includes(k));
+       const unknownKeys = remoteKeys;

[NoCoverage] ArrowFunction
src/firebase.js:200:43
-       const unknownKeys = remoteKeys.filter(k => !SYNC_KEYS.includes(k));
+       const unknownKeys = remoteKeys.filter(() => undefined);

[NoCoverage] BooleanLiteral
src/firebase.js:200:48
-       const unknownKeys = remoteKeys.filter(k => !SYNC_KEYS.includes(k));
+       const unknownKeys = remoteKeys.filter(k => SYNC_KEYS.includes(k));

[NoCoverage] ConditionalExpression
src/firebase.js:201:9
-       if (unknownKeys.length) console.warn('[Firebase] unknown remote keys (schema drift?):', unknownKeys);
+       if (true) console.warn('[Firebase] unknown remote keys (schema drift?):', unknownKeys);

[NoCoverage] ConditionalExpression
src/firebase.js:201:9
-       if (unknownKeys.length) console.warn('[Firebase] unknown remote keys (schema drift?):', unknownKeys);
+       if (false) console.warn('[Firebase] unknown remote keys (schema drift?):', unknownKeys);

[NoCoverage] BooleanLiteral
src/firebase.js:202:12
-       return true;
+       return false;

[NoCoverage] BlockStatement
src/firebase.js:203:15
-     } catch (e) { console.warn('Firebase load failed:', e); return false; }
+     } catch (e) {}

[NoCoverage] BooleanLiteral
src/firebase.js:203:66
-     } catch (e) { console.warn('Firebase load failed:', e); return false; }
+     } catch (e) { console.warn('Firebase load failed:', e); return true; }

[NoCoverage] BlockStatement
src/firebase.js:246:65
-     if (SYNC_KEYS.includes(key) && !window._suppressFirebaseSync) {
-       clearTimeout(_syncTimer);
-       _syncTimer = setTimeout(syncToFirebase, 3000);
-     }
+     if (SYNC_KEYS.includes(key) && !window._suppressFirebaseSync) {}

[NoCoverage] BlockStatement
src/firebase.js:255:42
-   export async function initFirebaseSync() {
-     const synced = await syncFromFirebase();
-     if (synced) {
-       // Push merged local state back so any locally-saved data that missed a previous
-       // sync (e.g. app closed before the 3s debounce fired) is written to Firebase now.
-       await syncToFirebase();
-       toast('☁ Date sincronizate', 'var(--green)');
-     }
-   }
+   export async function initFirebaseSync() {}

[NoCoverage] ConditionalExpression
src/firebase.js:257:7
-     if (synced) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/firebase.js:257:7
-     if (synced) {
+     if (false) {

[NoCoverage] BlockStatement
src/firebase.js:257:15
-     if (synced) {
-       // Push merged local state back so any locally-saved data that missed a previous
-       // sync (e.g. app closed before the 3s debounce fired) is written to Firebase now.
-       await syncToFirebase();
-       toast('☁ Date sincronizate', 'var(--green)');
-     }
+     if (synced) {}

[Survived] BlockStatement
src/firebase.js:63:36
-   async function _buildUrl(fullPath) {
-     const token = await getIdToken().catch(() => null);
-     const auth = token ? `?auth=${encodeURIComponent(token)}` : '';
-     return `${FIREBASE_URL}/${fullPath}.json${auth}`;
-   }
+   async function _buildUrl(fullPath) {}
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns already-populated when dest has data
  and 5 more tests!

[Survived] ArrowFunction
src/firebase.js:64:42
-     const token = await getIdToken().catch(() => null);
+     const token = await getIdToken().catch(() => undefined);
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns already-populated when dest has data
  and 5 more tests!

[Survived] BlockStatement
src/firebase.js:100:46
-   export async function buildAuthUrl(fullPath) {
-     return _buildUrl(fullPath);
-   }
+   export async function buildAuthUrl(fullPath) {}
Tests ran:
    auth-path-migration — happy path migrates source → dest when dest empty
    auth-path-migration — happy path idempotent — second call returns skipped
    auth-path-migration — edge cases returns already-populated when dest has data
  and 5 more tests!

[Survived] ConditionalExpression
src/firebase.js:219:7
-     if (!window._directorCache) return;
+     if (false) return;
Tests ran:
    Data Cleanup should clear test residue keys only
    Data Cleanup fullReset should clear everything
    DataCleanup — Firebase aware should set _suppressFirebaseSync flag during reset
  and 14 more tests!

[Survived] ConditionalExpression
src/firebase.js:224:9
-       if (window._directorCache) window._directorCache.invalidate();
+       if (true) window._directorCache.invalidate();
Tests ran:
    DataCleanup — Firebase aware resetTestData should schedule cache invalidation via debounce
    debounce — outside batch mode coalesces rapid successive DB.set calls into 1 invalidation after 250ms
    debounce — outside batch mode second burst after debounce window produces a second invalidation

[Survived] BooleanLiteral
src/firebase.js:235:30
-         _pendingInvalidation = false;
+         _pendingInvalidation = true;
Tests ran:
    suppressInvalidations — batch mode folds 11 DB.set calls on relevant keys into 1 invalidation
    suppressInvalidations — batch mode nested suppressInvalidations flushes once at outermost exit
    suppressInvalidations — batch mode propagates thrown errors but still flushes pending invalidation

[Survived] ConditionalExpression
src/firebase.js:236:11
-         if (window._directorCache) window._directorCache.invalidate();
+         if (true) window._directorCache.invalidate();
Tests ran:
    suppressInvalidations — batch mode folds 11 DB.set calls on relevant keys into 1 invalidation
    suppressInvalidations — batch mode nested suppressInvalidations flushes once at outermost exit
    suppressInvalidations — batch mode propagates thrown errors but still flushes pending invalidation

[Survived] BooleanLiteral
src/firebase.js:246:34
-     if (SYNC_KEYS.includes(key) && !window._suppressFirebaseSync) {
+     if (SYNC_KEYS.includes(key) && window._suppressFirebaseSync) {
Tests ran:
    suppressInvalidations — batch mode folds 11 DB.set calls on relevant keys into 1 invalidation
    suppressInvalidations — batch mode nested suppressInvalidations flushes once at outermost exit
    suppressInvalidations — batch mode propagates thrown errors but still flushes pending invalidation
  and 2 more tests!

[Survived] ConditionalExpression
src/firebase.js:246:7
-     if (SYNC_KEYS.includes(key) && !window._suppressFirebaseSync) {
+     if (true) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 29 more tests!

[Survived] ConditionalExpression
src/firebase.js:246:7
-     if (SYNC_KEYS.includes(key) && !window._suppressFirebaseSync) {
+     if (false) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 29 more tests!
