[Survived] LogicalOperator
src/firebase.js:246:7
-     if (SYNC_KEYS.includes(key) && !window._suppressFirebaseSync) {
+     if (SYNC_KEYS.includes(key) || !window._suppressFirebaseSync) {
Tests ran:
    CoachDirector — Equipment validation should NEVER recommend 26kg for DB Shoulder Press
    CoachDirector — Equipment validation should NEVER recommend 35kg for Pec Deck
    CoachDirector — CUT phase logic should suppress trend messages in AUTO + before July 20
  and 29 more tests!

[Survived] BooleanLiteral
src/firebase.js:214:28
-   let _pendingInvalidation = false;
+   let _pendingInvalidation = true;
Ran all tests for this mutant.

[NoCoverage] ConditionalExpression
src/inject.js:6:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/inject.js:6:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
+     if (false) return;

[NoCoverage] EqualityOperator
src/inject.js:6:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
+     if (localStorage.getItem('DEV_INJECT_BASELINE') === 'true') return;

[NoCoverage] ConditionalExpression
src/inject.js:7:20
-     const existing = DB.get('logs') || [];
+     const existing = true;

[NoCoverage] ConditionalExpression
src/inject.js:7:20
-     const existing = DB.get('logs') || [];
+     const existing = false;

[NoCoverage] LogicalOperator
src/inject.js:7:20
-     const existing = DB.get('logs') || [];
+     const existing = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/inject.js:7:38
-     const existing = DB.get('logs') || [];
+     const existing = DB.get('logs') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/inject.js:9:23
-     const hasRealData = existing.some(l => !l.baseline);
+     const hasRealData = existing.every(l => !l.baseline);

[NoCoverage] ArrowFunction
src/inject.js:9:37
-     const hasRealData = existing.some(l => !l.baseline);
+     const hasRealData = existing.some(() => undefined);

[NoCoverage] BooleanLiteral
src/inject.js:9:42
-     const hasRealData = existing.some(l => !l.baseline);
+     const hasRealData = existing.some(l => l.baseline);

[NoCoverage] MethodExpression
src/inject.js:10:23
-     const hasBaseline = existing.some(l => l.baseline);
+     const hasBaseline = existing.every(l => l.baseline);

[NoCoverage] ArrowFunction
src/inject.js:10:37
-     const hasBaseline = existing.some(l => l.baseline);
+     const hasBaseline = existing.some(() => undefined);

[NoCoverage] ConditionalExpression
src/inject.js:11:7
-     if (hasRealData || hasBaseline) return; // already has data
+     if (true) return; // already has data

[NoCoverage] ConditionalExpression
src/inject.js:11:7
-     if (hasRealData || hasBaseline) return; // already has data
+     if (false) return; // already has data

[NoCoverage] LogicalOperator
src/inject.js:11:7
-     if (hasRealData || hasBaseline) return; // already has data
+     if (hasRealData && hasBaseline) return; // already has data

[NoCoverage] MethodExpression
src/inject.js:14:25
-     const d = new Date(); d.setDate(d.getDate() - 3);
+     const d = new Date(); d.setTime(d.getDate() - 3);

[NoCoverage] ArithmeticOperator
src/inject.js:14:35
-     const d = new Date(); d.setDate(d.getDate() - 3);
+     const d = new Date(); d.setDate(d.getDate() + 3);

[NoCoverage] ArrayDeclaration
src/inject.js:16:16
-     const logs = [];
+     const logs = ["Stryker was here"];

[NoCoverage] ObjectLiteral
src/inject.js:19:5
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-0,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:19:68
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-0,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t + 0,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:19:80
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-0,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-0,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:19:100
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-0,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-0,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:20:5
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-1000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:20:68
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-1000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t + 1000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:20:83
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-1000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-1000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:20:103
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-1000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-1000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:21:5
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-2000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:21:68
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-2000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t + 2000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:21:83
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-2000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-2000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:21:103
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-2000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-2000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:22:5
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-3000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:22:68
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-3000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t + 3000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:22:83
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-3000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-3000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:22:103
-       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-3000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lat Pulldown',w:64,sets:1,reps:'8',rpe:8,ts:t-3000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:23:5
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-10000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:23:65
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-10000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t + 10000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:23:81
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-10000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-10000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:23:101
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-10000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-10000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:24:5
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-11000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:24:65
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-11000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t + 11000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:24:81
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-11000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-11000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:24:101
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-11000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-11000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:25:5
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-12000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:25:65
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-12000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t + 12000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:25:81
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-12000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-12000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:25:101
-       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-12000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Cable Row',w:72,sets:1,reps:'8',rpe:7,ts:t-12000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:26:5
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-20000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:26:66
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-20000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t + 20000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:26:82
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-20000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-20000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:26:102
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-20000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-20000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:27:5
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-21000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:27:66
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-21000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t + 21000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:27:82
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-21000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-21000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:27:102
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-21000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-21000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:28:5
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-22000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:28:66
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-22000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t + 22000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:28:82
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-22000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-22000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:28:102
-       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-22000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Face Pulls',w:41,sets:1,reps:'8',rpe:6,ts:t-22000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:29:5
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-30000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:29:72
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-30000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t + 30000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:29:88
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-30000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-30000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:29:108
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-30000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-30000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:30:5
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-31000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:30:72
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-31000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t + 31000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:30:88
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-31000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-31000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:30:108
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-31000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-31000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:31:5
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-32000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:31:72
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-32000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t + 32000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:31:88
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-32000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-32000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:31:108
-       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-32000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Curl',w:10,sets:1,reps:'10',rpe:7,ts:t-32000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:32:5
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-40000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:32:70
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-40000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t + 40000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:32:86
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-40000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-40000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:32:106
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-40000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-40000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:33:5
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-41000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:33:70
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-41000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t + 41000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:33:86
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-41000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-41000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:33:106
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-41000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-41000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:34:5
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-42000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:34:70
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-42000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t + 42000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:34:86
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-42000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-42000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:34:106
-       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-42000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Bayesian Curl',w:18,sets:1,reps:'10',rpe:8,ts:t-42000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:35:5
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-50000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:35:73
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-50000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t + 50000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:35:89
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-50000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-50000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:35:109
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-50000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-50000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:36:5
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-51000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:36:73
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-51000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t + 51000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:36:89
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-51000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-51000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:36:109
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-51000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-51000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:37:5
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-52000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:37:73
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-52000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t + 52000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:37:89
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-52000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-52000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:37:109
-       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-52000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'DB Shoulder Press',w:20,sets:1,reps:'8',rpe:7,ts:t-52000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:38:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-60000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:38:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-60000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t + 60000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:38:87
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-60000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-60000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:38:107
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-60000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-60000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:39:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-61000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:39:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-61000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t + 61000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:39:87
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-61000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-61000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:39:107
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-61000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-61000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:40:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-62000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:40:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-62000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t + 62000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:40:87
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-62000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-62000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:40:107
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-62000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-62000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:41:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-63000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:41:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-63000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t + 63000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:41:87
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-63000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-63000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:41:107
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-63000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'10',rpe:8,ts:t-63000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:42:5
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-70000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:42:69
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-70000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t + 70000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:42:85
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-70000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-70000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:42:105
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-70000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-70000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:43:5
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-71000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:43:69
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-71000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t + 71000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:43:85
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-71000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-71000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:43:105
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-71000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-71000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:44:5
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-72000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:44:69
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-72000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t + 72000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:44:85
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-72000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-72000,session:t + 86400000,baseline:true},
