[NoCoverage] BooleanLiteral
src/inject.js:44:105
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-72000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-72000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:45:5
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-73000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:45:69
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-73000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t + 73000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:45:85
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-73000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-73000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:45:105
-       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-73000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Rear Delt Fly',w:9,sets:1,reps:'10',rpe:7,ts:t-73000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:46:5
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-80000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:46:72
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-80000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t + 80000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:46:88
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-80000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-80000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:46:108
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-80000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-80000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:47:5
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-81000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:47:72
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-81000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t + 81000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:47:88
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-81000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-81000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:47:108
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-81000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-81000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:48:5
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-82000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:48:72
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-82000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t + 82000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:48:88
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-82000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-82000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:48:108
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-82000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-82000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:49:5
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-83000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:49:72
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-83000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t + 83000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:49:88
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-83000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-83000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:49:108
-       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-83000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Incline DB Press',w:30,sets:1,reps:'8',rpe:8,ts:t-83000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:50:5
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-90000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:50:77
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-90000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t + 90000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:50:93
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-90000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-90000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:50:113
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-90000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-90000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:51:5
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-91000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:51:77
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-91000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t + 91000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:51:93
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-91000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-91000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:51:113
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-91000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-91000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:52:5
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-92000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:52:77
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-92000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t + 92000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:52:93
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-92000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-92000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:52:113
-       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-92000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pec Deck / Cable Fly',w:32,sets:1,reps:'10',rpe:7,ts:t-92000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:53:5
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-100000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:53:73
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-100000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t + 100000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:53:90
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-100000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-100000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:53:110
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-100000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-100000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:54:5
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-101000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:54:73
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-101000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t + 101000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:54:90
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-101000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-101000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:54:110
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-101000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-101000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:55:5
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-102000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:55:73
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-102000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t + 102000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:55:90
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-102000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-102000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:55:110
-       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-102000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Overhead Triceps',w:41,sets:1,reps:'10',rpe:7,ts:t-102000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:56:5
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-110000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:56:65
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-110000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t + 110000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:56:82
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-110000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-110000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:56:102
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-110000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-110000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:57:5
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-111000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:57:65
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-111000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t + 111000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:57:82
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-111000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-111000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:57:102
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-111000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-111000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:58:5
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-112000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:58:65
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-112000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t + 112000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:58:82
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-112000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-112000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:58:102
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-112000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-112000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:59:5
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-120000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:59:65
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-120000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t + 120000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:59:82
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-120000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-120000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:59:102
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-120000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-120000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:60:5
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-121000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:60:65
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-121000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t + 121000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:60:82
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-121000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-121000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:60:102
-       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-121000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Pushdown',w:41,sets:1,reps:'10',rpe:7,ts:t-121000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:61:5
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-130000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:61:67
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-130000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t + 130000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:61:84
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-130000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-130000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:61:104
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-130000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-130000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:62:5
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-131000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:62:67
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-131000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t + 131000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:62:84
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-131000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-131000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:62:104
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-131000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-131000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:63:5
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-132000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:63:67
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-132000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t + 132000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:63:84
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-132000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-132000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:63:104
-       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-132000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Press',w:150,sets:1,reps:'12',rpe:4,ts:t-132000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:64:5
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-140000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:64:71
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-140000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t + 140000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:64:88
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-140000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-140000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:64:108
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-140000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-140000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:65:5
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-141000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:65:71
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-141000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t + 141000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:65:88
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-141000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-141000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:65:108
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-141000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-141000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:66:5
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-142000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:66:71
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-142000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t + 142000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:66:88
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-142000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-142000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:66:108
-       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-142000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Extension',w:100,sets:1,reps:'10',rpe:8,ts:t-142000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:67:5
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-150000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:67:66
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-150000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t + 150000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:67:83
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-150000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-150000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:67:103
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-150000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-150000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:68:5
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-151000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:68:66
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-151000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t + 151000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:68:83
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-151000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-151000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:68:103
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-151000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-151000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:69:5
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-152000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:69:66
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-152000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t + 152000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:69:83
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-152000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-152000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:69:103
-       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-152000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Leg Curl',w:100,sets:1,reps:'10',rpe:7,ts:t-152000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:70:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-160000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:70:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-160000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t + 160000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:70:88
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-160000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-160000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:70:108
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-160000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-160000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:71:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-161000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:71:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-161000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t + 161000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:71:88
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-161000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-161000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:71:108
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-161000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-161000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:72:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-162000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:72:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-162000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t + 162000,session:t-86400000,baseline:true},

[NoCoverage] ArithmeticOperator
src/inject.js:72:88
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-162000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-162000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:72:108
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-162000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-162000,session:t-86400000,baseline:false},

[NoCoverage] ObjectLiteral
src/inject.js:73:5
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-163000,session:t-86400000,baseline:true},
+       {},

[NoCoverage] ArithmeticOperator
src/inject.js:73:71
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-163000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t + 163000,session:t-86400000,baseline:true},
