[NoCoverage] ArithmeticOperator
src/inject.js:73:88
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-163000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-163000,session:t + 86400000,baseline:true},

[NoCoverage] BooleanLiteral
src/inject.js:73:108
-       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-163000,session:t-86400000,baseline:true},
+       {date:baseDate,ex:'Lateral Raises',w:10,sets:1,reps:'12',rpe:8,ts:t-163000,session:t-86400000,baseline:false},

[NoCoverage] BooleanLiteral
src/inject.js:77:29
-     DB.set('onboarding-done', true);
+     DB.set('onboarding-done', false);

[NoCoverage] BlockStatement
src/inject.js:80:36
-   export function injectMFPWeights() {
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
-     const ws = DB.get('weights') || {};
-     // Only inject if we don't have historical data
-     const dates = Object.keys(ws).sort();
-     const hasHistory = dates.some(d => d < '2026-04-20');
-     if (hasHistory) return;
-     
-     // Daniel's MFP weight history (from imported CSV)
-     const mfpWeights = {
-       '2026-04-15': 112.0,
-       '2026-04-16': 111.8,
-       '2026-04-17': 111.4,
-       '2026-04-18': 110.8,
-       '2026-04-19': 110.2,
-     };
-     
-     Object.assign(ws, mfpWeights);
-     DB.set('weights', ws);
-   }
+   export function injectMFPWeights() {}

[NoCoverage] ConditionalExpression
src/inject.js:81:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/inject.js:81:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
+     if (false) return;

[NoCoverage] EqualityOperator
src/inject.js:81:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return;
+     if (localStorage.getItem('DEV_INJECT_BASELINE') === 'true') return;

[NoCoverage] ConditionalExpression
src/inject.js:82:14
-     const ws = DB.get('weights') || {};
+     const ws = true;

[NoCoverage] ConditionalExpression
src/inject.js:82:14
-     const ws = DB.get('weights') || {};
+     const ws = false;

[NoCoverage] LogicalOperator
src/inject.js:82:14
-     const ws = DB.get('weights') || {};
+     const ws = DB.get('weights') && {};

[NoCoverage] MethodExpression
src/inject.js:84:17
-     const dates = Object.keys(ws).sort();
+     const dates = Object.keys(ws);

[NoCoverage] MethodExpression
src/inject.js:85:22
-     const hasHistory = dates.some(d => d < '2026-04-20');
+     const hasHistory = dates.every(d => d < '2026-04-20');

[NoCoverage] ArrowFunction
src/inject.js:85:33
-     const hasHistory = dates.some(d => d < '2026-04-20');
+     const hasHistory = dates.some(() => undefined);

[NoCoverage] ConditionalExpression
src/inject.js:85:38
-     const hasHistory = dates.some(d => d < '2026-04-20');
+     const hasHistory = dates.some(d => true);

[NoCoverage] ConditionalExpression
src/inject.js:85:38
-     const hasHistory = dates.some(d => d < '2026-04-20');
+     const hasHistory = dates.some(d => false);

[NoCoverage] EqualityOperator
src/inject.js:85:38
-     const hasHistory = dates.some(d => d < '2026-04-20');
+     const hasHistory = dates.some(d => d <= '2026-04-20');

[NoCoverage] EqualityOperator
src/inject.js:85:38
-     const hasHistory = dates.some(d => d < '2026-04-20');
+     const hasHistory = dates.some(d => d >= '2026-04-20');

[NoCoverage] ConditionalExpression
src/inject.js:86:7
-     if (hasHistory) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/inject.js:86:7
-     if (hasHistory) return;
+     if (false) return;

[NoCoverage] ObjectLiteral
src/inject.js:89:22
-     const mfpWeights = {
-       '2026-04-15': 112.0,
-       '2026-04-16': 111.8,
-       '2026-04-17': 111.4,
-       '2026-04-18': 110.8,
-       '2026-04-19': 110.2,
-     };
+     const mfpWeights = {};

[NoCoverage] ConditionalExpression
src/inject.js:102:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: true };
+     if (true) return { added: 0, had21: true, had22: true };

[NoCoverage] ConditionalExpression
src/inject.js:102:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: true };
+     if (false) return { added: 0, had21: true, had22: true };

[NoCoverage] EqualityOperator
src/inject.js:102:7
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: true };
+     if (localStorage.getItem('DEV_INJECT_BASELINE') === 'true') return { added: 0, had21: true, had22: true };

[NoCoverage] ObjectLiteral
src/inject.js:102:70
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: true };
+     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return {};

[NoCoverage] BooleanLiteral
src/inject.js:102:89
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: true };
+     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: false, had22: true };

[NoCoverage] BooleanLiteral
src/inject.js:102:102
-     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: true };
+     if (localStorage.getItem('DEV_INJECT_BASELINE') !== 'true') return { added: 0, had21: true, had22: false };

[NoCoverage] ConditionalExpression
src/inject.js:103:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/inject.js:103:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/inject.js:103:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/inject.js:103:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] MethodExpression
src/inject.js:109:17
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.every(l => l.date === '2026-04-21' && !l.baseline);

[NoCoverage] ArrowFunction
src/inject.js:109:27
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(() => undefined);

[NoCoverage] ConditionalExpression
src/inject.js:109:32
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(l => true);

[NoCoverage] ConditionalExpression
src/inject.js:109:32
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(l => false);

[NoCoverage] LogicalOperator
src/inject.js:109:32
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(l => l.date === '2026-04-21' || !l.baseline);

[NoCoverage] ConditionalExpression
src/inject.js:109:32
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(l => true && !l.baseline);

[NoCoverage] EqualityOperator
src/inject.js:109:32
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(l => l.date !== '2026-04-21' && !l.baseline);

[NoCoverage] BooleanLiteral
src/inject.js:109:59
-     const has21 = logs.some(l => l.date === '2026-04-21' && !l.baseline);
+     const has21 = logs.some(l => l.date === '2026-04-21' && l.baseline);

[NoCoverage] MethodExpression
src/inject.js:110:17
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.every(l => l.date === '2026-04-22' && !l.baseline);

[NoCoverage] ArrowFunction
src/inject.js:110:27
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(() => undefined);

[NoCoverage] ConditionalExpression
src/inject.js:110:32
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(l => true);

[NoCoverage] ConditionalExpression
src/inject.js:110:32
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(l => false);

[NoCoverage] LogicalOperator
src/inject.js:110:32
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(l => l.date === '2026-04-22' || !l.baseline);

[NoCoverage] ConditionalExpression
src/inject.js:110:32
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(l => true && !l.baseline);

[NoCoverage] EqualityOperator
src/inject.js:110:32
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(l => l.date !== '2026-04-22' && !l.baseline);

[NoCoverage] BooleanLiteral
src/inject.js:110:59
-     const has22 = logs.some(l => l.date === '2026-04-22' && !l.baseline);
+     const has22 = logs.some(l => l.date === '2026-04-22' && l.baseline);

[NoCoverage] ArrayDeclaration
src/inject.js:112:19
-     const newLogs = [];
+     const newLogs = ["Stryker was here"];

[NoCoverage] BooleanLiteral
src/inject.js:114:7
-     if (!has21) {
+     if (has21) {

[NoCoverage] ConditionalExpression
src/inject.js:114:7
-     if (!has21) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/inject.js:114:7
-     if (!has21) {
+     if (false) {

[NoCoverage] ArrayDeclaration
src/inject.js:116:18
-       const pull = [
-         // Lat Pulldown — 4 sets
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:1},
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:2},
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:3},
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:4},
-         // Cable Row — 3 sets
-         {ex:'Cable Row',     w:72, reps:'8', rpe:7, set:1},
-         {ex:'Cable Row',     w:72, reps:'8', rpe:7, set:2},
-         {ex:'Cable Row',     w:72, reps:'8', rpe:7, set:3},
-         // Face Pulls — 3 sets
-         {ex:'Face Pulls',    w:41, reps:'8', rpe:6, set:1},
-         {ex:'Face Pulls',    w:41, reps:'8', rpe:6, set:2},
-         {ex:'Face Pulls',    w:41, reps:'8', rpe:6, set:3},
-         // Incline DB Curl — 3 sets
-         {ex:'Incline DB Curl', w:10, reps:'10', rpe:7, set:1},
-         {ex:'Incline DB Curl', w:10, reps:'10', rpe:7, set:2},
-         {ex:'Incline DB Curl', w:10, reps:'10', rpe:7, set:3},
-         // Bayesian Curl — 3 sets
-         {ex:'Bayesian Curl', w:18, reps:'10', rpe:8, set:1},
-         {ex:'Bayesian Curl', w:18, reps:'10', rpe:8, set:2},
-         {ex:'Bayesian Curl', w:18, reps:'10', rpe:8, set:3},
-       ];
+       const pull = [];

[NoCoverage] ObjectLiteral
src/inject.js:118:7
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:1},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:119:7
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:2},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:120:7
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:3},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:121:7
-         {ex:'Lat Pulldown',  w:64, reps:'8', rpe:8, set:4},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:123:7
-         {ex:'Cable Row',     w:72, reps:'8', rpe:7, set:1},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:124:7
-         {ex:'Cable Row',     w:72, reps:'8', rpe:7, set:2},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:125:7
-         {ex:'Cable Row',     w:72, reps:'8', rpe:7, set:3},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:127:7
-         {ex:'Face Pulls',    w:41, reps:'8', rpe:6, set:1},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:128:7
-         {ex:'Face Pulls',    w:41, reps:'8', rpe:6, set:2},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:129:7
-         {ex:'Face Pulls',    w:41, reps:'8', rpe:6, set:3},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:131:7
-         {ex:'Incline DB Curl', w:10, reps:'10', rpe:7, set:1},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:132:7
-         {ex:'Incline DB Curl', w:10, reps:'10', rpe:7, set:2},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:133:7
-         {ex:'Incline DB Curl', w:10, reps:'10', rpe:7, set:3},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:135:7
-         {ex:'Bayesian Curl', w:18, reps:'10', rpe:8, set:1},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:136:7
-         {ex:'Bayesian Curl', w:18, reps:'10', rpe:8, set:2},
+         {},

[NoCoverage] ObjectLiteral
src/inject.js:137:7
-         {ex:'Bayesian Curl', w:18, reps:'10', rpe:8, set:3},
+         {},

[NoCoverage] ArrowFunction
src/inject.js:139:18
-       pull.forEach((s, i) => newLogs.push({
-         date:'2026-04-21', ex:s.ex, w:s.w, sets:1, reps:s.reps, rpe:s.rpe,
-         ts: s21 + i * 3000, session: s21, baseline: false,
-       }));
+       pull.forEach(() => undefined);

[NoCoverage] ObjectLiteral
src/inject.js:139:41
-       pull.forEach((s, i) => newLogs.push({
-         date:'2026-04-21', ex:s.ex, w:s.w, sets:1, reps:s.reps, rpe:s.rpe,
-         ts: s21 + i * 3000, session: s21, baseline: false,
-       }));
+       pull.forEach((s, i) => newLogs.push({}));

[NoCoverage] ArithmeticOperator
src/inject.js:141:11
-         ts: s21 + i * 3000, session: s21, baseline: false,
+         ts: s21 - i * 3000, session: s21, baseline: false,

[NoCoverage] ArithmeticOperator
src/inject.js:141:17
-         ts: s21 + i * 3000, session: s21, baseline: false,
+         ts: s21 + i / 3000, session: s21, baseline: false,

[NoCoverage] BooleanLiteral
src/inject.js:141:51
-         ts: s21 + i * 3000, session: s21, baseline: false,
+         ts: s21 + i * 3000, session: s21, baseline: true,

[NoCoverage] BooleanLiteral
src/inject.js:145:7
-     if (!has22) {
+     if (has22) {

[NoCoverage] ConditionalExpression
src/inject.js:145:7
-     if (!has22) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/inject.js:145:7
-     if (!has22) {
+     if (false) {

[NoCoverage] ObjectLiteral
src/inject.js:149:7
-         {ex:'DB Shoulder Press', w:20,   reps:'15', rpe:7, set:1, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:149:78
-         {ex:'DB Shoulder Press', w:20,   reps:'15', rpe:7, set:1, userOverride:true},
+         {ex:'DB Shoulder Press', w:20,   reps:'15', rpe:7, set:1, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:150:7
-         {ex:'DB Shoulder Press', w:22.5, reps:'12', rpe:7, set:2, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:150:78
-         {ex:'DB Shoulder Press', w:22.5, reps:'12', rpe:7, set:2, userOverride:true},
+         {ex:'DB Shoulder Press', w:22.5, reps:'12', rpe:7, set:2, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:151:7
-         {ex:'DB Shoulder Press', w:25,   reps:'8',  rpe:8, set:3, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:151:78
-         {ex:'DB Shoulder Press', w:25,   reps:'8',  rpe:8, set:3, userOverride:true},
+         {ex:'DB Shoulder Press', w:25,   reps:'8',  rpe:8, set:3, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:153:7
-         {ex:'Incline DB Press',  w:30, reps:'8', rpe:8, set:1, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:153:75
-         {ex:'Incline DB Press',  w:30, reps:'8', rpe:8, set:1, userOverride:false},
+         {ex:'Incline DB Press',  w:30, reps:'8', rpe:8, set:1, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:154:7
-         {ex:'Incline DB Press',  w:30, reps:'7', rpe:9, set:2, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:154:75
-         {ex:'Incline DB Press',  w:30, reps:'7', rpe:9, set:2, userOverride:true},
+         {ex:'Incline DB Press',  w:30, reps:'7', rpe:9, set:2, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:155:7
-         {ex:'Incline DB Press',  w:30, reps:'6', rpe:9, set:3, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:155:75
-         {ex:'Incline DB Press',  w:30, reps:'6', rpe:9, set:3, userOverride:true},
+         {ex:'Incline DB Press',  w:30, reps:'6', rpe:9, set:3, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:156:7
-         {ex:'Incline DB Press',  w:27.5, reps:'9', rpe:7, set:4, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:156:77
-         {ex:'Incline DB Press',  w:27.5, reps:'9', rpe:7, set:4, userOverride:true},
+         {ex:'Incline DB Press',  w:27.5, reps:'9', rpe:7, set:4, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:158:7
-         {ex:'Pec Deck / Cable Fly', w:30, reps:'15', rpe:6, set:1, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:158:79
-         {ex:'Pec Deck / Cable Fly', w:30, reps:'15', rpe:6, set:1, userOverride:true},
+         {ex:'Pec Deck / Cable Fly', w:30, reps:'15', rpe:6, set:1, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:159:7
-         {ex:'Pec Deck / Cable Fly', w:36, reps:'13', rpe:7, set:2, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:159:79
-         {ex:'Pec Deck / Cable Fly', w:36, reps:'13', rpe:7, set:2, userOverride:true},
+         {ex:'Pec Deck / Cable Fly', w:36, reps:'13', rpe:7, set:2, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:160:7
-         {ex:'Pec Deck / Cable Fly', w:36, reps:'10', rpe:8, set:3, userOverride:true},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:160:79
-         {ex:'Pec Deck / Cable Fly', w:36, reps:'10', rpe:8, set:3, userOverride:true},
+         {ex:'Pec Deck / Cable Fly', w:36, reps:'10', rpe:8, set:3, userOverride:false},

[NoCoverage] ObjectLiteral
src/inject.js:162:7
-         {ex:'Lateral Raises', w:10, reps:'8',  rpe:7, set:1, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:162:73
-         {ex:'Lateral Raises', w:10, reps:'8',  rpe:7, set:1, userOverride:false},
+         {ex:'Lateral Raises', w:10, reps:'8',  rpe:7, set:1, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:163:7
-         {ex:'Lateral Raises', w:10, reps:'9',  rpe:7, set:2, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:163:73
-         {ex:'Lateral Raises', w:10, reps:'9',  rpe:7, set:2, userOverride:false},
+         {ex:'Lateral Raises', w:10, reps:'9',  rpe:7, set:2, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:164:7
-         {ex:'Lateral Raises', w:10, reps:'10', rpe:8, set:3, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:164:73
-         {ex:'Lateral Raises', w:10, reps:'10', rpe:8, set:3, userOverride:false},
+         {ex:'Lateral Raises', w:10, reps:'10', rpe:8, set:3, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:166:7
-         {ex:'Overhead Triceps', w:41, reps:'10', rpe:7, set:1, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:166:75
-         {ex:'Overhead Triceps', w:41, reps:'10', rpe:7, set:1, userOverride:false},
+         {ex:'Overhead Triceps', w:41, reps:'10', rpe:7, set:1, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:167:7
-         {ex:'Overhead Triceps', w:41, reps:'9',  rpe:8, set:2, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:167:75
-         {ex:'Overhead Triceps', w:41, reps:'9',  rpe:8, set:2, userOverride:false},
+         {ex:'Overhead Triceps', w:41, reps:'9',  rpe:8, set:2, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:168:7
-         {ex:'Overhead Triceps', w:36, reps:'11', rpe:7, set:3, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:168:75
-         {ex:'Overhead Triceps', w:36, reps:'11', rpe:7, set:3, userOverride:false},
+         {ex:'Overhead Triceps', w:36, reps:'11', rpe:7, set:3, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:170:7
-         {ex:'Pushdown', w:41, reps:'9',  rpe:8, set:1, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:170:67
-         {ex:'Pushdown', w:41, reps:'9',  rpe:8, set:1, userOverride:false},
+         {ex:'Pushdown', w:41, reps:'9',  rpe:8, set:1, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:171:7
-         {ex:'Pushdown', w:36, reps:'11', rpe:7, set:2, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:171:67
-         {ex:'Pushdown', w:36, reps:'11', rpe:7, set:2, userOverride:false},
+         {ex:'Pushdown', w:36, reps:'11', rpe:7, set:2, userOverride:true},

[NoCoverage] ObjectLiteral
src/inject.js:172:7
-         {ex:'Pushdown', w:36, reps:'12', rpe:7, set:3, userOverride:false},
+         {},

[NoCoverage] BooleanLiteral
src/inject.js:172:67
-         {ex:'Pushdown', w:36, reps:'12', rpe:7, set:3, userOverride:false},
+         {ex:'Pushdown', w:36, reps:'12', rpe:7, set:3, userOverride:true},

[NoCoverage] ArrowFunction
src/inject.js:174:18
-       push.forEach((s, i) => newLogs.push({
-         date:'2026-04-22', ex:s.ex, w:s.w, sets:1, reps:s.reps, rpe:s.rpe,
-         ts: s22 + i * 3000, session: s22, baseline: false,
-       }));
+       push.forEach(() => undefined);

[NoCoverage] ObjectLiteral
src/inject.js:174:41
-       push.forEach((s, i) => newLogs.push({
-         date:'2026-04-22', ex:s.ex, w:s.w, sets:1, reps:s.reps, rpe:s.rpe,
-         ts: s22 + i * 3000, session: s22, baseline: false,
-       }));
+       push.forEach((s, i) => newLogs.push({}));

[NoCoverage] ArithmeticOperator
src/inject.js:176:11
-         ts: s22 + i * 3000, session: s22, baseline: false,
+         ts: s22 - i * 3000, session: s22, baseline: false,

[NoCoverage] ArithmeticOperator
src/inject.js:176:17
-         ts: s22 + i * 3000, session: s22, baseline: false,
+         ts: s22 + i / 3000, session: s22, baseline: false,

[NoCoverage] BooleanLiteral
src/inject.js:176:51
-         ts: s22 + i * 3000, session: s22, baseline: false,
+         ts: s22 + i * 3000, session: s22, baseline: true,

[NoCoverage] BooleanLiteral
src/inject.js:180:7
-     if (!newLogs.length) return { added: 0, had21: has21, had22: has22 };
+     if (newLogs.length) return { added: 0, had21: has21, had22: has22 };

[NoCoverage] ConditionalExpression
src/inject.js:180:7
-     if (!newLogs.length) return { added: 0, had21: has21, had22: has22 };
+     if (true) return { added: 0, had21: has21, had22: has22 };

[NoCoverage] ConditionalExpression
src/inject.js:180:7
-     if (!newLogs.length) return { added: 0, had21: has21, had22: has22 };
+     if (false) return { added: 0, had21: has21, had22: has22 };

[NoCoverage] ObjectLiteral
src/inject.js:180:31
-     if (!newLogs.length) return { added: 0, had21: has21, had22: has22 };
+     if (!newLogs.length) return {};

[NoCoverage] ArrayDeclaration
src/inject.js:182:18
-     DB.set('logs', [...logs, ...newLogs]);
+     DB.set('logs', []);

[NoCoverage] ConditionalExpression
src/inject.js:185:17
-     const burns = DB.get('session-burns') || [];
+     const burns = true;

[NoCoverage] ConditionalExpression
src/inject.js:185:17
-     const burns = DB.get('session-burns') || [];
+     const burns = false;

[NoCoverage] LogicalOperator
src/inject.js:185:17
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') && [];

[NoCoverage] ArrayDeclaration
src/inject.js:185:44
-     const burns = DB.get('session-burns') || [];
+     const burns = DB.get('session-burns') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/inject.js:186:7
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/inject.js:186:7
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (false) {

[NoCoverage] LogicalOperator
src/inject.js:186:7
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 || !burns.some(b => b.date === '2026-04-21')) {

[NoCoverage] BooleanLiteral
src/inject.js:186:7
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (has21 && !burns.some(b => b.date === '2026-04-21')) {

[NoCoverage] BooleanLiteral
src/inject.js:186:17
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 && burns.some(b => b.date === '2026-04-21')) {

[NoCoverage] MethodExpression
src/inject.js:186:18
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 && !burns.every(b => b.date === '2026-04-21')) {

[NoCoverage] ArrowFunction
src/inject.js:186:29
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 && !burns.some(() => undefined)) {

[NoCoverage] ConditionalExpression
src/inject.js:186:34
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 && !burns.some(b => true)) {

[NoCoverage] ConditionalExpression
src/inject.js:186:34
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 && !burns.some(b => false)) {

[NoCoverage] EqualityOperator
src/inject.js:186:34
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
+     if (!has21 && !burns.some(b => b.date !== '2026-04-21')) {

[NoCoverage] BlockStatement
src/inject.js:186:60
-     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {
-       burns.push({ date:'2026-04-21', day:'Marți', mins:62, kcal:320, sets:16, startHour:18 });
-     }
+     if (!has21 && !burns.some(b => b.date === '2026-04-21')) {}

[NoCoverage] ObjectLiteral
src/inject.js:187:16
-       burns.push({ date:'2026-04-21', day:'Marți', mins:62, kcal:320, sets:16, startHour:18 });
+       burns.push({});

[NoCoverage] ConditionalExpression
src/inject.js:189:7
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/inject.js:189:7
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (false) {

[NoCoverage] LogicalOperator
src/inject.js:189:7
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 || !burns.some(b => b.date === '2026-04-22')) {

[NoCoverage] BooleanLiteral
src/inject.js:189:7
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (has22 && !burns.some(b => b.date === '2026-04-22')) {

[NoCoverage] BooleanLiteral
src/inject.js:189:17
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 && burns.some(b => b.date === '2026-04-22')) {

[NoCoverage] MethodExpression
src/inject.js:189:18
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 && !burns.every(b => b.date === '2026-04-22')) {

[NoCoverage] ArrowFunction
src/inject.js:189:29
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 && !burns.some(() => undefined)) {

[NoCoverage] ConditionalExpression
src/inject.js:189:34
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 && !burns.some(b => true)) {

[NoCoverage] ConditionalExpression
src/inject.js:189:34
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 && !burns.some(b => false)) {

[NoCoverage] EqualityOperator
src/inject.js:189:34
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
+     if (!has22 && !burns.some(b => b.date !== '2026-04-22')) {

[NoCoverage] BlockStatement
src/inject.js:189:60
-     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {
-       burns.push({ date:'2026-04-22', day:'Miercuri', mins:68, kcal:350, sets:19, startHour:18 });
-     }
+     if (!has22 && !burns.some(b => b.date === '2026-04-22')) {}

[NoCoverage] ObjectLiteral
src/inject.js:190:16
-       burns.push({ date:'2026-04-22', day:'Miercuri', mins:68, kcal:350, sets:19, startHour:18 });
+       burns.push({});

[NoCoverage] ObjectLiteral
src/inject.js:194:10
-     return { added: newLogs.length, had21: has21, had22: has22 };
+     return {};

[NoCoverage] BooleanLiteral
src/main.js:5:32
-   window.__dataRegistryEnabled = true;
+   window.__dataRegistryEnabled = false;

[NoCoverage] BlockStatement
src/main.js:77:30
-     _devSoftReset: async () => {
-       if (confirm('Soft Reset: șterge datele de test, păstrează loguri reale, greutăți, kcal. Continui?')) {
-         await resetButKeepRealLogs();
-       }
-     },
+     _devSoftReset: async () => {},

[NoCoverage] ConditionalExpression
src/main.js:78:9
-       if (confirm('Soft Reset: șterge datele de test, păstrează loguri reale, greutăți, kcal. Continui?')) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:78:9
-       if (confirm('Soft Reset: șterge datele de test, păstrează loguri reale, greutăți, kcal. Continui?')) {
+       if (false) {

[NoCoverage] BlockStatement
src/main.js:78:106
-       if (confirm('Soft Reset: șterge datele de test, păstrează loguri reale, greutăți, kcal. Continui?')) {
-         await resetButKeepRealLogs();
-       }
+       if (confirm('Soft Reset: șterge datele de test, păstrează loguri reale, greutăți, kcal. Continui?')) {}

[NoCoverage] BlockStatement
src/main.js:82:29
-     dashSaveReadiness: (v) => { saveReadiness(v); renderDash(); },
+     dashSaveReadiness: (v) => {},

[NoCoverage] BlockStatement
src/main.js:83:30
-     _devResetTest: async () => {
-       if (confirm('Ștergi date de test (patterns, session drafts, etc.)?\nLogurile reale și greutățile rămân.')) {
-         await resetTestData();
-       }
-     },
+     _devResetTest: async () => {},
