[NoCoverage] ConditionalExpression
src/main.js:84:9
-       if (confirm('Ștergi date de test (patterns, session drafts, etc.)?\nLogurile reale și greutățile rămân.')) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:84:9
-       if (confirm('Ștergi date de test (patterns, session drafts, etc.)?\nLogurile reale și greutățile rămân.')) {
+       if (false) {

[NoCoverage] BlockStatement
src/main.js:84:112
-       if (confirm('Ștergi date de test (patterns, session drafts, etc.)?\nLogurile reale și greutățile rămân.')) {
-         await resetTestData();
-       }
+       if (confirm('Ștergi date de test (patterns, session drafts, etc.)?\nLogurile reale și greutățile rămân.')) {}

[NoCoverage] BlockStatement
src/main.js:88:30
-     _devFullReset: async () => {
-       if (confirm('⚠️ ATENȚIE: Ștergi TOT (loguri, greutăți, tot).\nEști sigur?')) {
-         if (confirm('Ultima confirmare: chiar ștergi TOATE datele?')) {
-           await fullReset();
-         }
-       }
-     },
+     _devFullReset: async () => {},

[NoCoverage] ConditionalExpression
src/main.js:89:9
-       if (confirm('⚠️ ATENȚIE: Ștergi TOT (loguri, greutăți, tot).\nEști sigur?')) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:89:9
-       if (confirm('⚠️ ATENȚIE: Ștergi TOT (loguri, greutăți, tot).\nEști sigur?')) {
+       if (false) {

[NoCoverage] BlockStatement
src/main.js:89:82
-       if (confirm('⚠️ ATENȚIE: Ștergi TOT (loguri, greutăți, tot).\nEști sigur?')) {
-         if (confirm('Ultima confirmare: chiar ștergi TOATE datele?')) {
-           await fullReset();
-         }
-       }
+       if (confirm('⚠️ ATENȚIE: Ștergi TOT (loguri, greutăți, tot).\nEști sigur?')) {}

[NoCoverage] ConditionalExpression
src/main.js:90:11
-         if (confirm('Ultima confirmare: chiar ștergi TOATE datele?')) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/main.js:90:11
-         if (confirm('Ultima confirmare: chiar ștergi TOATE datele?')) {
+         if (false) {

[NoCoverage] BlockStatement
src/main.js:90:69
-         if (confirm('Ultima confirmare: chiar ștergi TOATE datele?')) {
-           await fullReset();
-         }
+         if (confirm('Ultima confirmare: chiar ștergi TOATE datele?')) {}

[NoCoverage] BlockStatement
src/main.js:101:48
-   async function clearStalePatternsIfColdStart() {
-     try {
-       const logs = JSON.parse(localStorage.getItem('logs') || '[]');
-       const sessionKeys = new Set(logs.map(l => l.session ?? l.date).filter(Boolean));
-       if (sessionKeys.size < 3) {
-         localStorage.removeItem('applied-patterns');
-         localStorage.removeItem('pattern-learning-cache');
-         localStorage.removeItem('detected-patterns');
-         console.log('[Calibration] Cleared stale pattern caches (cold_start)');
-         // Also clear from Firebase so the next sync doesn't restore them
-         if (!window._suppressFirebaseSync) {
-           await clearFirebaseKeys(['applied-patterns', 'pattern-learning-cache', 'detected-patterns']);
-         }
-       }
-     } catch { /* non-blocking */ }
-   }
+   async function clearStalePatternsIfColdStart() {}

[NoCoverage] BlockStatement
src/main.js:102:7
-     try {
-       const logs = JSON.parse(localStorage.getItem('logs') || '[]');
-       const sessionKeys = new Set(logs.map(l => l.session ?? l.date).filter(Boolean));
-       if (sessionKeys.size < 3) {
-         localStorage.removeItem('applied-patterns');
-         localStorage.removeItem('pattern-learning-cache');
-         localStorage.removeItem('detected-patterns');
-         console.log('[Calibration] Cleared stale pattern caches (cold_start)');
-         // Also clear from Firebase so the next sync doesn't restore them
-         if (!window._suppressFirebaseSync) {
-           await clearFirebaseKeys(['applied-patterns', 'pattern-learning-cache', 'detected-patterns']);
-         }
-       }
-     } catch { /* non-blocking */ }
+     try {} catch { /* non-blocking */ }

[NoCoverage] ConditionalExpression
src/main.js:103:29
-       const logs = JSON.parse(localStorage.getItem('logs') || '[]');
+       const logs = JSON.parse(true);

[NoCoverage] ConditionalExpression
src/main.js:103:29
-       const logs = JSON.parse(localStorage.getItem('logs') || '[]');
+       const logs = JSON.parse(false);

[NoCoverage] LogicalOperator
src/main.js:103:29
-       const logs = JSON.parse(localStorage.getItem('logs') || '[]');
+       const logs = JSON.parse(localStorage.getItem('logs') && '[]');

[NoCoverage] MethodExpression
src/main.js:104:33
-       const sessionKeys = new Set(logs.map(l => l.session ?? l.date).filter(Boolean));
+       const sessionKeys = new Set(logs.map(l => l.session ?? l.date));

[NoCoverage] ArrowFunction
src/main.js:104:42
-       const sessionKeys = new Set(logs.map(l => l.session ?? l.date).filter(Boolean));
+       const sessionKeys = new Set(logs.map(() => undefined).filter(Boolean));

[NoCoverage] LogicalOperator
src/main.js:104:47
-       const sessionKeys = new Set(logs.map(l => l.session ?? l.date).filter(Boolean));
+       const sessionKeys = new Set(logs.map(l => l.session && l.date).filter(Boolean));

[NoCoverage] ConditionalExpression
src/main.js:105:9
-       if (sessionKeys.size < 3) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:105:9
-       if (sessionKeys.size < 3) {
+       if (false) {

[NoCoverage] EqualityOperator
src/main.js:105:9
-       if (sessionKeys.size < 3) {
+       if (sessionKeys.size <= 3) {

[NoCoverage] EqualityOperator
src/main.js:105:9
-       if (sessionKeys.size < 3) {
+       if (sessionKeys.size >= 3) {

[NoCoverage] BlockStatement
src/main.js:105:31
-       if (sessionKeys.size < 3) {
-         localStorage.removeItem('applied-patterns');
-         localStorage.removeItem('pattern-learning-cache');
-         localStorage.removeItem('detected-patterns');
-         console.log('[Calibration] Cleared stale pattern caches (cold_start)');
-         // Also clear from Firebase so the next sync doesn't restore them
-         if (!window._suppressFirebaseSync) {
-           await clearFirebaseKeys(['applied-patterns', 'pattern-learning-cache', 'detected-patterns']);
-         }
-       }
+       if (sessionKeys.size < 3) {}

[NoCoverage] BooleanLiteral
src/main.js:111:11
-         if (!window._suppressFirebaseSync) {
+         if (window._suppressFirebaseSync) {

[NoCoverage] ConditionalExpression
src/main.js:111:11
-         if (!window._suppressFirebaseSync) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/main.js:111:11
-         if (!window._suppressFirebaseSync) {
+         if (false) {

[NoCoverage] BlockStatement
src/main.js:111:42
-         if (!window._suppressFirebaseSync) {
-           await clearFirebaseKeys(['applied-patterns', 'pattern-learning-cache', 'detected-patterns']);
-         }
+         if (!window._suppressFirebaseSync) {}

[NoCoverage] ArrayDeclaration
src/main.js:112:33
-           await clearFirebaseKeys(['applied-patterns', 'pattern-learning-cache', 'detected-patterns']);
+           await clearFirebaseKeys([]);

[NoCoverage] BlockStatement
src/main.js:120:34
-   function setupOfflineIndicator() {
-     const el = document.getElementById('offline-indicator');
-     if (!el) return;
-     const update = () => {
-       if (navigator.onLine) {
-         el.style.display = 'none';
-         if (window._wasOffline) {
-           window._wasOffline = false;
-           if (typeof syncToFirebase === 'function') syncToFirebase();
-         }
-       } else {
-         el.style.display = 'flex';
-         window._wasOffline = true;
-       }
-     };
-     window.addEventListener('online', update);
-     window.addEventListener('offline', update);
-     update();
-   }
+   function setupOfflineIndicator() {}

[NoCoverage] BooleanLiteral
src/main.js:122:7
-     if (!el) return;
+     if (el) return;

[NoCoverage] ConditionalExpression
src/main.js:122:7
-     if (!el) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/main.js:122:7
-     if (!el) return;
+     if (false) return;

[NoCoverage] BlockStatement
src/main.js:123:24
-     const update = () => {
-       if (navigator.onLine) {
-         el.style.display = 'none';
-         if (window._wasOffline) {
-           window._wasOffline = false;
-           if (typeof syncToFirebase === 'function') syncToFirebase();
-         }
-       } else {
-         el.style.display = 'flex';
-         window._wasOffline = true;
-       }
-     };
+     const update = () => {};

[NoCoverage] ConditionalExpression
src/main.js:124:9
-       if (navigator.onLine) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:124:9
-       if (navigator.onLine) {
+       if (false) {

[NoCoverage] BlockStatement
src/main.js:124:27
-       if (navigator.onLine) {
-         el.style.display = 'none';
-         if (window._wasOffline) {
-           window._wasOffline = false;
-           if (typeof syncToFirebase === 'function') syncToFirebase();
-         }
-       } else {
+       if (navigator.onLine) {} else {

[NoCoverage] ConditionalExpression
src/main.js:126:11
-         if (window._wasOffline) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/main.js:126:11
-         if (window._wasOffline) {
+         if (false) {

[NoCoverage] BlockStatement
src/main.js:126:31
-         if (window._wasOffline) {
-           window._wasOffline = false;
-           if (typeof syncToFirebase === 'function') syncToFirebase();
-         }
+         if (window._wasOffline) {}

[NoCoverage] BooleanLiteral
src/main.js:127:30
-           window._wasOffline = false;
+           window._wasOffline = true;

[NoCoverage] ConditionalExpression
src/main.js:128:13
-           if (typeof syncToFirebase === 'function') syncToFirebase();
+           if (true) syncToFirebase();

[NoCoverage] ConditionalExpression
src/main.js:128:13
-           if (typeof syncToFirebase === 'function') syncToFirebase();
+           if (false) syncToFirebase();

[NoCoverage] EqualityOperator
src/main.js:128:13
-           if (typeof syncToFirebase === 'function') syncToFirebase();
+           if (typeof syncToFirebase !== 'function') syncToFirebase();

[NoCoverage] BlockStatement
src/main.js:130:12
-       } else {
-         el.style.display = 'flex';
-         window._wasOffline = true;
-       }
+       } else {}

[NoCoverage] BooleanLiteral
src/main.js:132:28
-         window._wasOffline = true;
+         window._wasOffline = false;

[NoCoverage] BlockStatement
src/main.js:148:44
-   async function processAuthCallbackOnBoot() {
-     try {
-       const result = await handleAuthCallbackRoute();
-       if (!result) return null;
-       if (result.ok) {
-         // Per §56.4 LOCKED V1: idempotent migration runner. Already-migrated
-         // sau no-source = no-op silent. Sets `_migration` flag în localStorage.
-         try { await runAuthPathMigration(); }
-         catch (err) { console.warn('[Auth] post-auth migration runner threw:', err); }
-       } else {
-         console.warn('[Auth] callback failed:', result.provider, result.error);
-       }
-       return result;
-     } catch (err) {
-       console.warn('[Auth] handleAuthCallbackRoute threw:', err);
-       return null;
-     }
-   }
+   async function processAuthCallbackOnBoot() {}

[NoCoverage] BlockStatement
src/main.js:149:7
-     try {
-       const result = await handleAuthCallbackRoute();
-       if (!result) return null;
-       if (result.ok) {
-         // Per §56.4 LOCKED V1: idempotent migration runner. Already-migrated
-         // sau no-source = no-op silent. Sets `_migration` flag în localStorage.
-         try { await runAuthPathMigration(); }
-         catch (err) { console.warn('[Auth] post-auth migration runner threw:', err); }
-       } else {
-         console.warn('[Auth] callback failed:', result.provider, result.error);
-       }
-       return result;
-     } catch (err) {
+     try {} catch (err) {

[NoCoverage] BooleanLiteral
src/main.js:151:9
-       if (!result) return null;
+       if (result) return null;

[NoCoverage] ConditionalExpression
src/main.js:151:9
-       if (!result) return null;
+       if (true) return null;

[NoCoverage] ConditionalExpression
src/main.js:151:9
-       if (!result) return null;
+       if (false) return null;

[NoCoverage] ConditionalExpression
src/main.js:152:9
-       if (result.ok) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:152:9
-       if (result.ok) {
+       if (false) {

[NoCoverage] BlockStatement
src/main.js:152:20
-       if (result.ok) {
-         // Per §56.4 LOCKED V1: idempotent migration runner. Already-migrated
-         // sau no-source = no-op silent. Sets `_migration` flag în localStorage.
-         try { await runAuthPathMigration(); }
-         catch (err) { console.warn('[Auth] post-auth migration runner threw:', err); }
-       } else {
+       if (result.ok) {} else {

[NoCoverage] BlockStatement
src/main.js:155:11
-         try { await runAuthPathMigration(); }
+         try {}

[NoCoverage] BlockStatement
src/main.js:156:19
-         catch (err) { console.warn('[Auth] post-auth migration runner threw:', err); }
+         catch (err) {}

[NoCoverage] BlockStatement
src/main.js:157:12
-       } else {
-         console.warn('[Auth] callback failed:', result.provider, result.error);
-       }
+       } else {}

[NoCoverage] BlockStatement
src/main.js:161:17
-     } catch (err) {
-       console.warn('[Auth] handleAuthCallbackRoute threw:', err);
-       return null;
-     }
+     } catch (err) {}

[NoCoverage] BlockStatement
src/main.js:177:7
-     try {
-       const migrationResult = migrateLogsUtcToLocal();
-       if (!migrationResult.skipped) {
-         console.log('[Migration] Logs/CDL date format updated to local timezone');
-       }
-     } catch (err) {
+     try {} catch (err) {

[NoCoverage] BooleanLiteral
src/main.js:179:9
-       if (!migrationResult.skipped) {
+       if (migrationResult.skipped) {

[NoCoverage] ConditionalExpression
src/main.js:179:9
-       if (!migrationResult.skipped) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/main.js:179:9
-       if (!migrationResult.skipped) {
+       if (false) {

[NoCoverage] BlockStatement
src/main.js:179:35
-       if (!migrationResult.skipped) {
-         console.log('[Migration] Logs/CDL date format updated to local timezone');
-       }
+       if (!migrationResult.skipped) {}

[NoCoverage] BlockStatement
src/main.js:182:17
-     } catch (err) {
-       console.error('[Migration] Failed:', err);
-       // Continue boot — migration failure non-blocking
-     }
+     } catch (err) {}

[NoCoverage] ObjectLiteral
src/main.js:190:24
-     window.__constants = { PROG, KCAL_TARGET, PROT_TARGET };
+     window.__constants = {};

[NoCoverage] ConditionalExpression
src/main.js:206:7
-     if (injected.added > 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/main.js:206:7
-     if (injected.added > 0) {
+     if (false) {

[NoCoverage] EqualityOperator
src/main.js:206:7
-     if (injected.added > 0) {
+     if (injected.added >= 0) {

[NoCoverage] EqualityOperator
src/main.js:206:7
-     if (injected.added > 0) {
+     if (injected.added <= 0) {

[NoCoverage] BlockStatement
src/main.js:206:27
-     if (injected.added > 0) {
-       extractAndSavePRs();
-       console.log(`[inject] +${injected.added} sets added (Apr21=${!injected.had21}, Apr22=${!injected.had22})`);
-     }
+     if (injected.added > 0) {}

[NoCoverage] BooleanLiteral
src/main.js:208:66
-       console.log(`[inject] +${injected.added} sets added (Apr21=${!injected.had21}, Apr22=${!injected.had22})`);
+       console.log(`[inject] +${injected.added} sets added (Apr21=${injected.had21}, Apr22=${!injected.had22})`);

[NoCoverage] BooleanLiteral
src/main.js:208:92
-       console.log(`[inject] +${injected.added} sets added (Apr21=${!injected.had21}, Apr22=${!injected.had22})`);
+       console.log(`[inject] +${injected.added} sets added (Apr21=${!injected.had21}, Apr22=${injected.had22})`);

[NoCoverage] ConditionalExpression
src/main.js:217:26
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = true;

[NoCoverage] ConditionalExpression
src/main.js:217:26
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = false;

[NoCoverage] LogicalOperator
src/main.js:217:26
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') && (DB.get('logs') || []).length > 0;

[NoCoverage] ConditionalExpression
src/main.js:217:55
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || false;

[NoCoverage] EqualityOperator
src/main.js:217:55
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length >= 0;

[NoCoverage] EqualityOperator
src/main.js:217:55
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length <= 0;

[NoCoverage] ConditionalExpression
src/main.js:217:56
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || (true).length > 0;

[NoCoverage] ConditionalExpression
src/main.js:217:56
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || (false).length > 0;

[NoCoverage] LogicalOperator
src/main.js:217:56
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') && []).length > 0;

[NoCoverage] ArrayDeclaration
src/main.js:217:74
-     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || []).length > 0;
+     const onboardingDone = DB.get('onboarding-done') || (DB.get('logs') || ["Stryker was here"]).length > 0;

[NoCoverage] BooleanLiteral
src/main.js:218:7
-     if (!onboardingDone) {
+     if (onboardingDone) {

[NoCoverage] ConditionalExpression
src/main.js:218:7
-     if (!onboardingDone) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/main.js:218:7
-     if (!onboardingDone) {
+     if (false) {

[NoCoverage] BlockStatement
src/main.js:218:24
-     if (!onboardingDone) {
-       checkOnboarding();
-     } else {
+     if (!onboardingDone) {} else {

[NoCoverage] BlockStatement
src/main.js:220:10
-     } else {
-       renderCoachIdle();
-       renderDash();
-       renderProg();
-     }
+     } else {}

[NoCoverage] ConditionalExpression
src/main.js:226:7
-     if ('serviceWorker' in navigator) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/main.js:226:7
-     if ('serviceWorker' in navigator) {
+     if (false) {

[NoCoverage] BlockStatement
src/main.js:226:37
-     if ('serviceWorker' in navigator) {
-       navigator.serviceWorker.register('/sw.js').catch(() => {});
-     }
+     if ('serviceWorker' in navigator) {}

[NoCoverage] ConditionalExpression
src/main.js:236:7
-     if (onboardingDone && !isAuthenticated()) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/main.js:236:7
-     if (onboardingDone && !isAuthenticated()) {
+     if (false) {

[NoCoverage] LogicalOperator
src/main.js:236:7
-     if (onboardingDone && !isAuthenticated()) {
+     if (onboardingDone || !isAuthenticated()) {

[NoCoverage] BooleanLiteral
src/main.js:236:25
-     if (onboardingDone && !isAuthenticated()) {
+     if (onboardingDone && isAuthenticated()) {

[NoCoverage] BlockStatement
src/main.js:236:45
-     if (onboardingDone && !isAuthenticated()) {
-       mountAuthBanner({
-         googleClientId: window.__GOOGLE_CLIENT_ID,
-         onAuthSuccess: ({ uid }) => {
-           // Post-auth success — trigger Daniel legacy path migration.
-           // Idempotent: no-op for non-Daniel users sau already-migrated.
-           runAuthPathMigration().catch(err => {
-             console.warn('[Auth] post-banner-auth migration threw:', err);
-           });
-         },
-       });
-     }
+     if (onboardingDone && !isAuthenticated()) {}

[NoCoverage] ObjectLiteral
src/main.js:237:21
-       mountAuthBanner({
-         googleClientId: window.__GOOGLE_CLIENT_ID,
-         onAuthSuccess: ({ uid }) => {
-           // Post-auth success — trigger Daniel legacy path migration.
-           // Idempotent: no-op for non-Daniel users sau already-migrated.
-           runAuthPathMigration().catch(err => {
-             console.warn('[Auth] post-banner-auth migration threw:', err);
-           });
-         },
-       });
+       mountAuthBanner({});

[NoCoverage] BlockStatement
src/main.js:239:35
-         onAuthSuccess: ({ uid }) => {
-           // Post-auth success — trigger Daniel legacy path migration.
-           // Idempotent: no-op for non-Daniel users sau already-migrated.
-           runAuthPathMigration().catch(err => {
-             console.warn('[Auth] post-banner-auth migration threw:', err);
-           });
-         },
+         onAuthSuccess: ({ uid }) => {},

[NoCoverage] BlockStatement
src/main.js:242:45
-           runAuthPathMigration().catch(err => {
-             console.warn('[Auth] post-banner-auth migration threw:', err);
-           });
+           runAuthPathMigration().catch(err => {});

[NoCoverage] ArrayDeclaration
src/onboarding.js:10:24
-   const INIT_EXERCISES = [
-     {ex:'Incline DB Press', label:'Incline DB Press (per ganteră)', placeholder:'ex: 30'},
-     {ex:'DB Shoulder Press', label:'Shoulder Press DB (per ganteră)', placeholder:'ex: 20'},
-     {ex:'Lat Pulldown', label:'Lat Pulldown (greutate totală)', placeholder:'ex: 64'},
-     {ex:'Cable Row', label:'Cable Row (greutate totală)', placeholder:'ex: 72'},
-     {ex:'Lateral Raises', label:'Lateral Raises (per ganteră)', placeholder:'ex: 10'},
-     {ex:'Face Pulls', label:'Face Pulls (cablu, greutate totală)', placeholder:'ex: 41'},
-     {ex:'Incline DB Curl', label:'Incline DB Curl (per ganteră)', placeholder:'ex: 10'},
-     {ex:'Bayesian Curl', label:'Bayesian Curl (cablu)', placeholder:'ex: 18'},
-     {ex:'Overhead Triceps', label:'Overhead Triceps (cablu)', placeholder:'ex: 41'},
-     {ex:'Pushdown', label:'Pushdown (cablu)', placeholder:'ex: 41'},
-     {ex:'Leg Press', label:'Leg Press (greutate totală)', placeholder:'ex: 150'},
-   ];
+   const INIT_EXERCISES = [];

[NoCoverage] ObjectLiteral
src/onboarding.js:11:3
-     {ex:'Incline DB Press', label:'Incline DB Press (per ganteră)', placeholder:'ex: 30'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:12:3
-     {ex:'DB Shoulder Press', label:'Shoulder Press DB (per ganteră)', placeholder:'ex: 20'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:13:3
-     {ex:'Lat Pulldown', label:'Lat Pulldown (greutate totală)', placeholder:'ex: 64'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:14:3
-     {ex:'Cable Row', label:'Cable Row (greutate totală)', placeholder:'ex: 72'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:15:3
-     {ex:'Lateral Raises', label:'Lateral Raises (per ganteră)', placeholder:'ex: 10'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:16:3
-     {ex:'Face Pulls', label:'Face Pulls (cablu, greutate totală)', placeholder:'ex: 41'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:17:3
-     {ex:'Incline DB Curl', label:'Incline DB Curl (per ganteră)', placeholder:'ex: 10'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:18:3
-     {ex:'Bayesian Curl', label:'Bayesian Curl (cablu)', placeholder:'ex: 18'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:19:3
-     {ex:'Overhead Triceps', label:'Overhead Triceps (cablu)', placeholder:'ex: 41'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:20:3
-     {ex:'Pushdown', label:'Pushdown (cablu)', placeholder:'ex: 41'},
+     {},

[NoCoverage] ObjectLiteral
src/onboarding.js:21:3
-     {ex:'Leg Press', label:'Leg Press (greutate totală)', placeholder:'ex: 150'},
+     {},

[NoCoverage] BlockStatement
src/onboarding.js:24:35
-   export function checkOnboarding() {
-     const done = DB.get('onboarding-done');
-     if (done) return;
-     // Check if any logs exist already
-     const logs = DB.get('logs') || [];
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
-     showOnboarding();
-   }
+   export function checkOnboarding() {}

[NoCoverage] ConditionalExpression
src/onboarding.js:26:7
-     if (done) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:26:7
-     if (done) return;
+     if (false) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:28:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/onboarding.js:28:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/onboarding.js:28:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/onboarding.js:28:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/onboarding.js:29:7
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
+     if (true) { DB.set('onboarding-done', true); return; }

[NoCoverage] ConditionalExpression
src/onboarding.js:29:7
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
+     if (false) { DB.set('onboarding-done', true); return; }

[NoCoverage] EqualityOperator
src/onboarding.js:29:7
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
+     if (logs.length >= 0) { DB.set('onboarding-done', true); return; }

[NoCoverage] EqualityOperator
src/onboarding.js:29:7
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
+     if (logs.length <= 0) { DB.set('onboarding-done', true); return; }

[NoCoverage] BlockStatement
src/onboarding.js:29:24
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
+     if (logs.length > 0) {}

[NoCoverage] BooleanLiteral
src/onboarding.js:29:52
-     if (logs.length > 0) { DB.set('onboarding-done', true); return; }
+     if (logs.length > 0) { DB.set('onboarding-done', false); return; }

[NoCoverage] ConditionalExpression
src/onboarding.js:38:7
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (true) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:38:7
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (false) return;

[NoCoverage] LogicalOperator
src/onboarding.js:38:7
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (typeof window !== 'undefined' || window._suppressOnboardingOverlay === true) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:38:7
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (true && window._suppressOnboardingOverlay === true) return;

[NoCoverage] EqualityOperator
src/onboarding.js:38:7
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (typeof window === 'undefined' && window._suppressOnboardingOverlay === true) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:38:40
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (typeof window !== 'undefined' && true) return;

[NoCoverage] EqualityOperator
src/onboarding.js:38:40
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay !== true) return;

[NoCoverage] BooleanLiteral
src/onboarding.js:38:78
-     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === true) return;
+     if (typeof window !== 'undefined' && window._suppressOnboardingOverlay === false) return;

[NoCoverage] ArrayDeclaration
src/onboarding.js:67:17
-                 ${[7,8,9,10].map(r => `<button onclick="setObRPE(${i},${r})" id="ob-rpe-${i}-${r}"
+                 ${[].map(r => `<button onclick="setObRPE(${i},${r})" id="ob-rpe-${i}-${r}"

[NoCoverage] ArrowFunction
src/onboarding.js:67:32
-                 ${[7,8,9,10].map(r => `<button onclick="setObRPE(${i},${r})" id="ob-rpe-${i}-${r}"
-                   style="padding:8px;background:var(--bg3);border:1px solid var(--border);border-radius:var(--rs);color:var(--text2);font-size:13px;font-weight:700;cursor:pointer;font-family:'JetBrains Mono',monospace;transition:all .15s">${r}</button>`).join('')}
+                 ${[7,8,9,10].map(() => undefined).join('')}
