[NoCoverage] BlockStatement
src/onboarding.js:86:36
-   export function setObRPE(idx, rpe) {
-     obRPEs[idx] = rpe;
-     [7,8,9,10,0].forEach(r => {
-       const btn = document.getElementById(`ob-rpe-${idx}-${r}`);
-       if (!btn) return;
-       const isSelected = r === rpe;
-       btn.style.background = isSelected ? 'rgba(200,255,0,0.15)' : 'var(--bg3)';
-       btn.style.color = isSelected ? 'var(--accent)' : (r===0?'var(--text3)':'var(--text2)');
-       btn.style.borderColor = isSelected ? 'var(--accent)' : 'var(--border)';
-     });
-   }
+   export function setObRPE(idx, rpe) {}

[NoCoverage] ArrayDeclaration
src/onboarding.js:88:3
-     [7,8,9,10,0].forEach(r => {
+     [].forEach(r => {

[NoCoverage] BlockStatement
src/onboarding.js:88:29
-     [7,8,9,10,0].forEach(r => {
-       const btn = document.getElementById(`ob-rpe-${idx}-${r}`);
-       if (!btn) return;
-       const isSelected = r === rpe;
-       btn.style.background = isSelected ? 'rgba(200,255,0,0.15)' : 'var(--bg3)';
-       btn.style.color = isSelected ? 'var(--accent)' : (r===0?'var(--text3)':'var(--text2)');
-       btn.style.borderColor = isSelected ? 'var(--accent)' : 'var(--border)';
-     });
+     [7,8,9,10,0].forEach(r => {});

[NoCoverage] BooleanLiteral
src/onboarding.js:90:9
-       if (!btn) return;
+       if (btn) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:90:9
-       if (!btn) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:90:9
-       if (!btn) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/onboarding.js:91:24
-       const isSelected = r === rpe;
+       const isSelected = true;

[NoCoverage] ConditionalExpression
src/onboarding.js:91:24
-       const isSelected = r === rpe;
+       const isSelected = false;

[NoCoverage] EqualityOperator
src/onboarding.js:91:24
-       const isSelected = r === rpe;
+       const isSelected = r !== rpe;

[NoCoverage] ConditionalExpression
src/onboarding.js:93:55
-       btn.style.color = isSelected ? 'var(--accent)' : (r===0?'var(--text3)':'var(--text2)');
+       btn.style.color = isSelected ? 'var(--accent)' : (true?'var(--text3)':'var(--text2)');

[NoCoverage] ConditionalExpression
src/onboarding.js:93:55
-       btn.style.color = isSelected ? 'var(--accent)' : (r===0?'var(--text3)':'var(--text2)');
+       btn.style.color = isSelected ? 'var(--accent)' : (false?'var(--text3)':'var(--text2)');

[NoCoverage] EqualityOperator
src/onboarding.js:93:55
-       btn.style.color = isSelected ? 'var(--accent)' : (r===0?'var(--text3)':'var(--text2)');
+       btn.style.color = isSelected ? 'var(--accent)' : (r !== 0?'var(--text3)':'var(--text2)');

[NoCoverage] ConditionalExpression
src/onboarding.js:99:16
-     const logs = DB.get('logs') || [];
+     const logs = true;

[NoCoverage] ConditionalExpression
src/onboarding.js:99:16
-     const logs = DB.get('logs') || [];
+     const logs = false;

[NoCoverage] LogicalOperator
src/onboarding.js:99:16
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') && [];

[NoCoverage] ArrayDeclaration
src/onboarding.js:99:34
-     const logs = DB.get('logs') || [];
+     const logs = DB.get('logs') || ["Stryker was here"];

[NoCoverage] BlockStatement
src/onboarding.js:102:36
-     INIT_EXERCISES.forEach((e, i) => {
-       const kgInput = document.getElementById(`ob-kg-${i}`);
-       const repsInput = document.getElementById(`ob-reps-${i}`);
-       const kg = parseFloat(kgInput?.value);
-       const reps = parseInt(repsInput?.value) || 8;
-       const rpe = obRPEs[i] || 8;
-       if (!isNaN(kg) && kg > 0) {
-         // Save as a historical log entry (3 sets to establish baseline)
-         for (let s = 1; s <= 3; s++) {
-           logs.unshift({
-             date: today, ex: e.ex, w: kg,
-             sets: 1, reps: String(reps), rpe,
-             ts: Date.now() - (s * 1000),
-             session: Date.now(), baseline: true
-           });
-         }
-         saved++;
-       }
-     });
+     INIT_EXERCISES.forEach((e, i) => {});

[NoCoverage] OptionalChaining
src/onboarding.js:105:27
-       const kg = parseFloat(kgInput?.value);
+       const kg = parseFloat(kgInput.value);

[NoCoverage] ConditionalExpression
src/onboarding.js:106:18
-       const reps = parseInt(repsInput?.value) || 8;
+       const reps = true;

[NoCoverage] ConditionalExpression
src/onboarding.js:106:18
-       const reps = parseInt(repsInput?.value) || 8;
+       const reps = false;

[NoCoverage] LogicalOperator
src/onboarding.js:106:18
-       const reps = parseInt(repsInput?.value) || 8;
+       const reps = parseInt(repsInput?.value) && 8;

[NoCoverage] OptionalChaining
src/onboarding.js:106:27
-       const reps = parseInt(repsInput?.value) || 8;
+       const reps = parseInt(repsInput.value) || 8;

[NoCoverage] ConditionalExpression
src/onboarding.js:107:17
-       const rpe = obRPEs[i] || 8;
+       const rpe = true;

[NoCoverage] ConditionalExpression
src/onboarding.js:107:17
-       const rpe = obRPEs[i] || 8;
+       const rpe = false;

[NoCoverage] LogicalOperator
src/onboarding.js:107:17
-       const rpe = obRPEs[i] || 8;
+       const rpe = obRPEs[i] && 8;

[NoCoverage] ConditionalExpression
src/onboarding.js:108:9
-       if (!isNaN(kg) && kg > 0) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/onboarding.js:108:9
-       if (!isNaN(kg) && kg > 0) {
+       if (false) {

[NoCoverage] LogicalOperator
src/onboarding.js:108:9
-       if (!isNaN(kg) && kg > 0) {
+       if (!isNaN(kg) || kg > 0) {

[NoCoverage] BooleanLiteral
src/onboarding.js:108:9
-       if (!isNaN(kg) && kg > 0) {
+       if (isNaN(kg) && kg > 0) {

[NoCoverage] ConditionalExpression
src/onboarding.js:108:23
-       if (!isNaN(kg) && kg > 0) {
+       if (!isNaN(kg) && true) {

[NoCoverage] EqualityOperator
src/onboarding.js:108:23
-       if (!isNaN(kg) && kg > 0) {
+       if (!isNaN(kg) && kg >= 0) {

[NoCoverage] EqualityOperator
src/onboarding.js:108:23
-       if (!isNaN(kg) && kg > 0) {
+       if (!isNaN(kg) && kg <= 0) {

[NoCoverage] BlockStatement
src/onboarding.js:108:31
-       if (!isNaN(kg) && kg > 0) {
-         // Save as a historical log entry (3 sets to establish baseline)
-         for (let s = 1; s <= 3; s++) {
-           logs.unshift({
-             date: today, ex: e.ex, w: kg,
-             sets: 1, reps: String(reps), rpe,
-             ts: Date.now() - (s * 1000),
-             session: Date.now(), baseline: true
-           });
-         }
-         saved++;
-       }
+       if (!isNaN(kg) && kg > 0) {}

[NoCoverage] ConditionalExpression
src/onboarding.js:110:23
-         for (let s = 1; s <= 3; s++) {
+         for (let s = 1; false; s++) {

[NoCoverage] EqualityOperator
src/onboarding.js:110:23
-         for (let s = 1; s <= 3; s++) {
+         for (let s = 1; s < 3; s++) {

[NoCoverage] EqualityOperator
src/onboarding.js:110:23
-         for (let s = 1; s <= 3; s++) {
+         for (let s = 1; s > 3; s++) {

[NoCoverage] UpdateOperator
src/onboarding.js:110:31
-         for (let s = 1; s <= 3; s++) {
+         for (let s = 1; s <= 3; s--) {

[NoCoverage] BlockStatement
src/onboarding.js:110:36
-         for (let s = 1; s <= 3; s++) {
-           logs.unshift({
-             date: today, ex: e.ex, w: kg,
-             sets: 1, reps: String(reps), rpe,
-             ts: Date.now() - (s * 1000),
-             session: Date.now(), baseline: true
-           });
-         }
+         for (let s = 1; s <= 3; s++) {}

[NoCoverage] ObjectLiteral
src/onboarding.js:111:22
-           logs.unshift({
-             date: today, ex: e.ex, w: kg,
-             sets: 1, reps: String(reps), rpe,
-             ts: Date.now() - (s * 1000),
-             session: Date.now(), baseline: true
-           });
+           logs.unshift({});

[NoCoverage] ArithmeticOperator
src/onboarding.js:114:15
-             ts: Date.now() - (s * 1000),
+             ts: Date.now() + s * 1000,

[NoCoverage] ArithmeticOperator
src/onboarding.js:114:29
-             ts: Date.now() - (s * 1000),
+             ts: Date.now() - (s / 1000),

[NoCoverage] BooleanLiteral
src/onboarding.js:115:42
-             session: Date.now(), baseline: true
+             session: Date.now(), baseline: false

[NoCoverage] UpdateOperator
src/onboarding.js:118:7
-         saved++;
+         saved--;

[NoCoverage] MethodExpression
src/onboarding.js:121:18
-     DB.set('logs', logs.slice(0, 5000));
+     DB.set('logs', logs);

[NoCoverage] BooleanLiteral
src/onboarding.js:122:29
-     DB.set('onboarding-done', true);
+     DB.set('onboarding-done', false);

[NoCoverage] ConditionalExpression
src/onboarding.js:124:7
-     if (el) el.remove();
+     if (true) el.remove();

[NoCoverage] ConditionalExpression
src/onboarding.js:124:7
-     if (el) el.remove();
+     if (false) el.remove();

[NoCoverage] BlockStatement
src/onboarding.js:130:34
-   export function skipOnboarding() {
-     DB.set('onboarding-done', true);
-     const el = document.getElementById('onboarding-overlay');
-     if (el) el.remove();
-   }
+   export function skipOnboarding() {}

[NoCoverage] BooleanLiteral
src/onboarding.js:131:29
-     DB.set('onboarding-done', true);
+     DB.set('onboarding-done', false);

[NoCoverage] ConditionalExpression
src/onboarding.js:133:7
-     if (el) el.remove();
+     if (true) el.remove();

[NoCoverage] ConditionalExpression
src/onboarding.js:133:7
-     if (el) el.remove();
+     if (false) el.remove();

[Survived] BooleanLiteral
src/state.js:5:15
-     sessActive: false,
+     sessActive: true,
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/state.js:4:22
-   export const state = {
-     sessActive: false,
-     sessStart: null,
-     sessTimer: null,
-     sessLog: [],
-     currentEx: '',
-     currentSet: 1,
-     awaitingRPE: false,
-     sessRepsInput: 10,
-     sessionKgOverride: null,
-     completedExercises: new Set(),
-     dropSetUsedThisSession: false,
-     pauseTimer: null,
-     pauseTotal: 0,
-     pauseLeft: 0,
-     lastPauseEndedAt: null,
-     isMuted: false,
-     activeNotes: new Set(),
-     logDateOffset: 0,
-     sessionTotalExercises: 0,
-     sessKcalBurn: 0,
-     earlyStopReason: null,
-     cdlEntryId: null,
-     sessType: null,
-     lastSetRPE: null,
-   };
+   export const state = {};
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/state.js:8:12
-     sessLog: [],
+     sessLog: ["Stryker was here"],
Ran all tests for this mutant.

[Survived] BooleanLiteral
src/state.js:11:16
-     awaitingRPE: false,
+     awaitingRPE: true,
Ran all tests for this mutant.

[Survived] BooleanLiteral
src/state.js:15:27
-     dropSetUsedThisSession: false,
+     dropSetUsedThisSession: true,
Ran all tests for this mutant.

[Survived] BooleanLiteral
src/state.js:20:12
-     isMuted: false,
+     isMuted: true,
Ran all tests for this mutant.

[Survived] ArrowFunction
src/state.js:32:25
-   export const getState = () => state;
+   export const getState = () => undefined;
Ran all tests for this mutant.
